{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tollfreeforwarding.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "YE",
          "Pseudo": "Abokhaled Mashal",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:53:59.000Z",
          "Titre": "Your support people are cooperative but…",
          "Contenu": "Your support people are cooperative but the service itself is bad because whatsapp calls don't arrive to my actual number, only appears in call history."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Pamela Jean",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T12:12:27.000Z",
          "Titre": "Fraudulent and Deceptive Business Practices",
          "Contenu": "Fraudulent and deceptive. I signed up for a 20 day free trial, only to have it end after a couple of hours with them demanding I give them my credit card details to continue with services. Perhaps it was serendipitous because I ended up going with a different vendor who was able to handle our business and also offered SMS and direct voicemail to email features. After this frustrating experience, I researched and learned they are not truly secure, which leaves their customers susceptible to having their details stolen. Guess someone was looking out for me, and I am extremely thankful my gut instinct was to NOT give them my cc details.Customer Service: 1/2 StarQuality: 1 StarTrust Worthiness: 0 Stars"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Lewis Vansteenkiste",
          "Nb_Reviews": 2,
          "Date": "2022-05-01T18:23:29.000Z",
          "Titre": "What kind of scammery is this?",
          "Contenu": "Out of nowhere I got an email from this website saying I have an open invoice of $9 and a monthly subscription. I have never heard about of even used this website, but maybe someone used my phonenumber and name to do something with this?As I never provided any ID, verification or something else, this is completely ungrounded. Please solve this, as I have NEVER even used your services or used your website"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jason Davenport",
          "Nb_Reviews": 5,
          "Date": "2022-04-03T13:35:06.000Z",
          "Titre": "Scam from the start. TollFreeForward no good",
          "Contenu": "Company states that it is instant connection. Clearly not the case. They take all your details and credit card info and then dont make any contact. You spend 30 minutes on the phone to be advised they need a business registration number and thats not legit for Toll Free Numbers. Scam company beware."
        },
        {
          "Note": 1,
          "Lieu": "LY",
          "Pseudo": "Noran Zummet",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:48:41.000Z",
          "Titre": "unsafe",
          "Contenu": "I wanted to try the service and they emailed me asking of a A copy of the credit card used on this account (front and back) and a credit card authorization!!this is completely a spam"
        },
        {
          "Note": 1,
          "Lieu": "MU",
          "Pseudo": "Jefrey Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T14:11:22.000Z",
          "Titre": "The service does not work optimally for…",
          "Contenu": "The service does not work optimally for Singapore.The caller id shows a prefix of +1213. It looks like an overseas call & is likely to spook locals from answering."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Anfal Nisar",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T11:56:53.000Z",
          "Titre": "They never forward call I bought number…",
          "Contenu": "They never forward call I bought number for 10$ and then paid 15$ extra and after that I cancelled my order and they never refunded me"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Vitaliy",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T16:10:19.000Z",
          "Titre": "Avoid this company",
          "Contenu": "You should call them to close your account. But they still tried to bill my card twice, two days after I canceled the trial period. account number is 6827103. Cancellation Confirmation Number: 757752"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "El Barto",
          "Nb_Reviews": 10,
          "Date": "2022-10-11T14:28:29.000Z",
          "Titre": "STAY AWAY!",
          "Contenu": "STAY AWAY!Once you have an account there, it's impossible to cancel. There is no way to cancel the contract, nor can you delete your credit card details. In the whole menu there is no option to cancel the number! And the whole site is very slow, it takes forever to even log in.Stay away from this rogue company! Setting up is very quick, an employee will call you immediately. So that you can quickly enter your credit card details. But if you don't want the number anymore, then there's no way to stop it. And we've taken screenshots of all sides of the menu just to be safe."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Tiisetso hlongwane",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T10:49:52.000Z",
          "Titre": "I requested for cancel and the agent…",
          "Contenu": "I requested for cancel and the agent mislead me and I was not able to reach customer service to cancel my subscription and got charged.  They said refund would take 7 business days but I have been waiting for 3 weeks now and still nothing."
        },
        {
          "Note": 1,
          "Lieu": "GE",
          "Pseudo": "Andrey",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T20:27:17.000Z",
          "Titre": "No customer service",
          "Contenu": "Unfortunately, my interaction with the company left much to be desired. Following my registration, I didn't receive any communication for four days. The web phone service was non-functional, and my attempts to contact them yielded no response. Despite attempting to complete the registration form three times, I encountered the same unproductive outcome each time. This experience led to a loss of four days, compelling me to seek an alternative provider. Needless to say, I am quite disappointed with the overall experience.Account Number: 7442105"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Dewell",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T22:04:49.000Z",
          "Titre": "Unresponsive to Request to Cancel",
          "Contenu": "I emailed to cancel my subscription and never reviewed a reply email. This was a while back. You have had plenty of time to get back to me. Planning to report this soon if it’s not cleared up. I don’t need your services and want to cancel. So let me cancel instead of ignoring me!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "j t",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T02:58:24.000Z",
          "Titre": "I have received 2 incorrect phone calls…",
          "Contenu": "I have received 2 incorrect phone calls looking for incorrect company that she & he told me my number +61 3 9071 1855 is written on the invoice that they received which belong to mirage digital.  in fact I am not mirage digital.."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "El Barto",
          "Nb_Reviews": 10,
          "Date": "2022-11-07T09:54:38.000Z",
          "Titre": "WARNING! EMPLOYEES OF THIS COMPANY COPY CUSTOMER DATA!",
          "Contenu": "WARNING! EMPLOYEES OF THIS COMPANY COPY CUSTOMER DATA!I had received a phone call from this company last week where the employee \"Steven\" wanted me to retract my previous negative review. He said that they had deleted all data, etc. and that I could therefore withdraw my rating.I then asked him how he could even call me if he had deleted all my data...To which he replied that he had wrote my phone number on a piece of paper before deleting it and that's why he still had it!In addition, he kept interrupting me and his tone was very unfriendly, which is why I hung up. He then tried calling again using the same number, but I didn't answer. Then he called again, this time from a UK number. I then told him that I didn't want to speak to him anymore and repeatedly asked him to delete my data.It's really unbelievable what kind of company this is. I have now blocked my credit card as a precaution, because who knows what else they have written off.People stay away from this company and don't give them any data!!!!"
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Soufiane EL GHAZI",
          "Nb_Reviews": 5,
          "Date": "2023-01-25T14:10:44.000Z",
          "Titre": "bad experiance with the Support",
          "Contenu": "I was an old client who pays, and when i want to comeback at the first page they tell you welcomeback, we ant to give you a free trial again, take your free trial, and order again, and when you do it, they will tell you no you are not elegitible to have a free trial, or discount or anything.and even the guy told if you want the free trial it means that you don't want to pay, that's what trigger this comment, talking to old custommers that they used to pay, and telling them that mayme they don't want to pay because they in your website you told them to get the free trial after they comeback. it's like like you tell them hey take something, and after one day the agent call and say to you in the phone hey maybe you will not pay us, we will charge you now. i don't recommend this company, for the way they operate and the way they talk to the custommer, especialy for client's outside the US."
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "JOSEPH IBANEZ",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T13:22:24.000Z",
          "Titre": "I received mistaken phone calls and the…",
          "Contenu": "I received mistaken phone calls and the I have to pay the transfer call.Also since I joined your company I have received a lot of junk mails on my email account."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Canadian Agency",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T16:06:46.000Z",
          "Titre": "Boots Spent our budget",
          "Contenu": "Boots from USA call regularly the TollFrerCalling number for 5min on the dot and cause to spend our budget very quickly. There is not caller on the other end.  Very strange."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T16:27:17.000Z",
          "Titre": "Numbers are not guaranteed to works Outside US/Canada",
          "Contenu": "Despite what they Claim on the Website the Toll Free numbers are not actually guaranteed to work outside US/Canada"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kiran Pratap",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T15:02:59.000Z",
          "Titre": "Over Charged earlier and later paid…",
          "Contenu": "Over Charged earlier and later paid high rates for incoming calls only. Please take customer situation into consideration."
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "Christian De la Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T13:14:29.000Z",
          "Titre": "Your support is awful",
          "Contenu": "Your support is awfull, you don't have a cancellation button and I really need it"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2021-10-01T11:18:07.000Z",
          "Titre": "Once you buy a number",
          "Contenu": "Once you buy a number, you get constant telemarketing calls as they share your number."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Randy Hammond",
          "Nb_Reviews": 5,
          "Date": "2021-12-29T16:02:56.000Z",
          "Titre": "major ongoing issues with virtual phone number.",
          "Contenu": "I was looking to set up a virtual phone number in Germany, and Tollfreeforwarding.com website stated that it could set up international phone numbers in 60 Seconds. That sounded promising, so I created an account, provided my credit card details and then..... a message stating that I needed to wait for something. The website gave me a phone number to call, if I didn't want to wait. So I called the support number, but ended up waiting indefinitely on hold... nearly two hours and still nothing, only an annoying voice that repeatedly promises that international calls can be set up immediately. Its very disappointing.. UPDATE: I've managed to get through to the call centre, only for the call to suspiciously drop out. During another call, my call was transferred to someone else who didn't know who I was or why I had been transferred. I've since been in contact with the team leader, but now I'm told it can take between 5 to 10 business days for the phone number to be connected. They are trying to expedite it following a complaint I made, however its in the hands of a third party telco provider in Germany. Hopefully TollFreeForwarding can liaise with the German telco to set up this number soon, I really need it for a job application in Germany. I wish they had been more transparent about the processing times for German numbers... then I would have applied for this number much earlier but I relied on their representation that this would only take a few minutes.Update: After a few days, the service was finally set up however IT DIDN'T WORK when I tested it-- when I tried calling the virtual phone number the target phone did not ring. I have reached out to tech support team.Update 2: Tech support team says they fixed it, however the service is still not working properly. Although the target phone now rings and I can answer the call, there is a high latency, which makes it impossible to communicate natural... call participants inevitably end up talking over each other. I have asked for service cancellation and a full refund because I can't use this product at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vikas Vijaya",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T03:08:19.000Z",
          "Titre": "I requested for cancel and the agent…",
          "Contenu": "I requested for cancel and the agent mislead me and I was not able to reach customer service to cancel my subscription and got charged"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Jodeci  Obrien",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T12:47:31.000Z",
          "Titre": "I’ve contacted and tried to cancel but…",
          "Contenu": "I’ve contacted and tried to cancel but can’t"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Dmytro Vdovenko",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T22:15:47.000Z",
          "Titre": "Sorry but I don’t need forwarding…",
          "Contenu": "Sorry but I don’t need forwarding services"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Melanie Maclin",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T15:56:00.000Z",
          "Titre": "It never worked",
          "Contenu": "It never worked and now the number is invalid"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Elly Reda",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T17:15:34.000Z",
          "Titre": "The sound is not good and that's if the…",
          "Contenu": "The sound is not good and that's if the sound comes through. Most of the times there's just a silent echo.I am not happy at all."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Kris Powel",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T04:21:19.000Z",
          "Titre": "wrong numbers display on cell phone."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Michaela",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T13:38:36.000Z",
          "Titre": "I am getting a bunch of random calls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Gombos",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T13:04:54.000Z",
          "Titre": "Not recommend",
          "Contenu": "Great service , only one thing missing: receive and send text messages (SMS) .If it will be available , I will replace my review to 5 start . Couple days later they suspended my account without any reason. And they wanted me to give full access over my credit card or I can not able to use my account. So I canceled my account.The only correct hing is that, they gave me back the unused money i paid in."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "imShujaatAli",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T04:47:01.000Z",
          "Titre": "today i signup for account and after…",
          "Contenu": "today i signup for account and after enter my payment details website not showing my account profile or any kind of data . just show on top right (My Account) but when click on it they again goto mainpage im scared about my payment details its maybe hacked, because they not show profile or deleted by payment information .!!!! don't use this website its scam now !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "MK",
          "Pseudo": "Alexander Stoicoff",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T22:05:33.000Z",
          "Titre": "Making Fake Calls to Build-Up Minutes",
          "Contenu": "A lot of fake calls to build up minutes started moments after I purchased their service (and didn't stop, even in the middle of the night). That's such a scam move to rely upon.But what got me on my nerves the most, was the charge they made twice in one month. I haven't received any call (except the fake ones) and yet I somehow used all the minutes in 5 days? Yeah right! tl;dr: Stay away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Allen",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T19:07:24.000Z",
          "Titre": "this isnt working",
          "Contenu": "I have no idea if I am getting any return on this investment.  I get billed but no calls...which to be fair may not be the fault of the program as its possible the calls I get( if any) are all computer generated.  Computer generated calls normally do not leave voice mail messages.  I do not answer any call that is from an unknown number.  I have never seen my toll free number show up on my caller id as I had thought it would"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Alice Matthews",
          "Nb_Reviews": 5,
          "Date": "2019-10-21T09:58:18.000Z",
          "Titre": "Cancelled my number without asking me",
          "Contenu": "Cancelled my number without asking me.  I ordered a NY call forwarding number.  I had the number in my account paid for and all.  I got cards printed up with this number on it.  Two days later , I went to my account and it was gone.  When I called, Toll Free Forwarding said another client had that number!!?  Refused to reimburse my expenses.   Total sham."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nusieba Ibrahim",
          "Nb_Reviews": 3,
          "Date": "2019-10-16T00:29:39.000Z",
          "Titre": "Worse company...",
          "Contenu": "Worse company.... They stole my money and I am in process of suing them! Thieves!I never received my refunds... I really do not trust you anymore because you really do not care about your customers. You gave me a big headache... You stole about $430 from me and as I said previously, I am in process of suing you..... Terrible experience...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Tratz",
          "Nb_Reviews": 3,
          "Date": "2020-02-18T08:37:19.000Z",
          "Titre": "Unprofessional",
          "Contenu": "Ordered phone number. After a few minutes, account was blocked and was asked all my personal data,also to send my credit card which not was attached,also my ID. I told told to them that this is not correct, to ask this personal documentation. After this email they deleted my account. Very unprofessional in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Navneet uniyal",
          "Nb_Reviews": 3,
          "Date": "2018-08-09T03:09:17.000Z",
          "Titre": "Company like toll free forwarding that…",
          "Contenu": "Company like toll free forwarding that hides everything from customer are not with bright future..I will put review on every possible places , blogs , Google about this company ..Its time to start another tollfreeforwading company with giving customer a total freedom with rights ..This company tells u nothing and they will turn your toll-free number down anytime without warning..So don't trust this company"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Navneet uniyal",
          "Nb_Reviews": 3,
          "Date": "2018-08-02T23:27:19.000Z",
          "Titre": "I have been using tollfreeforwarding…",
          "Contenu": "I have been using tollfreeforwarding since 48 months for same purpose since beginning. after 4 years they are saying my toll free no violated their policy and cancelled my account ...i would recommend not to trust such company they only need u when they are in growing phase.. dont trust tollfreeforwarding at all..funny thing is support people says we dont know what policy you violated ..amazing .."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anthony genth",
          "Nb_Reviews": 21,
          "Date": "2020-01-13T22:54:22.000Z",
          "Titre": "Complete misrepresentation by this company",
          "Contenu": "Complete misrepresentation between the website and there actual pricing which is ten times higher than what they show on the website. My agent Steven, hung up on me when i questioned this and was never willing  to even listen to my issues. I tried twice to make a payment to them and twice  different cards showed as declined even though when I called the CC company they confirmed that my card was fine and they had received no enquiries. Buyer beware this, is not an honest or customer friendly company."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Quiet_Earth",
          "Nb_Reviews": 2,
          "Date": "2020-02-29T00:46:02.000Z",
          "Titre": "Enough is Enough.",
          "Contenu": "Enough is Enough.This company constantly harasses me with advertising calls and emails. The calls come in on Sunday night too. I can't recommend tollfreeforwarding to anyone.Take a look at this: 24.02.2020 03:35:49 001213452150524.02.2020 03:35:46 001213452150524.02.2020 03:35:42 0012134521505"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 37,
          "Date": "2019-03-20T16:53:02.000Z",
          "Titre": "Caused me Stress",
          "Contenu": "Caused me stress.I needed a throw away number for just this once, but I started to think maybe I'd use one again in the future so long as I ONLY have to pay when I use it, not monthly.They approved the phone number, then this Alex guy calls me & when he finds out I don't plan to pay, he REMOVES the number so now the site I gave it to won't be able to reach me.VERY UNPROFESSIONAL COMPANY! Don't promise a trial if you DON'T want to give people one!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brian Bartley",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T20:26:47.000Z",
          "Titre": "The tech support people do to have…",
          "Contenu": "The tech support people do not have competency in fax. Tollfreeforwarding purports to support both voice mail.and fax mail. However the fax mail does not work  and they do not know how to fix it. There is no handshaking tone generated by the number I was.given. Without a handshaking tone there can be no fax transmission. After days and days of waiting  no resolution. Now 24 hours with no further communication. They are just ignoring the problem and hoping I will just give up and go away Not a good way to build a business. I can no longer recommend them to others."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mos",
          "Nb_Reviews": 1,
          "Date": "2020-03-01T21:43:27.000Z",
          "Titre": "bad service",
          "Contenu": "bad service, never reply or respond to your email.I asked questions on email before purchasing the product, how hard it is to reply to an email that i sent several times.i got calls but it stopped in one ring, did not even go to my voice mail, meaning you did not really try to contact me."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "pooja wahi",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T20:40:44.000Z",
          "Titre": "SCAM SCAM SCAM",
          "Contenu": "they guys listen your audio calls and then the making fool and they have second team who do outbound calls this company scamming people.I am not using service anymore I request you guys please do not use this company service otherwise you will lose your customers."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Gökçe",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T15:12:31.000Z",
          "Titre": "I put my payment information on this…",
          "Contenu": "I put my payment information on this website. But ı cant see my profile info and you even said cancel any time!!! It doesn't seem to be working. please tell me how to delete my account. I just want to delete my account or remove my payment information!!"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2019-02-22T17:12:35.000Z",
          "Titre": "Only trying to get your data...stay clear",
          "Contenu": "Only trying to get information and sensitive data out of you....asking for a copy of ID front and back plus credit card front and back. This is after paying through what was apparently their secure online payment. Lost my $9 as they canceled my subscription after 1 day. Stay clear of this site"
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "Robin Chater",
          "Nb_Reviews": 2,
          "Date": "2018-10-18T01:05:50.000Z",
          "Titre": "I am disappointed with your service",
          "Contenu": "I am disappointed with your service. I tried to report an incident concerning the misuse of my credit card - when TFF was the only organisation that had my Visa debit card details. However I was very rudely rebuffed by the person who took the call. I was also trying to provide details for a changed payment card - but they just never let me progress. If anyone complains about anything concerning my organisation we take details and investigate. Your company appears to lack integrity, professionalism and politeness.  You are also expensive compared to your rivals."
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Róbert Antal",
          "Nb_Reviews": 2,
          "Date": "2020-01-06T10:08:58.000Z",
          "Titre": "It's a bad service, at least for me",
          "Contenu": "Stay away from this, account cannot be cancelled, they keep charging you. They say that the service can be cancelled via phone, but they never answer it. Update: it can be cancelled via phone, but their 24h support's working hours is 9 to 5 or something."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nusieba Ibrahim",
          "Nb_Reviews": 3,
          "Date": "2019-08-20T14:32:41.000Z",
          "Titre": "Worse company ever.",
          "Contenu": "Worse company ever.. I asked you to send the refund to my Paypal account instead of my inactive (CLOSED) credit card, but you did not listen to me and sent it to the closed credit card.. I have not received my refund yet and I need my refund ASAP.... Thieves!"
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "John Hiestand",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T04:51:11.000Z",
          "Titre": "It worked fine for a couple calls",
          "Contenu": "It worked fine for a couple calls. For weeks I have been getting calls with just ambient noise. Not sure what’s going on but I’m getting charged. Not trustworthy with the pricing either. Getting charged for phantom calls. Waste of time and money!"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Kelson Awdren",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T01:00:22.000Z",
          "Titre": "Im paying every month for this service…",
          "Contenu": "Im paying every month for this service and i am yet to actually get one real call from a client. Every call i get is from a bot and they spend all my minutes.TollFreeForwarding should fix this issue, its almost as if its done on purpose."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Riot Solutions Inc",
          "Nb_Reviews": 1,
          "Date": "2019-03-19T10:36:04.000Z",
          "Titre": "Account was suspended without any reasons",
          "Contenu": "My account was suspended without any reasons. Moreover, when I called their customer care they asked me to send the image of Creditcard( Back and Front) This is very disappointing.Also, they are not able to give me any valid reason for suspending my account."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Gabor Dobos",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T12:15:57.000Z",
          "Titre": "Useless",
          "Contenu": "Entered my name, email address and phone number to have a Swedish number to forward to Argentina. Opted for the free trial. It said \"instant activation\", which is a lie. I had to call to try to activate the line. And ehen I called, I was told that based on the information given by me (literally just those 3 things I mentioned in the beginning), they are not able to open an account for me. Sucks big time. Useless. If they don't have numbers in Sweden, or cannot forward calls to Argentina, then why offer it? My name is a common one, and my email address is genuine, with one of the big email suppliers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "3D Mir",
          "Nb_Reviews": 2,
          "Date": "2019-03-28T23:51:09.000Z",
          "Titre": "customer service is very rude",
          "Contenu": "customer service is very rude. i found someone was using the phone number i was paying for  and called  their customer service. the woman on the phone seemed she jsut woke up and  instead of being polite and helping me understand what the issue was,she  ended up telling: \"I think I was clear before, someone was assigned to your phone number 9 months ago, i can give you a new phone number if you want but if you dont take the new phone number today you are on your own\".   Instead of being helpful and friendly she ended up raising her voice to a paying customer.......  SOrry you just lost a client......."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "antonella galvalisi",
          "Nb_Reviews": 1,
          "Date": "2019-08-29T00:30:51.000Z",
          "Titre": "I've been trying to cancel my free…",
          "Contenu": "I've been trying to cancel my free trial for hours and i don't get an answer. Also what kind of serious service doesn't have a link or way to cancel trials/unlink cards/etc from the same website??????? Why do i have to send mails or call them just to cancel sth that is \"free\"?????? I need to have total control over my data and it doesn't even let me edit or delete my card number. Also if that's the way it's going to be then put it big before one makes an account, this is ridiculous and for all these reasons when and if i manage to cancel my free trial i won't be using this service again"
        },
        {
          "Note": 1,
          "Lieu": "UZ",
          "Pseudo": "MrMichael",
          "Nb_Reviews": 1,
          "Date": "2020-04-18T16:01:03.000Z",
          "Titre": "It's scam! Never trust them!",
          "Contenu": "This is definitely a scam. I booked a number and entered my payment details. But I can't change or delete them! done specifically so that you can't remove your data and they will charge you unless you block your card!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Floribeth Gamboa",
          "Nb_Reviews": 1,
          "Date": "2017-10-12T17:39:19.000Z",
          "Titre": "BEWARE!!",
          "Contenu": "BEWARE!!! I canceled my account with this company last year, and after that I come to find out that they continued  to charge my credit card a $10 fee for twelve months without my authorization and now they refuse to refund me."
        },
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "Linuka Herath",
          "Nb_Reviews": 1,
          "Date": "2020-10-11T10:51:51.000Z",
          "Titre": "Delete my account",
          "Contenu": "Hi. I put my payment information on this website. It doesn't seem to be working. Plz tell my how to delete my account. I just want to delete my account or remove my payment information. Plz reply ASAP"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "nick moore",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T15:11:12.000Z",
          "Titre": "Just received a nuisance call that…",
          "Contenu": "Just received a nuisance call that spoke briefly then hung up .dialled back the number to be told by tollfree.com that this number no longer exists !!And all within 5 minutes .What an amazing service they offer ."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rubydoo",
          "Nb_Reviews": 2,
          "Date": "2018-07-06T08:58:02.000Z",
          "Titre": "Good until you want to cancel",
          "Contenu": "Good until you want to cancel - they don't let you!!!! They just keep billing your card forever until you cancel it, then they keep billing you!!! Avoid these people, there are more honest operators out there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Skin Tight",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T21:33:43.000Z",
          "Titre": "Continuously charged for calls that are not real",
          "Contenu": "Connected a number with them and immediately started to receive calls that were just background noise and lasted the full duration of our call time limit. This was despite our \"new number\" not being advertised anywhere.Contacted them for support and was eventually told to block the numbers that were calling. This does not help as the bogus calls come from different numbers each time, with the same background noise and no message left.Meanwhile they began charging our card for these calls.The problem continues to this day and we have gone ahead and printed our labels so we do not want to have to change the number but it looks like we will have to as they will not resolve the problem.Be warned! Stay clear of this company."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "MRL",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T08:50:44.000Z",
          "Titre": "There's NO free trial! (they ask for pics of your credit card!)",
          "Contenu": "There's NO free trial!Once you add your payment method to their website (hoping you'll get the advertised \"free trial\" by doing so), they'll send you an email asking you to reply back to them with a copy of your ID, proof of residence, front-and-back photos of your credit card AND a signed document in which you authorise them to charge you for \"forwarding services\", without ANY mention of the amount, the date, the terms nor the advertised \"free trial\" (you've also got to fill the document with your credit card number, expiration date and CVV number).If you refuse to do that, their answer will be, \"Unfortunately we're unable to provide you with services. We recommend you look for another provider. Best\".I do NOT recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Vivion Lee",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T02:30:19.000Z",
          "Titre": "NO ONE ANSWER & NO HELP!!!!!!!",
          "Contenu": "We tried to call you the  1-888-452-1505 /   400 120 4951 /+1 213 452 1505 three phone number, but they can not let us find the human service. then we called your home page another phone number, but still failed .  please just offer us a new phone number that can contact you in time. be quick !!!!! We even tried to contact with you on FaceBook, it showed Open Now on your working hour, but still no one answered our question!!!!!!!! Someone called us, our phone did not ringing. but your company charged our money ALL THE TIME . we need to know why.  Beside, when we checked the calling record, we can not see the caller, please offer us the caller record as soon as possible. Now our accuont has been charged about USD 745.77, we are worring about it  so much, please contact us now !!!!!if you have read our email and FaceBook messages, please reply to us ASSP!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "craig Josephs",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T14:47:55.000Z",
          "Titre": "Calls not being forwarded"
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Alejandro Amaya",
          "Nb_Reviews": 2,
          "Date": "2020-09-01T17:17:01.000Z",
          "Titre": "You can't close your account on web…",
          "Contenu": "You can't close your account through the website, this is a horrible user experience and the solution is getting your bank to blacklist them."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Sawan Choudhry",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T20:26:30.000Z",
          "Titre": "Call forwarding work only for call…",
          "Contenu": "Call forwarding work only for call coming from Hong Kong. Call from rest of world are all unattended. This was not explained before purchasing plan."
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Jorge Delgado",
          "Nb_Reviews": 4,
          "Date": "2019-07-10T04:20:35.000Z",
          "Titre": "When I contracted the service I was…",
          "Contenu": "I see two (2) great problems:1) They charged my credit card without telling me anything, as far as I understand it this is to steal my money.2) They never apologize for this, not even give me back my money, they offer to do it though but it was never reimbursed.And NO ITS NOT A \"HAPPINESS\" THING it's about dishonest behavior.--------------------------------------------------------------When I contracted the service I was asked to introduce a Credit Card for future payments, but it was charged without any previous advise.I start calling Tollfreeforwarding to get an explanation about this and to get my money back. After a while and after placing this information in Social Networks and TrustPilot, they contacted me and offer a reimburse.They said it was going to be sent by Western Union. Until today (more than 3 months) money hasn't been delivered.I really regret to have trusted Tollfreeforwarding."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Real Tech",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T04:17:24.000Z",
          "Titre": "Take so much time tyo active"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Gregoryhouse",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T05:12:46.000Z",
          "Titre": "Horrible-Horrible Support!",
          "Contenu": "Horrible-Horrible Support!! They first call you and talk to you and then select a plan based on what they feel is (good for you), (Something which you don't need) They also offer you a free trial for a week! Out of the Blue account gets suspended, Call up support and account gets unblocked. Kevin from Sales emailed me twice asking me to pay for (even tho trial was not over! ) I email him back saying I wish to start with a basic starter plan. (To which I don't get any reply for over 48 hours.) bam once again account suspended. Now they want an ID with photos to activate my account? What gives!!EDIT - NEW RULE!- Got another email saying once I add a Credit card they want a front and back picture of it!Edit 2 - > why not mention this clearly before making anyone sign up with you guys saying that you a need a CC Authorization form and a front and back picture of the credit card with the CCV number visible!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andrea Iervella",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T17:42:27.000Z",
          "Titre": "In all honesty...",
          "Contenu": "In all honesty, I have not renewed my contract because all I get through the number is calls from a fax machine. Probably about 5-10 per week."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mathieu Légaré",
          "Nb_Reviews": 5,
          "Date": "2019-11-03T02:30:41.000Z",
          "Titre": "Many 500 error",
          "Contenu": "Many 500 error, Account closed without warning and reason. Can't register, can't use website. Phone number are always the same."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gloria bermudez",
          "Nb_Reviews": 2,
          "Date": "2019-06-25T15:47:59.000Z",
          "Titre": "Tried to call due to another company…",
          "Contenu": "Tried to call due to another company Epic Shopper forward their number 1-888-233-3162 t TollfreeForwarding and still no answer."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Declan Campbell",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T14:50:36.000Z",
          "Titre": "Calls don’t divert to me",
          "Contenu": "Calls don’t divert to me. I get a missed call notification and then have to call the number back at full international rates"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Sam Anderson",
          "Nb_Reviews": 1,
          "Date": "2019-08-29T04:39:23.000Z",
          "Titre": "Not recommenced..",
          "Contenu": "Not recommenced... first month the service was okay but after sometime calls automatically break and worst voice quality."
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "YANNAN LI",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T02:33:24.000Z",
          "Titre": "Feel DISCRIMINATED by Tollfreeforwarding.com",
          "Contenu": "To be honest, I feel DISCRIMINATED against by this company..We wanted to buy a toll free number from Tollfreeforwarding.com. One of my colleague contacted the Client Support Representitive but he just simply said \"We CANNOT provide you service please find another provider\". The point is he DIDN'T give me any reasons. Ok, the same thing happens again. I contated another sales by email, and I want to ensure whether they can provide service to us or not and she said \"We service to customer GLOBALLY.\" And then we went to the payment process but failed. I called the customer service, a woman just felt impatient and said \"I cannot say any reason but just we do not provide you service.\"Excuse me?? I have contacted your sales for over 2 weeks and then you now say please find another provider?? I am not sure whether it is because we are from CHINA. I mean, the fact that you are even too lazy to give us a REASON is so RUDE. Everyone, please think twice before you choose Tollfreeforwarding.com, I am not sure who will be the next one to be DISCRIMINATED."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Minh Nguyen",
          "Nb_Reviews": 2,
          "Date": "2018-04-13T18:33:50.000Z",
          "Titre": "SCAM",
          "Contenu": "never enter you detail on their website. they canceled my account and the after that many strange call arrived to my phone"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jeremy Kronk",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T19:07:10.000Z",
          "Titre": "You sell me a number",
          "Contenu": "You sell me a number. Take 2 weeks to tell me you can't now give me  i have nothing but problems with your support"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nusieba Ibrahim",
          "Nb_Reviews": 3,
          "Date": "2019-08-16T20:07:10.000Z",
          "Titre": "Worse company",
          "Contenu": "Worse company. They are thieves and they stole my refund. I am going to file a complaint against them in the BBB."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Carlos Pinto",
          "Nb_Reviews": 6,
          "Date": "2021-03-22T22:43:42.000Z",
          "Titre": "Fraudulent procedure",
          "Contenu": "Fraudulent procedure: You register, your account stay pending approval, you never get approved, but your account is suspended after your card is debited. You make an overseas call to customer (rude) support to solve your problem, and you are played from one assistant to the other, who wants to type you a full email. At the same time, you're on hold. They PROPOSE to cancel your account and confirm a refund by email, but in the end, that doesn't happen. You get an email as you failed, and so they canceled your account and kicked you off as you were a fraudulent person. The customer \"assistant\" has not even tried to keep you as a client. I wonder why...? They took my money and closed me the door; that's how TollFreeForwarding dealt with me.Your Phone Numbers Have been Cancelled [ref:_00Df4oKTD._5001V1BE3mR:ref ]AFTER this post, I got an email with the following total content: \"My colleague whom you spoke to, already processed the refund.Please standby 5-9 business days.Regards,\"First time I experienced when a customer support work to get ridden of a client... policies, who knows!?... I would not risk having such staff on my companies for sure. Good luck!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shannon Balfoort",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T19:03:54.000Z",
          "Titre": "Calls constantly are getting dropped…not happy",
          "Contenu": "Calls constantly are getting dropped and the wrong numbers will call constantly from out of province."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Tarvinder Singh",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T05:29:54.000Z",
          "Titre": "Weird pricing model",
          "Contenu": "Weird pricing model, deducts money whenever they want. Messages don't deliver and some calls also fail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grace Dadson",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T01:51:13.000Z",
          "Titre": "Their service works well BUT is VERY…",
          "Contenu": "Their service works well BUT is VERY EXPENSIVE.Do not use if u need to use alot of minutes."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kris Pyle",
          "Nb_Reviews": 1,
          "Date": "2018-06-11T16:35:39.000Z",
          "Titre": "I asked for my account to be cancelled…",
          "Contenu": "I asked for my account to be cancelled and no one has contacted me to complete it."
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2019-06-25T04:56:51.000Z",
          "Titre": "Sorry",
          "Contenu": "Sorry, no response from you whenever i sent an email. But the phone works well."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mike Spragg",
          "Nb_Reviews": 4,
          "Date": "2018-10-11T00:49:27.000Z",
          "Titre": "I have been charged twice for a month…",
          "Contenu": "I have been charged twice for a month and the quality of the calls is appalling"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Gavin Crompton",
          "Nb_Reviews": 1,
          "Date": "2019-10-18T21:15:29.000Z",
          "Titre": "Took monies from my card even though i…",
          "Contenu": "Took monies from my card even though i deleted it from their system."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Ahmad Alshair",
          "Nb_Reviews": 1,
          "Date": "2019-09-09T08:28:16.000Z",
          "Titre": "very bad",
          "Contenu": "very bad i don't receive most of my calls, the voice is unclear,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Naomi",
          "Nb_Reviews": 2,
          "Date": "2016-08-09T19:43:24.820Z",
          "Titre": "Do NOT pay a yearly fee. They would NOT cancel your account! Terrible experience!",
          "Contenu": "Cancelling an account is a nightmare.Do NOT use this company!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Elsie",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T21:21:36.000Z",
          "Titre": "Pathetic.",
          "Contenu": "Pathetic.I dont recommend them to anyone not even my enemies"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Srdan Malesevic",
          "Nb_Reviews": 3,
          "Date": "2019-06-20T15:29:13.000Z",
          "Titre": "Very unprofessional",
          "Contenu": "Very unprofessional, secretive and discriminating company."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Steve eric",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T21:58:24.000Z",
          "Titre": "Please I will like to cancel my…",
          "Contenu": "Please I will like to cancel my international number"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Heiko",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T14:05:06.000Z",
          "Titre": "Rip off",
          "Contenu": "Its a rip off ....."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Adrian Mazza",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T18:59:52.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive. Cheaper options are becoming available."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Alvaro",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T13:41:21.000Z",
          "Titre": "Too many phonecalls"
        },
        {
          "Note": 1,
          "Lieu": "AM",
          "Pseudo": "Arman Kostandyan",
          "Nb_Reviews": 1,
          "Date": "2020-04-05T10:30:05.000Z",
          "Titre": "it's too hard to cancel the subscription"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "akra",
          "Nb_Reviews": 15,
          "Date": "2019-11-02T21:30:05.000Z",
          "Titre": "Lack of support",
          "Contenu": "Lack of support! Not generous and friendly!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mohamad",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T18:05:24.000Z",
          "Titre": "Bad Experience",
          "Contenu": "An average of 7 spam calls on a daily basis."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Ray Payne",
          "Nb_Reviews": 2,
          "Date": "2019-08-19T15:48:06.000Z",
          "Titre": "Very poor response from customer support"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "MRL",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T11:38:55.000Z",
          "Titre": "There's NO free trial! (they ask for pics of your credit card!)",
          "Contenu": "There's NO free trial! (they ask for pics of your credit card!)Once you add your payment method to their website (hoping you'll get the advertised \"free trial\" by doing so), they'll send you an email asking you to reply back to them with a copy of your ID, proof of residence, front-and-back photos of your credit card AND a signed document in which you authorise them to charge you for \"forwarding services\", without ANY mention of the amount, the date, the terms nor the advertised \"free trial\" (you've also got to fill the document with your credit card number, expiration date and CVV number).If you refuse to do that, their answer will be, \"Unfortunately we're unable to provide you with services. We recommend you look for another provider. Best\".An if you come here to complain about them, they'll just call you a liar, or say you did something wrong, or make up things so people think you're just mean or wrong and the company is right!Look at what they said about me:\"We are happy to provide free trials to customers that would like to test our services. Our security system is very good at spotting account information that is connected to an existing account that has violated our policies. If this occurs, additional information and further review of the account is required. This system is in place for the protection of our company and the protection of our customers.\"I've NEVER used their services, let alone broken their policies! That's what they'll do to you if you come here to warn people about them!If you don't believe me, then just go and try to get a free trial from them... Keep in mind that after you add your credit card to their website though, you'll NOT be able to cancel or delete it! I'll have to call them or send them an email, and then, and ONLY THEN, they'll inform you that they need pics of your credit card and everything else I said..You'll NOT get free trial with them, and if you do buy their service, they'll keep adding other hidden fees to your credit card, as said by many people here and on others websites like this.99% of the positive reviews here are made by people who came here only to review their company and then never came back! As if they just had to do it or would profit from it... The company does use this page to attract people to their website, where they advertise their \"\"\"\"30 days free trial\"\"\"\"\"!I do NOT recommend this company.PS: They've already flagged this review THREE TIMES! They do NOT want you to see this!! They've been trying to put this DOWN!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Miguel Ossandon",
          "Nb_Reviews": 1,
          "Date": "2018-09-26T21:20:56.000Z",
          "Titre": "To many unwanted calls"
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "Mariam Salem",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T13:25:27.000Z",
          "Titre": "The calls i receive are very laggy and…",
          "Contenu": "The calls i receive are very laggy and not good quality sound!"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Vincent Schreyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T12:30:34.000Z",
          "Titre": "Service is fine, customer service nonexistent",
          "Contenu": "Service was fine, but they didnt happen to provide the service I was looking for, which was SMS forwarding. I guess that´s my bad for not checking before hand. However, once I tried to reach customer service, my view on this company quickly turned. Not only was I first nearly spammed with emails like \"Hi, I am x and Id like to help you, reach me under this number or email\", but whenever I actually TRIED to reach someone I never got an answer. I wrote like three mails to JeremiahS, which apparently is the account manager responisble for my account. How do I know? Well, I received three automatically generated emails from him, stating, that if I ever have questions I should just write him. So much for that. I also wrote to official customer support, but same issue. No answer since a week. Thats not okay. Account number is 7261097."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tzinnia Najera",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T22:44:48.000Z",
          "Titre": "sometimes I don't get the calls",
          "Contenu": "sometimes I don't get the calls, and I don't like that I can't see the number when they call. or receive text messages, because sometimes you have to confirm via text. and it not possible"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kenny Goggin",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T14:06:07.000Z",
          "Titre": "I get non-stop spam calls every morning."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "EAG",
          "Nb_Reviews": 8,
          "Date": "2021-08-06T15:35:46.000Z",
          "Titre": "the collection works faster than the…",
          "Contenu": "the collection works faster than the service and more reliable. customer relationship could improve."
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "Mohammed Heragi",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T13:47:41.000Z",
          "Titre": "No good communication through the call"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Nancy C.",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T19:35:26.000Z",
          "Titre": "The line is quite bad most of the time",
          "Contenu": "The line is quite bad most of the time. There’s always a delay between the time I speak and when my client hears me, I already mentioned the problem it was rectified but keeps coming back. Also, I always receive marketing calls or fax calls on my line now so I’m pretty annoyed and frustrated with the problem."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "Amit",
          "Nb_Reviews": 1,
          "Date": "2016-08-08T02:13:22.000Z",
          "Titre": "They won't let you cancel. Otherwise good product",
          "Contenu": "I used the product, it works well as promised.The problem starts when you want to cancel it. There's no cancel button on your accounts page. I then emailed my account manager, and support, and billing. No reply for one month. I finally had to contact my credit card company to cancel the monthly billing."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Serious Donut Lover",
          "Nb_Reviews": 6,
          "Date": "2018-11-12T06:11:17.000Z",
          "Titre": "A nightmare just trying to set it up...and never managed to",
          "Contenu": "Signed up to this service for a local phone number for an overseas country. First off, trial form let me continue without saying which number I wanted calls forwarded to! Then it assigned a username and password to me but didn't tell me what they were. Tried to update destination number but wouldn't let me, so signed out and tried to sign in again but I had no idea username was email address and didn't know password. Tried to then reset the password but it kept failing. Couldn't get anywhere close to even trying the service! Strongly recommend against using it."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "CLS",
          "Nb_Reviews": 13,
          "Date": "2018-10-10T22:38:01.000Z",
          "Titre": "Calls don't go through",
          "Contenu": "I never get the calls, don't get notified of voicemails, poor service altogether. I hate to even put my virtual number on my U.S. accts because I know that if the company has to calI me there's probably a 95% chance the call will not go thru :("
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Joe Carpenter",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T19:06:08.000Z",
          "Titre": "I find the service very expensive and…",
          "Contenu": "I find the service very expensive and also I see spam billing by fax and fake calls.I am very diligently watching the billing....and it is almost always some issue with it.Be aware....watch closely if you decide to use this company."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Khitish Behera",
          "Nb_Reviews": 1,
          "Date": "2018-10-04T15:21:21.000Z",
          "Titre": "Sales team need to connect me",
          "Contenu": "1. hard to connect with sales team.2. No reply to my mail3. Voice quality is goodI have tried several time to call and fix my issue but sorry to say from last 6 month it not resolved. Mails are not coming to my id flustering."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "1129386",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T18:27:49.000Z",
          "Titre": "Call quality was rubbish",
          "Contenu": "Call quality was rubbish!  Repeated complaints were unresolved for the longest time. Service was inattentive until we threatened to leave at which point they seemed to have all sorts of deals better suited to our activity"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "ALEJANDRO CORRAL",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T02:03:57.000Z",
          "Titre": "We were Double charged",
          "Contenu": "We were Double charged, requested a review and agents said it was refunded, but never was, I have 2 equal charges, sent a screen shot, but replied the same. Im desapointed with you Tollfreeforwarding"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Shelley Hughes",
          "Nb_Reviews": 1,
          "Date": "2020-11-26T02:04:56.000Z",
          "Titre": "Unhappy with it",
          "Contenu": "Unhappy with it. However. I just spoke with a lovely lady who fixed things she said were set up incorrectly in the first place. So we will see. Ask me again in 2 weeks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T17:55:52.000Z",
          "Titre": "Technology way behind",
          "Contenu": "We have used tollfree for almost a decade.  I see many reviews saying support is great.  Either these are BS or they didn't really NEED customer service.  With over 60+ numbers, customer service was bad.Technology way behind. No app no features. Price per number is double the competitors'. Customer support is below average as sometimes they don't respond.Many new numbers have some sort of spam issues. Clients would call us complaining customers are calling them to yell at them for calling and hanging up- which they didn't.  The number was spoofed which Tollfree said was \"normal\" in the industry and not able to be stopped.We're using another service with 2 dozen tracking numbers over 6 months.  Not one dirty number, no spoof problems, great smartphone app and a much better/more current website."
        },
        {
          "Note": 2,
          "Lieu": "AR",
          "Pseudo": "Fabiana Andrea Ibsen",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T15:09:28.000Z",
          "Titre": "The quality of the conversation was bad…",
          "Contenu": "The quality of the conversation was bad the few times we used it. The last conversation was so bad we couldn't' understand where they were phoning from"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randy Wood",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T20:26:45.000Z",
          "Titre": "Server issues continue",
          "Contenu": "Server issues continue. I have two accounts. I am very disappointed with this product reliability. We deal with medical records and not receiving them is a major issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hernan Squizziato",
          "Nb_Reviews": 1,
          "Date": "2020-05-31T00:57:24.000Z",
          "Titre": "70% of the time people that calls me…",
          "Contenu": "70% of the time people that calls me can not connect. Very poor. I am thinking on changing my service to someone else"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Anderson Williams",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T12:25:43.000Z",
          "Titre": "Our customers are unable to call the…",
          "Contenu": "Our customers are unable to call the Toll Free Forwarding number if they use Digicel as their local provider."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ian Murray",
          "Nb_Reviews": 3,
          "Date": "2020-07-07T01:10:24.000Z",
          "Titre": "My account was suspended for no reason",
          "Contenu": "My account was suspended for no reason. No explanation. Never even used it so how could it become suspended??"
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "mrw",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T13:03:47.000Z",
          "Titre": "work ... so ... so ...",
          "Contenu": "too many calls dont relayed properly, recorded incoming message noticing to leave a message not played ..."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "David Robins",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T17:17:08.000Z",
          "Titre": "Need SMS (messaging) forwarding too",
          "Contenu": "Need SMS (messaging) forwarding too, this feature was promised a long time ago."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "1264149",
          "Nb_Reviews": 2,
          "Date": "2018-10-11T10:53:04.000Z",
          "Titre": "Too many automated irrelevant calls…",
          "Contenu": "Too many automated irrelevant calls being received."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Hersh Seth",
          "Nb_Reviews": 2,
          "Date": "2019-05-28T22:18:16.000Z",
          "Titre": "In the first 3 weeks I got a hundred…",
          "Contenu": "In the first 3 weeks I got a hundred spam calls..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Kirkland",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T22:23:56.000Z",
          "Titre": "50% of the calls drop after one or two…",
          "Contenu": "50% of the calls drop after one or two rings."
        },
        {
          "Note": 2,
          "Lieu": "LK",
          "Pseudo": "Samantha Dharmarathna",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T07:10:38.000Z",
          "Titre": "My connection is not working even after…",
          "Contenu": "My connection is not working even after payment"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Antonio Padilla",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T08:23:56.000Z",
          "Titre": "I never ear the other person",
          "Contenu": "I never ear the other person, I want to cancel"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Combs",
          "Nb_Reviews": 1,
          "Date": "2019-04-22T17:14:33.000Z",
          "Titre": "Best customer service ever!"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Abdulaziz Khan",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:13:18.000Z",
          "Titre": "Missing SMS option",
          "Contenu": "Call forward option is available but i am unable to setup my whatsapp on this as it is not able to send SMS, if that option is added it will be a great go"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DG",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T15:18:30.000Z",
          "Titre": "Lacks extra features. Just a number.",
          "Contenu": "The ability to text via the number would be helpful. A dedicated app would be helpful. Calling FROM the number would be helpful. All of those things are available with Google Voice for free in the US, but this has none of those features.For just having a virtual number it does the job, and getting voicemail sent to email is great, but it should be a free service."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Jacob Graungaard",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T13:17:37.000Z",
          "Titre": "Easy setup, but Lacking features",
          "Contenu": "Easy setup, good customer service.. But lacking features like automatic sending of invoices.They are charge the paycard, but it can take up to a month before the invoice is even made"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Steven Roffe",
          "Nb_Reviews": 4,
          "Date": "2022-05-22T13:26:28.000Z",
          "Titre": "Excellent voice call forwarding…",
          "Contenu": "Excellent voice call forwarding service.  Would get 5 stars if the service could be used for text messages. So many organizations require a local number for text verification that I really need to look for something which can support both voice and text."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Mahad Ul Haq",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T15:59:22.000Z",
          "Titre": "We have not published our new phone…",
          "Contenu": "We have not published our new phone number anywhere but we are are receiving wrong calls continuously. Who has published this un known number for marketing calls."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T12:50:24.000Z",
          "Titre": "There was mention of the free PBX…",
          "Contenu": "There was mention of the free PBX desktop app via the website and managing calls in/out via the number provided.  It was not known until after the purchase these are not in fact available.  Otherwise the service was found to be fine and does its job."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Leslie",
          "Nb_Reviews": 2,
          "Date": "2022-02-09T20:52:25.000Z",
          "Titre": "Barrage of Spam Calls Unwelcome",
          "Contenu": "Any help I have received by a representative has been great.  No complaints.  Call quality is also fine.  My complaint is the quantity of daily junk calls I get now that I have this number.  If there´s anything we can do about that, please advise."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Michele Clute",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T18:24:42.000Z",
          "Titre": "This is a great service for inbound…",
          "Contenu": "This is a great service for inbound calls. Would like to see outbound calling and texting added to your platform"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pamala Butters",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T03:03:50.000Z",
          "Titre": "I can't figure out how to use most of…",
          "Contenu": "I can't figure out how to use most of your options. My fault for not calling your people for help. I watched the tutorials and still couldn't get it. Now set up so all calls go to voicemail/ email. Want it to ring to me before, but doesn't work."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Nageeb",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T14:14:11.000Z",
          "Titre": "Provide Infographic for easier Setup",
          "Contenu": "Setup is not user-friendly. A lot of time wasted figuring out the right settings. A simple infographic would help."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Patrice Audet",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T18:43:09.000Z",
          "Titre": "It does the job, but they charge for minutes",
          "Contenu": "It does the job, but it's expensive. They charge you for every minutes someone calls you, and it was not clear on sigup they'd do this. I'm looking for an other option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill Moorer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:39:12.000Z",
          "Titre": "Unused",
          "Contenu": "The number is unused"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "liwen xu",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T15:10:59.000Z",
          "Titre": "sometimes phone call is not clearly",
          "Contenu": "sometimes，phone call is not clearly，some times phone call is not continuously"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "E Rueda",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T13:57:54.000Z",
          "Titre": "I was in Costa Rica and my costa rica…",
          "Contenu": "I was in Costa Rica and my costa rica number does not work for call forwarding"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alison Dunford",
          "Nb_Reviews": 8,
          "Date": "2021-09-01T20:50:30.000Z",
          "Titre": "Confusing",
          "Contenu": "Confusing. Service and billing not clear."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Love",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T00:03:03.000Z",
          "Titre": "Service works as promised."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Zolal Habibi",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T20:55:23.000Z",
          "Titre": "customer support",
          "Contenu": "last month we had an outage which lasted over a week, despite the outage not being tollfreeforwarding.com's fault, they didn't inform us of this issue until we contacted themBut after we reported the issue they gave us continuous updates, giving us a clear picture of where we stand and what is being done"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lucy Smith",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T16:49:54.000Z",
          "Titre": "Its really important to test and trial…",
          "Contenu": "Its really important to test and trial the service first, as most of the international services are routed via the internet, which can effect the quality of the call to not be as good due to voice time lag, subject to internet bandwidth and many other factors. This is a consumer warning to not take the chance, test and trial first before you pay any money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tamara Bernardo",
          "Nb_Reviews": 2,
          "Date": "2018-08-09T01:17:35.000Z",
          "Titre": "Started my free trial and received no…",
          "Contenu": "Started my free trial and received no notification of any kind. Can't reach my account page to cancel, and the number on their site is out of service. Their virtual number also won't connect. I'll be contacting my bank to report any charges as fraud, and let's hope they block these shysters.Edit: got the call to go through. The service is indeed impeccable, though they ought to look into setting up better notification pages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bjorn Wastvedt",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T21:13:46.000Z",
          "Titre": "Although somewhat useful to get calls…",
          "Contenu": "Although somewhat useful to get calls from abroad, it lags behind when people use smartphones and internet... Texting is impossible and placing calls from your foreign number is impossible as well. Also, your unused balance is deleted every month. Since video chatting now is available on Facebook for free, I am using it less and less. It would have been nice to hear of some new feature from  Tollfree forwarding from time to time, instead of just wasting our money!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 5,
          "Date": "2019-02-20T02:35:09.000Z",
          "Titre": "Unfortunately,the person that I would…",
          "Contenu": "Unfortunately,the person that I would like to be able to call me, has had trouble with the system working. The phone will ring, I'll answer, but we cannot hear each other.This may not be a problem of the system and my success with the system should not be used in your decision on whether to us the system."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "V3Tv.UK",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T12:56:29.000Z",
          "Titre": "The calls don't come through straight…",
          "Contenu": "The calls don't come through straight away. I often get told by callers that the line is busy, or goes to voicemail.  So, as a result, I have to let individuals know that calling me twice may be the only way to reach me.  Otherwise its okay I guess. Only wish it worked for text messages as well."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Patricia Bernard",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T21:36:51.000Z",
          "Titre": "The star rating has more to do with the…",
          "Contenu": "The star rating has more to do with the quality of the call.  I recently called TollFreeForwarding to try and improve the quality but we are on school holidays here in Australia at the moment so our business is not getting any calls for me to see if it has noticeably improved.  There was a significant delay in the conversation exchange since we started 18months ago and I would need to call the customer back if the call went for more than a minute. Since educators are so time poor - long calls were rare.In terms of customer service - I give tollfree forwarding 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T17:10:50.000Z",
          "Titre": "It most of the time will forward…",
          "Contenu": "It most of the time will forward numbers but sometimes it does not. It’s does not have any features such as letting the user know if it’s a call forwarding or direct call. It doesn’t do texting. It does not records calls or send emails. Etc"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Natalie",
          "Nb_Reviews": 5,
          "Date": "2020-05-06T14:44:33.000Z",
          "Titre": "CALLS ARE CLEAR AND IT WORKS WELL",
          "Contenu": "CALLS ARE CLEAR AND IT WORKS WELL, BUT THERE IS NO 'APP' TO SHOW ON MY PHONE. THE MONTHLY BILLS ARE CONFUSING BECAUSE THEY SEEM TO BE RISING WITH EVERY PAYMENT TAKEN OUT AND THERE IS NO BILLING BREAKDOWN THAT I CAN SEE."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "TIAMA Hotline",
          "Nb_Reviews": 1,
          "Date": "2018-03-21T12:33:56.000Z",
          "Titre": "Good support but can be improved",
          "Contenu": "Good support one bad point is the quality of the conversation not as clear as if you call directly another numberand also the time to transfer call is something too long and the Customer is not waiting that much and hang down"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robin Canuel",
          "Nb_Reviews": 1,
          "Date": "2018-03-14T05:58:31.000Z",
          "Titre": "The lag time when I get calls is…",
          "Contenu": "The lag time when I get calls is unbearable. Thinking about switching to another providerUpdated - got a follow up call and while the service was great the lag is better but still makes phonically slightly awkward."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T21:53:37.000Z",
          "Titre": "Customer service is great but I get daily phantom calls",
          "Contenu": "Customer service is great! What I don't like is that ever since I've signed up for a toll-free number, I get phantom calls and voicemails EVERY SINGLE DAY from other numbers."
        },
        {
          "Note": 3,
          "Lieu": "RS",
          "Pseudo": "mrorganic",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T11:06:16.000Z",
          "Titre": "sometimes it wont works and we are…",
          "Contenu": "sometimes it wont works and we are still being charged for that ..basically if the ports aren't working the line is open but we don't have the chance to cut of the call ..it just goes and goes"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ali Dorostkar",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T21:43:48.000Z",
          "Titre": "Hello",
          "Contenu": "HelloI've had some cases when my service was interrupted because the sender notified me that they had sent a fax but I didn't receive it.Also I wish you had a service for sending faxes as well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AG",
          "Nb_Reviews": 5,
          "Date": "2018-10-10T17:28:38.000Z",
          "Titre": "I get too many false rings on my…",
          "Contenu": "I get too many false rings on my primary business line.  My business line will ring and immediately stop ringing.  If I check my VM messages, I will have 30 minutes of silence."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2018-03-06T19:19:09.000Z",
          "Titre": "My issues are the lateness of receiving…",
          "Contenu": "My issues are the lateness of receiving a message from the time it is sent.  Also losing past callers - I would like a history of past callers available.Thank you"
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "BUI VAN HAI",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T17:35:36.000Z",
          "Titre": "always can not hear clearly",
          "Contenu": "Sometimes can not hear clearly, sometimes the passengers can not connected to saying on phone. Please to improve quality for better. Temporary it can be accepted"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Matty B",
          "Nb_Reviews": 1,
          "Date": "2018-09-27T03:38:30.000Z",
          "Titre": "For simple calls going to a voice mail…",
          "Contenu": "For simple calls going to a voice mail the cost per minute is high, especially in the digital age. Hover the quality of the calls is better than others"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Slater",
          "Nb_Reviews": 3,
          "Date": "2020-09-08T22:56:11.000Z",
          "Titre": "Great service for foreign phones in the…",
          "Contenu": "Great service for foreign phones in the USA BUT the time lag of 5 seconds makes calls very tedious. Quality is great but the lag is an issue."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T19:53:33.000Z",
          "Titre": "Since getting my toll-free account…",
          "Contenu": "Since getting my toll-free account (1800#) with your company I have been bombarded by spam companies calling my 1800#. Did you sell my number to them?"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Chris Kallevag",
          "Nb_Reviews": 3,
          "Date": "2020-11-18T14:05:50.000Z",
          "Titre": "Good value for money",
          "Contenu": "Good value for money, the clarity of the sound could be better, missing the option to receive texts to my virtual numbers. 3,5 stars."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Moses Govender",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T07:31:40.000Z",
          "Titre": "Started using a number for my business…",
          "Contenu": "Started using a number for my business and had to cancell after a month as others were using the number. Impacted my business negatively."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Gary Allen",
          "Nb_Reviews": 2,
          "Date": "2018-10-11T07:51:29.000Z",
          "Titre": "Pricey and limited",
          "Contenu": "The service is acceptable but seems a bit pricey. It would also be a big improvement if the service could accept and forward SMS messages."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Udit Bhan",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T05:47:33.000Z",
          "Titre": "Good Service",
          "Contenu": "This service can be little better. Because many times, its just the machine tone that is being heard at the time of picking up the call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "1132601",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T19:01:13.000Z",
          "Titre": "Average",
          "Contenu": "Average.  Calls drop, line quality sometimes is poor and no text forward function.  When all is working, it's convenient and useful"
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Misbah Anwar",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T21:56:40.000Z",
          "Titre": "Sadly I’ve been given a previously…",
          "Contenu": "Sadly I’ve been given a previously owned number. Used to be of a lock smith for whom I receive most of the wrong calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L. Martin",
          "Nb_Reviews": 1,
          "Date": "2018-03-26T14:12:53.000Z",
          "Titre": "Receipt of Unrelated Fax Weekly",
          "Contenu": "Once a week we receive an unrelated fax from an unknown source.   Also, there are random unrelated recruiting calls received."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nicholas Pole",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T20:48:57.000Z",
          "Titre": "No customer support once paid",
          "Contenu": "No account manager ,don’t explain how it really works ,no one to work with ,told us we could remove untrue reviews, you cant"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S Williams",
          "Nb_Reviews": 1,
          "Date": "2018-10-15T00:35:04.000Z",
          "Titre": "It works- it's a basic plan..",
          "Contenu": "It works- it's a basic plan... no bells no whistles.. no extra perks that make it stand out from the competition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mihran Nahabedian",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T19:04:35.000Z",
          "Titre": "It has been almost 1 year that I get…",
          "Contenu": "It has been almost 1 year that I get multiple faxes forwarded to me on the same fax. Total waste of time and nerves."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Caribbean Islands Travel, CIT",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T20:56:31.000Z",
          "Titre": "it is a nice option but they need to…",
          "Contenu": "it is a nice option but they need to improve your website and the option for configuration or  number cancellations"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "OZAV Innl",
          "Nb_Reviews": 8,
          "Date": "2021-01-19T16:59:10.000Z",
          "Titre": "3 Stars, out of 5 - For now.",
          "Contenu": "3 stars, our of 5 - for now, due to the: -Dashboard for a customer seems still missing easy of use and easy-understanding-things features, and shows you the data that ... currently what you mostly don't need on a login day versus what you would like to see and still is not there on your customer back end dashboard-Customer service appeared too busy while answering anything and felt like a fast train conversation style and as in written communication but still effective enough, while we'd like to stress that - as old saying goes, if you are in the such important business, or any business: \"it's nice to be important, but: it's more important to be nice\" and show your customers that you care and you have the time for their issue, that - it may be - on any day-You get notified only after you are in red with the credit and the way is done is currently a horror-movie style communication as well-Written by a pilot - on a Trust Pilot, trust me - I'm a Pilot and can spot the things - as they are, happy and much better new 2021,  for everyone, where ever you may happen to be reading this, hope it helps, as we are asked for a: review - here it is, for Jan 2021."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Jutta",
          "Nb_Reviews": 3,
          "Date": "2018-03-07T09:03:06.000Z",
          "Titre": "The service is great",
          "Contenu": "The service is great, but there are many times when the system is not working, due to technical glitches"
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T21:19:58.000Z",
          "Titre": "Overall it's fine but the delay is…",
          "Contenu": "Overall it's fine but the delay is forwarding and no SMS message and no out bound calls as promised."
        },
        {
          "Note": 3,
          "Lieu": "AG",
          "Pseudo": "Em",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T18:07:31.000Z",
          "Titre": "800 calls when we get them work fine…",
          "Contenu": "800 calls when we get them work fine but the huge amount of fax calls we get is incredibly annoying."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "John McConnell",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T20:41:33.000Z",
          "Titre": "Good billing",
          "Contenu": "Good billing, service and help.  But the delay on the line makes conversations difficult."
        },
        {
          "Note": 3,
          "Lieu": "CR",
          "Pseudo": "RP",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T18:35:49.000Z",
          "Titre": "Startup was a little confusing.",
          "Contenu": "Startup was a little confusing.Only a couple issues since.Pretty good for the price."
        },
        {
          "Note": 3,
          "Lieu": "PE",
          "Pseudo": "Sofia Arce",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T00:03:25.000Z",
          "Titre": "poor signal sometimes",
          "Contenu": "we are located in cusco - peru and the signal is not good in some of the phone calls."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Gopi Chandar",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T06:53:08.000Z",
          "Titre": "good service but except few technical issues",
          "Contenu": "we are experiencing call disconnect issues and few numbers are unable to connect."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lisa Perry",
          "Nb_Reviews": 1,
          "Date": "2018-10-08T16:50:22.000Z",
          "Titre": "I had issues and constant suspensions…",
          "Contenu": "I had issues and constant suspensions when I first joined, average over all."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Monique Princen l",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T18:14:01.000Z",
          "Titre": "There is noticeable delays in the calls…",
          "Contenu": "There is noticeable delays in the calls and audio quality can be variable."
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Luis Vinay",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T16:23:41.000Z",
          "Titre": "I'm getting a lot of undesired calls to…",
          "Contenu": "I'm getting a lot of undesired calls to sell me stuff and such"
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "Oleg L",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T12:01:46.000Z",
          "Titre": "Some features are really unique while…",
          "Contenu": "Some features are really unique while they still work unstable"
        },
        {
          "Note": 3,
          "Lieu": "VE",
          "Pseudo": "Freddy Roberto Ramos",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T00:26:03.000Z",
          "Titre": "For this company The customer comes first",
          "Contenu": "The Company cares about its customers. Thank you Mr. Carter."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Khairul Nizam Nizam",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T00:54:19.000Z",
          "Titre": "The call clarity can be improved",
          "Contenu": "The call clarity can be improved. Sometimes call drop happened."
        },
        {
          "Note": 3,
          "Lieu": "TZ",
          "Pseudo": "Jiten Joshi",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T15:30:56.000Z",
          "Titre": "I am unable to make phone calls with…",
          "Contenu": "I am unable to make phone calls with the number provided :("
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Farnoosh Mostaed",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T18:03:32.000Z",
          "Titre": "Most of the quality of receiving phone…",
          "Contenu": "Most of the quality of receiving phone is not good."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Gerasimos Solomos",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T21:49:04.000Z",
          "Titre": "Sometimes it takes time to solve…",
          "Contenu": "Sometimes it takes time to solve overseas problems."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mohanned Rahman",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T11:18:00.000Z",
          "Titre": "The quality of the line is not always…",
          "Contenu": "The quality of the line is not always great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JA",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T18:46:25.000Z",
          "Titre": "Good service, but no text capability",
          "Contenu": "Good service, but missing text forwarding."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Darryl",
          "Nb_Reviews": 1,
          "Date": "2018-09-25T00:17:25.000Z",
          "Titre": "We are getting a lot of spam calls"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Nader Nilizadeh",
          "Nb_Reviews": 1,
          "Date": "2019-06-25T22:09:41.000Z",
          "Titre": "Please add the mobile app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelly Grant",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T14:21:11.000Z",
          "Titre": "Number",
          "Contenu": "Paying for minutes you may not use is the only downfall. Other than that perfect for what I need."
        },
        {
          "Note": 4,
          "Lieu": "SX",
          "Pseudo": "Shanyra Roosberg",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T15:01:24.000Z",
          "Titre": "Fantastic service",
          "Contenu": "The service rep was polite, knowledgeable and answered all my questions truthfully. First we selected the wrong plan and the rep immediately assisted me with a plan more suitable for our business. Quick email responses and very friendly service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ehab Saad",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T14:00:25.000Z",
          "Titre": "Overall great service with some suggestions",
          "Contenu": "Great service, straightforward and easy to setup, very satisfied overall. Only things I've noticed are sometimes there's a delay when someone calls, so it'll be ringing for them for a few seconds before it rings for me, then by the time it reaches my phone, I get 1 ring then it goes to voicemail. Doesn't happen all the time though, but noticed it a few times. Also, website is overly difficult and complicated to use to manage your account. Unable to make any changes to your monthly plan without having to call in, request it, wait for them to make the change, then email to follow up to confirm changes have been applied, very inconvenient."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Charles Davis",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T14:59:59.000Z",
          "Titre": "It's working really well",
          "Contenu": "It's working really well. I was concerned that certain businesses couldn't reach me in the Philippines. This is a great solution."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T06:55:57.013Z",
          "Titre": "Very good call quality and excellent…",
          "Contenu": "Very good call quality and excellent customer service. Some difficulties in setting up voice mail through the online system.  More background information should be provided on the numbers on offer. I have had numerous wrong numbers calling for various defunct businesses associated with the number selected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M.A.M. Offset Repair",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T03:22:45.000Z",
          "Titre": "Sales forgot to charge my card for…",
          "Contenu": "Sales forgot to charge my card for payment. Texh support resolved issue in 2 minutes and I back up and running"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Milen Milkovski",
          "Nb_Reviews": 2,
          "Date": "2021-09-30T11:13:15.000Z",
          "Titre": "I would give it a 4 star",
          "Contenu": "I would give it a 4 star, the only feature I'm missing is having music while toll-free is call hunting."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Saad Mahmood",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T16:18:08.000Z",
          "Titre": "Pricing are little high but overall…",
          "Contenu": "Pricing are little high but overall service is great. They are very quick to respond in case of any complaint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cordares Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:49:49.000Z",
          "Titre": "It’s a learning experience",
          "Contenu": "Learning experience"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Adrian Magallanes",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T15:56:21.000Z",
          "Titre": "Its a very easy tool to set up",
          "Contenu": "Its a very easy tool to set up, but your help desk it has several opportunities and improvements in follow ups!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "CJ Taylor",
          "Nb_Reviews": 4,
          "Date": "2022-09-14T13:26:15.000Z",
          "Titre": "TollFreeForwarding was what I needed…",
          "Contenu": "TollFreeForwarding was what I needed and all I can say is, thus far, it helped me accomplish what I needed to do. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Katya Miraglia",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T14:32:09.134Z",
          "Titre": "It’s a very good service",
          "Contenu": "It’s a very good service, the only problem is that SMS are not allowed."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "ALANHO CHIANG",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T02:04:33.000Z",
          "Titre": "Which O.S is the best to login?",
          "Contenu": "Verification code?? Is it designed for slow PC only?"
        },
        {
          "Note": 4,
          "Lieu": "TZ",
          "Pseudo": "Stephen Ommuli",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T07:28:17.000Z",
          "Titre": "The account manager (Victor) is so…",
          "Contenu": "The account manager (Victor) is so helpful"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Haitam Abo Hoseen",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T15:46:53.000Z",
          "Titre": "Four stars",
          "Contenu": "Four stars, because there are no text messages"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jeffery James",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T15:06:54.000Z",
          "Titre": "Easy set up and number that fits our…",
          "Contenu": "Easy set up and number that fits our business."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JAMES PAVELEY",
          "Nb_Reviews": 5,
          "Date": "2020-08-31T20:50:41.000Z",
          "Titre": "Courteous and helpful staff",
          "Contenu": "Friendly staff. Had a slight issue with having been put on a more expensive number without realizing,which was frustrating initially, however the staff member listened to my requirements and worked quickly and courteously to resolve it, saving me time and money. I was impressed by the level of service. Email responses are generally fast. I will be recommending this company to my personal friends as I believe their level of service is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bojopr",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T00:18:16.000Z",
          "Titre": "My only complaint is...",
          "Contenu": "Overall I'm very happy with this service. My only complaint is when calls come in from spammer's/telemarketers I'm getting charged for them, and it isn't cheap. I don't know if there is a way to solve this, but I got this service for clients, not spammer's/telemarketers. Otherwise I would have given 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Larry Omo",
          "Nb_Reviews": 2,
          "Date": "2020-03-02T18:17:12.000Z",
          "Titre": "We moved to Europe and I thought the…",
          "Contenu": "We moved to Europe and I thought the toll free number would be helpful. However, with the free applications available such as Whatsapp, Wechat, Messenger, etc.,  we are able to communicate with family and friends free. We used service for only six weeks and decided that I did not need the toll free number at this time.   Also we received a large number of unsolicited spam calls on the toll free number.  So I decided to cancel the service at this time."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Clinton Skakun",
          "Nb_Reviews": 2,
          "Date": "2019-09-26T02:07:55.000Z",
          "Titre": "I've used them before years ago and…",
          "Contenu": "I've used them before years ago and they were great. The second time around they froze my account and asked for a copy of my ID and credit card. I sent it to them, called them to let them know. They didn't give me an ETA so I emailed them 30 mins later, no response the entire day. Yes I'm unreasonably impatient for this 1800 number, I planned on having it up today."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Noe Tinoco",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T04:16:54.000Z",
          "Titre": "Totally worth it.",
          "Contenu": "It is a good call forwarding service. How ever I find it to be a bit expensive. Is there like a yearly plan payment to save money? 🤔FOLLOW UP; First of all, I did receive the follow up from their team. I am completely convinced that it is totally worth it. After reviewing and follow-up into a bit of research about other similar service providers. I recommend there fast quality of customer care and follow-ups on you matters. - Thank you! You have won a customer 🤝"
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "GEORGE S.",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T14:12:26.000Z",
          "Titre": "CUSTOMER SERVICE IMPROVED A LOT",
          "Contenu": "After a bad experience that I had with the lack of communication and a problem in the contracted line, I got a lot of response from the technical service and they fixed the problem I had. The customer service improved a lot, and the attention changed from very bad to excellent. Thanks for the support."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Chinyere Ogwuegbu",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T16:03:47.000Z",
          "Titre": "An overall good service",
          "Contenu": "An overall good service. However I wasn't notified of An automatic recharge that was charged to my payago account for $9 and I there is no option to reduce the recharge amount although the agent I spoke to, Chad, who was rather offhand told me there was(although in fairness to all their other kind and patient agents that I have interacted with in the past, he was an exception). And I got charged for the calls although they didn't ring nor did I pick them up. Other than these, not a bad service."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Dar",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T16:46:53.000Z",
          "Titre": "Very good service",
          "Contenu": "I have approached tollfreeforwarding.com with lot of apprehension as I was not able to gather much information about their services. But wanted to give them a try as couldn't find any other in time I had. I was pleasantly surprised by the service that was provided. They lived upto that expectations and completely recommended them. One suggestions is if that can make the services less expensive. As a whole, very good service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Viorel Rebrisorean",
          "Nb_Reviews": 3,
          "Date": "2019-11-05T13:45:41.000Z",
          "Titre": "Works,...I was able to receive transfered calls…",
          "Contenu": "Works,...I was able to receive calls overseas in Romania, transfered on local cell phone number i did purchased. But ONLY 4 stars,..because there it's a little issue I did found when I return back in USA after i did put back the at&t SIM card into my unlocked Smart phone, because I had many Voice messages  from peoples calling me on my USA ph number, but the calls Never went thru. So,..I'm thinking it was a netwtork issue, or..just a transfer glitch of these Guy's system."
        },
        {
          "Note": 4,
          "Lieu": "MT",
          "Pseudo": "Joseph Vella",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T18:11:07.000Z",
          "Titre": "Almost a 5 star service . . . . if only it had texting ability",
          "Contenu": "Setting up the new number with a new country code was a breeze.  The Control panel is intuitive and very useful. Pricing is very reasonable.  I would have given this service 5 stars if these numbers were at least able to receive texts.  Effectively it is a landline.  Maybe this function can be added which would make the service flawless."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2018-07-02T23:32:00.000Z",
          "Titre": "Good range of countries and number types.",
          "Contenu": "Good service, reasonable prices and large range of countries to choose from. Porting process was relatively painless.Web UI for hunting lists is relatively basic, but does the job well. Being able to control a group of TollFree numbers with one main set of rules has allowed us to centralise all TollFree numbers onto this service."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Tracie Griffin",
          "Nb_Reviews": 1,
          "Date": "2018-09-19T22:10:04.000Z",
          "Titre": "It was extremely fast to set up",
          "Contenu": "It was extremely fast to set up. It works perfectly and it's economical.  On the downside, as with any calling service there are constant machine calls advertising their services.  As I am in New Zealand, they come at all hours of the night and I also get many one or two ring calls from scammers hoping I'll ring them back and they'll make a pennies from my return call.  Very frustrating, but this would happen with any global 0800 service. Overall, very good and nice people too."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Mr James Collis",
          "Nb_Reviews": 19,
          "Date": "2018-10-03T16:41:17.000Z",
          "Titre": "Product works",
          "Contenu": "Product works, call quality good, support excellent. Good value for money. Only reason for 4 not 5 is cancelling a contract if it turns out to be not quite right for your business or nor longer needed is really hard to find option buried under non-obvious menu choice. Platform sophistication well beyond our needs."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Conrado Ramírez",
          "Nb_Reviews": 3,
          "Date": "2020-10-13T13:08:19.000Z",
          "Titre": "Good service and areas of opportunity",
          "Contenu": "We have been with the service for more than 4 years. We are really happy with the service and the solutions they provide. Ability to make calls from anywhere and any device would be a great value added, however it is not possible at the present time. :("
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Daniel Shepherd",
          "Nb_Reviews": 1,
          "Date": "2018-08-27T17:16:04.000Z",
          "Titre": "Need Text Forwarding",
          "Contenu": "I would give five stars if you could forward text. Bank internet operations and computer app updates require confirmation via text. I hope this is something you are working on.Otherwise your service is great and our relatives like the ease of calling us on a U.S. number."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T21:41:24.000Z",
          "Titre": "As I'm overseas I needed a phone number…",
          "Contenu": "As I'm overseas I needed a phone number in USA and this was very quick and easy to set up. The default voicemail message could be much better. I have set all voicemails to come straight to my email which is fantastic given the timezone difference."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cilica",
          "Nb_Reviews": 1,
          "Date": "2018-03-21T04:29:29.000Z",
          "Titre": "The service itself is great",
          "Contenu": "The service itself is great.  Customer Service by telephone is wonderful.  E-mail customer services is lacking, so I try never to email for help. I would recommend toll free forwarding, their service is never down and reliable, the prices are great."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Janie",
          "Nb_Reviews": 5,
          "Date": "2020-09-14T22:04:20.000Z",
          "Titre": "Good service with competitive price",
          "Contenu": "Overall, it's a good service with competitive price.However, the minutes are counted even we didn't answer the phone and my clients said sometimes they couldn't reach to this toll-free, it was an invalid number."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Harry Zettel",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T04:40:48.000Z",
          "Titre": "Call forward option",
          "Contenu": "Service works wellwish there was also a way to forward a call to my cell phone with caller thinking that I am at my toll free number, but If I dont pick it up after say 4 rings it goes to the answering machine.Harry"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Vitalii Zurian",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T15:08:27.000Z",
          "Titre": "Their customer service was very helpful…",
          "Contenu": "Their customer service was very helpful when I was setting up my account. The system itself works just fine. 1 star is missing for me that they don’t send you invoices via email automatically - you have to download them from the portal."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "GmcG",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T22:51:31.000Z",
          "Titre": "Overall pretty good, phantom calls and tricky to cancel",
          "Contenu": "Signed up for the sevrice for my US ecom store to add credibility and meet Google requirements. The price is reasonable and when tested it worked pretty well. I have 2 points I'd like to make.1. I seemed to be getting charged for calls but not receive any email notifications or voicemails about them.2. I'm changing my store and no longer need the service and wanted to cancel but I couldn't find anywhere on the site (which isn't optimised for mobile) to cancel. Hopefully my email is to support will work.Overrall pretty good, with a few things needing ironing out. I guess that's one of the perks of using Trustpilot, to find these things out and fix them."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Tebogo Moeng",
          "Nb_Reviews": 1,
          "Date": "2019-11-26T04:30:51.000Z",
          "Titre": "I cannot comment much since I have been…",
          "Contenu": "I cannot comment much since I have been with the company for a few months, but the staff I have dealt with thus far try by all means to make a happy clients out of me. Thank you Kevin P for handling my account so well."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Sol",
          "Nb_Reviews": 1,
          "Date": "2019-12-26T11:21:23.000Z",
          "Titre": "Keep it up!",
          "Contenu": "Our account manager was very helpful and accommodating with friendly CS support team. Although we haven't fully utilize all of TollFreeForwarding's solutions, so far we are happy with their services."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "JenS",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T12:19:45.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2018-07-02T15:49:49.000Z",
          "Titre": "Happy",
          "Contenu": "Good deal.  The whole plan thing is very confusing, and the support agents weren't able to fully explain it to me, however having a local Amsterdam # during a job search has proven to be a great thing."
        },
        {
          "Note": 4,
          "Lieu": "AL",
          "Pseudo": "T. C.",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T16:33:25.000Z",
          "Titre": "Affordable & Responsive",
          "Contenu": "Affordable and responsive.  Good for someone who just needs to maintain a US number, which is all I need.  And if there are questions or concerns, you speak to a human every time."
        },
        {
          "Note": 4,
          "Lieu": "TN",
          "Pseudo": "Hichem Touihri",
          "Nb_Reviews": 1,
          "Date": "2018-11-07T22:36:02.000Z",
          "Titre": "Works.",
          "Contenu": "I had a problem with their support at first with emails bouncing back and the fact that I couldn't access my account, but they handled the problem from there, and the service is working fine now."
        },
        {
          "Note": 4,
          "Lieu": "ET",
          "Pseudo": "Haymanot Dagnaw",
          "Nb_Reviews": 2,
          "Date": "2019-03-05T05:58:33.000Z",
          "Titre": "Thank you for your information that you…",
          "Contenu": "Thank you for your information that you gave me. and it was help full.but i would be glad if you can tell me any possibilities to call to my own country subscribers like i am from other country."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Luis Fernando L pez",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T13:45:45.000Z",
          "Titre": "The phone line works as It was…",
          "Contenu": "The phone line works as It was programmed"
        },
        {
          "Note": 4,
          "Lieu": "LU",
          "Pseudo": "Joel OLIVEIRA",
          "Nb_Reviews": 7,
          "Date": "2018-11-19T22:45:19.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service, at first I had some troubles with getting the number, I was always getting \"Unknown Number\" for incoming calls, but then they solved my problem. Recommended."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Amrit",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T06:47:15.000Z",
          "Titre": "I've toll free forwarding number that I…",
          "Contenu": "I've toll free forwarding number that I took from toll free forwarding, I've a good experience with them, they have good service as well good people.They are doing good job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rizwan Sarkhot",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T20:08:41.000Z",
          "Titre": "Turn around was quick",
          "Contenu": "Turn around was quick. Account rep was helpful in providing suggestion and getting provisioning expedited. Toll Free portal has been easy to use and has features you would need typically."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "oulevey jean-philippe",
          "Nb_Reviews": 1,
          "Date": "2020-05-03T01:49:43.000Z",
          "Titre": "The forwarding works well",
          "Contenu": "The forwarding works well. Incoming works well, but I sense that on the other side they experience a slight delay. Overall it works but there must be room for improvements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Wolberger",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T05:34:56.000Z",
          "Titre": "We are very happy with your service",
          "Contenu": "We are very happy with your service.  We have had a few bumps with this particular phone number but your support has been excellent.  Let us know when you get text messaging!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sergiy Tsimidanov",
          "Nb_Reviews": 1,
          "Date": "2018-03-14T00:16:32.000Z",
          "Titre": "Add more tools",
          "Contenu": "Hi,Your service works fine, but I would add some quite useful tools I couldn't find on your website:1. I have 2 virtual numbers, but I can only redirect them to 1 number. Still do not understand why I cannot redirect one number to one cell phone and another to another. I work with another guy and simply need one number to be redirected to his cell phone. 2. We need a tool to call from these numbers. Meaning if we need to make a call I want a receiver to see our U.S. 3. I could not find how to activate an answering machine, but not the one I have on a cell phone, but the virtual number one. I run several businesses and it is impossible to record a universal one. All calls from virtual numbers should have its own answering machine if not answered within 5-6 rings. For everything else it is ok."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Dick Thompson",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T15:58:17.000Z",
          "Titre": "I have experienced some problem with…",
          "Contenu": "I have experienced some problem with the line - it wouldn't ring when someone tried calling from South African cell. Your team quickly solved the problem. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Marcus Glover",
          "Nb_Reviews": 2,
          "Date": "2018-03-14T07:24:38.000Z",
          "Titre": "It all works fine BUT i get far more calls from",
          "Contenu": "It all works fine BUT i get far more wrong numbers from people in nigeria wanting some kind on money bond service.  I guess this cant be helped but im paying for those calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ipmbugbo",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T13:05:00.000Z",
          "Titre": "They did a great job.",
          "Contenu": "They did a great job and fallowed up well. I would recommend them to anyone. They are having a problem transferring on of my 5 numbers but i don't think its their fault."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "anon",
          "Nb_Reviews": 1,
          "Date": "2018-10-18T20:09:56.000Z",
          "Titre": "Used them for 3 years",
          "Contenu": "Used them for 3 years. Works well. Good customer services. Polite staff. Always helpful. Only downside is you cannot reach them evenings and weekends if you have problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DeWayne Mann",
          "Nb_Reviews": 1,
          "Date": "2019-10-08T20:51:49.000Z",
          "Titre": "Not 5 stars, but.....",
          "Contenu": "4 stars because I would like to set up ring tone or caller I'd to know the number is being forward so I can recognize who is calling.  Great service though"
        },
        {
          "Note": 4,
          "Lieu": "PG",
          "Pseudo": "TERENCE NIRIGUT",
          "Nb_Reviews": 1,
          "Date": "2021-12-26T02:25:44.000Z",
          "Titre": "no sms so i give you this rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. French",
          "Nb_Reviews": 3,
          "Date": "2020-01-27T20:29:21.000Z",
          "Titre": "Forwarding from the U.K",
          "Contenu": "Forwarding from the U.K. to the USA has been 90% seamless. Good initial customer service during set up and has run without incident since then. Recommended."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2019-07-22T22:19:26.000Z",
          "Titre": "Helpful tool to manage across timezones",
          "Contenu": "Great to have voicemails emailed through so nothing is missed and you can set specific messages for different time periods to help manage across timezones."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 191,
          "Date": "2016-03-24T16:07:14.484Z",
          "Titre": "Works well, good customer service",
          "Contenu": "Like this service if I quickly need a local number somewhere. Got great service. Had a number that didn't work and was replaced. Difficilt to cancel, though."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Yuri Lima",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T12:32:31.000Z",
          "Titre": "Sometimes the call is not very clear"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "MAURICIO SALAS",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T19:03:09.000Z",
          "Titre": "Good service",
          "Contenu": "We’ve received tons of spam calls, and the audio of the calls get a lot of lag. Other than those two little inconveniences, the service is always working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Seath Manering",
          "Nb_Reviews": 2,
          "Date": "2018-07-02T17:42:19.000Z",
          "Titre": "Very polite and knowledgeable customer…",
          "Contenu": "Very polite and knowledgeable customer service agents. i received the services I had asked for and was advised of any other options that were available."
        },
        {
          "Note": 4,
          "Lieu": "GF",
          "Pseudo": "Wathleine Jean Louis Aladin",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T17:13:16.000Z",
          "Titre": "I like the service provided."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anita Elphinstone",
          "Nb_Reviews": 2,
          "Date": "2020-11-10T00:33:52.000Z",
          "Titre": "Pretty good service",
          "Contenu": "Pretty good service, works as expected but often calls have quite a bit of a lag which is annoying and can make it harder to talk to people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Rios",
          "Nb_Reviews": 1,
          "Date": "2018-10-16T17:01:09.000Z",
          "Titre": "TFF has been great to work with over…",
          "Contenu": "TFF has been great to work with over the past few months. I've used them for a project and they have always delivered when they said they would."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Jane Team",
          "Nb_Reviews": 2,
          "Date": "2020-12-03T11:54:48.000Z",
          "Titre": "Great tool & easy to use !",
          "Contenu": "Great tool & easy to use !For 5 stars just a little improvement on user interface, technically it's perfect up till now.  thx"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Marian",
          "Nb_Reviews": 2,
          "Date": "2019-03-19T12:09:59.000Z",
          "Titre": "Good service technically works…",
          "Contenu": "Good service technically works flawless. Little tricky to launch I guess not possible without confirmation with operator but acceptable toll."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Nitesh Bhardwaj",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T19:07:38.000Z",
          "Titre": "I don’t like it full Coz every month…",
          "Contenu": "I don’t like it full Coz every month starting number gets suspended, atleast don’t suspend it put a reminder on my account to pay the money."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Bernard Thiry",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T06:22:24.000Z",
          "Titre": "Good Service",
          "Contenu": "Rapid answer to any issue, easy interface and very good contact with the support.We will continue to work with TollFreeForwarding.com"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stacey Getz",
          "Nb_Reviews": 4,
          "Date": "2018-03-14T08:02:44.000Z",
          "Titre": "Was easier to set up and transfer over…",
          "Contenu": "Was easier to set up and transfer over to than others plus more economical only down fall is all number show with Tollfree for caller ID"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "James Robinson",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T23:13:49.000Z",
          "Titre": "Good customer service.",
          "Contenu": "Good customer service.At times there can be a 'time delay' or 'lag' on the line when you are having a conversation."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Henry Heinz",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T08:19:38.000Z",
          "Titre": "friendly staff with helpful service",
          "Contenu": "Unfortunetaly the 1st number was'nt work but the friendly staff with helpful service was find a quickly solution."
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "Mamiko Hashimoto",
          "Nb_Reviews": 1,
          "Date": "2019-09-03T03:51:05.000Z",
          "Titre": "Its amazing",
          "Contenu": "Its amazing! And its working perfectly! The only bad thing its that I can't see the number of the person who is calling.."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Alina Mocanu",
          "Nb_Reviews": 5,
          "Date": "2018-03-14T14:54:21.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, never a problem.Quality of sound in Europe, sometimes not so good. But only temporary.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Newman",
          "Nb_Reviews": 3,
          "Date": "2023-01-12T16:37:38.000Z",
          "Titre": "The call is ok when it goes through"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "andrea tremblay",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T18:06:07.000Z",
          "Titre": "Very happy with this service though I…",
          "Contenu": "Very happy with this service though I found setting up multiple levels of answering messages complicated."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Hugo Lotez",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T09:41:41.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, I am giving TollFreeForwording, a 4 Stars because your Service is Wondeful I Love it.ThanksMr.Hugo."
        },
        {
          "Note": 4,
          "Lieu": "ET",
          "Pseudo": "Haymanot Dagnaw",
          "Nb_Reviews": 2,
          "Date": "2019-03-01T08:01:02.000Z",
          "Titre": "appreciate !",
          "Contenu": "Can I call like I am from another country while I am in my country using this? can anybody help me please?"
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Houke",
          "Nb_Reviews": 4,
          "Date": "2019-08-26T18:09:34.000Z",
          "Titre": "Good",
          "Contenu": "It's good. The interface is clear, and they call every now and then to see if everything is okay"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Ahmed Mohamed",
          "Nb_Reviews": 3,
          "Date": "2020-05-11T14:50:55.000Z",
          "Titre": "Very practical solution",
          "Contenu": "Very good and stable service, only few times that callers has been directed to a inbox services."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Marco Agostinho",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T18:56:27.000Z",
          "Titre": "We don´t have techinicals problemas and…",
          "Contenu": "We don´t have techinicals problemas and we get a good job. Our users talk wtth us very well."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Julie",
          "Nb_Reviews": 2,
          "Date": "2020-02-24T21:31:16.000Z",
          "Titre": "Honestly couldn’t believe how fast…",
          "Contenu": "Honestly couldn’t believe how fast these guys responded to my queries. Spot on service👍"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Louis Richard",
          "Nb_Reviews": 1,
          "Date": "2018-08-06T23:11:31.000Z",
          "Titre": "Absolute excellent customer service",
          "Contenu": "Absolute excellent customer service. Each time I had an issue, they were there to help. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy Dekker",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T21:50:22.000Z",
          "Titre": "The voice mail wasn't working",
          "Contenu": "The voice mail wasn't working. The service helped and solved the problem immediately."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Monique Idemudia",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T07:13:25.000Z",
          "Titre": "Everything works fine and I never had…",
          "Contenu": "Everything works fine and I never had an issue. Pricing is reasonable too. I can recommend it."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T21:30:36.000Z",
          "Titre": "It does exact what it must do",
          "Contenu": "It does exact what it must do. Except calls and send them through voicemail. Great tools!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Gavin Smith",
          "Nb_Reviews": 2,
          "Date": "2020-02-03T20:46:18.000Z",
          "Titre": "crackly reception",
          "Contenu": "The conversations have been a bit crackly at times but 90% of time it’s been great. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "1268619",
          "Nb_Reviews": 1,
          "Date": "2018-10-19T01:43:33.000Z",
          "Titre": "Simple and easy to use",
          "Contenu": "Simple and easy to use, worldwide toll free number support and excellent supporting services."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kevin Belanger",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T22:31:22.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, some technical issues receiving calls that were quickly addressed."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Yaron Gal",
          "Nb_Reviews": 3,
          "Date": "2018-10-18T00:00:29.000Z",
          "Titre": "Not using it so often",
          "Contenu": "Not using it so often, but get every call at the right time and with email voice record."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Petchie",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T03:16:11.000Z",
          "Titre": "No problems yet",
          "Contenu": "No problems yet, but don't have a lot of calls yet to give a more informed opinion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Atwood",
          "Nb_Reviews": 2,
          "Date": "2020-10-13T06:03:36.000Z",
          "Titre": "4 stars",
          "Contenu": "4 stars. Great service. Switched from another virtual number provider, and happy."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Moutaz Mashhour",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T20:51:18.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service.  Looking forward to expanding your features and offerings."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Linda Albrektsson",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T13:36:39.000Z",
          "Titre": "I am only missing one important…",
          "Contenu": "I am only missing one important feauture - the possibility to receive text messages!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stephen Spencer",
          "Nb_Reviews": 2,
          "Date": "2019-03-11T18:01:35.000Z",
          "Titre": "Very satisfied",
          "Contenu": "The company was very easy to deal with and the service has worked perfectly so far."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Vishakha bose",
          "Nb_Reviews": 1,
          "Date": "2018-09-25T04:11:37.000Z",
          "Titre": "Very nice",
          "Contenu": "Very nice thing..but now they want German I'd proof for German toll free number"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GFF",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T23:18:17.000Z",
          "Titre": "Too many wrong numbers",
          "Contenu": "Since writing the review below, I have been contacted by the company and they are trying to  rectify the problem. I give them credit for their quick response to the review and to their efforts in resolving the situation  now and at the time the problem was first reported. Time is likely going to be a factor in resolving the problem in its entirety but the interim solutions that have been suggested by the company seem to be working. I am still a believer! So, two stars to begin with, four stars now and hopefully five stars in time. Too many wrong numbers. Suggest to me that the toll free numbers are handed out too soon before the last user finished with them. We experienced several calls asking for the same service - i.e. the service provided by an earlier user of the toll free number that we were provided. After contacting the company, they did try to correct it and they offered a small discount for the inconvenience. It was of no consolation as the wrong numbers continued. Eventually we had to limit the area from which the calls were emanating. This significantly reduced the number of wrong calls. I suggest that if you are considering this service, you do not update your documentation or publications with the new toll free number until you are satisfied you have received a number that has been properly vetted. We didn't; it was a costly lesson."
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Jorge Medranda",
          "Nb_Reviews": 2,
          "Date": "2020-06-08T21:51:24.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. It just needs to add conventional receive send text messages"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "carlos lunardini",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T03:43:15.000Z",
          "Titre": "I have had a very positive experience…",
          "Contenu": "I have had a very positive experience with the service as well as customer service."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ana Lupu",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:21:23.000Z",
          "Titre": "⭐️⭐️⭐️⭐️⭐️",
          "Contenu": "⭐️⭐️⭐️⭐️⭐️The best part is that you can cancel the membership subscription at any time and then if you need it again you can register again without having any problems. Thank you tollfreeforwarding.com"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hassan Ahmed",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T22:13:25.000Z",
          "Titre": "Noah the person I dealt with over phone…",
          "Contenu": "Noah the person I dealt with over phone provided outstanding customer service. I found him very helpful and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TradeCmart International",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T15:50:48.000Z",
          "Titre": "Jon Hulett was exceptional and very…",
          "Contenu": "Jon Hulett was exceptional and very knowledgeable. He listened and made sure he understood what I needed then he resolved it immediately, I am very happy with his service output and his approach in solving my issues !!!! Great job Jon...."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "ALAN CLERKIN",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T15:07:30.000Z",
          "Titre": "Excellent company",
          "Contenu": "Excellent company.  I've signed up to Toll Free Forwarding for many years now and they are fantastic to deal with with instant replies to any queries I may have.  Steven Adkins is always on hand to deal with any of our business queries which I am very grateful for and I can only highly recommend him and Toll Free Forwarding."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "SIMON BYKER",
          "Nb_Reviews": 9,
          "Date": "2023-09-19T21:04:07.000Z",
          "Titre": "Praise for Tollfreeforwarding !!",
          "Contenu": "I had a need for an Asian virtual phone number and found Tollfreeforwarding who could supply this.They had a verification process,which involved being  phoned.I spoke to Blade who organised the number with a credit balance quickly and efficiently.The website also had clear instructions for contacting the company for help.A few hours later, I managed to make an arrangement with someone in the Asian country and asked for the subscription and number  to be cancelled.This took very little time,was confirmed by email and all was done effectively.I was impressed by the ease of using the website,by the efficiency and understanding of Blade and would highly recommend Tollfreeforwarding in every way."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Hirst",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T19:19:00.000Z",
          "Titre": "First class service",
          "Contenu": "Without much research (other than Trustpilot reviews) I set up an online account with tollfreeforwarding.com. I tried a test call and received fax dial tones. After struggling with the phone interface I sent them an email asking for help. I received a phone call from Alan within 5 minutes of sending the email. Alan asked me questions relating to my needs and told me they could not supply all the services I required. He even recommended companies that could provide the services I required. Within minutes of hanging up I received an email verifying the account cancelation. Absolutely first class and professional service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Wasley",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T21:08:47.000Z",
          "Titre": "Uncommonly Good Service - Every Time!",
          "Contenu": "Working with Steven Adkins has been a personal pleasure and a professional home run! From helping me find the perfect \"vanity number\" to assisting me with countless changes in configurations, to testing and training, Steven has proven to be an expert that knows his product inside and out. The technical support team is available 24/7 to address my questions in a pinch. Overall, the value delivered to our business is unparalleled! TollFreeForwarding.com is has been a key link in my marketing strategy for many years. I'm delighted to have the opportunity to praise a company I hope will be around as long as I am in business!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Fareed Shahid",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T15:38:08.000Z",
          "Titre": "I would highly rate this organization",
          "Contenu": "I would highly rate this organization. What impressed me the most is the timely response the team has. Operating in a completely different timezone, I was expecting delays, but I was surprised to see the prompt responses within 30 mins of my first email to the company. We were able to close the deal within a day, this is the promptness which businesses should have.Best wishes"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sylvain Tremblay",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:34:08.000Z",
          "Titre": "Awesome service!",
          "Contenu": "I was looking for a service which would forward calls from France to our service desk in Canada.  Used the free trial and tested it with a contact in France, it works!  Also got a toll-free number for USA/Canada (1-888) and got it to forward to the same service desk.  Works great for our small online company which offers customer support from many countries.  After signing up, Steve, our rep from tollfreeforwarding.com, was quick to call me and explain to me the services and plans.  He sent me several email with further information.  So far, I am happy with the service and customer service.  The system is complete with IVR menus, voice mail, scheduled forwarding and more.  Perfect for any size company who offers customer service internationally."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mandy jane Philips",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:25:22.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Osama Alvi",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T14:23:54.000Z",
          "Titre": "Service",
          "Contenu": "I highly recommend this to anyone who is looking for Toll free Number. Alex Witek offered very good customer service as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GT",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T01:33:09.000Z",
          "Titre": "Incredibly Easy Process",
          "Contenu": "I have worked with sales associate Buket Bavas on purchasing a line for marketing purposes. The process was super easy, Mrs Bavas was extremely professional, attentive and responsive. She has made sure the process was smooth and answered every question we've had. I have recommended their services to multiple colleagues afterwards. Thank you for your help, Buket!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jeffrey Charfauros",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T13:41:51.000Z",
          "Titre": "Best price for a toll free number !!",
          "Contenu": "Best price for a toll free number !!!  Works perfectly, gives my 1 man operation credibility 💰"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "ED Becker",
          "Nb_Reviews": 5,
          "Date": "2023-04-30T17:25:38.000Z",
          "Titre": "A senior rep was able to set up my…",
          "Contenu": "A senior rep was able to set up my account just the way I need it (keeping my account open and allowing me to get a number when I need it and cancel it when I don't).I appreciate the service (as well as the connection quality that TFF gives).The only concern has to do with the fact that a senior rep had to step in when a first-level rep was unaware of the possibility at all. The rep should have known that this is something that can be done even if they would need a senior rep to set it up."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Colin Saunders",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T16:25:09.000Z",
          "Titre": "I cannot fault the level of customer…",
          "Contenu": "I cannot fault the level of customer service Blade and the team give. I had another provider but dumped them after a series of automated generic emails and no one took responsibility for my account. With toll-free forwarding you get to speak to a real person and there is no high pressure sales. These guy really do what they say they will do and very quickly. I know as my business expands toll-free will be there for me. As for value for money toll-free are not the cheapest on the market but they are the BEST."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Todd Barry",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T13:37:51.000Z",
          "Titre": "Alex was amazingly helpful",
          "Contenu": "Alex was amazingly helpful. When I needed a professional toll free number for my clients to get a hold of me internationally, he was nothing but great. He walked me through all the options and we found a solution that was right for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asia White",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T07:29:10.000Z",
          "Titre": "It was very easy to set-up and select…",
          "Contenu": "It was very easy to set-up and select your toll free number. It gave you variety of numbers to pick from and the price was very reasonable. I was very happy and satisfied with the experience. I would recommend others about TollFreeForwarding."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tyler Argue",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:20:52.000Z",
          "Titre": "Telephone support",
          "Contenu": "Great customer service. Affordable telephone services for any business."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Reid Smith",
          "Nb_Reviews": 7,
          "Date": "2023-03-09T18:21:02.000Z",
          "Titre": "Had a great experience with…",
          "Contenu": "Had a great experience with TollFreeForwarding. Needed to buy a Canadian phone, i received the calls instantly. Kevin Porter helped clarify any questions I had and checked in on me to see how things were going. I would recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Ann",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T18:08:16.000Z",
          "Titre": "Loved the immediate follow-up phone…",
          "Contenu": "Loved the immediate follow-up phone call and service.  Blade was so professional and listened to my needs.  Didn't try to oversell me. LOVE, LOVE that you  are an American based company!  You should truly promote that on your website!  I was highly stressed when selecting a company  I would end up with an overseas company that I barely understand.  Very excited to find you and have you handle this part of my business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:23:26.000Z",
          "Titre": "The ultimate international toll-free store",
          "Contenu": "We have several international toll-free numbers with tollfreeforwarding and haven't had a single issue obtaining or using them.  Our contact at tollfreeforwarding, Steven Adkins, was pivotal in getting the more \"complicated\" orders processed for our company.  He's been very responsive to any questions we've ever had concerning our numbers with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patsy",
          "Nb_Reviews": 5,
          "Date": "2022-08-18T13:55:44.000Z",
          "Titre": "Professional, prompt, friendly interactions.",
          "Contenu": "Easy to work with. Gave correct information and did exactly what they said they would do. I have never had a phone number ported from another carrier so quickly and correctly. I look forward to working with TollFreeForwarding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. RG",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T18:40:11.000Z",
          "Titre": "very robust and reliable",
          "Contenu": "This virtual phone service is fantastic! At first, I was concerned about their identity verification process since they asked you for your scanned ID and credit card, which could be associated with scam practices; but let's be real, people could use this service for bad practices so now their verification process makes sense. I have not had any issues with the service, very robust and reliable!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charlene Wall",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T19:16:11.000Z",
          "Titre": "SMALL FEE with BIG IMPACT!!!",
          "Contenu": "I can’t thank Blade B….. enough for his expert advice on services that will positively impact my business growth potential. Your patience, professionalism and time are most appreciated. I would recommend any business to take a look at your services!!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Hans Perzl",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T11:40:25.000Z",
          "Titre": "Toll Free is a very professional…",
          "Contenu": "Toll Free is a very professional company.service and support are very fast and competent.Fast reaction is only one of a lot of positive experience which we had with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BradW",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T13:24:27.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, seamless setup after I called customer support. Got a number that forwards to my USA phone for an Australian number with no issues at all. Very happy. Has been doing exactly what I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Hall",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T04:22:12.000Z",
          "Titre": "Toll Free Forwarding was answer to my prayer!",
          "Contenu": "Toll Free Forwarding was an answer to my prayer. I can't recommend Toll Free Forwarding enough.  I had been paying close to 100 dollars a month with my other service, because I got hundreds of spam calls to my 800 number, that company said there was nothing they could do about it.  I stayed with them for 10 plus years thinking there was no other way.  Then I found Toll Free Forwarding, and Stephen was amazing, trustworthy, dependable, and backed up everything he said.  The transition process was seamless and needless to say I'm ecstatic to be paying a nominal 19 bucks a month, and even better I can go into my back office and if I do get a spam call(s), I simply go in and block that number.  I have total control.  Call them, they will treat you right, and give you peace of mind, thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne Tactikos",
          "Nb_Reviews": 6,
          "Date": "2023-02-10T14:21:06.000Z",
          "Titre": "Great support",
          "Contenu": "The reps were very helpful and followed up with my issues. They expressed genuine concern and showed a willingness to help. They let me know they would always be available if I need future assistance"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Burlew",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T15:16:01.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Worked with the rep I used to work with in my former company. Detailed out what was required to obtain the number, reviewed rates and number is functioning as expected."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Natalia",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T20:36:24.000Z",
          "Titre": "I like this option to allow my clients…",
          "Contenu": "I like this option to allow my clients to contact me via a toll free number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T15:01:07.000Z",
          "Titre": "US/UK cell in one phone",
          "Contenu": "This was a great opportunity for my daughter who had an American cell phone with international service to keep the same phone while she’s in the UK studyingShe has both are US and UK number on the same cell phone. I highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mr Hall",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:52:16.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. Very helpful, kind, and professional.  Buket Bavas, Account Manager"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Luis Chamorro",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T05:15:11.000Z",
          "Titre": "I recently got in contact with Suppot…",
          "Contenu": "I recently got in contact with Suppot and it was awesome!I talked to Jon Hulett, his support was 10/10, he was kind and always clear! He Gave me an answer swiftly and was very fast at working on a resolution. Best support ive talked to yet!"
        },
        {
          "Note": 5,
          "Lieu": "KW",
          "Pseudo": "Abu Lulu",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T21:12:22.000Z",
          "Titre": "Customer Service",
          "Contenu": "A few misconceptions happened but their customer support is amazing and did not waste my time.Any issues you have will quickly get solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 3,
          "Date": "2022-01-14T15:40:01.000Z",
          "Titre": "Would like to compliment Jon Hulett for…",
          "Contenu": "Would like to compliment Jon Hulett for his exceptional service.  I had a complicated request and he handled it with ease and expertise.  He was professional and friendly.  Thank you, Jon, for a great job!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Semple",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T20:45:35.000Z",
          "Titre": "Quick Response",
          "Contenu": "We needed a toll free number for Australia.  The company was able to set this up and have it optional within a few hours. The system works great and the number connects seamlessly to our US support team."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "CW",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:08:53.000Z",
          "Titre": "Great personal service."
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T13:30:48.000Z",
          "Titre": "Reliable and easy to operate",
          "Contenu": "The service is reliable and it is very easy to switch between settings no matter if you are on your computer or on your phone."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "KS",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T02:55:02.000Z",
          "Titre": "TollFreeForwarding 5 Star Service",
          "Contenu": "So simple to sign up and the actual service is a breeze to use. Works flawlessly. TollFreeForwarding Customer Service is exceptional and prompt to respond."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Victoria Matrixa Weber Abel",
          "Nb_Reviews": 4,
          "Date": "2023-03-10T16:34:11.000Z",
          "Titre": "Absolutely best customer service I’ve…",
          "Contenu": "Absolutely best customer service I’ve ever recieved, from anywhere! I hope these emplyoees get paid good for their great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha Turnquest",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T20:58:04.000Z",
          "Titre": "Responsive company",
          "Contenu": "I had some issues, but Stephen was very helpful I resolving the matter. It appeared the calls just don't work from the Bahamas, but the number really is for international clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 3,
          "Date": "2022-12-29T18:14:08.000Z",
          "Titre": "The TFF team has been beyond helpful",
          "Contenu": "The TFF team has been beyond helpful, friendly, and accommodating to me as a returning customer! I'm so pleased with their service and am glad I decided to become a client again."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Randall West",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T22:41:50.000Z",
          "Titre": "I was impressed",
          "Contenu": "I was impressed! I searched Google for phone numbers I could forward to clients of my towing website service. I found several companies. TollFreeForwarding stands out.Their products are simple, affordable and efficient. Their on-boarding process is superior and their customer service is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen Velazquez",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T19:13:20.000Z",
          "Titre": "Highly Recommend!",
          "Contenu": "The service is affordable, easy to use, and the customer service is AMAZING! A dedicated account manager was assigned to me on the spot, and the service was active immediately after I creating our company profile."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "BARRINGTON WALKER",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T16:43:27.000Z",
          "Titre": "OUTSTANDING EXPERIENCE",
          "Contenu": "I LIKE AND APPRECIATE THE PRODUCT BEING OFFERED WITH THE SPEED AND EASE OF ACQUISITION OF THE PHONE NUMBER ESC. I ESPECIALLY HAD A GREAT EXPERIENCE WITH ALAN MY REP, HE WAS EXCEPTIONAL!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Sammyil",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T14:49:20.000Z",
          "Titre": "Easy to sign up, set up ... Even cancel!",
          "Contenu": "Michelle made this experience so easy. I needed number short term for a client in London.I was working in one phone call, and John contact me in minutes to set to close. No hoops or red tape, I will use them again soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 3,
          "Date": "2022-03-21T13:53:37.000Z",
          "Titre": "Extraordinary Service",
          "Contenu": "On Friday 3.18 my new provider made a huge mistake.  Blade and his team Lauren, Monica, and Leandro worked with me for over an hour on Friday night to rectify a problem someone else caused.  It was a nail-biter of a situation and Blade stayed with me on the phone and in constant contact with his team. I am very grateful for their help and at the same time, sad that I am having to leave.  The service and support have always been excellent and I will miss this team very much.  To quote Arnold Schwarzenegger, I'll be back!  Thank you and Kudos to Blade, Lauren, Monica, and Leandro."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Viktor Logachev",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T13:52:26.000Z",
          "Titre": "TollFreeForwarding.com is an excelleте!",
          "Contenu": "TollFreeForwarding.com is an excellent choice for companies looking for a convenient and effective way to improve customer service. Their services are available worldwide, flexible, and reliable, making them the most attractive choice for many companies. With virtual phone numbers, you can easily redirect calls to your main phone number, providing customers with quick and easy access to your company. Don't hesitate to contact TollFreeForwarding.com to improve the quality of your customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ishvinder Jeet Singh",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T21:51:42.000Z",
          "Titre": "Helpful and good service",
          "Contenu": "Kai has been very helpful and is always happy to help when I have any questions. Will definitely recommend this service!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Mirza Usman Ali",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T19:16:23.000Z",
          "Titre": "So far the very good experience of…",
          "Contenu": "So far the very good experience of calling voice quality is brilliant and I haven't had any kind of distortion in line yet."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Sekito Seki",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T17:30:52.000Z",
          "Titre": "The values",
          "Contenu": "Excellent services.People in the call Centre are really so amazing.serving people with a great smile.It's really wonderful."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Phil Henderson",
          "Nb_Reviews": 12,
          "Date": "2022-12-08T16:52:14.000Z",
          "Titre": "Great comany to deal with",
          "Contenu": "Great comany to deal with, we use this on an eCom store and it has resulted in sales and more satisfied customers"
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "Nicole Kaminski",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T14:48:19.000Z",
          "Titre": "Excellent service from day 1",
          "Contenu": "Excellent service from day 1! Im getting my calls and setup was instant. The best part?....I haven't had to call customer service for anything."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Louise",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T16:53:08.000Z",
          "Titre": "My experience has been outstanding",
          "Contenu": "My experience has been outstanding, the call quality is excellent and never do the calls fail.I had previously been with a cheaper company and the experience was absolutely terrible so to now have the quality even though it's costing me more is well worth it"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Daniel-Ray Carothers",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T17:33:54.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "Outstanding customer service! Jeremiah Santos is the best. He follows through on his commitments, is very professional and courteous, and makes it a pleasure to partner with Toll-Free Forwarding."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chung Tak Anthony So",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T15:04:56.000Z",
          "Titre": "Good customer and support service",
          "Contenu": "Good customer and support service.  The reach and coverage is good.  I must thank the support team patience is handling and following my request fast and effective."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Asher Syed",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T21:10:33.000Z",
          "Titre": "excellent service",
          "Contenu": "excellent service, compared to other big providers i have found a number matching my preference and have it setup in minutes"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Magdalena",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T12:53:23.000Z",
          "Titre": "Excelent service",
          "Contenu": "My contact was Alan Ibarra. Excelent atention, he gave me a good information about all my question."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Bianca Richardson",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T23:42:25.000Z",
          "Titre": "Helpful & happy to fix a issue",
          "Contenu": "We had trouble getting spam phone calls from Google. Tollfree were really helpful and have sorted it out. I have put my number on hold and will certainly use them again"
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "H nbogi Jeagaer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T15:26:57.000Z",
          "Titre": "Everyone has been very helpful so far."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Mian Khubaib",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T15:22:50.000Z",
          "Titre": "Nice service",
          "Contenu": "Nice service, Specially their employees are so good, very supportive staff, KaiB always there to help me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy Foresman",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T02:36:49.000Z",
          "Titre": "Start to finish, outstanding",
          "Contenu": "The porting process was outlined by the agent, given a timeline, and performed.  The follow up during the process was excellent."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Heather Howdle",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T14:07:54.000Z",
          "Titre": "great service",
          "Contenu": "We had forgotten to sign up after the free trial and our agent was able to search and find that the number we had on all of our promotional material was still available!"
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "Muaweiah",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T19:26:12.000Z",
          "Titre": "very good service specially if you are…",
          "Contenu": "very good service specially if you are out of your country."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Jale Medlin",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T17:50:34.000Z",
          "Titre": "Great service",
          "Contenu": "It was ver easy to get local phone number and very satisfied with the service. Great overall quality."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Massimo",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T11:19:14.000Z",
          "Titre": "Excellent service!",
          "Contenu": "Excellent service and the staff is always courteous and available to solve any problems. I highly recommend it to anyone who needs a global telephone forwarding service."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jack George",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T21:02:23.000Z",
          "Titre": "I am so happy I found Toll-Free…",
          "Contenu": "I am so happy I found Toll-Free Forwarding. It solved the problem I had in one easy step and it has worked flawlessly ever since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana M. Neal",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T23:23:50.000Z",
          "Titre": "Absolutely fantastic service!!",
          "Contenu": "Absolutely fantastic service!!! Highly recommend!!! Would give it TEN STARS if I could!!!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "rana numan shafqat",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:08:33.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Britt",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T16:31:37.000Z",
          "Titre": "TollFreeForwarding is simply the best",
          "Contenu": "TollFreeForwarding is simply the best. No drop calls no matter where I am! I love it! I’m glad I chose TollFreeForwarding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juliet Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T16:50:27.000Z",
          "Titre": "This call forwarding is amazing",
          "Contenu": "This call forwarding is amazing. I just start using it but my calls came straight to my mobile. I am happy with this service."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Ivan Ibarra del Cueto",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T22:05:24.000Z",
          "Titre": "I am very happy with the service",
          "Contenu": "I am very happy with the service. Customer service is very supportive. The rates are pretty fair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurel",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T01:57:31.000Z",
          "Titre": "Very straightforward",
          "Contenu": "Very straightforward, simple, and affordable solution to having an overseas number.  Thank you for making this service available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "muhammad muddasir",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:18:37.000Z",
          "Titre": "good services"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lauren Carson",
          "Nb_Reviews": 3,
          "Date": "2022-07-21T13:18:32.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, staff are always very helpful and quick to respond. Would definitely recommend!!! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Moffet",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T19:56:16.000Z",
          "Titre": "Love!",
          "Contenu": "So easy to use, incredible prices that help keep small businesses in operation, and great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Jens",
          "Nb_Reviews": 3,
          "Date": "2022-09-21T18:50:23.000Z",
          "Titre": "This service works perfectly for me",
          "Contenu": "This service works perfectly for me. Isn't used ever day, but when it's used, 👍👍👍I recommend 💯"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Cioppa",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T14:52:37.000Z",
          "Titre": "Excellent Experience",
          "Contenu": "Excellent service, even for a small customer like me. My account rep has been responsive and the toll-free service excellent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T13:21:45.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service, very helpful and explained everything I needed to know. I would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Cristóbal",
          "Nb_Reviews": 5,
          "Date": "2023-01-10T00:37:28.000Z",
          "Titre": "Very straight forward service",
          "Contenu": "Very straight forward service. I highly recommend it. Steven was incredibly helpful!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Flavio Cavalcanti",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T22:22:43.000Z",
          "Titre": "awesome support",
          "Contenu": "awesome support! every time I have a question, I always have it resolved!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Monjazeb",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T01:45:33.000Z",
          "Titre": "Alan Ibarra has been great…",
          "Contenu": "Alan Ibarra has been great to work with. Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T17:01:07.000Z",
          "Titre": "solid service",
          "Contenu": "solid service. could be a bit cheaper but works great no hassles no complaints"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Klassen",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T00:09:39.000Z",
          "Titre": "It was simple to setup an extra number…",
          "Contenu": "It was simple to setup an extra number for my business."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Becky",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T06:19:19.000Z",
          "Titre": "Responds to Customer Needs",
          "Contenu": "The person with whom I spoke was most helpful and knew the right package for my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LIsa Ovitt",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T16:43:00.000Z",
          "Titre": "Jeremiah Santos was invaluable in…",
          "Contenu": "Jeremiah Santos was invaluable in assisting me in porting over our toll free number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esteban Leguizamo",
          "Nb_Reviews": 3,
          "Date": "2022-09-09T16:13:09.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, the atenttion is very good and fast and I never had any issue with the service"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Luis Jara",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T22:55:19.000Z",
          "Titre": "great response",
          "Contenu": "great response time. excelent team. very concerned with the customers."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "bruce leytham",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T13:35:31.000Z",
          "Titre": "New customer So far I have used your service 2 time…",
          "Contenu": "So far I have used your service 2 time but I will say was very nice no problems."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Noman Khan",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T13:54:17.000Z",
          "Titre": "Yes this company doing well I really…",
          "Contenu": "Yes this company doing well I really appreciate toll free forwarding thanks 🙏👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gwendolyn Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T18:56:20.000Z",
          "Titre": "I just love the fact that my company…",
          "Contenu": "I just love the fact that my company was able to match the toll free number with the letters of the company!! Just EPIC!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bee",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T23:03:10.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I have never received such excellent customer service. Michael A. was extremely efficient and friendly when assisting in the process."
        },
        {
          "Note": 5,
          "Lieu": "AZ",
          "Pseudo": "Ramin Gunyashev",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:13:39.000Z",
          "Titre": "This is a great service",
          "Contenu": "This is a great service! Would recomend, customer service is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Esteban Leguizamo",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T17:35:36.000Z",
          "Titre": "The client services is fast",
          "Contenu": "The client services is fast, efficient and the numbers never had issues with them"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mitchell Yaffy",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T14:12:10.000Z",
          "Titre": "Works great",
          "Contenu": "Works great good way to start a business with a phone number"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Motti Liter",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T13:08:50.000Z",
          "Titre": "Toolfreeforwarding service",
          "Contenu": "It's a great calling line provider with excallant support and an easy interface for management"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Chieh Wang",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:36:22.000Z",
          "Titre": "Speedy",
          "Contenu": "Speedy, professional customer service."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "AndreiC",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T13:36:08.000Z",
          "Titre": "works",
          "Contenu": "works! 📞I use it to have Australian number while in Europe"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T23:06:27.000Z",
          "Titre": "Nice and simple and affordable",
          "Contenu": "Nice and simple and affordable. Good backend for call history and voicemail"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanye Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:31:37.000Z",
          "Titre": "Satisfied client",
          "Contenu": "I love this company. I have tried several and this one by far is amazing."
        }
      ]
    }
  ]
}