{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tonerprice.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Sasser",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:01:47.000Z",
          "Titre": "Received wrong cartridge",
          "Contenu": "I was careful to order the correct toner cartridge for my Canon model.  I received the wrong toner cartridge and now must go through the hassle of returning and re-ordering."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GG",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T22:43:18.000Z",
          "Titre": "Poor ordering and Poor delivery",
          "Contenu": "Poor ordering and Poor delivery- order was confirmed. After 10 calendar days no further confirm of when it would ship.- company says orders can ship as soon as same day ordered.  Delivery takes 7 more days.  Too long for an etail company.  - after 8 business days had to call to find out shipping status."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Thal",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:01:02.000Z",
          "Titre": "Very confusing to order the right toner…",
          "Contenu": "Very confusing to order the right toner from their site. It turns out the toner I ordered was the wrong compatibility with my printer. Because the box was opened, they wouldn't exchange."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KCinFL",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T23:46:43.000Z",
          "Titre": "Ordered toner BECAUSE website showed it…",
          "Contenu": "Ordered toner BECAUSE website showed it was in stock. Placed order to get email 2 days afterwards that they expect to get some 3 weeks after the day I placed order and did I want to cancel order...I was told that the NY warehouse was supposed to have it but they couldn't find any when they went to look for it.Now have idle machine as I have to source elsewhere and wait longer for delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina Chyn",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T19:16:24.000Z",
          "Titre": "Beware!! Less than half  the tube inside. You buy air with your ink cartridges.",
          "Contenu": "I've searched all over your site to find the total number of pages this toner cartridges can print, but  I couldn't find it. When I look at the ink container,  it looks the same . Now I open it,  it contains less than half  the tube in them. This is SO.... DECEIVING. Now I see why you didn't include that information. I am very disappoint in you site. NO MORE business with you.........................................................I understand the manufacturer can't fill the whole tube. But it shouldn't be that low. You still can't answer me the number of pages this toner cartridge can print. Can you answer this simple question in your next reply?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lea K.",
          "Nb_Reviews": 4,
          "Date": "2022-03-10T03:07:12.000Z",
          "Titre": "BEYOND DISSAPOINTED!",
          "Contenu": "Just an update on my previous poor review... I had ordered multiple ink cartridges from their website and checked out with my credit card. Few days late  While waiting for a notice for a shipment,I had an email saying they are all discontinued and my order is cancelled. That was then but today there is a charge on my card for the full amount and I have to call them tomorrow!!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dupe OLAWOYIN",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T17:32:15.000Z",
          "Titre": "Ordered for High yield konica toner TN…",
          "Contenu": "Ordered for High yield konica toner TN 616C and TN 616Y as listed on the site but Low yield  TN 616C-L and TN 616Y-L delivered. Waste of precious time and very disappointingREMARK: Always ensure that what is paid for is delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Nees",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T21:10:27.000Z",
          "Titre": "Inadvertently ordered two of the wrong…",
          "Contenu": "Inadvertently ordered two of the wrong toner cartridges.  Per the return policy, I emailed Tonerprice to let them know that I had opened one of the packages and that I only learned of my mistake when the cartridge wouldn't fit in my printer.  The response I received from the company was that they would only accept the unopened package back for return and that I was stuck with the opened package because I had \"cut the seal\" on the box.  First, there was no seal on the box - you think they'd know their own product.  And second, the cartridge remains brand new and only needs to have the inner plastic resealed.  Given the nature of a service business like Tonerprice, you think they'd take the risk of accepting back the cartridge I opened in order to maintain me as a customer.  Well, I'm not going to return the cartridges, I'll try to sell them on ebay.  While they kept the proceeds of these 2 cartridge sales, they lost my business forever.  I think they're out more than the roughly $40 the two cartridges cost in lost sales.  Great job, guys - way to cut customer service in the name of really-short-term cost savings.  It will be great never doing business with you again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Moe a",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T06:39:58.000Z",
          "Titre": "bad shipping  i did not recieve my…",
          "Contenu": "bad shipping  i did not recieve my order untill nowthey are taking forever  may i got my money back since i did not recieve nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 4,
          "Date": "2023-01-28T09:21:23.000Z",
          "Titre": "I was told you cartridges would fit",
          "Contenu": "I was told you cartridges would fit. You wasted my time and now you don't want to give my money back after I sent you products back. Your company has poor, poor customer service. The price was fine if they could send the right products. Them they write there on review to cover up there bad service. Now I don't trust this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Miller",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T15:29:49.000Z",
          "Titre": "cartridge leaked when removed from box",
          "Contenu": "cartridge leaked when removed from box.  Prints that came out were all gray and unusable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shara",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T15:31:14.000Z",
          "Titre": "Never received the product",
          "Contenu": "Never received the product.  After ordering, sent an email saying no longer available"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ellen Bohn",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T00:16:33.000Z",
          "Titre": "Product Not Delivered",
          "Contenu": "Cannot give any feed back if we have not received any product! Still waiting for a delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Hebert",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T20:34:27.000Z",
          "Titre": "No delivery",
          "Contenu": "Ordered toner on 11/10-It's 11/17- no deliveryPoor service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lea K.",
          "Nb_Reviews": 4,
          "Date": "2022-02-28T16:56:54.000Z",
          "Titre": "Dissappointed!",
          "Contenu": "Unfortunately my review is not positive because of ordering multiple items from their website which showed all in stock. I went through the whole process ordering.  provided my personel information and credit card, only to be notified days later that all items are discontinued at HP and therefore Tonerprice cancelles my order! I am dissappointed bu the way they operate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PCRO",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T14:30:58.000Z",
          "Titre": "Unacceptably Slow",
          "Contenu": "I placed my order on 1/19 and paid almost $100 for 3 day shipping on an item that was marked as in stock.  It's now 1/27 and my order hasn't even shipped yet and my order is marked as On Hold.  Not only that but there's not even a customer service email that I can send anything to, only a phone number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy Ackles",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T12:55:29.000Z",
          "Titre": "I still have not received my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2022-02-15T19:52:44.000Z",
          "Titre": "You said you had my toner",
          "Contenu": "You said you had my toner, I placed my order, gave you all my confidential credit card information, THEN You tell me you don't have my toner.....waste my time and get my credit card info.  NOT A GOOD EXPERIENCE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2017-08-17T00:08:18.000Z",
          "Titre": "Unacceptable return policy",
          "Contenu": "Somehow on their website while searching for a drum for my printer I found an inexpensive one. I ordered it and it was the wrong one for my printer. Maria in their customer service informed me that they would not take it back and issue me a full refund. They would only refund 50%. That's about what it would cost to send it back. Unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Davis Clip-per",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T01:12:45.000Z",
          "Titre": "Still have not received order",
          "Contenu": "Still have not received order.  When I ordered the  person said would have received by Tuesday. It is now scheduled tomorrow, maybe.The order I had ordered didn't last even 500 copies. The other colors are still going but had to replace this one.  Needless to say, I am not happy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valerie Watson",
          "Nb_Reviews": 3,
          "Date": "2018-03-30T14:24:59.000Z",
          "Titre": "WARNING",
          "Contenu": "WARNING.  I contacted Ricoh for help and this is what they replied:  \"Toner Price is not  an authorized Ricoh vendor, it is very possible that they purchase toners and resell them but they are not in anyway connected to Ricoh....in most cases these supplies are not genuine Ricoh supplies.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "peter r",
          "Nb_Reviews": 1,
          "Date": "2016-02-14T02:20:29.000Z",
          "Titre": "got sent wrong ink cartridge",
          "Contenu": "I ordered  selphycp 780 ink n was sent an ink cartridge but obviously for something else because my printer tells me it's the wrong size yet fits perfectly and I'm very disappointed with my order cause I'm out $40"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack Sparks",
          "Nb_Reviews": 3,
          "Date": "2020-10-04T02:14:01.000Z",
          "Titre": "Generic Ink screws up printers",
          "Contenu": "For the first time, I tried generic ink for my printer.  Now all pictures are shaded purple, and I have to buy all new ink to fix it.  I hope no more damage was done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2017-01-10T08:56:11.000Z",
          "Titre": "Bad Toner",
          "Contenu": "The toner I bought does not work. In fact, it makes my printer jam when it prints. :( Maybe it was just a bad one and not all are like that but, can I get a refund?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-02T02:26:00.000Z",
          "Titre": "The toner you sell is not OEM and clogs…",
          "Contenu": "The toner you sell is not OEM and clogs up the copier. Now I have to pay someone to fix it. I want a refund on my toner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rick",
          "Nb_Reviews": 1,
          "Date": "2020-06-24T13:59:11.000Z",
          "Titre": "wrong supplier id'd…",
          "Contenu": "wrong supplier identified...410A generated an error message and would not allow the hp M452DW to print ...period..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customertskis",
          "Nb_Reviews": 1,
          "Date": "2017-10-18T04:22:49.000Z",
          "Titre": "They do not accept returns because “we …",
          "Contenu": "They do not accept returns because “we opened the box”We will never again order anything from tonerprice.Beware...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Voegeli",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T22:12:48.000Z",
          "Titre": "Received today after waiting for over a…",
          "Contenu": "Received today after waiting for over a week and toner doesn't work in my machine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Guy Griffiths",
          "Nb_Reviews": 1,
          "Date": "2016-01-14T18:31:38.113Z",
          "Titre": "Shipped the wrong toner. Charged 15% restocking fee. Poor customer service.  Would not recommend.",
          "Contenu": "Shipped the wrong toner. Charged 15% restocking fee. Poor customer service.\r Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-05T01:15:37.000Z",
          "Titre": "Incomplete Order",
          "Contenu": "Incomplete Order! I ordered two Samsung CLPT660B OEM Transfer Belts, but only received one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2018-08-04T17:59:02.000Z",
          "Titre": "My order was defective and the company…",
          "Contenu": "My order was defective and the company has ignored my emails regarding an exchange/refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle A. Calloway",
          "Nb_Reviews": 1,
          "Date": "2016-02-25T17:45:55.000Z",
          "Titre": "Didn't receive what I ordered",
          "Contenu": "My credit card was billed, but I never received my ink !!!!  Not very happy at all !!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T01:51:02.000Z",
          "Titre": "Ordered over a week ago",
          "Contenu": "Ordered over a week ago. Still has not shipped."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Avi Perets",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T10:29:33.000Z",
          "Titre": "THe prooduct you endt me not well per…",
          "Contenu": "THe prooduct you endt me not well per new product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trish Chandler",
          "Nb_Reviews": 2,
          "Date": "2016-09-20T20:41:21.000Z",
          "Titre": "TERRIBLE",
          "Contenu": "The ink does not work and slung blue ink all over my machine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ozzy",
          "Nb_Reviews": 1,
          "Date": "2016-09-02T19:34:11.000Z",
          "Titre": "Still waiting for order !!!",
          "Contenu": "Still waiting for order to arrive. It's been 10 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer Marilyn Cones",
          "Nb_Reviews": 2,
          "Date": "2015-12-15T22:04:14.978Z",
          "Titre": "Toner",
          "Contenu": "Have not received the toner I ordered.\r Marilyn Cones"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SKK",
          "Nb_Reviews": 1,
          "Date": "2018-03-30T01:15:52.000Z",
          "Titre": "My Ricoh printer broke and I had to buy…",
          "Contenu": "My Ricoh printer broke and I had to buy a new model, so I checked the Returns Page for tonerprice.com, followed all the requirements, and returned the Color PCU's I had purchased for $464.95. I returned an unopened product. In the product box. Within the timeframe. WITH a return authorization code. Now they are trying to tell me that because I did not have the FACTORY box (what the heck is that?) the best they can do is hold it for a very long time on consignment to try to resell for half price, and then give me half of that.  Which of course means 25% of what I paid. They even sent me a picture of what they received which SHOWS the product box! They later tried to tell me they didn't have the product box. They told me it was clear to them the product was unopened. They later tried to tell me it was \"damaged.\" So now they have lied twice about what they received, and the condition it was in, and the last I heard from \"Jody\" was that he or she had to leave for the day at 3 p.m. PST. Great. Will have to dispute with the credit card company. (When I first received the product, I wrote on the outside of the box what it was, i.e. \"color pcu for Ricoh....\" before I stored it in my closet. Now they are saying that \"damages\" the product.  Wow.) On another note, I had a full set+ of toner that I bought from Ink Technologies that was worth almost $300 that I returned to them. NOT. ONE. PROBLEM. They didn't even ding me for a \"restocking fee!\"  On to the next review for Ink Technologies (that will be 5 star!). Wow.  Just read their reply and they could not be more wrong in their description. Just another example of how deceitful and greedy they are.  I tried to put as much extra packaging around the unopened color PCU units as possible so they would not get damaged in shipping; those are the white bags he is referring to and the additional cardboard Box that I placed them in for protection.  The actual item is sealed shut, un opened, fully functional as well as brand new.  I guess if I was the only person to give them a one star review there might be some question as to the legitimacy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2016-11-05T18:18:29.000Z",
          "Titre": "Never received tje toner",
          "Contenu": "Where is rhe toner"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Stanton",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T21:56:10.000Z",
          "Titre": "I wish Tonerprice would have told me…",
          "Contenu": "I wish Tonerprice would have told me that the discount which was advertised as 12% wasn't available for HP toner. I had to call them & then they offered me a 6% discount. Other than that it shipped fast.Ok sorry, I see you did have a note that OEM HP was excluded from the discount. I would suggest putting it under the OEM discount on the right. Since it's under the compatible discount, it seems to be pertaining to the compatible discount."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lan Wong",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T17:55:04.000Z",
          "Titre": "11 days later",
          "Contenu": "11 days later, I’m still waiting on my toner. It took a full week after I placed the online order, for them to creating a shipping label, and it looks like another week to ship. So basically, about 1/2 a month from ordering to receipt. This sort of turn around for a toner is very slow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Schwalbach",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T22:12:14.000Z",
          "Titre": "Shipped product to billing address…",
          "Contenu": "Shipped product to billing address instead of shipping address.  Cost me double shipping and my time to correct their mistake.  Might have been their vendors fault but it was inconvenient and frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike O'Lear",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T21:49:03.279Z",
          "Titre": "Four of the boxes for the ink toner…",
          "Contenu": "Four of the boxes for the ink toner arrived looking new.  The one with the CYAN/C504S is in a very damaged package.  The outside box and packaging was is excellent shape, so to me that means that the box of toner was put in with the other toners with the shipper knowledge of it's damage..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Sanders",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T22:01:45.000Z",
          "Titre": "Ordered toner cartridges for a Ricoh…",
          "Contenu": "Ordered toner cartridges for a Ricoh Aficio MP C305spf.  What they sent was a generic brand and it broke my copier.   I know have to pay over $500 for a new one.  I wish the description was more in depth and explained this issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TIM NOONE",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T18:56:25.000Z",
          "Titre": "Sales",
          "Contenu": "Just let me know when a sales is coming up. I had to ask for 7% and could have been told to wait a week for 15% and FREE shipping.. I asked when next sale was coming and was told they didn't know.  Thanksgiving sale went online like 2 days later. I lost 8% and FREE shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 2,
          "Date": "2022-09-19T19:42:35.000Z",
          "Titre": "We ordered black ink - got yellow ink",
          "Contenu": "We ordered black ink. We received yellow ink. I asked the question why only to be told I got what I ordered which is incorrect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancie W",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T20:18:22.000Z",
          "Titre": "I ordered 5 total toner cartridges but…",
          "Contenu": "I ordered 5 total toner cartridges but only received 2.  There luckily was a packslip and it showed the other 3 as backordered BUT no one notified me of the backorders.  It would have been nice to know because one of them was needed YESTERDAY.  You made sure to take my money - now get my cartridges to me.  Not sure if I'll be back or not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Respectable Business Owner",
          "Nb_Reviews": 8,
          "Date": "2021-09-12T16:41:46.000Z",
          "Titre": "We did not get the return labels for…",
          "Contenu": "We did not get the return labels for the toner cartridges and therefore the $12.00 we saved by ordering from them now cost more as we have to chase down labels ourselves. Will go back to our other vendor from now on. Time is money and not getting what you paid for is an issue!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2017-07-03T18:46:40.000Z",
          "Titre": "The toner cartridges I ordered took …",
          "Contenu": "The toner cartridges I ordered took nearly a week to get to my office and there was no communication from Tonerprice telling me what the status was of the order, nor was there any acknowledgement from Tonerprice even telling me that they had received the order.  I had to call to determine whether the order had been received and what the status of the shipment was."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Music Librarian",
          "Nb_Reviews": 1,
          "Date": "2016-01-06T08:52:30.635Z",
          "Titre": "Misleading delivery date",
          "Contenu": "On Tuesday, Dec 29, at 5PM EST, I ordered 2 toners to be delivered via Federal Express and paid for 2 day delivery.  Today, Tuesday, Jan 5, UPS delivered the toners some time after 5PM.  I paid for 2 day delivery, not 7.  Agreed that there was a holiday during that week, but it was only Friday, not Wednesday, Thursday and Friday.  Your definition of 2 working days is certainly not mine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peggy",
          "Nb_Reviews": 1,
          "Date": "2015-04-20T17:08:57.000Z",
          "Titre": "Not ok",
          "Contenu": "The first order I received was great.  The 2nd order the toners were leaking in the box,  I returned them and they were replaced with new ones.    These new ones were not leaking in the box but after putting them in the machine they started to leak.  We were worried they would ruin the drum of the printer so we removed them all and returned to you.  We will not be ordering them again.\rYour customer service was great but the product not so much"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nadezda Surac",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T18:27:32.000Z",
          "Titre": "watch their sale items",
          "Contenu": "watch their sale items. Last year I ordered things and it come with dram$140. This year identical item on sale for $39 but it come without drums. So I did have to order drams for $126. So where is 70% sawing? How smart."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jackeline",
          "Nb_Reviews": 1,
          "Date": "2017-11-05T15:41:04.000Z",
          "Titre": "It is good for B&W products Color Items very poor quality.",
          "Contenu": "Customer Serv. It is good. but only 40% of the product work correctly. The time of changing and reordering it is a tiring experience. One is better of to head to local store and buy item there after 3 tries that is what I did.!!! human experience great. Quality of products poor"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Printing on the Mountain.",
          "Nb_Reviews": 1,
          "Date": "2016-04-08T20:06:23.000Z",
          "Titre": "Where do I send the bill/package again?",
          "Contenu": "Live in the mountains, work in the city.  Billing address is unreachable yet thats where they sent the delivery despite having the invoice filled out correctly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-03-19T16:55:58.000Z",
          "Titre": "eventual price",
          "Contenu": "had a quote; then offered first-time discount; new quote was virtually identical since the new shipping rate had increased by what the discount had reduced"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert F",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T09:40:24.000Z",
          "Titre": "Received the wrong item lost a job…",
          "Contenu": "Received the wrong item lost a job whilst waiting for the correct item to arrive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 5,
          "Date": "2018-10-01T16:59:27.000Z",
          "Titre": "Shipping is very slow",
          "Contenu": "Shipping is very slow. Haven't received the item. Maybe Wednesday. 3 days would be fine but 5?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John C",
          "Nb_Reviews": 1,
          "Date": "2015-12-22T17:56:32.207Z",
          "Titre": "Sent to old address",
          "Contenu": "The box was sent to an old address even though the shiping address was correct."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T21:36:44.000Z",
          "Titre": "My items were delivered to the wrong…",
          "Contenu": "My items were delivered to the wrong address"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-04T03:25:34.000Z",
          "Titre": "Took 5 days to ship even though the…",
          "Contenu": "Took 5 days to ship even though the item was in stock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FRED ROGERS",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T13:45:54.000Z",
          "Titre": "still unresolved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nuno Miranda",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:25:40.000Z",
          "Titre": "Toner was ordered about a week ago and…",
          "Contenu": "Toner was ordered about a week ago and it has not shipped or been received at our plant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T23:38:30.000Z",
          "Titre": "Good Quality but delayed",
          "Contenu": "Ordered from provider in part based upon delivery promise. Toners were reportedly in stock and ‘would be delivered in 48 hours upon ordering’ however it turns out it was not locally in stock and it actually took a 7 business days. Customer service was very apologetic and thorough. Upon receipt, products appear to be the correct HP products ordered and are working well! Had the came as promised, would have given 5 star rating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Indiana, PA Nonprofit",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T00:22:29.000Z",
          "Titre": "Good price, doesn't work with Brother printer.",
          "Contenu": "The price was good and the cartridge fit into my Brother printer, but every single page I printed had a dark gray background. I tried to print many test pages, hoping it was just because the product was new, but nope. I had to reorder Brother brand toner from Office Depot and these are going back to Tonerprice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Palumbo",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T01:53:54.000Z",
          "Titre": "The toner box was sent by itself and…",
          "Contenu": "The toner box was sent by itself and the box came through FEDEX in not good shape.   This should have been put in another box for shipping to protect it.   Further it was delivered earlier than expected by tracking and stayed outside for a day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Corrin Trowbridge",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:55:50.000Z",
          "Titre": "whish the prices were lower"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PJ GODINEZ",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:43:00.000Z",
          "Titre": "Ink took longer to arrive then…",
          "Contenu": "Ink took longer to arrive then expected, I ordered on a Wednesday, Amazon was going to arrive with same ink Friday (same CANON OEM brand) I recieved ink following week Late Tuesday."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Eddy",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T01:41:22.000Z",
          "Titre": "Good prices, quick shipping, but defective products",
          "Contenu": "Tonerprice has good prices and ships quickly. The problem is that when I order 5 refilled cartridges, at least 1 (if not 2 of the 5) do not work. For one the printer said that the cartridge was \"for an older printer.\" Since the price is about 1/2 HP prices, you are still saving money when 2/5 do not work, but it is a hassle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Mills",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T20:29:31.000Z",
          "Titre": "Return Slip Up",
          "Contenu": "I ordered something, it was not what I expected. I called and spoke to a nice woman & she said that they would send me an email with the return slip so I could send it back. I have yet to receive it and it's been over 2 weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T21:38:23.000Z",
          "Titre": "Product is always good",
          "Contenu": "Product is always good. Disappointed that prices have gone up so much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T21:47:45.000Z",
          "Titre": "I am still waiting on my full order to be delivered",
          "Contenu": "I am still waiting on my full order to be delivered.  3 of the 4 toner cartridges were delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Betty Turner",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T20:09:03.000Z",
          "Titre": "We received our ink cartridges in an…",
          "Contenu": "We received our ink cartridges in an efficient manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Myrna Angle",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T15:33:37.000Z",
          "Titre": "I requested and paid for shipment to be…",
          "Contenu": "I requested and paid for shipment to be delivered within 3 business days when I placed my order on Dec 27th. I did not receive the package until Jan 3, 2022. I don't understand why the shipping cost is more than the product cost itself. In any case, I should get a refund of at least some of the shipping cost because the 3-day time frame was not met. We'll see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ricardo Ramirez",
          "Nb_Reviews": 2,
          "Date": "2022-05-07T21:14:37.000Z",
          "Titre": "It took over a week for delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex S.",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T02:02:18.000Z",
          "Titre": "I was rather surprised when I was told…",
          "Contenu": "I was rather surprised when I was told that I had to pay for the shipping charges of the toner that was either ordered accidently or shipped incorrectly. As a consumer of many online products, I don't recall the last time I had to pay for the freight of the product that were being returned. Not a very good return policy in my eyes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Miller",
          "Nb_Reviews": 1,
          "Date": "2021-07-25T00:45:16.000Z",
          "Titre": "Ordered genuine toner set to replace…",
          "Contenu": "Ordered genuine toner set to replace recently purchased, from y’all, generic toner (which could not be sensed / found by the printer). 2nd toner purchased more expensive, but works fine, so far. Still missing one of four toner cartridges in set ordered. No indication of where missing cartridge is located or if I will receive what I paid for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Office User",
          "Nb_Reviews": 2,
          "Date": "2021-04-05T16:06:54.000Z",
          "Titre": "Replacement toners works well until it…",
          "Contenu": "Replacement toners works well until it hits about 30% capacity remaining.  After that point you get blotchy ink spots and color striping along the edges of pages. In speaking with Tonerprice that indicated that this is normal for their replacement toner cartridges.  So, do not expect to get the full use out of the extra capacity cartridges. ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Crystal Rialti",
          "Nb_Reviews": 7,
          "Date": "2021-07-18T21:48:46.000Z",
          "Titre": "I ordered B/C/M/Y HP toner cartridges but . . .",
          "Contenu": "I ordered B/C/M/Y HP toner cartridges. All but the magenta arrived timely. However, the magenta has yet to arrive. I tried to call but it was after 5p on Friday. So, I emailed asking when I can expect to receive the remaining cartridge. I have not yet heard back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Anderson",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T17:27:32.000Z",
          "Titre": "I ordered the wrong toner",
          "Contenu": "I ordered the wrong toner.  I called during normal business hours on Thursday afternoon (10/14).  I got their voice mail, I left a message but have not heard back. It's Monday 10/18 now.  I am very unhappy with their lack of customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-02-13T13:49:06.689Z",
          "Titre": "Shipping",
          "Contenu": "I'm always careful when entering my address because mail does not come to my home but rather a PO box. Your site listed shipping as UPS but my package came USPS and when it arrived I got a tracking message that said it was undeliverable and was being returned. I had to call the post office and ask them to keep an eye out for it and flag it to be put in my box. 8 days since I ordered and still waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allan Stern",
          "Nb_Reviews": 2,
          "Date": "2016-04-18T17:33:29.000Z",
          "Titre": "The part I received was not like new.",
          "Contenu": "I ordered a PCU for my Ricoh laser printer and when it arrived the 3 cover caps on the end of the unit had fallen off and the the bottom plastic cover was covered with different colored ink.  It definitely did not look like a new unit and I have no idea how degraded it may be.  For now it works but for how long, who knows?\r Al Stern\rBluffton, SC"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nitelite",
          "Nb_Reviews": 2,
          "Date": "2016-04-08T15:09:44.000Z",
          "Titre": "Poor web site return procedures. You have to call.",
          "Contenu": "First cartridge sent was defective, received a replacement quickly, but had to call, and although they said they would send a RA and shipping label for returning the defective cartridge still haven't gotten it yet. The point being I may be charged for the second cartridge if not returned - according to their 'fine print'."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Virginia K.",
          "Nb_Reviews": 1,
          "Date": "2015-04-20T17:58:58.000Z",
          "Titre": "Not as much ink as you would expect",
          "Contenu": "I thought the pricing was really good, but I guess I forgot to compare the actual quantity of the contents.\rBefore you knew it I was running out of ink and had to use another cartridge.\rIt would be a good idea to advertise how much is being provided compared to the original HP brand if you are going to compare prices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EDWIN LEVISTE",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T18:29:33.000Z",
          "Titre": "I called in the morning someone told me…",
          "Contenu": "I called in the morning someone told me a same day shipping 'coz it's in LA area The next day I ordered it, sounded like a day but not sure but I received it a lil late. Time was very sensitive then,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LESLIE BEACH",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T18:54:56.000Z",
          "Titre": "I couldn’t believe that a $100 toner…",
          "Contenu": "I couldn’t believe that a $100 toner cartridge was shipped with nothing more than a shipping label on it then left on our porch for all the world to see! Expensive items should at a minimum be concealed!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2016-02-21T17:11:08.082Z",
          "Titre": "Toner price",
          "Contenu": "The item I have ordered has still not arrived, so delivery has not been received.   This seems a bit slow even for economy shipping.    I have been satisfied in the past, however, for this order shipping is a concern."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Hoffmeister",
          "Nb_Reviews": 1,
          "Date": "2015-12-23T18:27:41.000Z",
          "Titre": "I was happy with the price and quality of the toner, however.....",
          "Contenu": "The toner was OEM and I have had great results with it, however the shipping charges were very high and with that factored in, I will not be reordering as other suppliers have a much more reasonable shipping charge"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer Eric",
          "Nb_Reviews": 1,
          "Date": "2016-01-12T17:25:18.325Z",
          "Titre": "Timely delivery",
          "Contenu": "While the toner order was quick and correct, two of the colors were spilling toner out. 1 was not and I have not opened the other. Not sure if that is supposed to happen with compatibles??"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "G  LAKE",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T20:37:18.000Z",
          "Titre": "Usually we receive shipment within 2 to…",
          "Contenu": "Usually we receive shipment within 2 to 3 days. This most recent shipment it has come in bits and pieces over 7 days and we still don't have the complete shipment"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "goober",
          "Nb_Reviews": 1,
          "Date": "2016-03-14T03:01:02.000Z",
          "Titre": "Just ok experience",
          "Contenu": "The ink cartridges were listed as in stock, instead the two black are on backorder. The ones I needed the most, of course. I got the color cartridge which is just a backup. Yay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2015-04-21T00:42:47.000Z",
          "Titre": "Ever since ordering thru tonerprice.com I have received tons of spam mail!",
          "Contenu": "Ever since ordering thru tonerprice.com I have received tons of spam mail that I am not interested in receiving.  Would not order thru them again for this reason."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maryjane Boren",
          "Nb_Reviews": 2,
          "Date": "2018-09-04T13:33:40.000Z",
          "Titre": "Order fill issues",
          "Contenu": "Order fill issuesSent wrong order, went through the whole return process and now have been shipped two replacement orders when I only needed one. :-/"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Prow",
          "Nb_Reviews": 3,
          "Date": "2018-03-02T22:02:57.000Z",
          "Titre": "My order was rerouted to California",
          "Contenu": "My order was rerouted to California.  Had to call the company and they sent another toner cartridge to me with two-day delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Quinn",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T21:19:37.000Z",
          "Titre": "Items advertised as in stock took a…",
          "Contenu": "Items advertised as in stock took a long time to arrive, so I guess they weren't  \"In Stock\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 1,
          "Date": "2017-01-02T17:46:18.000Z",
          "Titre": "shipped to wrong address",
          "Contenu": "they shipped my product to my billing address which was clearly different than my shipping address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-10-08T18:15:09.341Z",
          "Titre": "Seems OK",
          "Contenu": "Other than the cap being off one of the toners and leaking during shipping,  received as ordered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lnnn",
          "Nb_Reviews": 1,
          "Date": "2017-10-03T01:18:50.000Z",
          "Titre": "There is no estimate of when to expect …",
          "Contenu": "There is no estimate of when to expect delivery and the link to track the status does not work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ray Casper",
          "Nb_Reviews": 1,
          "Date": "2016-03-12T04:14:29.000Z",
          "Titre": "Tonerprice TN350 toner & Drum",
          "Contenu": "Great price, however, the ink is less black than Brother original or other aftermarket toners."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darnell Jackson",
          "Nb_Reviews": 1,
          "Date": "2017-08-08T01:27:46.000Z",
          "Titre": "Some of the toner cartridges did not …",
          "Contenu": "Some of the toner cartridges did not give the amount of pages that they were supposed to"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STEVEN",
          "Nb_Reviews": 2,
          "Date": "2017-08-06T00:59:43.000Z",
          "Titre": "It was easy to use.said it would be …",
          "Contenu": "It was easy to use.said it would be here in 3 days and because of the week end it took 4"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T15:50:42.000Z",
          "Titre": "You are asking me to review before I've…",
          "Contenu": "You are asking me to review before I've even received the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-04-13T15:59:45.000Z",
          "Titre": "shipping charges",
          "Contenu": "your shipping charges are outrageous!\rYou charge double the normal charges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JANETTE ANDERSON",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T15:39:54.000Z",
          "Titre": "I received my order",
          "Contenu": "I received my order, but it was missing a toner cartridge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill Watson",
          "Nb_Reviews": 2,
          "Date": "2021-07-17T23:11:21.000Z",
          "Titre": "Product is great",
          "Contenu": "Product is great, the time it took to get it was not so great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larkin Bramblett",
          "Nb_Reviews": 4,
          "Date": "2022-01-20T16:05:43.000Z",
          "Titre": "We ordered 10 and you only shipped me 8."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neil Roper",
          "Nb_Reviews": 3,
          "Date": "2016-01-10T20:07:31.000Z",
          "Titre": "Not What I Expected",
          "Contenu": "I ordered toner 4 cartridges for my Samsung laser printer, \rModel #SCX-4623FW, 3 compatible non OEMs, Model # SA-MLT-D105L, and one Samsung OEM, Model #105L. The Samsung OEM came from the same location but in a separate shipment. While all of the non-OEMs were sealed in such a way that indicated the boxes they were in had never been opened, not so with the OEM. Not only was the box taped to hold it together after the zipper-like strip opener had obviously been \"unzipped\" and tossed by someone before me. And the interior air-filled protector had also been opened. While I can see no evidence on the cartridge itself that anyone had either used or attempted to load it into a printer, it was still apparently a restocked item. Nothing was said on the website about restocked items, information quite common to such entities as Crutchfield, Best Buy, and Office Max/Depot. Though this item was discounted online and I was able to use a coupon code to further reduce the cost of the items, I would suggest that the least that could have done by Tonerprice when the OEM was returned to them would have been to reseal the interior air-filled protector to ensure the cartridge wouldn't be adversely affected by exposure to the air; after that, a simple disclaimer that these products might be restocked items would be a fine addition to the description. I'm just installing the cartridge today, as the one currently installed is indicating that it's almost empty, so at this point I cannot say for sure that there's anything wrong with this product; time will tell rather quickly, I assume.\r I must say, though, that the prices I paid were quite reasonable, even compared to other internet sites I've used before to purchase ink, the added discount was and the shipping time was really fast; I placed my order on the evening of 12/31/15  and received the non OEMs the following Wednesday, 1/6/15, the OEM the following day. And the shipping was FREE! Thank you, Tonerprice, for that, but you need to practice a more transparent \"truth-in-sales\". I've been an online ink purchaser for over 8 years, this was the first time I've ordered from Tonerprice. I plan to order from you again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:18:42.000Z",
          "Titre": "First time user.",
          "Contenu": "It took a little bit to find the toner I needed but once I did, it was easy and quick.  I set up a new account and made my payment.  Toner came quickly, even using 'ground' shipping.  I will use this again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kendra Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T02:32:20.000Z",
          "Titre": "first purchase with tonerprice.com",
          "Contenu": "This is my first purchase with this website. So my preliminary review is ….. The drop-down menus on the website made it easy to find the toner that I needed without having a whole lot of information about the copier that I needed it for. That is super helpful. Shipping was super fast. Love that! I can’t speak to the integrity of the toner or the link that it last just yet as this is my first order from this company but I will post an updated review when we are to that point. As of right now, I will definitely be purchasing again from this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 6,
          "Date": "2023-09-05T18:49:15.000Z",
          "Titre": "Excellent Service",
          "Contenu": "It says something when you want to give a 4 star review for a transaction that didn't work out as we would have liked. We ordered a complete \"aftermarket\" toner package for our copier Unfortunately the toner cartridges wouldn't work with our copier. They sent us two more different cartridges for free and they didn't work either. I didn't want to spend the money on factory toner for our older machine so we opted to purchase a newer copier. The upside is that Jody at Tonerprice.com was AWESOME in her attempts to help us in every way possible. Tonerprice.com will be my first stop the next time we need toner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyrone Chambers",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T19:53:11.000Z",
          "Titre": "After having UPS lie as if they…",
          "Contenu": "After having UPS lie as if they attempted a delivery that was made difficult due to construction in my neighborhood, my delivery was returned to sender and could not be rerouted.  Upon my reporting  to the staff at Tonerprice.com a new package was shipped in less then 24 hrs and I was treated with the utmost respect and consideration. Thanks Tonerprice.com, you helped make right of this complicated situation even though is wasn't made so by your actions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul H",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T17:15:30.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service - very fast delivery.  Only problem I had was that I received what seemed to be the wrong cartridge.  After contacting you, I was assured that the substitute was compatible with my printer.  I haven't had the need to replace the cartridge yet.  So I have yet to see."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T&M RAM TRANSPORTATION  LLC",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:08:37.000Z",
          "Titre": "The fast shipping.            act that they had it in stock  the…",
          "Contenu": "The fact that they had it in stock  the price and most of all shipping  time we were out so time was of the essence  it shows up a couple of days  to our surprise  thank you this what a company should  be  thank you  again  T&M RAM TRANSPORTATION  LLC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lea K.",
          "Nb_Reviews": 4,
          "Date": "2022-03-31T22:16:39.000Z",
          "Titre": "Credited",
          "Contenu": "4 Star review is only for their customer service, my original review overall was poor if you've read what happened to me. As for an Update, after posting my review last time, I was contacted by Jody from their customer service which I appreciate. Amount charged was credited now without a hassle. I hope this experience benefits people on both sides. Tonerprice needs to update their website for out of stock items if it's known discontinued and fix an issue of being able to check out by providing personal information when items are not available. As for the customers, I always appreciate to read an honest review without exaggeration I hope you do as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-02T22:30:56.000Z",
          "Titre": "difficult to put in drum was wrong size…",
          "Contenu": "difficult to put in drum was wrong size and would not fit in machine wasted toner and drum X2 even w adjustments so could not be returned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Southern California customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T20:17:47.230Z",
          "Titre": "Compatible toner cartridges were…",
          "Contenu": "Compatible toner cartridges were reasonably priced and came promptly.  However, I had to buy several more cartridges than required in order to qualify for free shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "yatin patel",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T02:51:25.000Z",
          "Titre": "Good price and good service",
          "Contenu": "Good price and good service, with in 3 days, I receive parcels from orderThanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Tam",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T00:27:52.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. I received my order within couple of days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr Walter Powers",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T13:07:59.000Z",
          "Titre": "Great buy",
          "Contenu": "Fast shipping cost is the affordable compared to other."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maureen  C. Schultz",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:43:58.000Z",
          "Titre": "Fast delivery of product",
          "Contenu": "Fast delivery of product. Easy site to order from."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randell Riley",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T17:27:10.000Z",
          "Titre": "Good value and no mess!",
          "Contenu": "Good value and no mess!I've used refill kits for my color laser printer.  I like them, but they can be a bit messy.  Plus the chip replacement is a bit iffy. (Those require exact placement sometimes to work properly.)Popping in a relatively inexpensive cartridge compared to the OEM manufacturer's product saved me about 60 percent. And it is just toner.  It works fine and the colormatch seems near perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald A. Rosenberg",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T19:56:14.000Z",
          "Titre": "The service was pretty good",
          "Contenu": "The service was pretty good.  I was grateful that Tonerprice followed up on a delivery purchased on September 30, finally reached me on October 22.  That delivery was a replacement for the original order.  Mistakes happen, but the best outcome is when the supplier makes good to fulfill the original order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Berdinella",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T22:15:02.000Z",
          "Titre": "Tonerprice.com was very helpful in…",
          "Contenu": "Tonerprice.com was very helpful in allowing a return of a toner pack that we had incorrectly ordered and reversed the charge as soon as we returned the incorrect packet. We then reordered the correct pack and are very satisfied with the quality of their toners for our Kyocera copier ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Patterson",
          "Nb_Reviews": 3,
          "Date": "2021-05-01T20:59:48.000Z",
          "Titre": "Immediate Correction.",
          "Contenu": "Being my 1st order, always want perfect.  Not quite here but almost.  I ordered a set of 6 ink cartridges and got 5 right.  Got a duplicate of 1.  Called Joni(?) on 4/28.  She immediately took care of the problem & got my correct replacement on 5/1.  Cant do much better than that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hendry",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T18:22:47.000Z",
          "Titre": "Performance of the toner",
          "Contenu": "Installed the black toner only not tried the colored ones yet. Installation was easy. The toner looked slightly different from the original but it did fit. Perform test paper print. Come out not perfect but acceptable for a after market product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2016-01-29T13:43:12.823Z",
          "Titre": "1st toner purchase",
          "Contenu": "Toner arrived the next day!  I had a question when I received it and called customer service.  They answered my question, and were very polite and helpful.  Just sorry I didn't find this place earlier.  I've installed the toner cartridge and am interested in seeing how the quality is.  If it performs as expected, Tonerprice.com will be my new supplier for all my ink toner and cartridge needs!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Boyd",
          "Nb_Reviews": 1,
          "Date": "2016-02-22T19:50:15.703Z",
          "Titre": "Get it Fast",
          "Contenu": "Haven't had a chance to use my new all in one printer as of yet, but the delivery of the toner was so fast. I received my shipment in just a couple of days after placing the order. Thanks for gettin my order out so quick. And I never even asked for rush delivery. I will recommend you to anyone who wants toners. Again, thank you. \rBob Boyd \r     [:{]}"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Dower",
          "Nb_Reviews": 2,
          "Date": "2021-11-01T16:19:49.000Z",
          "Titre": "Toner was a replacement for the 730.",
          "Contenu": "Toner was a replacement for the 730.. fit without issue but the contrast is a little light.. I cranked up the contrast so it's at least working.  Gave it 4 stars because it came a lot quicker than I was anticipating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-02-27T20:38:00.224Z",
          "Titre": "Good Stuff",
          "Contenu": "I can't honestly write a review of the product as I had it shipped to a family member for their use.  But it did arrive on time, in working order and all is well.  It was a bit more expensive than some other sources, but Tonerprice had it, delivered it, and that's really what's important."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry All About Printing",
          "Nb_Reviews": 1,
          "Date": "2015-08-04T16:39:03.836Z",
          "Titre": "Great Product and fast delivery but way too many e-mails",
          "Contenu": "I love the fact they have low prices and they ship[ same day so I had the next day but I was bombarded with E-mails at least 3-4 within the first two days after I ordered. That is a big turnoff to me as it takes time to read or delete and most of them were just promoting more business. Less is better!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas McCall",
          "Nb_Reviews": 1,
          "Date": "2018-02-03T19:51:06.000Z",
          "Titre": "Placed my order at night and it shipped …",
          "Contenu": "Placed my order at night and it shipped next day. Ink arrived as advertised except one package was shipped to their warehouse in California. One phone call resolved the issue and they even called me back to tell me product was on the way to correct address. Great customer service !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer- Sunnyvale Ca.",
          "Nb_Reviews": 1,
          "Date": "2015-10-03T05:52:46.175Z",
          "Titre": "Received wrong toner; was promptly & courteously sent the right item.",
          "Contenu": "What came in was smaller than I ordered, and otherwise incorrect ; e-mail request for RMA got me a phone call & quick sending of the correct item, and a shipping label to send the other back. So, I'm satisfied, except for the extra time spent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M.",
          "Nb_Reviews": 1,
          "Date": "2015-04-20T17:02:37.000Z",
          "Titre": "Great customer service",
          "Contenu": "They missed our order which was to be overnighted which I paid for.  A week later no toner and we did not have the use of our fax machine. But when they realized their mistake that shipped our toner and refunded our shipping.  I'd used them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gustave",
          "Nb_Reviews": 2,
          "Date": "2018-04-03T16:07:51.000Z",
          "Titre": "Discovered Toneprice.com surfing the…",
          "Contenu": "Discovered Toneprice.com surfing the net for decent deals on toner.  The usual site I go to just got too expensive and started charging for shipping.  The toner arrived on time and, I am satisfied with the quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Boswell",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T01:03:31.000Z",
          "Titre": "I appreciate the friendly service",
          "Contenu": "I appreciate the friendly service.  I would like to have the name of the shipper and the tracking number.  I hope that this is or becomes an automatic email !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Ball",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T00:42:42.000Z",
          "Titre": "I got a toner cartridge for an older HP…",
          "Contenu": "I got a toner cartridge for an older HP LaserJet 3390 for a very reasonable price. I got it 3 days after ordering, regular ground delivery. Very satisfied!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Ionascu",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T00:57:24.000Z",
          "Titre": "I purchased and received a Toner…",
          "Contenu": "I purchased and received a Toner cartridge for the Canon ImageClass D530 copier/printer and it got stuck when I tried to place in the printer - it took me over 45 min to dislodge it......Called Tonerprice and Mr. WAYNE FISH TOOK MY CALL and offered to send me a new cartridge at no charge.The first cartridge I had received had some plastic orange oval pieces at each end, which fell out when I removed it from the box. The new cartridge I just received has them too....  and the user guide I had received does not mention anything about these oval orange plastic pieces.....I tried a few times to insert the new toner cartridge into the Canon D530 unit but it DOES NOT FIT! iI did not remove these orange plastic end-pieces.I don't want to damage the printer/copier so I will call Monday and request to send both cartridges back.  I feel I cannot deal with Tonerprice.I do not want a Trustpilot account!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "H Kotowski",
          "Nb_Reviews": 1,
          "Date": "2016-04-30T15:45:17.000Z",
          "Titre": "Extreme shipping and great service so far.",
          "Contenu": "Haven't tried the drum or toner yet, so I removed a star. Extremely fast shipping. They come with a 1 year warrantee and if they print as well as their shipping response and price it will be a home run!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Canon GPR 28",
          "Nb_Reviews": 1,
          "Date": "2015-08-19T15:47:47.794Z",
          "Titre": "Canon Cartridge",
          "Contenu": "The product arrived in a timely manner and appears to be of good quality. Not a Canon product but the price was better, I will use Tonerprice.com again for my printer cartridge needs.\r Thank You"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alliance Church",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T15:41:54.000Z",
          "Titre": "Refused delivery on the Black cartridge…",
          "Contenu": "Refused delivery on the Black cartridge as it is leaking. Called toner.com and they apologized for the inconvenience and were sending out a new cartridge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr StokesCustomer",
          "Nb_Reviews": 1,
          "Date": "2015-09-22T02:15:22.744Z",
          "Titre": "First purchase",
          "Contenu": "Ordered on Friday. Delivered on Monday. Regular mail. Easy order, fast service, very low price. Have not used product yet but if it works you have my business for years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2017-07-01T18:50:27.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, excellent website, very quick delivery but one cartridge we received was defective.  Will have to send it back but would definitely order again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2018-04-01T23:27:48.000Z",
          "Titre": "Item was out of stock",
          "Contenu": "Item was out of stock, but they notified me and gave me the option of waiting. I did, and it came pretty quickly. No problem at all. Good transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2018-04-04T15:39:45.000Z",
          "Titre": "Okay.",
          "Contenu": "Smooth transaction. The product is good, but I bought a bundle and the yellow toner leaves streaks on my pages, which is a bit annoying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "fred",
          "Nb_Reviews": 2,
          "Date": "2015-10-14T15:32:29.972Z",
          "Titre": "Great shipping",
          "Contenu": "Price could always be better but they arrived so fast I was really surprised and pleased.  I will be ordering from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2015-04-20T16:55:33.000Z",
          "Titre": "Decent price, quick delivery",
          "Contenu": "The ordering process was easy, the pricing was reasonable, and the order was filled and delivered in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L A Albrecht",
          "Nb_Reviews": 2,
          "Date": "2021-08-16T18:42:32.000Z",
          "Titre": "First time buyer",
          "Contenu": "So far, so good.  Fast delivery.  Really can't review properly until I print a few times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CustomerNeal",
          "Nb_Reviews": 3,
          "Date": "2020-06-01T16:07:10.000Z",
          "Titre": "came quickly",
          "Contenu": "my replacement toner cartridge came quicker than I expected, however I haven't installed it, yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2016-04-09T20:43:01.000Z",
          "Titre": "Drum Cartridge",
          "Contenu": "Received my new replacement drum catridge; very simple to install and it is now working great again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jack",
          "Nb_Reviews": 1,
          "Date": "2015-06-21T22:15:08.196Z",
          "Titre": "Toner for HP cp4005N",
          "Contenu": "I wan in need of HP cp4005N black toner.\rOriginally I was going to order from HP but after so much of hesitation I ordered through tonerprice.com.  While I was ordering there was a $ 10 promotion and if your order is more than $125 then the shipping will be free. So order two toners because I want to make sure to have other color spare toners in back stock.  Since I never used tonerprice.com, I was not sure if I will even get the stuff I am ordering.  BUT..\r As soon as I order completed, I received a confirmations through email for my order and  payments, since i placed the order on Saturday, I received fedex shipment information on Monday, on Thursday I received a big box with my two toners.\r When I open the black toner, one of the lever is broken, when I instal the toner in the toner comportment it fixed well and I did a test printing and printed ok.  Instead of returning or even to call them to let them know I started to work on it ad it is printing well.  If I have any problem because of the broken lever then this will be my last order otherwise I will keep tonerprice .com as my toner supplier.  I am satisfied with the entire process and I am recommending toner service to my other business friends as well.   Thank you tonerprice team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2019-01-08T04:09:15.000Z",
          "Titre": "Took a little longer than I expected",
          "Contenu": "Took a little longer than I expected. one more day and my copier would have stopped working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Professor Larry Byrd",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T15:17:16.000Z",
          "Titre": "received  replacement Inks and cartridges for HP printers",
          "Contenu": "I have ordered four Times Inks and/ or Toner Cartridges and they have always been great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHELLE GREEN",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T11:54:03.000Z",
          "Titre": "I thought my toner would ship a day i…",
          "Contenu": "I thought my toner would ship a day i ordered it.the sales rep. said it would?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-04-25T19:52:22.000Z",
          "Titre": "They were great and fast",
          "Contenu": "They were the best price we found for both my toner on my copy machine and printer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hiram Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2022-02-26T21:44:45.000Z",
          "Titre": "All the parts work and they arrived on…",
          "Contenu": "All the parts work and they arrived on time. So far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer1",
          "Nb_Reviews": 1,
          "Date": "2016-03-04T18:06:00.436Z",
          "Titre": "Ricoh Toner",
          "Contenu": "Shipping was VERY prompt.  I will have to wait and see how well product performs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rony Bran",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T16:48:39.000Z",
          "Titre": "I received the product on time,friendly…",
          "Contenu": "I received the product on time,friendly service.thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-06-04T16:10:35.000Z",
          "Titre": "Great Product",
          "Contenu": "Product works, low price, fast delivery, no hiccups. Would use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Anderson",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T17:29:00.000Z",
          "Titre": "Cartridge",
          "Contenu": "Good results, quick service, safely packed for shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-01-04T22:44:49.662Z",
          "Titre": "Fast shipping",
          "Contenu": "I would recommend this site, shipping was fast and no issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "New York Designer",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T04:37:21.000Z",
          "Titre": "Great Service",
          "Contenu": "Delivery was much faster than I expected, very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. Hugh Long",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T13:45:14.000Z",
          "Titre": "Does a good job of printing and like…",
          "Contenu": "Does a good job of printing and like the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2017-10-09T23:06:45.000Z",
          "Titre": "Great Price",
          "Contenu": "Great Price - Toner works fine will order again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurent Saint Pierre",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T10:12:30.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I will keep you posted"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert",
          "Nb_Reviews": 3,
          "Date": "2021-05-03T18:08:46.000Z",
          "Titre": "Great TN660 Toners",
          "Contenu": "Great TN660 Toners, arrived early!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 3,
          "Date": "2021-07-06T20:53:51.000Z",
          "Titre": "Satisfied",
          "Contenu": "Prompt, prices were reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FinneyC",
          "Nb_Reviews": 3,
          "Date": "2018-01-03T06:12:51.000Z",
          "Titre": "fast service delivered within 24hrs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Hooper",
          "Nb_Reviews": 1,
          "Date": "2021-02-07T20:37:17.000Z",
          "Titre": "Very satisfied in all respects"
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "Taylor",
          "Nb_Reviews": 10,
          "Date": "2021-03-12T12:36:44.000Z",
          "Titre": "Excellent customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Baho",
          "Nb_Reviews": 2,
          "Date": "2015-07-30T18:30:16.133Z",
          "Titre": "Reliable, competitive and on time",
          "Contenu": "A repeat and satisfied customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T16:57:16.000Z",
          "Titre": "Fast quick service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sazzad",
          "Nb_Reviews": 1,
          "Date": "2017-08-06T15:17:21.000Z",
          "Titre": "Good and save money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 2,
          "Date": "2020-01-09T22:05:31.000Z",
          "Titre": "Product works fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customerrodney",
          "Nb_Reviews": 1,
          "Date": "2019-08-11T20:21:45.000Z",
          "Titre": "Great product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2015-12-16T20:51:17.777Z",
          "Titre": "Good",
          "Contenu": "Good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 6,
          "Date": "2023-12-16T22:51:28.000Z",
          "Titre": "Jody Golley is great",
          "Contenu": "Jody Golley is great. We ordered a drum and unfortunately the wrong one was shipped. Jody called us and helped us get the correct on on order and issued us a cal tag for the wrong one - great customer service !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LISA CAREY",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:08:29.000Z",
          "Titre": "Phenomenal customer service!",
          "Contenu": "Phenomenal customer service found me the products we needed and within a few days of ordering they were delivered. Will not shop anywhere else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rudy Esposito II",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:52:59.000Z",
          "Titre": "Great toner!",
          "Contenu": "The toner arrived quickly. The quality of the product is great. I will recommend Tonerprice.com to all my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean Mueller",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T14:36:44.000Z",
          "Titre": "I love TonerPrice",
          "Contenu": "I love TonerPrice. The prices are competitive,  and my supplies are  always delivered in a timely manner.  If you ever have a problem with your order, they go out of their way to make sure you are happy and you get what you need. They are wonderful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donnalisa",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T01:48:16.000Z",
          "Titre": "Tonerprice is amazing!",
          "Contenu": "Tonerprice is amazing!! I have an older Samsung printer that I cannot locate toner for. Not only did they have my toner but offer a sign up discount as well. Toner works perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Dean",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:35:12.000Z",
          "Titre": "Dell stopped supplying my toner and…",
          "Contenu": "Dell stopped supplying my toner and tonerprice seems to have a product that is at least as good if not better.. at a much better price.  5 STARS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUSAN MARTIN",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:13:28.000Z",
          "Titre": "Jodie is always friendly and helpful ……",
          "Contenu": "Jodie is always friendly and helpful … she goes out of her way to find the best products for you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfred Chapmanjr",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:28:15.000Z",
          "Titre": "Tremendous Service  Super nice and helpful",
          "Contenu": "The lady that provided my service was TREMENDOUS!   SHE IS PATIENT, POLITE AND SUPER HELPFUL.   SHE is definitely a keeper!!!!THANK YOU,\"Al\"When it is all said and done, the only thing that will really matter is whether or not you know Jesus Christ as your Lord and Savior!!!Alfred A. Chapman, Jr."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MONICA GARNER",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T02:57:53.000Z",
          "Titre": "Fast",
          "Contenu": "Talked to the right person to get what I need it, order payed and in two day came my merchandise…Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Folk",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:01:26.000Z",
          "Titre": "Great Seller, Great Product and Fast Delivery",
          "Contenu": "This was my first time ordering from Tonerprice, so I was apprehensive.The order arrived extremely fast, the remanufactured toner cartridge fit and worked perfectly, for about 20% of the price of a new one. I have no complaints at all and will order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil Rand",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T18:52:41.000Z",
          "Titre": "Really great service - Thanks",
          "Contenu": "I was having a little trouble with your website, and your customer care person was friendly, professional, and efficient.  The toner is just what I needed and the delivery was absolutely wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T18:37:12.000Z",
          "Titre": "Service is always excellent and fast!",
          "Contenu": "The service is always excellent and fast.  I have been using Tonerprice for years.  Very satisfied.  The products save me money and are reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T00:57:27.000Z",
          "Titre": "I ordered a color toner cartridge and…",
          "Contenu": "I ordered a color toner cartridge and received it within two days.  When I tried to install the cartridge, it did not work.  I called Tonerprice customer service and they immediately sent out a replacement.  My call was on a Friday and I was resigned to the fact that it would be a few days before I received it.  The cartridge arrived on Sunday and this cartridge worked fine.  Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Gaines",
          "Nb_Reviews": 5,
          "Date": "2023-10-05T16:27:05.000Z",
          "Titre": "Easy Ordering, Fast Shipping, Great Product",
          "Contenu": "Easy to use web site helped me find exactly what I needed and the ordering process was quick and easy.  Extremely fast shipping, received it next day even though I only paid for standard shipping.  The product was packed well and works just as good as OEM product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brian",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T18:53:53.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Best price around and they even give you discount with reward points. Toner cartridge delivered on time. They were quick to pick up the phone (no robo or call back) when I contacted them about some heavy ink printing spots with the new cartridge and they immediately sent me a new one. I will never go anywhere else to buy my ink cartridges. They make it easy and cost effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garry & Suzanne Scheier",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T19:13:05.000Z",
          "Titre": "Easy on-line ordering",
          "Contenu": "Easy on-line ordering. Would like to see Senior Citizen pricing for home use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Martin",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T14:16:40.000Z",
          "Titre": "Lightening-Speed Shipping",
          "Contenu": "PROS: Extremely reasonable prices for the off-brand cartridges.  Lightening-speed shipping due to multiple shipping centers. (I can order Monday afternoon and have my shipment by Tuesday morning!)CONS: The off-brand products work reasonably well with the occasional exception of the colored toner cartridges. (The first printed page likes to leave a yellow strip whether printing in color or black and white).OVERALL: 9/10 - I Highly Recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T21:25:24.000Z",
          "Titre": "I ordered a compatible HP toner cyan…",
          "Contenu": "I ordered a compatible HP toner cyan cartridge. It was delivered promptly but failed to operate. I called Toner Price, and was told I would get a mailing label to return non-working cartridge and a new cartridge would be shipped that day. I received the new cartridge and it works PERFECTLY!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T01:13:51.000Z",
          "Titre": "I didn't expect to get it that fast",
          "Contenu": "I ordered some Konica-Minolta cartridges from Tonerprice.com.   I picked them because their price looked good, an my previous supplier no longer carried the items.   I ordered the items on Thursday evening.  I was pleasantly surprised when I received delivery on Saturday afternoon.   Turns out that Tonerprice has a warehouse in Suburban Chicago.   I will buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emmanuel Ayala",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:09:24.000Z",
          "Titre": "Toner for Toshiba Printer.",
          "Contenu": "Order was placed with ease, and the turnaround time was quick! Product works great as well, definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JERRY MORGAN",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T22:26:59.000Z",
          "Titre": "Quick response,Price",
          "Contenu": "Quick response,Price, Over rode printer not wanting to recognise Tonerprice.  My local retail store did not carry my older printer and cost would have been $100 dollars one cartridge!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. GARSKE",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T02:17:11.000Z",
          "Titre": "Years of satisfactory service",
          "Contenu": "Someone polite always answers the phone, no waiting. Quick to look up our account and carefully take our order. Verifies the payment details. Product is received in a timely manner. In the many years I have ordered from Tonerprice, our company has only experienced one error and I believe that was a shipping error."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Williquette",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T00:28:30.000Z",
          "Titre": "GOOD EXPERIENCE",
          "Contenu": "This is my first order from them, the check out was quick and easy, product arrived sooner than I expected, and shipment was very well packed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-11-09T23:30:20.000Z",
          "Titre": "Great experience.Easy to navigate the…",
          "Contenu": "Great experience.Easy to navigate the website and always get my good discount + points with every purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess Work",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T16:03:21.000Z",
          "Titre": "Real website!",
          "Contenu": "Real website - ordered on Thursday, received Monday. I ordered a knock-off canon imageclass drum. It's better quality than the one I got off a-zn. Obviously I can't say yet whether it holds up as well as the OEM - I'll come back and edit this if it's an unreasonably short amount of time. I'm willing to try this company's toner next."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynda",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T17:35:47.000Z",
          "Titre": "I am a small order customer",
          "Contenu": "I just place small orders, but Tonerpice always treats me like an important customer. If I have a problem or question, they are always answered quickly and fairly. Plus it is a relief to find toner for my old HP that works and doesn’t cost an arm and a leg! Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:47:03.000Z",
          "Titre": "Easy to work with",
          "Contenu": "The 4 toners came in 3 different shipments so I was perplexed when I initially only received 2 of the 4 toners. When I contacted Tonerprice, the sales manager responded promptly and answered my questions. She  was very helpful providing information as to when to expect the other toners and why they weren't all shipped together."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne L",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T04:07:34.000Z",
          "Titre": "Site Easy to Use",
          "Contenu": "The site was easy to find when I searched for HP Toner Cartridges.  Many different sites appear, but it was good to find one that offered real HP products at a lower price.  The selection of the product, placing in the cart, and check-out processes were very simple to perform and user-friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard S.",
          "Nb_Reviews": 4,
          "Date": "2022-12-18T01:14:31.000Z",
          "Titre": "Minor problem with order",
          "Contenu": "Minor problem with order. Follow up customer service was excellent. One of the toner cartridges needed to be replace. I got a same day response to my email and a replacement in the mail in two days. My laser printer is now showing full toner and printing again. All for a much better price than OEM supplies.I would definitely do business with this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katharine Powell",
          "Nb_Reviews": 6,
          "Date": "2023-01-11T04:35:09.000Z",
          "Titre": "What a wonderful surprise",
          "Contenu": "What a wonderful surprise!  My copier needed new toner.  I went online to find what kind of toner cartridge was needed for my copier (which is 10+ years old and still had the original toner cartridge).  With that info I placed the order on Wednesday.  The cartridge arrived the next day.  I have no experience with copiers, but located the old cartridge, replaced it with the new, and voila—perfect copies again!Great company, and incredible packaging of product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Martin",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:20:15.000Z",
          "Titre": "Buy with confidence",
          "Contenu": "Really fast shipping, product as advertised. You can buy with confidence"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T19:03:19.000Z",
          "Titre": "Loved the customer service",
          "Contenu": "Loved the customer service! I had ordered some difficult to find toners and trays from the website.One of the items that I thought was in my cart was not and I had paid for express delivery. I went back into the system and reordered the item (because there was only one left). I then called customer service and left a message about needing it to all to come together express. The agent quickly found my order and was able to bundle them together and ship them. Thank you for the great attention to detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Rauh",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T02:18:07.000Z",
          "Titre": "Well done",
          "Contenu": "The ink cartridge arrived in a reasonable amount of time from the West Coast.  It was packaged extremely well with multiple layers of padding.  The cartridge fit easily and worked right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristine Murfin",
          "Nb_Reviews": 4,
          "Date": "2023-10-23T23:34:13.000Z",
          "Titre": "Quick Delivery! Competitive prices.",
          "Contenu": "I always order from Tonerprice because they are priced competitively and I usually receive my order the next day. Super quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Franciscan Servants daiseydew",
          "Nb_Reviews": 5,
          "Date": "2022-12-03T20:15:54.000Z",
          "Titre": "We have been ordering toner from your…",
          "Contenu": "We have been ordering toner from your company for years. Why? The toner is of good quality, the price is good, your sales are wonderful, the shipping is fast and best of all your customer service with Jody Golley is Wonderful. She is intelligent, professional and extremely helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Burns",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T01:18:33.000Z",
          "Titre": "A great supplier for our old copier",
          "Contenu": "We were told that our toner had been discontinued, so after calling several places and being told the same thing, I was very happy to talk to a wonderful man at Tonerprice who not only had the toner we need but parts and other items for our copier as well. He saved the day for us, and we can continue our printing activities into the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Packer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T07:19:52.000Z",
          "Titre": "Good Price - Quick Delivery - As Promised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marian",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T00:09:37.000Z",
          "Titre": "Notified me right away about item that…",
          "Contenu": "Notified me right away about item that was not in stock and suggested a replacement.  Got back to me immediately as to what my wishes were - refund or replacement.  Delivery was very fast- very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Dicarmine",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T21:24:32.000Z",
          "Titre": "My order came quickly but …",
          "Contenu": "My order came quickly but was inaccurate, I called the company fearing the worst when instructed to \"leave a message\" to my delight the call was returned promptly and the order corrected immediately! Everyone makes mistakes - its all in how you respond. So refreshing to have great customer service for a change!!! Will definitely order again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Munz",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T22:03:06.000Z",
          "Titre": "Repeat Customer",
          "Contenu": "This is the 3rd time I have purchased a toner cartridge over the last 6 years.  I wouldn't keep buying from Tonerprice if I didn't like their service and their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:52:34.000Z",
          "Titre": "Glad I bought from Toner Price",
          "Contenu": "I reviewed other sites to buy my old parts from and they were negative, tonerprice were all good, so I took a chance. I received my items with in 2-3 days and they were correct. Totally glad I bought from tonerprice and will buy again from them!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tucker",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T21:50:10.000Z",
          "Titre": "Arrived on time and in excellent…",
          "Contenu": "Arrived on time and in excellent condition.  Fair price.  Will order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Koch",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:51:27.000Z",
          "Titre": "customer service experience",
          "Contenu": "...taking care of the customer!!!..product looks good so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Lubovich",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:17:35.000Z",
          "Titre": "Ordering was simple",
          "Contenu": "Ordering was simple, and delivery was very fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARGARET",
          "Nb_Reviews": 3,
          "Date": "2023-02-28T19:12:41.000Z",
          "Titre": "a great company",
          "Contenu": "a great company.  JODY ALWAYS MAKES MY DAY!  SHE IS VERY PROFESSIONAL AND HELPFUL.  DELIVERIES ARE ALWAYS PERFECT, ON TIMER, AND EXACTLY WHAT I ORDERED.  DON'T REMEMBER EXACT DATE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CISCO GONIZALES",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:12:48.000Z",
          "Titre": "Their product's quality are what they…",
          "Contenu": "Their product's quality are what they promised. Prices are very affordable and competitive. Their delivery and shipping services are always a on time which is a very important factor for my company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wayne fogle",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T22:24:47.000Z",
          "Titre": "The website was easy to navigate and…",
          "Contenu": "The website was easy to navigate and find exactly what i needed. also the processing and shipping was quicker then i expected and received it promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KIM",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T19:01:04.000Z",
          "Titre": "Nice Customer Service",
          "Contenu": "I have purchased toner from this company for years and they always go above and beyond to help me locate the correct cartridge for my office needs. They also offer nice holiday specials."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "none",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:39:52.000Z",
          "Titre": "The help I received at the phne number…",
          "Contenu": "The help I received at the phne number when I couldn't confirm that I was ordering the right product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Bowes",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T16:22:47.000Z",
          "Titre": "TONER CARTRIDGES",
          "Contenu": "You had the toner cartridges that I need at the lowest price I could find.  Easy ordering and fast shipment.  Will order through you again and also recommend your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIM Print LLC",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T02:23:28.000Z",
          "Titre": "Reasonable price quality product and…",
          "Contenu": "Reasonable price quality product and reached on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie Henry",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T19:37:53.000Z",
          "Titre": "Ordering was easy and delivery was…",
          "Contenu": "Ordering was easy and delivery was fast. I will definitely order from Tonerprice again. Toner working great. I have a Ricoh copier/printer MP C3003."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Concerned U.S. Citizen",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T01:51:38.000Z",
          "Titre": "I was able to reach a human being on…",
          "Contenu": "I was able to reach a human being on the other end of the line after just a couple of rings. Did not have to press any other numbers to get routed anywhere. The rep was very responsive to my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 3,
          "Date": "2023-01-31T16:31:09.000Z",
          "Titre": "I was totally satisfied with the person…",
          "Contenu": "I was totally satisfied with the person that answered the phone. It was sent immediately. It was to be here on Tuesday and came on Sunday. It was easy to put in the printer. The whole experience was professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aileen Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T22:06:33.000Z",
          "Titre": "Very competitive pricing",
          "Contenu": "Very competitive pricing. The service was stellar. We ordered on December 29th and received it December 30th. Shipping was fast!We will continue to use their services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SB Shopper",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T14:56:32.000Z",
          "Titre": "Have used tonerprice for over 10 yrs",
          "Contenu": "Have used tonerprice for over 10 yrs! I buy from them because their selection and pricing is great, and service is too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enzo",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T03:49:51.000Z",
          "Titre": "Excellent services …",
          "Contenu": "For many years in dealing with your company for my toner supply i am very happy to congratulate all of Emploee for your excellent service. Enzo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve C",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T03:18:55.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Ordered item no longer available. Was informed promptly and my credit card was not charged. Very happy with their customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Jones",
          "Nb_Reviews": 3,
          "Date": "2023-05-26T16:49:23.000Z",
          "Titre": "Prompt service",
          "Contenu": "Prompt service, quick shipping, fair prices.  Could not ask for a better experience in buying toner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Timmons",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:13:46.000Z",
          "Titre": "Ease of identifying product needed on…",
          "Contenu": "Ease of identifying product needed on web site and completion of order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:03:31.000Z",
          "Titre": "Great selection of toners",
          "Contenu": "Great selection of toners. Old and new models copiers. my go to store for my toner and other printing accesories"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AMY",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T15:08:53.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, efficient, excellent friendly customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Cselovszky",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T20:09:17.000Z",
          "Titre": "Professional and courteous service.",
          "Contenu": "The staff at Tonerprice were very courteous and professional to deal with. They promptly issued me a credit when I had a problem with a product that was delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Wood",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T18:05:09.000Z",
          "Titre": "Speedy delivery, good product",
          "Contenu": "We have used this company for several years now for our office toner.  Quick delivery.  Product always works well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raquel Castaneda",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T00:37:19.000Z",
          "Titre": "Exceptional service !",
          "Contenu": "I had a very difficult time finding a specific toner, and they had it in stock. Customer service was excellent. I definitely would recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Russo",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T00:52:34.000Z",
          "Titre": "Amazingly fast service as my order…",
          "Contenu": "Amazingly fast service as my order arrived in just days. TonerPrice is my go-to toner provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Behr",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T21:19:12.000Z",
          "Titre": "The website was easy to use.",
          "Contenu": "The website was easy to use.I was impressed with the fact that we got a phone call to verify the order before initiating it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GEORGE MACPHERSON",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T21:00:57.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Quick delivery, good packing and especially access to customer service who located what I needed in stock even though the web site indicated that the item was out of stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andres Sandoval",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T19:54:46.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, I emailed to ask why my order was on hold and they called me within the hour!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STELLA ROJAS",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T17:35:56.000Z",
          "Titre": "I had totally run out of toner and…",
          "Contenu": "I had totally run out of toner and Tonerprice was able to get toner to me within 1 day so I could finish my project.  Great customer service!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris  Jepsen",
          "Nb_Reviews": 4,
          "Date": "2023-03-05T17:50:05.000Z",
          "Titre": "Toner cartridges that are fair priced…",
          "Contenu": "Toner cartridges that are fair priced and work as they should. Never have had any issues with My Dell or Brother laser printers with these."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rc",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T17:45:08.000Z",
          "Titre": "Toners and drum worked great",
          "Contenu": "Toners and drum worked great. No issues - Shipping was super fast from internet order to door step - 2 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent Novell",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T15:17:48.000Z",
          "Titre": "The usual great experience!",
          "Contenu": "Just a reorder of toner but,  as always, very well priced, high quality, delivered quickly and in excellent condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Woodward",
          "Nb_Reviews": 5,
          "Date": "2023-03-07T05:59:36.000Z",
          "Titre": "Called concerning a defective toner…",
          "Contenu": "Called concerning a defective toner cartridge. The person answering the phone was courteous and quickly took care of the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch Kotula",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T03:18:47.000Z",
          "Titre": "I like dealing with you folks",
          "Contenu": "I like dealing with you folks.  Quick and easy to order, orders promptly filled, return label to recycle empties.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BBC International",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T15:01:29.000Z",
          "Titre": "Good service",
          "Contenu": "Jody Golley was very helpful answering my questions about my order status."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VICKEY  WELLS",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T21:31:43.000Z",
          "Titre": "Tonerprice (Fantastic)",
          "Contenu": "Your delivery was fast and correctly and I had No problem getting or ordering from you. Again Thank You for everything you did"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T00:56:16.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Very knowledgeable about the product. I made myself a note to do all my toner reorders here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim in Houston",
          "Nb_Reviews": 5,
          "Date": "2022-11-29T15:08:59.000Z",
          "Titre": "Excellent, reliable company",
          "Contenu": "Extremely fast shipping and the lowest price on HP cartridges anywhere! Would not hesitate to purchase from them, and I am a regular customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Ann Gratty",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T15:01:01.000Z",
          "Titre": "I spoke to the owner who spent a lot of…",
          "Contenu": "I spoke to the owner who spent a lot of time helping me to choose the right toner at the best price.  I received my toner in a few days.  I had a great experience with him.  Thanks so much.  Mary Ann"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T17:17:06.000Z",
          "Titre": "The help we had ordering was very good",
          "Contenu": "The help we had ordering was very good. Thank you for being very prompt. Weskan Bible Church by treasurer Judy Raney."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert  Strobel",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:02:18.000Z",
          "Titre": "I love your service",
          "Contenu": "I love your service, my printer is finally working again. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Huse",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T16:45:52.000Z",
          "Titre": "good service",
          "Contenu": "honest fairly priced and on schedule delivery time, also earn points on every purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jimmy davis",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T21:55:00.000Z",
          "Titre": "Great company",
          "Contenu": "First contacted customer service who answered my questions timely and completely. Order shipped promptly, as always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mahmood Arbab",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T00:37:33.000Z",
          "Titre": "Excellent packaging and prompt delivery!",
          "Contenu": "Excellent packaging and delivery. Product was right, fit and was installed easily.Thank you and keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Baird",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T03:26:15.000Z",
          "Titre": "Successful transaction",
          "Contenu": "The toners arrived in a singe box and everything worked just fine. Very successful transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Sapp",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T16:53:15.000Z",
          "Titre": "We recommend these guys!",
          "Contenu": "Selection was great, ease of placing the order was smooth, and the prices will have us coming back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Newness",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T23:25:06.000Z",
          "Titre": "You have the right person as customer…",
          "Contenu": "You have the right person as customer service. I can not give her a 10 out 10 because Her numbers are far above that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nannette  Nekora",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T18:48:19.000Z",
          "Titre": "Order promptly filled and delivered",
          "Contenu": "Order promptly filled and delivered.  I did not request special service, but the order arrived promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernadette McCormick",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:53:30.000Z",
          "Titre": "Easy purchase",
          "Contenu": "Easy purchase, user friendly site and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Gruver",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T14:43:38.000Z",
          "Titre": "It was easy to search online for the…",
          "Contenu": "It was easy to search online for the correct product.   Products shipped right away and were competitively priced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Copy Service Corp of MN",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T02:49:39.000Z",
          "Titre": "Wonderful fast service",
          "Contenu": "Wonderful fast service! Always has what I need when I need it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilberto Cardenas",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T02:33:28.000Z",
          "Titre": "very good, thank you",
          "Contenu": "I received my order on time, good quality tonner and affordable prices, thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Woolford",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:06:16.000Z",
          "Titre": "Toner replacement",
          "Contenu": "They had the best pricing for the items I needed. Everything was delivered quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KENNETH EDWARDS",
          "Nb_Reviews": 4,
          "Date": "2023-08-22T21:04:55.000Z",
          "Titre": "Helpful support",
          "Contenu": "Jody was very helpful with ensuring I obtained the appropriate imaging drums for my Xerox WorkCentre 6515 and, subsequently, helping to make the printer recognize that the drums are NEW, after installing them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Witkowski",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T00:12:34.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service, great price and product, fast shipping, and great communicationto my question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T19:20:51.000Z",
          "Titre": "I had a order misdone and gave them a…",
          "Contenu": "I had a order misdone and gave them a call and fixed it immediately I appreciate the kindness from the young lady that helped me was a great experience would refer all my friends and family"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RUSSELL LEISNER",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:59:30.000Z",
          "Titre": "great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shonna Adams",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T22:37:10.000Z",
          "Titre": "Online order was easy and came in a…",
          "Contenu": "Online order was easy and came in a fast timeframe.  Will continue to order!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delilah",
          "Nb_Reviews": 4,
          "Date": "2023-03-17T23:49:37.000Z",
          "Titre": "Service was quick",
          "Contenu": "Service was quick, price was reasonable, and I was assured of getting an OEM product."
        }
      ]
    }
  ]
}