{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "torguard.net",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon Warning IMLIGHTING LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:13:22.000Z",
          "Titre": "I didn't order it",
          "Contenu": "I didn't order it. You hadn't expired card and you managed to charge me anyway. Still waiting on refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:08:23.000Z",
          "Titre": "Shady billing & support - Effe' Torguard!",
          "Contenu": "I had the service for nearly 10 years and found that recently that I had been double billed.  Jordan was helping (here's the ticket I was working from:  Ticket ID: 28956) and had promised to talk with mgmt to see what he could do about merging the accounts & possibly working out some kind of deal... Someone named Thomas from another shift got involved, refused to advocate to mgmt, refused to merge my accounts, offered me a $10 discount on 2 years of additional service on top of the year I was already paid thru, and when I said I'd pass, he cut my access the day before it was even supposed to expire.   All of my devices that were connected hit a brick wall which shutdown my house.  I still had another year of paid service on the other contract, but he also blocked my IP (which I assume also is working to block my MAC address when coming from another IP address).... To conclude, I have an account that's paid thru Decemeber of 2024 but i can't use it because this wanna-be-marketer-know-it-all-control-freak has taken over my account.  I'm posting about it on social media and gamer forums.  Effe' Torguard!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ross Giddings  Meighen Windsor",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:32:17.000Z",
          "Titre": "I removed my credit card info because I…",
          "Contenu": "I removed my credit card info because I want to leave your service. And now I am getting emails warning me to pay."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Ruby",
          "Nb_Reviews": 5,
          "Date": "2023-11-25T06:00:46.000Z",
          "Titre": "Unable to pay invoices with CC",
          "Contenu": "Unable to pay invoices with CC.  The dropdown only had crypto options despite multiple interactions with CS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Low Ryder",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T08:12:10.000Z",
          "Titre": "Can't logg on to pay you and it says I…",
          "Contenu": "Can't logg on to pay you and it says I don't have an account by email your lost"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "L.Nilgo",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T01:57:25.000Z",
          "Titre": "the worst VPN I've ever seen.",
          "Contenu": "the worst VPN I've ever seen.almost no support for P2P, tunneling is non existent,your true DNS is almost always leaking, most websites and services block TorGuard's VPN and without split tunneling your only choice is to disable it.waste of money."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Xiaopong Tran",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T15:02:46.000Z",
          "Titre": "I subscribed to TorGuard as my wife is…",
          "Contenu": "I subscribed to TorGuard as my wife is traveling to China and she needs to access her google mail. I had reviewed your product description and reviews from other users that it would work in China, unfortunately, that's not the case. It shows that it's connected to your vpn server, but it does not connect to the internet. We had tried to connect to many servers, none of them work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zahra",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T06:51:32.000Z",
          "Titre": "I dont understand why I am being…",
          "Contenu": "I dont understand why I am being charged for TorGaurd. I deactivated my accouny a while ago and I am not willing to purchase it again."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Jaran",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T14:24:36.000Z",
          "Titre": "Corrupt VPN Provider - Torguard Scam",
          "Contenu": "TorGuard does ban users for sharing a 32 connection account with your parents and it's against their ToS. Do not USE, they will find an excuse to ban you. SCAM ALERTI'm very dissatisfied and will pursue legal action"
        },
        {
          "Note": 1,
          "Lieu": "LU",
          "Pseudo": "Vahid Wasp",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T06:57:48.000Z",
          "Titre": "This app and service is a real scam",
          "Contenu": "This app and service is a real scam. I purchased an 8-user account and personally installed it on 8 devices of myself and my family members and did not even share the account password with them. After a few months, their ridiculous firewall suspended my account due to exceeding the number of simultaneous connections, and no matter how many support tickets I filed that I didn't violate your ToS, they just accused me of reselling the account without providing proof."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Leroy",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T08:14:21.000Z",
          "Titre": "Unusable piece of crap and scam.",
          "Contenu": "Unusable piece of crap.The pricing page sucks and almost forces you into buying the same product multiple times because of a \"bug\" in the UI.Everything is broken and unusable. I bought the Pro package which says I can get a \"FREE Dedicated IP\" and I never got it. Clearly torguard is a scam. What a bunch of a**holes.Desktop client spams you with notifications every 5 minutes when you're disconnected from the VPN. Absolute atrocious nonsense.Also, all the 4-5 stars reviews are fake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous?",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T02:29:15.000Z",
          "Titre": "Awful connectivity",
          "Contenu": "Awful connectivity. When accessing websites, it hangs often. If go to Torguard, it says detecting. Connection is not verified. Even after making verified connection, when I come back seconds layer, it says detecting again and not connected. So if not connected then no VPN? And I'm paying for this service? Nope. Not anymore. I canceled and found a VPN that is more reliable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessie Parker",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T18:20:41.000Z",
          "Titre": "I would not recommend",
          "Contenu": "Disappointed because online reviews were good. I was never able to connect to their VPNs. I sent several support tickets to troubleshoot; zero resolution. Oddly, one person from their Support Ticket team told me to disable my built-in Firewall for MacOS... what?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eliezer Clement / Aliyah Stree",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T11:13:23.000Z",
          "Titre": "Tor guard is not as private as it once…",
          "Contenu": "Tor guard is not as private as it once was. I am identified as M247 now and your VPN is highly detectable. There is a lag. My upload and download rates drop significantly and the VPN always drops while in us and cause my internet signal to disconnect. Additionally there are always problems with my firewall interfering with the VPN signal or the internet connection when the TORGuard is active."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "ShayP",
          "Nb_Reviews": 12,
          "Date": "2023-09-14T21:40:34.000Z",
          "Titre": "wireguard not working / lot of problems…",
          "Contenu": "wireguard not working / lot of problems with drivers tap tun / torguard app buggy laggy slowly / high pings but the price The price accordingly .5 eyes usa not good for privacy"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "eightySix",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T08:45:14.000Z",
          "Titre": "Software crashes Computer/Causes a blue screen of death",
          "Contenu": "Cause countless Crashes and blue screen error's leading my ALOT of lost work from corrupted or lost files. First year is worked well, then an update came that just straight f*cks me over after it connects and crashes my computer (Blue screen of death)/restarts my PC without even a chance to save or recover what I was doing."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2023-07-12T00:48:22.000Z",
          "Titre": "It disconnected on its own while I was sharing sensitive files...",
          "Contenu": "TorGuard is there to protect our privacy while sharing files in the form of torrents; it's literally their name.How good is a guard when it just stops working? When you return to your computer after an extended period of time, and you see the message \"invalid password\" on your TorGuard. I clicked connect, and it connected no problem. During that extended period of time, I had multiple torrents running...Now guess who has my IP. Why? Because TorGuard decided to just disconnect.Lucky I'm in Canada, and the worst outcome is my internet provider refuses me service. This would still be fatal, as I own a business in a rural community with only one option for the internet (other than Starlink). But if this happened in the USA, I would literally be excreting cement blocks knowing that now my IP address had been captured. Why? Because TorGuard glitched."
        },
        {
          "Note": 1,
          "Lieu": "IR",
          "Pseudo": "Anonymous Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:30:44.000Z",
          "Titre": "bad servise",
          "Contenu": "most of the times it has problem connecting, one you suspend my account for no reason, and I decided not to use it after a while"
        },
        {
          "Note": 1,
          "Lieu": "IR",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T12:55:55.000Z",
          "Titre": "Worst service I ever had",
          "Contenu": "I can't use a month from my account and support always says that there is no problem for other Iranians. But I and my friends have. In addition, many people in that your platform are saying they can't be connected; however, it is not important for Torguard."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Flo Vilmar",
          "Nb_Reviews": 29,
          "Date": "2023-06-28T10:27:44.000Z",
          "Titre": "Gave me a flagged IP, buggy software",
          "Contenu": "I got a dedicated IP. It's so bad. I'm getting more captcha's than before, which means the IP is actually flagged and I'm getting the opposite of the effect that I wanted.The software kicks me out all the time, it's super unstable - this is not normal with other VPNs."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T13:33:30.000Z",
          "Titre": "Awful, subpar product",
          "Contenu": "Awful service. First off, Torguard provides really crappy service (it's always lagging; disconnects constantly; and takes 5 minutes to log onto a server). It's not worth the subscription price. What's more, their customer service is awful. When I tried to cancel my subscription, they refused to cancel. The company is probably bleeding customers, which explains their horrible customer service and refusal to refund customers for their lousy product. Avoid this company like the plague."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Mason",
          "Nb_Reviews": 4,
          "Date": "2023-07-28T02:24:02.000Z",
          "Titre": "Lies Lies Lies",
          "Contenu": "I was told that the torrent proxy service doesn't offer any protection at all (you can review the email exchange). I  cancelled my service and was charged without my consent. Please refund ASAP."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "G.p",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:37:52.000Z",
          "Titre": "poor service and speeds (useless)!",
          "Contenu": "poor speeds & packetloss and not enough servers, was difficult to setup port forwarding. also when connecting to a specific country it doesn't give it's locations IP address and DNS accordingly."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "iHàmi Official",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:55:33.000Z",
          "Titre": "Unfortunately",
          "Contenu": "Unfortunately, this app does not work on iPhone in Iran"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marshall Sam McLeod",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:05:05.000Z",
          "Titre": "low price but low quality",
          "Contenu": "low price but low quality. slow speeds, blacklisted by many websites, connection problems using macOS desktop app. avoid this vpn."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Scott Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T12:10:28.000Z",
          "Titre": "I decided not to renew my plan",
          "Contenu": "I decided not to renew my plan, had 5 days left and reached out to support.  They cancel the auto-pay no problem, but then they just canceled my account.  Why?"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "elmira pourabrishami Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T08:08:13.000Z",
          "Titre": "Nothing Worked",
          "Contenu": "I am from Iran and bought this proxy since it had v2ray. I had very much hope that it would work and the speed would be good. The thing is, literally, none of the protocols or the ways worked. I have tested them with different internet providers and even shared them with some experts who spent days trying everything. The ones that did work their speed were so slow that they couldn't open a web page properly. I was truly disappointed."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Ruben Canals",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T05:46:36.000Z",
          "Titre": "It never works on my phone",
          "Contenu": "It never works on my phone. It doesn’t work either in camouflage mode to be able to watch apps like Netflix as if you were in the country that you selected the server for. Connection are never stable nor fast."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "m dry",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T18:41:34.000Z",
          "Titre": "scam vpn service",
          "Contenu": "scam vpn service . i bought annaul premium account for 8 device two month ago they suspend my account with no reason . then after my ticket for suport .they just said you had many connection and they removed my plan .i had logging sessions on 6 or 7 device.they did't answer any of my question .this is really scam"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Marky",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T19:16:05.000Z",
          "Titre": "Torguard block my account",
          "Contenu": "Torguard block my account , they say im a spy and work for iran intelligence gov, what? i dont have much money and need to have my money back but no respond my support email. im regular person with family."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T18:17:31.000Z",
          "Titre": "I put this on my Mac Mini M2 chip…",
          "Contenu": "I put this on my Mac Mini M2 chip (brand new) and I couldn't get it to connect reliably. Sometimes it would, but mostly not.  I switched to Private Internet Access.  I will use TorGuard on my linux box."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T23:11:31.000Z",
          "Titre": "Total incompetence!",
          "Contenu": "I didn’t purchase it- you keep invoicing me to renew and I keep telling you I don’t want it!!!!!!! How often will I have to tell you morons to stop trying to bill me for something I don’t want!!!!!!!!!!!! Get your shot together and stop harassing me!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T00:37:46.000Z",
          "Titre": "Dishonesty",
          "Contenu": "I repeatedly asked you not to charge my card for Dedicated IP Service as it consistently failed to connect and yet you went ahead and charged twice. Then you refused to refund, which is a shame me. That's called bottom feeding"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T09:23:56.000Z",
          "Titre": "worst VPN of all",
          "Contenu": "worst VPN of all , i live in Crimera  , some of the services suffer from restrictions , guess whot , TORGUARD will NOT help you with that , they even rufuse to give me my money back , since i payed with Bitcoin DONT BUY IT!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "dont worry about my name",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T03:57:46.000Z",
          "Titre": "everything is good except a lot of…",
          "Contenu": "everything is good except a lot of their IP address has being banned by many website due to many user abusing it.  i mean its not their fault but clients fault."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T01:58:54.000Z",
          "Titre": "I did NOT authorize this transaction",
          "Contenu": "I did NOT authorize this transaction, I do not wish to have any of your services .Please refund within 24 hours or I will be launching a CC dispute."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SYSAdmin",
          "Nb_Reviews": 15,
          "Date": "2023-05-30T14:07:09.000Z",
          "Titre": "HOW IS torguard vpn service ? OMG biblic times very loong to get a support !!!",
          "Contenu": "torguard vpn service ?we have tested in deep theyr services and discovered that:the only good thing they offer are that's 20 portthey offer... same thing do airvpn already reviwed.theyr app is just poor and not let you see the down/upspeeds in real time and in the server list not show the ping.just a C***p app.theyr protocolls are just wireguard and open vpnbehind our test very very not reliable and no stable.so the vpn tunnel disconect in random way...the guys at support exchange you a paying customerfor a beta test so they will fill your timewith test after test leting you lost so many timewith theyr bad suggestions trying to fix nothingof nothinf for weeks.yes they are fast to respond in tickets but theyrreply are all unless without a real solution.they offer you so many services vpn to monetize as musch they can :-)in support tickets seem they are all bots...there is not logic with the support.these support guys at the end goes in looprepeating and offering same questions/aswers.having a very very bad jurisdcition , USApay attention to select and choice this service.it have only as good the ports fowarard thing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T23:11:25.000Z",
          "Titre": "Did not answer my final question about…",
          "Contenu": "Did not answer my final question about why WireGuard tunnel stopped working. Also, no comments regarding DL speeds using the various tunnels."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DD CC",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T01:49:08.000Z",
          "Titre": "Stealth connections don't work on iOS",
          "Contenu": "For one year (!!) now Torguard can't get their Stealth services working properly on iOS - while they are fine on Desktop and Android. Other Stealth-type VPNs work fine on iOS. Torguard needs to clean up their act!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Meyer",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T15:10:50.000Z",
          "Titre": "Could not get the service to work in…",
          "Contenu": "Could not get the service to work in the US, but the tec support team took there time from multi emails to help me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T17:33:29.000Z",
          "Titre": "Don’t use websites any more with visual…",
          "Contenu": "Don’t use websites any more with visual test software to verify non-bot status"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T22:17:14.000Z",
          "Titre": "I guess I got refunded but it took a…",
          "Contenu": "I guess I got refunded but it took a month of haggling over emails to not feel completely ripped off so yeah not a good experience at all I will certainly never look at this company for anything ever again"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Paul Johanson",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T13:36:43.000Z",
          "Titre": "Flaky connections",
          "Contenu": "Flaky connections. Servers which are not clearly identified as being suited to a specific purpose. Hard to change settings without disconnecting."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Soheil Behnam",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:59:37.000Z",
          "Titre": "Suspension",
          "Contenu": "Because without any alert, tgey suspend our accoubt"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "hossein . Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T09:58:02.000Z",
          "Titre": "I can't connect and it's very difficult"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roberto Guzman",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T22:57:28.000Z",
          "Titre": "Even though I had to try and get this…",
          "Contenu": "Even though I had to try and get this issue resolved. When I turn on VPN, it seems like certain apps that I cannot open. I have to turn VPN off in order to access an app."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "dennis",
          "Nb_Reviews": 3,
          "Date": "2022-11-19T06:54:17.000Z",
          "Titre": "Regards refunds.",
          "Contenu": "Requested a refund same day as bought to try it out, charged me 15.72. asked if it was ok to refund me 8.99? Said 7 days money back on their website. Let's see how it goes but seems to be an unfair company. Outside this their customer service was quick to relpy, and helpfull. Once it started about refunds, the replies became very slow...Edit: It's also funny how their customer service replies when from very quick to suddenly very slow. hidden things in the Ts and C's, instead of being transparant. Then say full money back excluding sales tax and dedicated IP. And then you should trust a company who does this kind of practices to keep your anonymity? It's been years since i have heard of such a way of deceiving people."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Abbas",
          "Nb_Reviews": 5,
          "Date": "2023-11-25T19:21:04.000Z",
          "Titre": "Good but not enough",
          "Contenu": "Very understanding and responsive support team but the windows and android app is very buggy and have connection issues.Hope they update it regularly"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Jay Wu",
          "Nb_Reviews": 3,
          "Date": "2023-02-28T12:23:08.000Z",
          "Titre": "SCAM - Tor Guard encourages account sharing then suspends account for sharing with family,",
          "Contenu": "If you thought you can share the VPN account with your family, you are wrong, Tor Guard is suspending account for it!Their deceitful ads should reflect that these VPN accounts are for personal use only,I purchased an annual premium package with 30 simultaneous connection for my family in a country with severe censorship, I don't use it at all myself, and this is for them to be able to access internet.Purchasing a premium package with 30 simultaneous should assume you can share it with your family, there is no way you need 30 simultaneous connection if it was for personal use only. They advertise the great deal of simultaneous connection to entice users to buy it, and they ban it for sharing the account.The customer support had the audacity to not refund the money or reactive the account.Their deceitful ads should reflect that these VPN accounts are for personal use only,"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Jay Wu",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T01:10:42.000Z",
          "Titre": "TorGuard does ban users for sharing account with others",
          "Contenu": "TorGuard does ban users for sharing account with others and it's against their ToS. Do not USE, they will find an excuse to ban you. SCAM ALERT"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leon",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T01:07:09.000Z",
          "Titre": "They keep trying to bill me when I…",
          "Contenu": "They keep trying to bill me when I already canceled. Not interested and do not want service but I keep getting billed!"
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Jae",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:40:56.000Z",
          "Titre": "No connecting by any means and when I…",
          "Contenu": "No connecting by any means and when I ask for a refund - after 3 days - they don't answer."
        },
        {
          "Note": 1,
          "Lieu": "IR",
          "Pseudo": "Farhad Ghorbani Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T06:44:59.000Z",
          "Titre": "The time of connection wa too long and…",
          "Contenu": "The time of connection wa too long and the speed wasn't satisfactory also"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jon Bramley",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T18:55:10.000Z",
          "Titre": "Your system is not working for me",
          "Contenu": "Your system is not working for me. I cannot obtain UK TV services"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mark thorson",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T08:44:14.000Z",
          "Titre": "The irony of a no log VPN sharing data…",
          "Contenu": "The irony of a no log VPN sharing data (without your permission) to spammy crap like trust pilot 🤣😂 time to look for a new VPN provider."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Unknown",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T15:55:05.000Z",
          "Titre": "Very slowwww VPN",
          "Contenu": "Very slowwww VPN, to every connecting point... not even 5Mbps throughput down slowww"
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T08:19:46.000Z",
          "Titre": "You suspended my account and i still…",
          "Contenu": "You suspended my account and i still dont understand why"
        },
        {
          "Note": 1,
          "Lieu": "IR",
          "Pseudo": "Amir",
          "Nb_Reviews": 6,
          "Date": "2022-10-30T11:07:24.000Z",
          "Titre": "Worse customer service",
          "Contenu": "I wanted to purchase this service but i was not sure if it is working for my country or not so I emailed the customer service asking exactly what I want and they said their service is working fine. So I purchased the service and It didn't work when I emailed the customer service about it they asked me to buy another app and they said previous methods are not working but the funny thing is I just asked them before purchasing. I informed them about it and they didn’t even care for simple apology. It is not easy to pay from my country and it is costly and they made me lose some money but if they just could have informed me before purchasing then I could save the cost. The customer service person keep changing and it is a mess to answer correctly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Xexdurp",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T08:06:01.000Z",
          "Titre": "Spam",
          "Contenu": "How many damn emails you guys gonna keep sending telling me to renew my membership seeeeeesh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marianne Webb Marianne Webb AP",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T07:19:37.000Z",
          "Titre": "Not worth the hassle of signing on",
          "Contenu": "Not worth the hassle of signing on. I hope to figure out how to get rid of it and save the money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevins Smithly",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T18:54:41.000Z",
          "Titre": "Stopped supporting torrents",
          "Contenu": "You stopped supporting torrents. :( There are many legal uses for torrent technology and not having access to it via vpn is disappointing."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "jack agfsdgagsa",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:11:06.000Z",
          "Titre": "didn’t even work"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "First Time Victim",
          "Nb_Reviews": 6,
          "Date": "2022-10-18T21:41:32.000Z",
          "Titre": "Not good for me",
          "Contenu": "Not good for me. Switched to NordVPN years back after duelling PC, web and Android clients kept locking me out of my account. Unwanted auto-renewals should stop now that credit card has aged out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T02:24:15.000Z",
          "Titre": "Hard to understand and use product…",
          "Contenu": "Hard to understand and use product effectively and efficiently."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "gerald lumm southwind corp.",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T04:44:57.000Z",
          "Titre": "Torguard no longer usuable. Tech support not able to help.",
          "Contenu": "Torguard worked for several years on my Asus Vivobook. Then suddenly it would not log on, just kept bouncing from wait to reconnecting ad nauseam. By accident I discovered that if tried a second attempt it would work. That lasted for a few months. It was inconvenient but at least usable. Now it will not log on at all. I've been communicating with Torguard to no avail. Their suggestions have been fruitless. I uninstalled Torguard and installed it again from their website. Again, to no avail. I am shopping for a different vpn now. I will cancel Torguard before the next billing cycle."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "agustin pedro lagos",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:33:07.000Z",
          "Titre": "I requested a cancellation yesterday…",
          "Contenu": "I requested a cancellation yesterday and you bill me todat, i want a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maynard Thomson",
          "Nb_Reviews": 3,
          "Date": "2022-08-28T18:19:15.000Z",
          "Titre": "Not For The Technically Unprepared",
          "Contenu": "I've used Torguard for several years.  Last year I canceled it because of repeated problems understanding all the bells and whistles.  When something goes wrong, the help staff sends advice filled with terms that mean nothing to me.  You should prepare a video, or at least written instructions, that explain to those who aren't technically advanced what the myriad controls mean.  I don't even know how to select the optimal server."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Seyedpouria Hashemi",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T08:27:27.000Z",
          "Titre": "Your services not working in iran"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SERGIO",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T04:40:43.000Z",
          "Titre": "No Way In",
          "Contenu": "I haven't been able to log in for months. It's so secure I can't get back in."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T07:46:32.000Z",
          "Titre": "vpn almost never work for last 1 year"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hoss Mostafizi",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T19:05:47.000Z",
          "Titre": "It did  not work in Iran",
          "Contenu": "It did  not work in Iran. We paid for something that did not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Imtiyaz Ghoghawala",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T02:26:51.000Z",
          "Titre": "Bad customer service very lousy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eliezer Clement / Aliyah Stree",
          "Nb_Reviews": 2,
          "Date": "2022-07-28T17:20:06.000Z",
          "Titre": "The cost is well more than the average…",
          "Contenu": "The cost is well more than the average that is available. The quality is lacking in comparison. I am identified and no longer able to hide my IP address. Services that I was able to use in various locations including the US are no longer available and there is no customer support from your company."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Pat",
          "Nb_Reviews": 2,
          "Date": "2022-07-02T23:09:17.000Z",
          "Titre": "Does not work",
          "Contenu": "Does not work. At least not when one's phone has \"professional\" spy software on it and the provider is working together with those who put it on your phone. Not secure at all. Maybe useful for normal circumstances, but then why use it at all?!Mobile phones have a faulty design and no VPN will solve that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ghenadie Turcov",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T21:21:58.000Z",
          "Titre": "No answers for my request in chat",
          "Contenu": "I have a question related to the payments I made. I left the message in the chat. Nobody reached out to me yet, despite that it was more that enough time. I think I will start looking for another vpn service provider after several years of being loyal customer."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Allisen Brown",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T01:16:47.000Z",
          "Titre": "I paid for an extra 3 years when I did…",
          "Contenu": "I paid for an extra 3 years when I did a Black Friday special and now I keep getting a bill for an additional amount and my service was suspended. Fraud"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Clark",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T17:52:59.000Z",
          "Titre": "Really starting to doubt the usefulness…",
          "Contenu": "Really starting to doubt the usefulness of Torguard. My IP address was leaked or it wasn't properly shielded. This happened several times. Very disappointed and defeats the purpose of having a VPN. Would not recommend.Edit 1: Saw the reply from Torguard. Let's just say I've never had this problem with other VPNs... But I will contact Torguard's customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steven Willis",
          "Nb_Reviews": 6,
          "Date": "2022-10-10T15:33:52.000Z",
          "Titre": "Constantly disconnecting",
          "Contenu": "Constantly disconnecting, so not to be trusted. It's a bit of a headache to constantly ensure that the VPN is still connected."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T04:36:09.000Z",
          "Titre": "I wanted a dedicated VPN for Dallas and…",
          "Contenu": "I wanted a dedicated VPN for Dallas and everything was fine for a month until one day I checked and noticed the VPN location was in Moldova.  I exited out, came back and again it was in Moldova."
        },
        {
          "Note": 1,
          "Lieu": "IS",
          "Pseudo": "Simon Simplex",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T22:00:28.000Z",
          "Titre": "I had to switch to a different product.",
          "Contenu": "I updated to the latest version after having TorGuard for many years.  The latest version simply did not work.  Outside DNS servers had access to my computer plus my IP address was sometimes not cloaked.  No excuse for this since TorGuard used to be a reliable product."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Michael Hummel",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T05:35:24.000Z",
          "Titre": "Horrible VPN - Gonna find better service",
          "Contenu": "Horrific customer service even after 4 years as a customer. TorGuard changes thier settings (Socket) Does not send out an email notifying anyone, then when I purchase the 10gb service which says it works for Sock5, and it does NOT.they won't refund me - QUOTUNG thier \"Terms of Service\"."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "William Geddis",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T12:03:55.000Z",
          "Titre": "Have tried to delete my account on…",
          "Contenu": "Have tried to delete my account on numerous occasions but still being bombarded with invoices & daily reminders. NO ONE IS LISTENING!! 😡😡😡Your reply says a lot about your company! I raised an account deletion ticket, I was asked why I wanted to cancel, I told you because your product didn't work, I said go ahead & delete, you DIDN'T!! 😡😡  Instead you opted to ignore my request! I have screenshots of every email to back me up. Trying to put the blame on me is low, shame on you!"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Lucio Silva",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T13:41:09.000Z",
          "Titre": "FU CKIN' THIEVES",
          "Contenu": "FU CKIN' THIEVES. I ASKED THE CANCELLATION OF THE SERVICE AND THEY DID NOT RETURN THE UNUSED DAYS.Edit:GO TAKE IT IN YOUR ASS THIEF. I AM NOT COMPLAINING ABOUT THE MONTH I USED. THE SECOND MONTH WAS CHARGED AND I ASKED FOR CANCELLATION. YOU HAVE NOT REFUNDED UNUSED DAYS.Edit:NO PROBLEMS JAMES. GIVE THE MONEY TO YOUR MOTHER'S WHO RE."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Y.K.",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T12:08:01.000Z",
          "Titre": "AVOID Customer service is very bad",
          "Contenu": "Customer service is very bad. They don’t adhere to the 14 day return requirement of the eu when their service doesn’t work as required. Even after cancelling everything, they still charged another year so I’ll have to deal with their bad service once more. Absolutely avoid these, their vpn and dedicated IP’s do not work. There are services who are much cheaper, with fantastic customer service and who actually work. (PrivateVPN, nordvpn,…)"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Rusya Magdi Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T10:49:07.000Z",
          "Titre": "vi pidarasi"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tristan Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T17:04:35.000Z",
          "Titre": "Service is good. After sales support is not.",
          "Contenu": "I ordered Torguard when you were offering the firestick as a bonus With a router for $10 extra. I ordered both and never  received the products. I enquired several times and was told that you were  no longer shipping the firestick even though it was still being advertised on your website. Not happy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Lavoie",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T22:48:55.000Z",
          "Titre": "used to be a great product",
          "Contenu": "used to be a great product, added features wether you wanted them or not. hard to disable/turn off the added features. made watching some purchased streaming sites unusable. I paid for a year like I have in the past but only used a few months because of the crap they added."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmy",
          "Nb_Reviews": 2,
          "Date": "2021-09-19T00:08:11.000Z",
          "Titre": "App never worked",
          "Contenu": "App never worked. For some reason Torguard just did not want to connect on my pc and it was far too much of a hassle to google around and try to solve the problem. Shame because I heard lots of good things ahout it and the price was better.Anyway, switched to a different service that is a lot easier to manage and has a better design/layout as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie Beauregard",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T00:39:23.000Z",
          "Titre": "Don’t waste your money!",
          "Contenu": "The last thing I want is to renew with this company! 1. I didn’t authorize a renewal 2. Never received promotional products from first purchase. Just used the excuse of Covid! 3. Got tired of going back and forth with the company for 6 months. I finally gave up, that seems to be their goal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Slim",
          "Nb_Reviews": 2,
          "Date": "2022-02-19T18:07:50.000Z",
          "Titre": "Takes too long to connect, drops connection.  Speed reduced by 75 percent while connected.",
          "Contenu": "Takes too long to connect.  Drops connection often after connected. While connected speed drops by 75% or more. Product has become very bottom of the barrel.After using this service for 3 years,  I requested my account be closed. This service has no value to me."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "DirtyCandy",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T09:08:21.000Z",
          "Titre": "Programs that don't use a quarter of the time",
          "Contenu": "After purchasing a 2-year license,I haven't used it for a year and a half due to program problems, but this company still hasn't solved my problem.And they charge new money."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Ian Chong",
          "Nb_Reviews": 2,
          "Date": "2021-08-22T03:20:31.000Z",
          "Titre": "Since the latest update",
          "Contenu": "Since the latest update, I have found my torguard service almost unusable. It runs well enough immediately it's connected but within a minute it will start to drop connections .... every few seconds and keeps on doing this continuously.Am considering dropping this service which I've been using for at least 3 or 4 years now."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bad Company",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T16:38:54.000Z",
          "Titre": "Residential IPs aren’t",
          "Contenu": "Dedicated residential IPs are just regular data center IPs that will get flagged as a VPN - Dope false advertising!Edit: The IP is from an ASN that is a data center. Again - any streaming platform worth a cent will check for that and disallow the connection, which is the exact opposite of what your marketing claims. Edit: Residential IPs are classified differently, your IPs are classified as hosting/business when checked, it’s very simple. I’m shocked at this companies technological illiteracy.Edit: James I’m using IPInfo.io and data from YouTube TV and other streaming services that should work with a residential IP but do not based on my previous edits."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ross Curtis",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T07:40:58.000Z",
          "Titre": "I refer ticket #417111",
          "Contenu": "I refer ticket #417111I am still unable to connect.Keep getting the message; incorrect user name or p/wGo round and round in circles, making no progress attempting to change p/wHaven't been able to connect since I subscribed to the annual plan way back when.Not happy Jan!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Warwick Ingram",
          "Nb_Reviews": 4,
          "Date": "2021-09-29T08:07:33.000Z",
          "Titre": "I paid but still could not use bet365…",
          "Contenu": "I paid but still could not use bet365 while abroad. I think this was because I set it up while I was away and not when I was in the UK but that was not explained to me before purchase.I have cancelled my contract but you sending me emails saying you taking money, if you do I will sue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "conrad warren",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T18:54:11.000Z",
          "Titre": "Service was renewed without my…",
          "Contenu": "Service was renewed without my authorization.  Service does not work properly.Edit: I didn't need to check with support to find out why it wasn't working, it was in the news.  Torguard blocks torrent traffic."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Araz Hakan Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T08:26:33.000Z",
          "Titre": "toguard is week"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Fuck Joe Biden",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T14:42:36.000Z",
          "Titre": "blocked and blacklisted so often. Slow speeds, inconsistent speeds, frequent disconnects.",
          "Contenu": "blocked and blacklisted"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JD VIGIL",
          "Nb_Reviews": 2,
          "Date": "2021-07-09T21:46:18.000Z",
          "Titre": "Horrible they increased the prices 5…",
          "Contenu": "Horrible they increased the prices 5 times for slow unreliable hacked serviceThey responded by saying they weren't hacked https://www dot pcmag dot com/news/nordvpn-torguard-hit-by-hacks-involving-insecure-serversPC mag says otherwise.   BeetVPN, AirVPN, SurfShark heck even CactusVPN is less than the $29.99/month they want to charge!Notice...they didn't say anything about being slow.    S L O W.   And if they ever post anything about ANYONE's account you know they are untrustworthy.   What a garbage company."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Hamid Shirvani Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T06:51:45.000Z",
          "Titre": "It's always \"Reconnecting\" without any…",
          "Contenu": "It's always \"Reconnecting\" without any understandable message indicating the problem. poor GUI."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Paul B",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:49:44.000Z",
          "Titre": "The Torguard app works well for some…",
          "Contenu": "The Torguard app works well for some devices and not others.  Please fix the countless connection issues with the app for FireTVs available through the Amazon app store and update it. The currently available version has not been updated in a long time.  The previous version worked much better.After years users still have no way to identify which servers are bogged down and which ones aren't.  I have to connect, run a speed test, disconnect, try another server, run a speed test, disconnect, try another server, run a speed test, etc, etc, etc.   Express VPN has had this feature for many many years now."
        },
        {
          "Note": 2,
          "Lieu": "IR",
          "Pseudo": "Anonymous Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:05:33.000Z",
          "Titre": "90% of the servers stopped working and…",
          "Contenu": "90% of the servers stopped working and those that worked were very slow and almost useless. I had to purchase another VPN."
        },
        {
          "Note": 2,
          "Lieu": "FI",
          "Pseudo": "Janne  Helin",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:50:29.000Z",
          "Titre": "payment options were too limited"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:24:31.000Z",
          "Titre": "So difficult",
          "Contenu": "I could not use it well in Russia, thank the support, but too difficult"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T19:09:35.000Z",
          "Titre": "No split tunneling after years of waiting.",
          "Contenu": "I've been a long time Torguard user and it's been unacceptable to not support split tunneling when every other provider does. It's been pending for years that split tunneling is coming to the windows client. This is the main reason why I cancel my service. VPN is useless without being able to access my PC remotely on my local network."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:07:52.000Z",
          "Titre": "I have been using Torguard for years but..",
          "Contenu": "I have been using Torguard for years. Recently a update caused the program to be not compatible with Utorrent. I followed the steps posted to fix but it still doesn't work. I opened a ticket over a month ago and still haven't received a response. I would not purcahse Torguard again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DeltaGolf",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T02:42:18.000Z",
          "Titre": "Slow mo",
          "Contenu": "Your tool slows my system down soo much that I only use it when I’m doing things that require absolute security. I will try your new STEALTHPROXY promo and see what happens."
        },
        {
          "Note": 2,
          "Lieu": "LV",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T05:01:44.000Z",
          "Titre": "I have 500mbs connection",
          "Contenu": "I have 500mbs connection. Proved by Ookla's speedtest. Brazilian private ip gives me about....0.3 mbs. And regularly connection crashes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ronnie rogers",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T06:00:19.000Z",
          "Titre": "I bought this program many years ago…",
          "Contenu": "I bought this program many years ago and it would work on my MacBook Pro but I wanted it to work on my desktop and for some reason the installation instructions you have given me I’ve never worked on that MacBook desktop.   Maybe you can email me instructions so I can try again. I just gave up. Thanks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E. Taft",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T15:44:34.000Z",
          "Titre": "2 star service as it stands",
          "Contenu": "-1 star for never sending the VPN router that was part of the deal when I was new to the service and never responding to my case on the issue.-1 star for pushing forward with a project that had you changing IP addresses that you failed to ensure would properly geographically locate.  When I raised concern over not being able to access US sites your advice was to use my static IP, a solution for one computer.  This diminished the value of the service to me.-1 star for the wild fluctuations in speed across various sites and inability to maintain a connection to some.  I'm not talking about extremes like US vs Asia, I'm talking regional US sites like TX, GA, FL, NY and NJ.+1 for connection software, easy to use, lots of features+1 for offering access to so many sites worldwide and the cost if the service when everything works properly My overall impression however is that I'm going to try other services to see if I find one that is a better fit for me rather than continue with this one."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "richard",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T01:19:58.000Z",
          "Titre": "The app constantly crashes and takes…",
          "Contenu": "The app constantly crashes and takes upto 6 or 7 attempts to start. I’m always left thinking I should try another provider but I have to say when I run an ip test once it’s running it does work and does the job. On the laptop it’s also hit and miss if it starts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Lytton  Astrea Place",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T05:50:17.000Z",
          "Titre": "I seem to keep losing my ability to…",
          "Contenu": "I seem to keep losing my ability to connect.  I get failure notices when I try to log in.  The help desk people are helpful but it typically takes numerous back and forth notes to get me back on-line."
        },
        {
          "Note": 2,
          "Lieu": "IR",
          "Pseudo": "Mohammad Mohammadi Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T06:20:45.000Z",
          "Titre": "Your vpn quality has been decreased since begining"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Todd Hamilton",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T22:46:19.000Z",
          "Titre": "Speeds are terrible",
          "Contenu": "Speeds are terrible. Spent half an hour speaking with support trying different settings with no change in speed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T. Newell  Health Care",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:30:25.000Z",
          "Titre": "The software requires users to have…",
          "Contenu": "The software requires users to have local admin rights to run the software. This is problematic with our security."
        },
        {
          "Note": 2,
          "Lieu": "HU",
          "Pseudo": "Igor Nikolaev Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:42:51.000Z",
          "Titre": "Lots of servers are unavailable on all…",
          "Contenu": "Lots of servers are unavailable on all protocols"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Colin Silver",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T01:32:59.000Z",
          "Titre": "support does not know the settings…",
          "Contenu": "support does not know the settings needed for openvpn on a router even using you file generation method"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Rand slot Channel",
          "Nb_Reviews": 7,
          "Date": "2022-12-23T07:12:03.000Z",
          "Titre": "Hello I usually use servers Germany…",
          "Contenu": "Hello I usually use servers Germany Malta and Canada for some reason when I connect to them they reduce my streaming or internet connection which is really bad for me"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T01:21:17.000Z",
          "Titre": "Lost connection",
          "Contenu": "Lost connection, wouldn't reconnect without restarting, no kill switch when connection lost. Went elsewhere, got better product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ted Wright",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T06:24:20.000Z",
          "Titre": "No iPhone protection Hawaii and Fiji",
          "Contenu": "I have just been in Hawaii and Fiji. On my iPhone, where I needed your service, you app showed only a black screen. When I return home I will cancel my subscription"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T00:24:37.000Z",
          "Titre": "Helpful at first, then difficult to get a refund",
          "Contenu": "Support was helpful with getting port forwarding set up but when it wasn't fast enough to host my server, they were very difficult about getting a refund and I didn't get the full amount back since I unknowingly bought a dedicated IP just by using a coupon which isn't refundable."
        },
        {
          "Note": 2,
          "Lieu": "GU",
          "Pseudo": "George Palican",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T22:23:02.000Z",
          "Titre": "Netflix and Hulu detected Torguard and…",
          "Contenu": "Netflix and Hulu detected Torguard and stopped streaming.  Had to disconnect it in order to continue streaming."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Carr AllenCore",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T20:16:06.000Z",
          "Titre": "Freezes and I need to change servers…",
          "Contenu": "Freezes and I need to change servers frequently - considering trying a different vpn"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clyide Amith Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T23:13:52.000Z",
          "Titre": "All connections are slow not good for…",
          "Contenu": "All connections are slow not good for gaming"
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "a.weekes",
          "Nb_Reviews": 4,
          "Date": "2022-11-16T18:06:21.000Z",
          "Titre": "always crashes and many times the vpn…",
          "Contenu": "always crashes and many times the vpn does not work with amazon or other apps."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Benigno Miguel Pacia",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T03:17:44.000Z",
          "Titre": "Vpn was to slow the whole month",
          "Contenu": "Vpn was to slow the whole month. Had a bad experience."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T12:18:22.000Z",
          "Titre": "No good deal",
          "Contenu": "I have been loyal customer for almost 10 years, expected to have better deal for longer plan but unfortunately the offer is not attractive at all. Disappointed."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "AA L",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T19:49:47.000Z",
          "Titre": "You guys were awesome for several years…",
          "Contenu": "You guys were awesome for several years then your support team just turned rude and refused to honor your deals. Have a look at the chat logs you guys lost my business and several of my friends because of that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T05:55:55.000Z",
          "Titre": "Never got my VPN router that was part…",
          "Contenu": "Never got my VPN router that was part of the deal 2 years ago"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "TorGuard user",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T08:59:21.000Z",
          "Titre": "The service started very good",
          "Contenu": "The service started very good. I was really happy with it over few years now. Then there were some app and connection problems, speed problems but it was solved later. Now the IPs of the servers are blocked in many websites and in common engines. Hard to use some times but still works. I have resigned only because I don't use it that much anymore, just few hours in a year maybe."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "D",
          "Nb_Reviews": 15,
          "Date": "2022-04-02T21:02:54.000Z",
          "Titre": "Can be very troublesome getting…",
          "Contenu": "Can be very troublesome getting connected then staying connected and every few months I can’t reconnect and have to redo out all the details. Won’t be renewing and left.The response below is a typical response where the client is constantly mentioned. This set up was on a router so unless you want the client then support is limited to, delete and try again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Barry Boom",
          "Nb_Reviews": 4,
          "Date": "2022-03-14T21:45:11.000Z",
          "Titre": "Reasonable price but was poor service",
          "Contenu": "was never really impressed with there service offerings although was a good price for what they offered at the time. assume still a new company having a lot of what i would regard as rookie mistakes leaving me as a customer without service with no warning. hopefully these issues have since been ironed out and service improved but i have moved my services off Torguard as dont trust they are yet up to the job"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Diana",
          "Nb_Reviews": 3,
          "Date": "2022-03-28T22:44:56.000Z",
          "Titre": "I have tried to contact Torguard weeks…",
          "Contenu": "I have tried to contact Torguard weeks ago, and obviously, noone cared, ie. replied. It was about the VAT in Germany (and thus their invoices) where I keep my company . So it was not only of importance for me, but for them also. Support takes a big part in a customer's relationship which is why I am thinking about changing the provider."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kim Dandridge",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T21:26:20.000Z",
          "Titre": "When it worked",
          "Contenu": "When it worked, it worked fine, but if I went away from it for any length of time, I had to contact Torguard and it was back and forth to get me an ISP that worked. Makes me think that my assigned ISP was not mine alone.  I finally gave up and cancelled."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wagner Computing Services",
          "Nb_Reviews": 2,
          "Date": "2022-02-21T21:13:28.000Z",
          "Titre": "Port forwarding was not available",
          "Contenu": "I signed up for Tor services on the recommendation from a Discord user who said that I would be able to use a VPN with port forwarding to get a port directed for my Helium miner. I was unable to get the port forwarded as when I tried the TOR system would say that that port was in use and to try another port."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TorGuard User",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T10:51:20.000Z",
          "Titre": "Windows users beware.",
          "Contenu": "I’ve used Torguard on both my computers and phone. On the iPhone, I had the most success connecting to VPN using the Torguard app. Using another app or through the phone settings doesn’t always work. On my Mac, I didn’t get any issues. However, that’s not the case on Windows. Torguard broke my Windows internet connection. I could not browse or download anything if Torguard wasn’t opened. I tried uninstalling/reinstalling Torguard, network adapter, and reset the network settings. Nothing worked, so in the end, I had to reinstall Windows."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Luis Vargas",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T20:14:36.000Z",
          "Titre": "TorGuard failure",
          "Contenu": "I’ve used TorGuard for a few years now but lately, on my MacBook Air, I can’t open any torrents or any internet sites without having to close my VPN and then ounce I’m on it put it back on, this is very inconvenient. I have an iPhone and iPad and don’t have that problem, can you help me ????"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T21:07:41.000Z",
          "Titre": "Streaming services may not be available.",
          "Contenu": "I finally decided to upgrade to a streaming bundle, because it was advertised as available servers in JP and UK, among others. The moment I signup and send my ticket to get JP added, I'm told it's sold out. Even though it's available to add ala carte online. Now I have to message support constantly hoping a space opens up. May not get what you think you are when signing up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Duda",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T16:25:08.000Z",
          "Titre": "Web interface is bad and so many…",
          "Contenu": "Web interface is bad and so many options could not be configured without contacting support. I did not appreciate the predatory subscription cancelling model either, where you can't cancel your autopay without going through support, who told me to just delete my payment method but then you still spam me with bill reminders. Just let me disable autopay and cancel my subscription like a normal service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Curry",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T00:17:49.000Z",
          "Titre": "I purchased the service thinking that…",
          "Contenu": "I purchased the service thinking that it would be good but it was not. On multiple occasions I would turn on the Vpn and later discover that it turned itself off and some of the content I wanted to access it would not unblock it. I also put in a ticket asking my service be canceled and still currently I am receiving emails to renew service. This is my third time stating to cancel my service. Because this  product do not work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TorGuard User Judy",
          "Nb_Reviews": 2,
          "Date": "2021-11-18T20:28:11.000Z",
          "Titre": "Having problems recently",
          "Contenu": "Hi TorGuard, the problem I'm having lately is that the vpn doesn't connect right away, sometimes for a couple of hours, and then I can't use my laptop until it comes on.It didn't always do that just the past couple of weeks.I hope I can depend on it getting back to being good again.Judy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TorGuard User",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T14:55:50.000Z",
          "Titre": "Your service should merit 5 stars",
          "Contenu": "Your service should merit 5 stars. It’s fast, effective, useful, priced appropriately. I’m only giving it two stars, because the primary issue is consistency.I need my electric company to provide power all the time, not just most of the time. Also I expect my internet to work when I need it, however it n a very consistent basis during peak usage it slows to 1-2mbps. This needs to change if you want to earn the other three stats."
        },
        {
          "Note": 2,
          "Lieu": "IS",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T11:58:55.000Z",
          "Titre": "Disappointing and hard to use",
          "Contenu": "Honestly, I did not feel like I had enough \"tech knowledge\" to adequately run this VPN service. There were too many functions- needing to download specific vpn servers because I had the streaming package was confusing. I never was able to access most of what I wanted to stream. This purchase was frankly disappointing."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T00:15:04.000Z",
          "Titre": "Speed is atrocious at times",
          "Contenu": "Speed is atrocious at times. Data dropouts in the Dallas server are frequent. Main complaint is speed. Lots of apps are blocking VPNs so your company needs to do a better job at hiding your IP addresses. Speed and still having lan bypass not working issues that stops the lan pass through after being connected for a long time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "purple haze",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T04:40:13.000Z",
          "Titre": "Expiring wireguard conf files!",
          "Contenu": "The fact that wireguard conf. files can only be used for one login and then expire is problematic when using a 3rd party Wireguard app. The TG macOS desktop app is very buggy, very slow to connect and creates problems on my macbook so I prefer to use the Wireguard app. For this reason I rate TG a 2 or 2.5. Other vpn's I have used do not have expiring Wireguard conf files."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Douglas Burbank",
          "Nb_Reviews": 3,
          "Date": "2021-06-02T00:32:18.000Z",
          "Titre": "Download speeds were all over the board…",
          "Contenu": "Download speeds were all over the board but generally bad (ISP speed 200 MB; VPN 6-100 MB) with more 6 than 100 MB days.Yes it could be my ISP but when I turned off TorGuard and checked the download speeds they ranged 170 - 210 from my ISP. I have no love for my provider but back to back speed test say not them"
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "Konstantinos Vasileiou",
          "Nb_Reviews": 2,
          "Date": "2021-09-09T13:52:35.000Z",
          "Titre": "The service is honest - however...",
          "Contenu": "The service is honest and respects your privacy - unlike other heavily marketed VPN providers. However, the product and especially the Windows client simply suck. It is unresponsive, there is no auto-update (in 2021 one of the few apps that don't auto-update), regularly everything gets disconnected - especially after waking up the PC and you never know why.Support team is responsive but are you inclined to spend hours and hours doing tests across different configurations to find out how to make it work? I don't and neither should you."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Araz Hakan Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T08:26:33.000Z",
          "Titre": "toguard is week"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Private Citizen",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T15:39:46.000Z",
          "Titre": "Overall unsatisfied",
          "Contenu": "macOS client app experience is terrible it hang the system often on start and stopiOS client app is functionally to limitedThe client apps are not open source for code review and TorGuard business not being auditedI won’t bother completing my TorGuard subscription and will take my business to NordVPN very soonWe can say that business audits are a publicity stunt all we want but at the end of the day a security solution provider that has no transparency worries me with all the data mining going on in our era. Just think onavo protect"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Aceson",
          "Nb_Reviews": 1,
          "Date": "2017-09-21T02:55:23.000Z",
          "Titre": "VPN doesn't work at strict places",
          "Contenu": "VPN no longer works at my school I'm about to decide probably not to buy products from TorGuard again I made a ticket and they tried to resolve it every option to do which I did and still didn't work very dissapointed it NO longer works at my school is anyone is looking for an vpn to use at a strict government place this vpn will not work even stealth didn't work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Moore",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T11:53:40.000Z",
          "Titre": "I tried to cancel in time but still…",
          "Contenu": "I tried to cancel(Steaming Bundle) in time but still charged. The service support is good but today is the end the pay period but somehow they charged me before the next pay period. I thought I had time because I messaged support asking how to cancel."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T19:59:25.000Z",
          "Titre": "Many Services already Block vpn",
          "Contenu": "Many Services already Block the torguard ip's. Often sounget good speeds but in bigger live streaming Events they are to slow to even do Basic things"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Hayden",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T07:11:29.000Z",
          "Titre": "Customer service has gone downhill with…",
          "Contenu": "Customer service has gone downhill with no live support. It takes a lot longer to sort problems out as you seem to deal with a new support agent for every reply who asks the same questions.Edit. In reference to the reply below. I have asked to change my dedicated IP address in the past. It had usually been resolved in under two hours. This time, it took at least 14 emails to give me what I had asked for. Each new email or reply with a new person resulted in me being asked the same information over and over again to where I keep stating \"Please read my last reply.\" It was not easy, I felt like I had to fight for something that I pay for and I was disappointed. I delt with the support email address."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T19:06:09.000Z",
          "Titre": "Quality Problems",
          "Contenu": "I have had lots of connectivity problems with TorGuard recently. From failure to connect to extremely slow data rates (sub 10Mbps when connecting over 1Gb Google Fiber links for example), my frustration level has me looking at alternatives."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dale D",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T13:48:27.000Z",
          "Titre": "Disappointed in dropped connections...",
          "Contenu": "Disappointed in dropped connections...I find that the connection is lost without notifying me.I need to do my own monitoring of my internet connection, trying to understand if I'm routing through the VPN or not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T16:52:08.000Z",
          "Titre": "im only giving this 2 stars because  my…",
          "Contenu": "im only giving this 2 stars because  my internet speed was over 400 mbps and when i put on torguard VPN  it dropped to 14 to 19 mbps. when I tried to stream anything it would stop and start had to turn it off."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Marcin",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T17:02:58.000Z",
          "Titre": "Poor of speed..",
          "Contenu": "Poor of speed... That's right, I have about 200 MB of speed, in vpn connection I have only 20... What's wrong?"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "David Carlson",
          "Nb_Reviews": 4,
          "Date": "2022-04-30T04:13:30.000Z",
          "Titre": "Good until no longer required.",
          "Contenu": "I am only rating this low because I no longer need a VPN, but cannot find a way to close my TorGuard account nor am I able to unsubscribe from their emails."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "yyyyy",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T14:14:25.000Z",
          "Titre": "Be aware they dont give refund!",
          "Contenu": "Be aware they dont give refund!, before  i make purchase  they offfer 7 days refund but after purchase by bitcoin on first day of subscription! i make request for refund theay say theay  cannot beacuse refund abuse is currently being attempted by many users?Why they misleading people that they offer 7 days refund?be aware that TorGuard dosent offer refund!From Torguard terms of service: The Client agrees that any refunds for transactions using BitCoins will be assessed on the BitCoin exchange rate to USD at the time of the refund disbursement, and not at the time of the original transaction or refund request. I ask Torguard for other payment refund option theay declined!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jpn streaming IP user",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T07:23:00.000Z",
          "Titre": "Been waiting for nearly 6 months to fix…",
          "Contenu": "Been waiting for nearly 6 months to fix Jpn streaming IP.  I have to keep messaging and get now useful/meaningful update. Also being billed for the IP I'm not being provided"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew S",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T14:02:35.000Z",
          "Titre": "Good program, iffy team and billing",
          "Contenu": "The service itself is great and rather fairly priced, plenty of UI for the average user but also good options for more advanced users. The billing system is a bit clunky, and it took me several emails to cancel an invoice even though I had never enabled auto renew or autobilling however.Edit: (From 3 stars to 2) I have been sent a reply telling me that even though I disabled auto renew from day one and have never considered turning it on for any of the many services I have paid the company for, auto renew is one even when you turn it off as for guard is a “recurring service” so expect to have to navigate emails and stubborn support if you ever choose to stop using the service. Not to mention that support will try to lure you into more purchases when you try to cancel an automatic invoice for which you didn’t sign up. (There are options to disabling auto renew and auto billing, even if you disable them the support team will act as though you kept them enabled.)  However I’d still like to emphasize that the service itself is excellent. Just don’t expect much from customer support."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Nadia R",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T01:43:56.000Z",
          "Titre": "Geo error not resolved",
          "Contenu": "I continue to get geo error when accessing Amazon prime. I've raised this issue with customer support numerous times to no avail. Dissatisfied customer!"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Gaurav Parwanda Arbtech",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T21:05:58.000Z",
          "Titre": "Buying IP’s is a Waist as similar IPs…",
          "Contenu": "Buying IP’s is a Waist as similar IPs still detect the same up as they are form the same batch or sequence..disappointing as it beats the purpose"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "K F",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T22:00:50.000Z",
          "Titre": "SSL Certificate issues",
          "Contenu": "SSL Certificates are constantly expiring on the proxies"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T14:58:38.000Z",
          "Titre": "very slow to connect",
          "Contenu": "very slow to connect. If I put my computer to sleep, when I wake it up ToGuard is frozen and will not work until I restart my computer."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "ok",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T23:38:23.000Z",
          "Titre": "servers are very slow and unstable also…",
          "Contenu": "servers are very slow and unstable also not many countrys to pick from sadly compared to other providers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry  Morton",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T15:38:18.000Z",
          "Titre": "I must change locations of my server…",
          "Contenu": "I must change locations of my server too often. A real nuisance."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "razvan munteanu",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T15:03:03.000Z",
          "Titre": "very slow with remote",
          "Contenu": "While I like the protection and the mechanics of it, the speed when using windows remote  is very slow , which makes it pretty unusable ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Lee",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T02:00:15.000Z",
          "Titre": "Ui is bad",
          "Contenu": "Ui is bad. Speeds are ok, lag spikes occur even when connecting to very close nodes. This is probably my last subbed year."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 6,
          "Date": "2021-09-17T21:01:44.000Z",
          "Titre": "Excruciatingly slow more than half the time",
          "Contenu": "It's ridiculously slow and cheap. VPN research is hell, but use trials and money back guarantees, and find something else."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "itsmeray",
          "Nb_Reviews": 1,
          "Date": "2020-10-18T14:09:39.000Z",
          "Titre": "Im a long time customer",
          "Contenu": "Im a long time customer. I keep the service because I trust that you're not logging and if the MPAA or some other dictatorial group asked for my records you wouldn't provide them. I also enjoy the use of a free secure email account. I was also thrilled when it went back on the Amazon store because the previous process for sideloading it on a Firestick or Cube was very time consuming. So thank you for that. What I don't like is the speed. It's okay for torrents and surfing anonymously but for streaming videos not so much. I ended up signing up with another service just to stream videos and my iptv service. My ISP provides me with a steady 400 down the Tor Guard nodes slow me down into the teens and low 20's while other vpn's consistently have me in the 50 to 150 range. I'd really like to have just the one service and at some point may stop renewing. Trust is what keeps me renewing. If I ever find out you shared information with any countries authorities we will be done."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ju kim",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T00:16:15.000Z",
          "Titre": "clients are way to slow, and app support is very minimal",
          "Contenu": "protection wise it's great, but support for mobile and desktop is either very slow, or just takes too long to setup"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adel Eibesh",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T20:07:15.000Z",
          "Titre": "Happy VPN customer since 2014, Very unhappy dedicated IP customer.",
          "Contenu": "Their VPN service is OK, but dedicated IP service is no good. I purchased 4 different dedicated IP's from them over the years (the most recent one was about 9 months ago), Every single one of these IP's got detected one way or another especially by google captcha everywhere.Which I don't understand why because they are supposed to be dedicated (supposedly Only I get to use them) so how are other people using them :|And IP number 4, I used it for like 2 months just fine, Then they simply blocked HTTP access (because they were getting DDOSed per customer support) and after about 4 months of wait hoping they would restore service soon, I E-Mailed support again and they pretended like the IP I purchased was never supposed to be used over HTTP and said I would not be able to use the IP over HTTP ever again. Which is not true at all and they even detail how to use it on their own website and how to use it with foxy-proxy too. So now I payed $40 for a 2 years subscription for a useless dedicated  IP address. And when I asked for a refund, I was told to hit the door. Never using their services ever again. Not even for regular VPN."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "eightySix",
          "Nb_Reviews": 2,
          "Date": "2021-12-26T18:44:49.000Z",
          "Titre": "since the last update it no longer…",
          "Contenu": "since the last update it no longer connects or if it does it creates errors and blue screen crashes"
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "Muhammad Ali",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T17:30:21.000Z",
          "Titre": "Not working  fine on computer  just…",
          "Contenu": "Not working  fine on computer  just fine for mobiles update your self and customer  care response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "regan",
          "Nb_Reviews": 2,
          "Date": "2021-08-11T20:57:49.000Z",
          "Titre": "intermittantly when im linked to…",
          "Contenu": "intermittantly when im linked to torgard, my internet access using any browser is blocked."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Sharukh Ansari",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T03:01:21.000Z",
          "Titre": "Review",
          "Contenu": "Speed and customer i dont like in torguard and its take long time to connect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T18:45:31.000Z",
          "Titre": "When living in",
          "Contenu": "When living in, my connection would turn off often. It was work to keep connected"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim Warr",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T06:39:05.000Z",
          "Titre": "Torguard does not work anymore on my…",
          "Contenu": "Torguard does not work anymore on my iPhone 12 Pro Max.  I am considering canceling."
        },
        {
          "Note": 2,
          "Lieu": "SK",
          "Pseudo": "Vladis",
          "Nb_Reviews": 3,
          "Date": "2021-12-06T23:34:43.000Z",
          "Titre": "No Vudu and Hulu TV optimalization",
          "Contenu": "No Vudu and Hulu TV optimalization. For US servers is latency too high."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robner Camilien",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T15:26:57.000Z",
          "Titre": "Server keep falling sometimes no signal…",
          "Contenu": "Server keep falling sometimes no signal on it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter Schembri",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T21:02:15.000Z",
          "Titre": "Blocks a number of sites",
          "Contenu": "Blocks a number of sites. Thinking of canceling Confusing to configure"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mmassie",
          "Nb_Reviews": 2,
          "Date": "2021-01-31T14:50:09.000Z",
          "Titre": "Service was great until last year where…",
          "Contenu": "Service was great until last year where connection errors have skyrocketed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 4,
          "Date": "2022-08-02T02:40:07.000Z",
          "Titre": "need some improvement",
          "Contenu": "You guys need the windows to be for 32bits too"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Payne",
          "Nb_Reviews": 1,
          "Date": "2021-08-29T13:15:45.000Z",
          "Titre": "I paid my bill but your app keeps going…",
          "Contenu": "I paid my bill but your app keeps going in and out. No help or fix."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 3,
          "Date": "2021-07-18T18:25:59.000Z",
          "Titre": "Slow and unreliable connection.",
          "Contenu": "Slow and unreliable connection.Barely works on Win 7 and Mac 10.11"
        },
        {
          "Note": 2,
          "Lieu": "CN",
          "Pseudo": "Anson",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T14:14:38.000Z",
          "Titre": "Doesn't work in China",
          "Contenu": "Unfortunately, the service didn't work for me in China."
        },
        {
          "Note": 2,
          "Lieu": "HU",
          "Pseudo": "fx",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T12:11:21.000Z",
          "Titre": "It works ok",
          "Contenu": "It works ok.   but i had problems"
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Dragos",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T14:16:21.000Z",
          "Titre": "to long time to respond and still now…",
          "Contenu": "to long time to respond and still now wotking properly ."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "a.weekes",
          "Nb_Reviews": 4,
          "Date": "2021-11-23T15:13:45.000Z",
          "Titre": "Not worth the money keeps getting…",
          "Contenu": "Not worth the money keeps getting bumped off the app."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 2,
          "Date": "2022-05-17T09:34:06.000Z",
          "Titre": "More than 1 month to get a dedicated IP",
          "Contenu": "More than one month to get a dedicated IP"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "PETER JARY",
          "Nb_Reviews": 7,
          "Date": "2021-08-01T16:55:33.000Z",
          "Titre": "Going to cancel not good nothing works…",
          "Contenu": "Going to cancel not good nothing works very slow"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrei Tverdokhlebov",
          "Nb_Reviews": 2,
          "Date": "2021-01-31T19:52:20.000Z",
          "Titre": "you don't support my old mac any more…",
          "Contenu": "you don't support my old mac any more :-("
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ED Barry",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T00:19:10.000Z",
          "Titre": "Not a happy camper will not renew"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T12:20:50.000Z",
          "Titre": "trouble with windows 10"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "walid barhoumi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:57:46.000Z",
          "Titre": "Good VPN but Bad interface",
          "Contenu": "The VPN service itself was awsome, fast and pretty much reliable. But the main issue that I had was with the application itself, I kept getting an error about the OpenGL driver or something like this and it was quite painful to start the software."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Robert Gaylord  S th Ave",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T00:02:15.000Z",
          "Titre": "It has to be disabled using some online…",
          "Contenu": "It has to be disabled using some online apps to get a proper feed."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Dexa un Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T11:49:39.000Z",
          "Titre": "there update every year its bad thing",
          "Contenu": "there update every year ios app not working in iran just wiregurd working some times android app not working as well as before windows app are so laggy i gave 3 out of 5 star"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T09:08:11.000Z",
          "Titre": "Windows and Android programs work well",
          "Contenu": "Windows and Android programs work well, but the iOS program lags behind those two programs and cannot be used in Iran. The development team of this company does nothing to update it. My opinion is that this company's iOS app is dead"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mehdy Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T06:31:41.000Z",
          "Titre": "When It was working It was great but…",
          "Contenu": "When It was working It was great but sometimes it didn't work at all you had to make more adjustments manually they gave a good discount but when I paid by crypto for only 3 Trx they cut more than one month of service they could just add 3 Trx at the beginning of payment support team were as expectedThank you Torguard"
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Saman ABdi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:17:27.000Z",
          "Titre": "USER EXPERIENCE",
          "Contenu": "Hi... Because of Iran's circumstances, I could barely connect. The speed was also slow. thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Easter",
          "Nb_Reviews": 5,
          "Date": "2023-09-28T14:56:24.000Z",
          "Titre": "The support is good but beware",
          "Contenu": "The support is good, some might say excellent. My problem with Torguard is they didn't honor the refund agreement for premium proxy service trial period. I tried the service and decided it wasn't for me and ask for a refund well within the trial period. Torguard instead offered credit. When I ask to apply the credit a few months later, I was offered half of what I initially paid as credit. Long story short is I decided to leave Torguard."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicholas Lopez",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T04:24:41.000Z",
          "Titre": "Not terrible, not amazing. . .",
          "Contenu": "Been using TorGuard since 2019 on my laptop (2.4Ghz quad core) and tower (4.2Ghz, 16GB ram.) On both machines run Win10 with latest updates. TorGuard is always slow to connect, takes about 2 minutes to fully verify with their proprietary \"WireGuard\". Connection drops sometimes regardless of what server you pick. If ever the app is open but not active, all internet traffic is stopped. Sometimes after closing TorGuard my WiFi adapter craps itself completely, wont reconnect to wifi unless system reboot. After using for 4 years I would say TorGuard is slow, but does a good job overall for the discounted price of $30 USD/ year. Not terrible but not amazing either."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Andrea R.",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T17:56:14.000Z",
          "Titre": "Solid but plenty of Torguard IPs are blocked",
          "Contenu": "The service seems solid (no disconnections so far) but in reality a bit of hit and miss. In particular I surprisingly realized some Torguard IPs are blocked in a couple of countries I have tried and some popular websites are showing the dreaded Cloudflare IP blocked page and not reachable.This seems such a shame in 2023 with all the other VPNs doing a better job at rotating IPs. I even tried their Streaming IP to no avail.Support is prompt to answer but in one occasion the person completely misread my messages. In the others the problem of IP blocking was dismissed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerome Albrecht",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T04:55:36.000Z",
          "Titre": "Overall good experience.",
          "Contenu": "Overall the Torguard VPN worked well once everything was up and running.  I never did figure out how to get it to connect automatically on Windows start up.  I had to start it manually.  I also had some issues with it not waking up after the computer was restarted after being in sleep mode for a while.  I found the customer support process clunky and difficult.  I was satisfied with the VPN when it was up and running."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Vanover none",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T05:01:54.000Z",
          "Titre": "My connection to TorGuard kept…",
          "Contenu": "My connection to TorGuard kept disconnecting while I was out of the country in Mexico. Every time I picked up my phone I had to check to see whether the VPN was connected spending six weeks away in Mexico. It got tiresome."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Gabriel Iatarelli",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T02:12:42.000Z",
          "Titre": "Good service but there is room for improvement.",
          "Contenu": "Some apps doesn't work with tor guard enabled and I have to try some other locations or just pause (majority of the cases).Sometimes the connection speed gets slow, but in this case I don't if it have to be with the app itself but strangely when I pause the connection gets faster."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Graham Ball",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T04:43:39.000Z",
          "Titre": "Requested review",
          "Contenu": "1. My download speed is significantly slower with Torguard running.2. Often nothing will download (even though there are tons of seeds) and I have to reboot computer to get downloading up and running.3. Not being a 'computer' person, not sure what to do to improve experience.For the record I run a fibre to the premises 250Mbs internet service with a top provider so that should not be the source of the issues."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Stefan",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T07:52:31.000Z",
          "Titre": "Ok value for the price",
          "Contenu": "Connections are good however the software needs work to integrate with modern 4k & 8k screens used on pc’s. I have to lower the screen resolution just to adjust and save settings"
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Keith Bennett",
          "Nb_Reviews": 2,
          "Date": "2022-12-25T14:50:56.000Z",
          "Titre": "Breaks DNS",
          "Contenu": "Works, but on my Linux system, after disconnecting often leaves my DNS in a state where the connectivity fails. /etc/resolv.conf still contains its nameservers.Also, Android app server scroll list is impossible to control to get to desired server. No way to scroll it slowly or step one server at a time."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "chongoc",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T00:00:11.000Z",
          "Titre": "There are more choices out there",
          "Contenu": "It was great value for money when I joined but over time, the number of countries and servers decreased. They also added additional service levels pricing and removing service from standard package making it less value for you money. Performance was also average most of the time."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T10:51:30.000Z",
          "Titre": "Hello,",
          "Contenu": "Hello,Torvpn does not work with netflix, amazon, box Mail like orange and some other website, so I wonder why the useful value of having Torvon if I have to always disconnect it to use those website above ? Otherwise Torvpn seem to do its job but not entirely. So I will not use it more time for a high price monthly."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Matt Hoppen",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T03:25:43.000Z",
          "Titre": "Tell your product management people…",
          "Contenu": "Tell your product management people that these unsolicited surveys are a waste of everyone's time. I like Torguard but would be less likely to recommend your product to others if I keep getting these."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T00:42:49.000Z",
          "Titre": "I like Torguard but have noticed that…",
          "Contenu": "I like Torguard but have noticed that there aren't as many working servers as there used to be. The Toronto server, specifically, rarely connects anymore... on both IOS and Windows laptop."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John D Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T17:37:10.000Z",
          "Titre": "Slow boot-up!",
          "Contenu": "Torguard is probably an OK VPN. I have never had any security issues over many years.The main complaint is a very slow boot-up & constant warnings that the boot-up is\" taking longer than expected\". Shut down is also very slow."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Thomas Cartwright",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T13:46:35.000Z",
          "Titre": "Every month for the past year or so my…",
          "Contenu": "Every month for the past year or so my credit card payment has been rejected and I have had to pay manually.It's not a big problem, but it's more admin than I'd like for a good project."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jasper",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T09:17:32.000Z",
          "Titre": "I'm Canadian",
          "Contenu": "I'm Canadian, so I'm disappointed that I can't watch Shaw Cable when I'm out of the Canada.  Same goes for Netflix.  Otherwise, everything else is great, especially great dollar value.  It meets all my other needs.  I'm a long term customer and will continue to be one."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Michael Hall",
          "Nb_Reviews": 3,
          "Date": "2022-11-28T07:37:48.000Z",
          "Titre": "Options and speeds are very good, but some annoying issues on streaming devices",
          "Contenu": "Options and speeds are very good, and the ability to choose 2 dedicated IP addresses is also really good.However, I do find that I get disconnected regularly, and need to manually reconnect on streaming devices like an Amazon Fire (not so often on my laptop) That is very annoying"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "ShayP",
          "Nb_Reviews": 12,
          "Date": "2022-12-28T23:01:17.000Z",
          "Titre": "local server is good but all outside…",
          "Contenu": "local server is good but all outside servers are bad high pings low speed i am not recommenddont forget to cancel the auto renew !!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chaz",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T19:13:48.000Z",
          "Titre": "Disappointed",
          "Contenu": "I would give 5 stars but for some reason I can't watch my streaming channels when connected to the VPN I asked about it to tech support and they never got back to me."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T00:29:14.000Z",
          "Titre": "i get its secure and ram servers but i…",
          "Contenu": "i get its secure and ram servers but i need somthing for downloading 4k like 70gb files the download speed dosnt cut it"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Bernie",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T00:03:13.000Z",
          "Titre": "Good enough",
          "Contenu": "They need more servers in APAC, uptime is good but not outstanding , support is quick and the client is hassle free"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T16:05:29.000Z",
          "Titre": "Your work is good but Your android app…",
          "Contenu": "Your work is good but Your android app is buggy it can be better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous Cruiser",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T00:46:07.000Z",
          "Titre": "I was really hoping your VPN would help…",
          "Contenu": "I was really hoping your VPN would help me get to websites I needed to while on Carnival's network, however despite using stealth settings their network still recognized that I was using a VPN and caused me issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry Holthof",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T15:42:57.000Z",
          "Titre": "Disconnect - Reconnect",
          "Contenu": "Seems like more and more companies are not allowing the use of Torguard.  So I keep having to disconnect and reconnect.  Not so much a Torguard issue but seems like Torguard will become more and more useless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dale D",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T03:26:01.000Z",
          "Titre": "Reduced bandwidth",
          "Contenu": "My disappointment is in bandwidth dropping about 30 mbps (or more), when Torguard is running. I know I can reconnect to a different server, but fighting with poor streaming bandwidth, or having to constantly monitor communications, or messing around with settings is not the software service I expect."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Roger Foster",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T15:15:55.000Z",
          "Titre": "its OK I was having issues connecting…",
          "Contenu": "its OK I was having issues connecting until I changed the Open VPN protocol your basic is not much better than free ones out there, the bandwidth is garbage unless you want to pay for internet & pay again for VPN bandwidth to use it.the good thing is your basic is cheap so if you don't or seldom use it its good as a standby option, the down side is you will have to bump it up to streaming level service to do basic internet tasks today, when most people see \"streaming\" as \"broadcasting\" where you are podcasting or something similar where you are streaming content to the internet, or subscribed to a streaming video service like Netflix where you will be watching movies contentiously along your regular internet tasks.thus the basic should have enough bandwidth to load pages without any noticeable delay & watch a video clip from YouTube, Face book & such social media sites without buffering so long as you are not doing other things like downloading files at the same time, that would make it more usable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ana Jimenez Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T20:30:41.000Z",
          "Titre": "Slow",
          "Contenu": "Slow, connection drops. IP address worked for 2-3 weeks than it stopped working"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Derek Slatkos",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T15:05:59.000Z",
          "Titre": "seems to be a lot of connectivity…",
          "Contenu": "seems to be a lot of connectivity stability issues in the last year..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vishwa",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T17:38:36.000Z",
          "Titre": "App Support not great",
          "Contenu": "App Support not great VPN kept disconnecting Messages/Notifications popped late was irritating. Faced lot of issues with WhatsApp/Telegram"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T22:12:33.000Z",
          "Titre": "Good Service",
          "Contenu": "I would like a better user interface as well as more server locations, specifically locations closer to me."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Robert Gaylord  S th Ave",
          "Nb_Reviews": 4,
          "Date": "2022-12-21T09:44:33.000Z",
          "Titre": "Disconnect vpn for Facebook",
          "Contenu": "I have to disconnect vpn in Facebook to get secondary pages."
        },
        {
          "Note": 3,
          "Lieu": "IR",
          "Pseudo": "A EM Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T06:02:06.000Z",
          "Titre": "It does not work properly in Iran",
          "Contenu": "Hi,It does not work properly in Iran.Best regards"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Pedro",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T15:19:20.000Z",
          "Titre": "Connecting time delays",
          "Contenu": "Sometimes, it takes too long to connect and get the ip."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Zvi Regev",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T07:25:51.000Z",
          "Titre": "Some times it disturb surfing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Hart",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T01:38:13.000Z",
          "Titre": "Doesn’t completely hide all my Web…",
          "Contenu": "Doesn’t completely hide all my Web activity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dhirendra Verma Ikigai Venture",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:42:35.000Z",
          "Titre": "Refused to cancel Account and refund",
          "Contenu": "Refused to cancel Account and refund. Pathetic customer service.Cancelled account and issued refund now"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "THOMAS BERRY rehoboth investme",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T23:58:02.000Z",
          "Titre": "Slow at times",
          "Contenu": "Slow at times. Dropped connections. Blocks some sites"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T00:37:22.000Z",
          "Titre": "Reliable but slow",
          "Contenu": "Reliable but slow. No issues in my 3(?) years of using TorGuard and their provided email service, but VPN speeds were consistently around 2MiB/s (16mbps), even when connecting to the closest server location (LA for me). Normal speed without VPN on is around 80-100MiB/s and I'm able to get good speeds when connecting to another VPS service through OpenVPN. Due to this, I rarely used the service and really only kept it so long for the privatemail account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Some Guy",
          "Nb_Reviews": 2,
          "Date": "2022-09-04T23:09:48.000Z",
          "Titre": "Blocked In Spite Of WireGuard",
          "Contenu": "I found myself getting blocked on motel wi-fi because there is software which block filesharing programs now, so I will have to explore otherVPN options. Since TorGuard has been responsive to my feedback, I will do one subscription until I can find a replacement."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Dean Smith",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T09:01:02.000Z",
          "Titre": "Service is fine for most people. I left because of missing features that originally existed when I signed up.",
          "Contenu": "The vpn worked fine, no issues. Speeds were good and Android app worked well.The only reason I left is because they shut down all but the North American socks5 servers. I did ask support when more EU servers would return,  all they could tell me was \"they would be coming soon\" I had already waited over 2 months and my renewal was up so I went back to Nord.Edit* Just checked back and still no socks5 servers in Europe.....pft. Pull your finger out!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Greg Gray",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T20:29:50.000Z",
          "Titre": "problems with connections since last feb.",
          "Contenu": "No problems with connections for years, but the new IP  I got last February is slow, connection keeps lagging and I have to try to log in twice before it connects. I get a busy, busy signal 1st log in. I have a dedicated IP.I also have issues with it being recognized that I am in Arab Emirates and many websites convert to their language. I did open a ticket about it, and they told me it was google who saw me as Arab Emirates. And then said they cant help me. So Ive been putting up with double log ins and the location/ slow connections issue ever since. I DO like Torguard, and my customer service has always been good. I will definitely stay with you, just want this last IP to work correctly. TY"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Torguard user Uber",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T10:14:30.000Z",
          "Titre": "Need vpn server In phoenix Arizona."
        },
        {
          "Note": 3,
          "Lieu": "BH",
          "Pseudo": "BP",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T18:55:41.000Z",
          "Titre": "Good VPN & Price, lacking customer service",
          "Contenu": "TorGuard VPN offers a good VPN service that handles strong firewalls and censorship filters, against which multiple other popular services fail.The price with promo code is a good bargain, that is difficult to match by other services..However, the customer service is almost non-existent, as no one responds to the chat. Moreover, the service asks for credentials and credit card numbers, which kills the purpose of privacy..PayPal payment option does not exist."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "TorGuard spud",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T07:48:20.000Z",
          "Titre": "Easy setup",
          "Contenu": "Easy setupSocks5 doesn't work. BBC costs extra"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carl Goodman",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T14:22:08.000Z",
          "Titre": "Connection trouble.",
          "Contenu": "I have had trouble connecting and staying on. I get messages on password errors. Sometimes I need to try three and four times to connect."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T10:16:30.000Z",
          "Titre": "works quite well",
          "Contenu": "works quite wellhowever I get rather slow speeds through this vpn"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel  Townsend",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T19:00:29.000Z",
          "Titre": "Your fulfillment process was flawed"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T11:46:03.000Z",
          "Titre": "The app itself is excellent and if I…",
          "Contenu": "The app itself is excellent and if I was using it the score would be higher. My orimary usage is with an Asus Router and the connection was very hit and miss and kept having to change ports otherwise received a connection error. I have since changed to another VPN and do not have any issues using the router."
        },
        {
          "Note": 3,
          "Lieu": "KN",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T16:21:50.000Z",
          "Titre": "TorGuard is a great VPN to use",
          "Contenu": "TorGuard is a great VPN to use. For me, I need a bit more for what they are offering.1. While connected is sometimes disconnect your internet and you will only notice when you really that you are not able to receive any messages or access the internet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael A",
          "Nb_Reviews": 2,
          "Date": "2022-01-09T15:07:26.000Z",
          "Titre": "The speed is getting worse",
          "Contenu": "The speed is getting worse. I emailed recently looking for tips or tricks to increase my speed. All I got was the boiler plate answer. Read the manual. Well I've been with you for over a year. I know the manual. I was looking for some help. There has to be a good setting to get better speed on a Android smart TV using Nvidia Shield."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Armond",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T21:22:20.000Z",
          "Titre": "Torguard good overall, some issues this year that were resolved",
          "Contenu": "I've used TorGuard VPN for several years. There was a period in 2021 where I would frequently lose internet while connected to the VPN. Sometimes I would have to switch to a different VPN server to get it to work again.I'm not sure if something was fixed but I can't remember that I've had this issue within the past month or so."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Richard Jones",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T16:48:17.000Z",
          "Titre": "Generally satisfied, but",
          "Contenu": "Your service which I have used for many years has worked reliably and I have always received prompt and helpful response when experiencing problems. My one beef would be that the service seems aimed at the technically sophisticated. I am reasonably knowledgeable about the technology in general terms but lack ready understanding of some of the details. Some lower level documents in the help area explaining in general how TorGuard vpn works with explanations of some of the technical terms would be useful for me."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Stephen Paterson",
          "Nb_Reviews": 2,
          "Date": "2022-03-14T18:25:23.000Z",
          "Titre": "It's been pretty good but from time to…",
          "Contenu": "It's been pretty good but from time to time two errors will appear. First one says Error: The I/O Operation has been aborted because of either a thread exit or an application request. Second one says Error: The Network connection was aborted by the local system.Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 3,
          "Date": "2021-11-30T21:53:46.000Z",
          "Titre": "When it works it is great but when it…",
          "Contenu": "When it works it is great but when it bugs our it is an uphill struggle to get it to work. The only other real issue is the fact that it is detected as using a vpn. The staff are usually very helpful even though they may be a bit slow with their email replies. The price is fair for the quality even if it slows down frequently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Walker",
          "Nb_Reviews": 4,
          "Date": "2022-05-14T00:21:13.000Z",
          "Titre": "I've had Torguard for around 6 years…",
          "Contenu": "I've had Torguard for around 6 years now and I'm guessing that the $36 yer annum is pretty reasonable. The problem I have with Torguard is the blocked sites. I find that quite often, I have to turn off the VPN as sites just won't let me on while the VPN is engaged. This is very aggravating to me. I do not have any experience with other VPN companies other than Torguard and can only rely on reviews on the Web and Youtube most of which are usually affiliates getting kick-backs from the respective companies that get the most favorable reviews. VPN service is very difficult to qualify as absolutely required. I use it exclusively for torrenting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "former long time customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T17:55:13.000Z",
          "Titre": "Used Torguard for 4+ years, then left",
          "Contenu": "Used Torguard for 4+ years and it worked well in general. Encountered some problems this year (2021) with some streaming services. Customer support tried to upsell a residential IP address which did not sit well. Moved to NordVPN which include many more VPN servers, and includes proxy servers, and a \"SmartDNS\" feature. The SmartDNS has worked quite well. Torguard would be well advised to include those features as part of their core offering."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T17:44:30.000Z",
          "Titre": "Signed up for an offer",
          "Contenu": "Signed up for an offer, items never were fulfilled, was given an option to extend service. When my current plan was due to expire, they re-neged on said offer, and just gave 50%. Feels bait and switch. Reps were pretty rude. Will look for a new VPN after this expires."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Anonymous Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T15:30:21.000Z",
          "Titre": "Not bad but you can be a beter"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T20:29:49.000Z",
          "Titre": "Very slow to connect and disconnect",
          "Contenu": "Very slow to connect and disconnect, add to that that Windows 10 is always resetting (for your own security protection is the official word) itself with more frequency lately I have to constantly download tor-guard over and over. (yes I know I can reset that) I just like things to be easier not harder when you purchase a service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Smith",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T20:10:40.000Z",
          "Titre": "TorGuard is slower than the competition",
          "Contenu": "I have had TorGuard for over 4 years. I have found Torguard is Much Slower than the other three VPN's I have tried lately. I live fairly close to the geographic center of the lower 48 United States. I always start with the servers closest to my location and then progress to those servers farther away trying for a fast connection. I prefer Wireguard, but I have also tried OpenConnect and both types of OpenVPN, and no matter the connection type or location, Torguard Always lags well behind the others in both download/upload speeds and ping (3 or 4 and occasionally 5 times longer ping times than the other Vpn's with the same server locations).  I use VPN connections on three very different Windows computers - Asus, Dell, & H.P. - all with hard-wired connections to my gigabit router. Torguard is just plain slow compared to some of the competition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grandmaster Yeet",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T20:44:16.000Z",
          "Titre": "After the first month I wasn't so sure…",
          "Contenu": "After the first month I wasn't so sure on the speeds, then the next 2 months were almost as fast as my internet without a VPN. Then this last month the speeds were horrendous. I only continued the subscription this time on faith that the speeds will be up to the standard that I experienced those 2 months."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Robin Hood",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T14:20:49.000Z",
          "Titre": "The Windows app is just a mess",
          "Contenu": "The Windows app is just a mess, crashes constantly and I just couldn't set up the VPN to work. Sorry guys, but I would've loved to see that app working. Anyway, as a first impression after that I just wanted to go back to ProtonVPN even if it's a lot more expensive, it's worth the money for the quality of the service. Their app never crushed in 2 years.But one thing they've got right is the customer support. Awesome and on point. So it's about three stars from me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry Kline",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T18:06:56.000Z",
          "Titre": "Mixed",
          "Contenu": "PROSVery good price.Responsive customer service.Linux GUI!CONSA fairly large number of websites do not work with TorGuard (I've used other VPNs that didn't have that much of a problem).There is no whitelist feature to allow some apps/urls to not use the VPN.TorGuard starts automatically when I boot my computer but I don't see the icon, thus I have to go to the command line and kill the process if I want to disable it."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Luke Aldred",
          "Nb_Reviews": 2,
          "Date": "2021-02-04T10:52:41.000Z",
          "Titre": "It's Okay",
          "Contenu": "Good prices available if you looking for sales, great speed available with their wire guard services. Servers are enough but not great for everyone, such as those in certain parts of europe and australia. The biggest issue I have is major lagging between pages in their IOS and Win10 applications and connection times are sometimes not so great on Win10 whereas the IOS version seems to cut out my internet sometimes. When it works, it is great though."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "J E",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T10:30:52.000Z",
          "Titre": "Fast but needs UI improvements",
          "Contenu": "As a previous subscriber of PIA, the user experience of using TorGuard is almost the same. However, a better UI for the ios and macos clients would go really well with your fast services. In addition, I think it is best that the subscribers like myself could see the ping of each server on the dropdown list, and also being able to change the servers on the fly, without having to disconnect, select, and reconnect. Again, it is always about convenience these days."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2021-02-27T08:33:37.000Z",
          "Titre": "I had been using TorGuard for several…",
          "Contenu": "I had been using TorGuard for several months with no problems, then all of a sudden my dedicated VPN slowed down to a crawl and would not let me stream anything anymore.  I reached out to your tech support and we tried to switch to WireGuard and that helped enough that I could at least do somewhat of streaming without waiting to buffer all the time.  The speed is still half of what I can do without the VPN connected.  Hopefully, the problem will get worked out and it will be as fast as it was."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T00:24:25.000Z",
          "Titre": "Was billed even when I didn’t require services.",
          "Contenu": "The service seemed to be ok. I have no way of knowing how good it was or how secure, but I just assume it was solid enough. I stopped using torguard well over 2 years ago and I just kept getting invoices. My account was automatically charged every time.  I accept most responsibility because it was my fault for not spending the time to sit down and cancel the service with their exact instructions. I believe the billing cycle was every 3 months which was an inconvenience too. It would be nice if things went differently for Torguard  and I, but they didn’t. I won’t be saying hi to torguard if I see it at a party."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Blaylock",
          "Nb_Reviews": 4,
          "Date": "2020-12-10T01:53:23.000Z",
          "Titre": "The dedicated IP address is very slow…",
          "Contenu": "The dedicated IP address is very slow most of the time so I don't use it much!  I was assigned an LA server which I really didn't want. Guess other servers were full.....Contacted you as requested, I received no response or help.  I guess the dedicated IP address isn’t the way to go. Like TorGuard other than that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay Closky",
          "Nb_Reviews": 2,
          "Date": "2020-10-18T20:26:47.000Z",
          "Titre": "Service is solid however not happy with…",
          "Contenu": "Service is solid however not happy with the way they deal with their customers.Announced a new VPN Pro pasn that included a dedicated IP -and- 10gb access. Cost me $4 to convert. Then I was told that the dedicated IP cannot use the 10gb servers. Unbelievable!  They charged me another $4 to revert.Back on my streaming package they gave me an IP that won't support Wireguard so I asked for a different one.... $4 fee!This is BS..... Will go elsewhere when my package expires"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kailash",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T05:15:38.000Z",
          "Titre": "IP address and hence location leak when…",
          "Contenu": "IP address and hence location leak when using standard locations.Dedicated IP is working as desired.Dedicated Device (router) firmware would greatly help with designing devices to use TorGuard and those allowed direct access.Currently Asus official router firmware does not allow for selective routing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 2,
          "Date": "2021-02-03T05:23:40.000Z",
          "Titre": "The program only loads properly about…",
          "Contenu": "The program only loads properly about half the time when i turn on the laptop. I tried re install but doesnt seem to help. leaves a message \" there may be leaks\". It also interferes at times with my wifi loading. If i turn Torguard off start menu, wifi loads and  after that i can stsrt Torguard."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Ben Carbery",
          "Nb_Reviews": 3,
          "Date": "2021-07-07T02:24:10.000Z",
          "Titre": "Not as many servers as competitors",
          "Contenu": "Not as many servers as competitors, usually one per country, but usually able to log in first go. Client is less powerful / flexible than say NordVPN but this may suit some users. However, it hides itself when prompting for credentials during logon which makes no sense ay all."
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "Pia",
          "Nb_Reviews": 1,
          "Date": "2021-02-07T14:22:58.000Z",
          "Titre": "VPN in China is not that great",
          "Contenu": "VPN is very much needed in China as majority of the basic sites needs to be accessed by foreigners especially for work. In the past months, it has been very unstable and difficult to get a fast and stable connection even with wireguard. Hope we can find a better solution  to this dilemma. Thanks♡"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T07:26:11.000Z",
          "Titre": "It's a good VPN provider but...",
          "Contenu": "The speed is okay, the customer service are good but a lot of their IP got blocked in china's firewall and they seems not bothering to do anything about it.Plus the IP is where you connected to and you are using, which is bad if government or ISP are monitoring you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2021-02-12T01:25:17.000Z",
          "Titre": "My ip was visible to Spectrum",
          "Contenu": "My ip was visible to Spectrum so that was the whole point of using the vpn to cover my tracks.  I would assume the configuration out of the box would cover your ip address for standard home internet activity.  I am going to try and do a socks 5 instead for downloading without vpn."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Shepherd",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T14:15:11.000Z",
          "Titre": "Torguard is Great...BUT!",
          "Contenu": "I love your product, but over the past couple of years I have had several interruptions due to that the Torguard has gone into a sleep mode as in gone into waiting and I have had to turn everything off, disconnect whatever I was doing or Downloading, and turn off my Torguard and then reconnect.  Several times I have had to change to Open VPN instead of Wireguard in order to get it to work.  So not happy when that happens.  I have uninstalled and then reinstalled in order to fix the problem from happening again, and sooner or later it happens again.  So that is my complaint.  I hope you can rectify the problem someday.  Lisa Shepherd"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "NO SPECIAL CHARACTERS IN NAME",
          "Nb_Reviews": 2,
          "Date": "2021-10-05T23:21:37.000Z",
          "Titre": "It does it's job but appkill doesn't.",
          "Contenu": "It does it's job but I wish the app was a little better. I always have to click on proximity to find the best servers to choose from from. Why is the default set to \"custom first\" and alphabetical? Those servers are super far away.I tried using the app kill feature, which I think is a great idea, but eventually my browser could no longer access my internet. Restarting my comp didn't help and my other apps worked. I googled my problem and found that I had to disable my appkill feature. I didn't even set my browser to be killed if my VPN turned off! No I'm afraid to use it again because it may happen again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "alain duval",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T07:27:29.000Z",
          "Titre": "Price is great",
          "Contenu": "Price is great, windows app has never felt fast or snappy and crashes from time to time. Only 2 servers in all of Canada, 1 at each end of the country... Up time is 99.9%."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "magilla",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T15:21:32.000Z",
          "Titre": "Great Basic Service, Won't Allow Some Streaming Services",
          "Contenu": "The price for the basic VPN service is unbeatable. They have a lot of servers and the service only mildly slowed down the connection. However, I had difficulty accessing streaming services through the VPN."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "yassine benmalek",
          "Nb_Reviews": 3,
          "Date": "2021-07-18T20:04:59.000Z",
          "Titre": "Internet speed problem",
          "Contenu": "It works but it devises my internet speed by 4. normaly i have more 500 Mb per second. When I activate the VPN it diminish between 125 Mb and 225 MB. I tried different protocols, closest servers (paris) and settings but it didn't do any better."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Rashed",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T08:11:06.000Z",
          "Titre": "The TorGuard app is a very hit or miss",
          "Contenu": "The TorGuard app is a very hit or miss, it sometimes has issues with connecting to even your own private address and it’s quite disappointing. I also subscribe to Nord just in case this doesn’t work"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T08:02:18.000Z",
          "Titre": "Good but not enough",
          "Contenu": "The service it's ok but the speeds on streaming services on peak hours is slow. I've contacted to support but the problem doesn't solved. In general they have a good support with quick response. I will recommend the torguard but not for streaming."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David Stone",
          "Nb_Reviews": 2,
          "Date": "2021-03-19T01:38:57.000Z",
          "Titre": "The produce is probably excellent…",
          "Contenu": "I feel that the produce is probably excellent.  But, I was unable to set it up properly.  My computer experience is limited and I could not find instruction as to how it should be running.  I will continue to try and find helpful information."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2021-02-10T07:47:12.000Z",
          "Titre": "One UK server",
          "Contenu": "Reasonable, dated user interface. 3 stars as only one server in the whole of the United Kingdom. Torguard did reply (stating more servers were available) but makes no sense, as on the UI it only gives a choice of one server based in London UK."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David May",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T15:23:54.000Z",
          "Titre": "Servers could be more available",
          "Contenu": "Generally, servers are unreliable to respond and connect.  Once connected, they seem to stay connected, but frequently (ie. daily) some servers do not respond.  At times, it can be difficult to find a working server."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alphonso Jones",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T22:25:48.000Z",
          "Titre": "VPN for oldies.",
          "Contenu": "I’m happy to have Torguard vpn however, as a non technical person it would help me to know what the readings on my page are for. What would happen if I click here or there?, what to beware of?, and how to optimize my vpn!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Techsi",
          "Nb_Reviews": 28,
          "Date": "2018-08-02T08:40:15.000Z",
          "Titre": "I left them for another",
          "Contenu": "I definitely agree with reviewer Allan Thibodeau not the worse service provider and I switched VPN provider for the same reason slow speeds frustrating tech support.I checked with Torguard tech support BEFORE switching to Fibre Broadband, couldn't enjoy the benefits of Fibre once I did... I wouldn't have switched at that time had they told me the truth regarding their service speed limitation.Now with a different provider and although I don't have the asynchronous speeds bought ...when using my VPN I'm way happier than when I was with Torguard 2016-2017."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joredas",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T21:46:34.000Z",
          "Titre": "Speed and stability have suffered…",
          "Contenu": "Speed and stability have suffered drastically compared to when I got it 2 years ago.  Playing Overwatch with TorGuard on is basically throwing at this point.  I also need to turn it off now everytime I want to watch anything that's not Youtube and Netflix, and occasionally I have to turn it off for Netflix too.  As far as I know it's still doing it's job for my torrenting so I do still have it on most of the time, but whether they're falling behind or something else is going on in the background I would not know.  I'd really rather not have to research it and it's not like it's hard to turn off.  I just miss not having to go through that small hassle."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Rashida",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T14:57:03.000Z",
          "Titre": "It surved its purpose",
          "Contenu": "It surved its purpose. I was able to watch Attack On Titan on Crunchyroll qnd the price is ver reasonable. However, I experienced lag quite a few times but other than that it was cool."
        },
        {
          "Note": 3,
          "Lieu": "SY",
          "Pseudo": "TG iOS",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T16:26:56.000Z",
          "Titre": "Dedicated IP",
          "Contenu": "Hello dears,Everything is ok, customer service is more than great, though I have a problem that I can’t use the dedicated IP on multiple devices simultaneously..I don’t know if this how it should be..Thank you"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Thomas Blake",
          "Nb_Reviews": 3,
          "Date": "2021-07-05T00:50:11.000Z",
          "Titre": "Slow VPN",
          "Contenu": "\"Our network team is currently upgrading hardware on all US locations and refreshing all IP ranges to provide improved services in these areas\" Can you please advise if these improvements only relate to US sites?I am in Australia and use a server in New Zealand. My normal speeds (no VPN and fibre to the premises) are in the following range,  Down 254Mbps-     Up 23Mbps, generally +/- 15%. Speed test with Torguard measured within 2 mins of the Non VPN test is as follows.  Down 60 Mbps - Up 12 Mbps. This is far from an acceptable speed performance don't you think? I am disappointed with these results and would appreciate your input. This comparison test has been performed with the same results on many occasions. Regards, Tom Blake"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gordon Blackburn",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T18:26:34.000Z",
          "Titre": "Still having problems getting all UK…",
          "Contenu": "Still having problems getting all UK programmes, the help line is too complicated for old people who are not computer literate and do not know what you are talking about."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Jeroen Brauns",
          "Nb_Reviews": 2,
          "Date": "2021-02-23T17:32:45.000Z",
          "Titre": "Good VPN service provider with mediocre desktop application.",
          "Contenu": "The speed and customer service are excellent. The desktop application is very slow when connecting and disconnecting from a server. Also, settings cannot be adjusted when you are connected to a server."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T05:48:10.000Z",
          "Titre": "Terrible log in interface.",
          "Contenu": "Been with TorGuard for six years. The speed is ok but not great. I find only a handful of countries that gave me good internet speed. It can be a chore for new users who have to play around with country/server selection for the best speed. Pros: (1) Stable installation: I have installed Torguard on Windows, Android phone and TVBox with no problems. (2) The price is very good if you got the discounted price. Cons: Log in interface (you have to click that round thing to log in) - it just is so confusing when I log in the first time and subsequent uses makes me disdain it. While browsing MSN feeds, it still showed stuff from my residing country instead of the country (a different) I had sign on to. There are problems with Kill Switch (Torguard auto expire due to inactivity but website and internet is still running). That log in interface is the straw that broke the camels back - so am changing provider."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Psyop",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T06:29:17.000Z",
          "Titre": "Solid but slow",
          "Contenu": "Solid, but very slow speeds. Also folded like origami to RCIA and started blocking all torrent traffic in US, even valid, legal sources and uses."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Ed Carty",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:52:55.000Z",
          "Titre": "User friendly",
          "Contenu": "Simple, easy to use and effective."
        },
        {
          "Note": 4,
          "Lieu": "IR",
          "Pseudo": "Anonymous Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T07:06:45.000Z",
          "Titre": "My Experience",
          "Contenu": "Hello Dear Torguard Team,It's been amazing experience with your service through out this past year!I'll give you that, but there were outages here and there and those were unfortunate, Cause i live in Iran,and these inconsistencies aren't all your fault but resides to Iranian Government, Thanks for your help!Besides could you please provide me a little discount to renew my account cause i'm from iran ?Thanks in advance!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T00:55:47.000Z",
          "Titre": "Awesome VPN when working",
          "Contenu": "Awesome VPN when working. Love the no traffic log feature! Lately, consistent connection for streaming is a bit wanting. All in all, a well performing vpn solution that I would recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:20:37.000Z",
          "Titre": "Mostly good experience",
          "Contenu": "Mostly good experience. It’s difficult but not impossible to set up on Synology drives."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nonnie",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:45:05.000Z",
          "Titre": "Excellent service...",
          "Contenu": "Everything is great,the service has been flawless. The only reason I only gave 4 stars is because I wish we could access BBC IPlayer with this service. Any way that is a possibility? Other than that, I have absolutely no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T03:34:59.000Z",
          "Titre": "As close to 5 stars as you can get",
          "Contenu": "No one can ever receive 5 stars. 4.9? 4.8? sure, but never 5 full stars; however, TorGuard gets very close. Hassle free setups, easy to use configurations. It's as solid of a service as any. I highly recommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blake Fountain",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T00:05:53.000Z",
          "Titre": "I Really Do Enjoy TorGuard",
          "Contenu": "Overall, I like TorGuard, but I do run into issues with them. For example, Tor only works on my phone now, and I'm using Proton VPN on my computer now because of that. I'm tired of the problems, but customer support is always there and quick to reply, which is appreciated. It is my fault; I have not contacted them about my computer issue as I'm using Proton. I do wish they helped more overall, despite what I said. I most likely will renew as I think I'm grandfathered into a deal. I like to have options, too. This is not a ‘knock’ at you, TorGuard."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Ashwin T",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T15:01:25.000Z",
          "Titre": "Good service with great support",
          "Contenu": "Good service with great support.  Large number of servers in different regions with multiple protocols which is a boon wherever Internet Censorship (Middle East) is a thing. Torrents are also supported in some regions. VoIP and other restricted services work well as long as one is connected to speedy servers.Multiple apps accross different ecosystems like iOS, Android, Fire stick, windows, chrome browser, etc.Only downside is that out of their very many servers, only a handful of them can give good download and upload speeds."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Tunstall",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:15:23.000Z",
          "Titre": "Good, with one slight flaw",
          "Contenu": "TorGuard is a good VPN, and the best for my purposes.It supports unlimited port forwarding (albeit with a slight delay between setting and use), has good speed, and is very customisable in other areas.The only issue is that when connected for long periods of time, it appears to slow down (particularly on certain websites), but this seems to fix itself when disconnecting and reconnecting. This could pose a problem for some, as it has for me, so I cannot give this a five-star review."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr. B.",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T22:51:28.000Z",
          "Titre": "A bit flakey, but okay - it does what I need.",
          "Contenu": "Second renewal of a two year period with this VPN. My only criticism is the IOS versions of the app are flakey and often disconnect when the device goes to sleep, not automatically restoring on wake-up, which is annoying. I'm not sure whether there is any chance of data leaking at these times. Such leakage would not matter to me, but others may be more concerned."
        },
        {
          "Note": 4,
          "Lieu": "IR",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T23:32:52.000Z",
          "Titre": "1 of the BEST⭐️⭐️⭐️⭐️",
          "Contenu": "Speed⭐️⭐️⭐️⭐️Powerful Protocol through stable Stunnel for high restricted internet censorship countries on Android & Windows devices⭐️⭐️⭐️⭐️⭐️UI needs little bit of improvement⭐️⭐️⭐️Lack of Stealth protocol& Stunnel method on ios⭐️⭐️Needs more servers⭐️⭐️⭐️Great Customer Support⭐️⭐️⭐️⭐️Overall Awesome⭐️⭐️⭐️⭐️For me TorGuard is on my Top3 list in this industry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vino",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T17:30:27.000Z",
          "Titre": "I was with TG for about 4 years and had…",
          "Contenu": "I was with TG for about 4 years and had a great experience. Even though I had popup errors I couldn't shake their customer service has always been great. The download speed has been better than my other vpn Nord. The only reason for 4 stars, for me, is their software is a bit confusing if you go to any tab other than the front page. I also wish you could connect to another area on the fly, without having to disconnect and then reconnect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T00:20:47.000Z",
          "Titre": "It's working great outside of a few…",
          "Contenu": "It's working great outside of a few glitches that I attribute to power issues at the main server area that I normally use. If that happens I switch to the next nearest servers and all is OK. I have noticed a drop off in the # of seeds connecting for downloading media lately on the Vuze software. IDK if it's a Torguard problem or not. The system lists hundreds of seeds at times and I only get a few? I may have a bad setting or maybe Vuze isn't what they used to be!"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Private",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T07:34:01.000Z",
          "Titre": "Mostly happy with this VPN",
          "Contenu": "Works great now that i dont use TotalAV anymore… Damn antivirus made TorGuard take extra extra long time connecting to any server. Work this out and it is a 5 star rating from me :-)I have 750/750 fiber internet and TorGuards Norwegian server is capable of this kind of speed, I’m very happy with my choice of VPN :-)"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Guy B",
          "Nb_Reviews": 13,
          "Date": "2023-09-06T11:21:40.000Z",
          "Titre": "Good",
          "Contenu": "Sometimes my internet connection stops and then I have to stop Torguard and reconnect, sometimes restart my Macbook M1. Very annoying while streaming. Otherwise speed is ok.Also location changing does work 50% of the time.Torguard does have a good support"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "sasayaku",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T00:10:31.000Z",
          "Titre": "Best at what it does, a little clunky, mainstream feature should not be locked under paywall",
          "Contenu": "overall reliable services to make browsing more comfortable and private. bypass restriction was working flawlessly, fast and stable connection (depends on how far country you choose). Awesome for gaming. apps is a little bit clunky to navigate, and streaming support was locked behind paywall. but there's one missing feature : split tunneling. I just hoping someday they added this feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bookkeeping Has Two Ks",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T19:03:12.000Z",
          "Titre": "What you need , when u need it",
          "Contenu": "TorGuard has been good to me. They yake their money when it's due, they don't ask you for it 10 days in advance of my monthly service agreement so as to collect 10 days of interest on it, unlike a familiar San Diego utility. They are very responsive when putting in a work ticket. However, they need to give much better and more thorough instructions in their answers to the questions a user may ask. Oh , the cost!!! Well it's ok. For what im getting and what i pay for if considering the newish layout and features,  im happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abby Dee",
          "Nb_Reviews": 4,
          "Date": "2023-07-17T02:01:06.000Z",
          "Titre": "TorGuard is consistent & reliable",
          "Contenu": "TorGuard is consistent & reliable.  Excellent support too.I do wish that it was a little less complicated, since as soon as things go wrong, I'm lost.  As long as the support continues to be responsive, that isn't much of a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KH",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T21:02:49.000Z",
          "Titre": "I renewed my VPN service online",
          "Contenu": "I renewed my VPN service online, paying by credit card.  Your website worked well and easily and remembered my details while retaining some anonymity.  Then I considered upgrading to a premium speed, advertised at about $8 per month.  The website wanted to bill me $55 - which is obviously not one year at that price.  There was nowhere which said how many months that was for, or if I had a choice of how many months to sign up for, or if I could cancel.  That is why I only gave four stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel Henriquez",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T20:22:07.000Z",
          "Titre": "The VPN has a large variety of servers",
          "Contenu": "The VPN has a large variety of servers, and offers very fast speeds. It also hosts IPs that aren't insta blocked by sites that detect VPNs sometimes. However, it is fairly simple and does not have many features, such as split tunneling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RoadracerRR",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T01:38:52.000Z",
          "Titre": "It works",
          "Contenu": "It works, for my purpose it does what it needs to and being a long time customer I can't complain about the price. I probably could find one for cheaper but after 5 years and zero problems, if it ain't broke why try and fix it?"
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "JasszoGoth",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:41:25.000Z",
          "Titre": "TorGuard is a fair option for linux users",
          "Contenu": "TorGuard has very low tolerance for peer-to-peer file sharing aka torrenting, but, since this was not the main reason for which I opted for a VPN service, I do not regard it as a significant fault or disadvantage. The subscription is fair-priced, I think, and with close proximity servers selected, I can not even sense the expectedly slower connection speed. As a fedora workstation user, I highly appreciate the linux support, too."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Ardeshir .z Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T16:24:42.000Z",
          "Titre": "It is one of the only vpns still…",
          "Contenu": "It is one of the only vpns still working in my country iran but unfortunetly only some of the availible countries ip can be used such as greece and  most of the others will never get connected...and some times it takes alot of time to get connected"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Concerned Citizen",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T01:31:47.000Z",
          "Titre": "Love it, but...",
          "Contenu": "Love it, feel safe and protected... except the process of disconnecting the service is frustrating as far as the user interface goes... there is a delay between hitting the disconnect button and any feedback as to whether or not itt is disconnecting, which usually encourages more clicking which connects, then disconnects, then connects, then you have to disconnect again. Not the end of the world, but a little frustrating every time I disconnect from the VPN."
        },
        {
          "Note": 4,
          "Lieu": "HT",
          "Pseudo": "Aland Valbrun Pro=Type service",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T16:45:49.000Z",
          "Titre": "My Feedback",
          "Contenu": "Sometimes the waiting time is too long to have a response from the support. And also if one IP doesn’t work properly as expected the fee for any change not have to come from the customer. Otherwise the service is good very good most time the connection is stable and the IP you provided to me personally are very safe so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Jones",
          "Nb_Reviews": 5,
          "Date": "2023-01-15T17:58:52.000Z",
          "Titre": "Experience of a long term customer",
          "Contenu": "Generally, my experience has been positive. Reduction in network speed appears to be minimal, with my chosen server location. I miss the optional settings I used to be able to manipulate. I frequently fond that Torguard has stopped working overnight, so I have to check before I use links I want protected (banks, military record info, online shopping). I am sure these can be managed, but it is not intuitive."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T19:30:32.000Z",
          "Titre": "TorGuard is one of few VPNs that work…",
          "Contenu": "TorGuard is one of few VPNs that work in Iran. The speed is acceptable but could be better. The android application sometimes stucks and needs to be force closed. All things considered I would still recommend it to everyone living in Iran."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "DomX",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T10:03:23.000Z",
          "Titre": "Reliable and customer oriented VPN++ provider!",
          "Contenu": "I know the service for quite some time now, but it’s just crazy what the people are choosing as their VPN provider. It’s scary already. So I’m sorry but I’m not going to cry because it’s just working fine… I have not took it under investigation, neither one of the applications nor their configs. It’s just hard to find the right service or platform that you really need. Supposed to be aware of this. I’m still experimenting but I’m still not feeling alone with a question or a problem. So there’s just one point. The market synchronized itself and this is not good. It destroys the whole competition and all of that because of their own laziness… As everywhere in the CyberSec field…I just can say, try it urself to have a conclusion on that matter… Everbody is individually in their own way and needs but there are some quite cool features that TorGuard still making attractive…"
        },
        {
          "Note": 4,
          "Lieu": "OM",
          "Pseudo": "Florian",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T11:12:04.000Z",
          "Titre": "Torguard works",
          "Contenu": "Torguard is the only VPN that effectively cuts through the internet censorship here (ME country). For video calling, the connection can be slow and tends to cut out after a varying amount of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George A Dolak",
          "Nb_Reviews": 3,
          "Date": "2023-10-14T17:32:26.000Z",
          "Titre": "Except for the occasional automaic…",
          "Contenu": "Except for the occasional automaic disconnect in recent weeks, Torguard has been reliable and secure.  This gives me confidence that I am, in fact, anonymous on the net."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Akos",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T06:46:47.000Z",
          "Titre": "Worth the money",
          "Contenu": "TorGuard is way cheaper than the alternatives but still provides the same speeds.I can't give a 5 star however, because when using WireGuard, it takes ages to connect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn Helmle",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T01:03:12.000Z",
          "Titre": "You do a good job of keeping in touch…",
          "Contenu": "You do a good job of keeping in touch via email so that I am informed about what is going on with my system.Also, I like the way that I can run a malware check any time on the system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Bazzell",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T17:52:43.000Z",
          "Titre": "This a good service overall",
          "Contenu": "This a good service overall and for most people I'm sure that it will be just fine. I, however have a fiber internet connection and the speeds are not able to keep up but for most people it should be fine"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jonathan Lavoie",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T22:43:34.000Z",
          "Titre": "Decent VPN",
          "Contenu": "The VPN did what I wanted. Speed was good as well.Netflix cracked down on VPNs, nothing to do with the provider.My only real gripe was with the Windows app where I had to jump through hoops to make the app connect with Wiredguard after a new install and this persisted and still persists to this day.Overall a good experience however."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Peter Kucera",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T12:22:24.000Z",
          "Titre": "Slow download speeds",
          "Contenu": "For some reason my download speed is very slow, compaired to when NOT using TorGuard. The date given is not the exact date because it is EVERY time I log onto TorGuard that me download speed is slow."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T07:41:05.000Z",
          "Titre": "it is good vpn for baypass but not…",
          "Contenu": "it is good vpn for baypass but not split tunnel for debian and not list sort for ping to choose best speed and have proxy gateway for tv,console,other is good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin  Williams",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T04:30:06.000Z",
          "Titre": "Renewing is very convenient",
          "Contenu": "Renewing is very convenient. I’m happy with the service.  I’d like to see a north Florida connection point. I live in central Florida and the closest point is Miami next being Atlanta."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NO SPECIAL CHARACTERS IN NAME",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T20:35:34.000Z",
          "Titre": "Simple to use",
          "Contenu": "Simple to use. Take care of itself. Killswitch has become better and is super useful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "delvontay davis",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T21:46:45.000Z",
          "Titre": "works good keep it up 100% recommend…",
          "Contenu": "works good keep it up 100% recommend this VPN but it does have little issues with DNS connections with WireGuard or something so i have to restart it to fix it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nevsky",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T06:46:43.000Z",
          "Titre": "Generally works well and generally good…",
          "Contenu": "Generally works well and generally good customer service. Good interface.   Only issue is that the performance is often slowed more than I think it should."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert  Lavery N/A",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T21:58:56.000Z",
          "Titre": "Everything is fine with the exception…",
          "Contenu": "Everything is fine with the exception of I never recieved the free router I was promised when I signed up.  I questioned and never received a response.."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Ivahoa",
          "Nb_Reviews": 5,
          "Date": "2023-07-24T08:16:05.000Z",
          "Titre": "Easy to access",
          "Contenu": "Easy to access, easy to use Not sure Not sure that I exploit the full potential of the tool but it is the limit of my skills ;-)"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Paul Lazo",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T10:33:57.000Z",
          "Titre": "Overall is great",
          "Contenu": "Overall is great.  There was a time the servers were unresponsive maybe about 5 to 6 weeks ago but it has not occurred again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer Razor Ramon",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T11:02:44.000Z",
          "Titre": "Response was good but the spelling was…",
          "Contenu": "Response was good but the spelling was terrible in responses. Multiple people responding to my case caused more confusion in my opinion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce L",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T22:14:59.000Z",
          "Titre": "Unfortunately some sites will not let…",
          "Contenu": "Unfortunately some sites will not let you log in such as Lowe’s and Home Depot while using it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sergey",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T21:40:25.000Z",
          "Titre": "TorGuard Experience",
          "Contenu": "I am fully satisfied with my use of TorGuard at my computer. However, I have not received clear instructions from customer service how to install the device in addition devices (another computer and cell phone)."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "steven rae",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T18:44:35.000Z",
          "Titre": "All i did was pay my subscription",
          "Contenu": "All i did was pay my subscription, in response to an e-mail. Apparently, an e-mail was sent by Torguard to me on 22/2/23; I did not receive this mail!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawerence Laizure",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T21:19:51.000Z",
          "Titre": "Although most of the time it seems to…",
          "Contenu": "Although most of the time it seems to work well, there are times when it stops all traffic so I have to disconnect and reconnect. Kind of annoying."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "mahdi karimi",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T14:13:22.000Z",
          "Titre": "problems in android app",
          "Contenu": "problems in android app , sometimes app doesn't connect and I need to force stop it and open it again to connect ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dyl",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T22:09:41.000Z",
          "Titre": "Fast & Secure connection speeds",
          "Contenu": "Fast support response. Fast connection speeds.Could improve by adding DNS support to iOS app & adding support for IPv6"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "J.P. van Galen",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T13:07:43.000Z",
          "Titre": "Always works but sometimes servers get…",
          "Contenu": "Always works but sometimes servers get blocked because they are listed as not trustable"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T18:50:15.000Z",
          "Titre": "Great programme",
          "Contenu": "It works well just have to make sure that it’s open before downloading anything"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T06:59:07.000Z",
          "Titre": "Google detected unusual activity",
          "Contenu": "Google detected unusual activity, asked too many captcha when using the VPN"
        },
        {
          "Note": 4,
          "Lieu": "IR",
          "Pseudo": "Mohammad Hossein Dalvi",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T08:09:22.000Z",
          "Titre": "Support is great",
          "Contenu": "Support is greatService is greatBut there were some problems made my experience not flawless"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jonathan Nelson-Iye",
          "Nb_Reviews": 5,
          "Date": "2023-05-16T20:49:55.000Z",
          "Titre": "Their customer service is really…",
          "Contenu": "Their customer service is really good,if I have any queries they are always very helpful, and the service is very good."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Sina",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T08:15:50.000Z",
          "Titre": "Overall it’s a really good VPN",
          "Contenu": "Overall it’s a really good VPN, and it works well with Iran’s restricted internet, but unfortunately sometimes the speed is too slow."
        },
        {
          "Note": 4,
          "Lieu": "MD",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T11:06:30.000Z",
          "Titre": "A VPN for all the seasons",
          "Contenu": "Though we experience a strict internet blockade in Iran, Torguard has many different settings and solutions to circumvent internet blockade and protect users privacy that it always works contrary to other vpn apps."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T03:36:47.000Z",
          "Titre": "Keep comkng back to Torguard",
          "Contenu": "Been with Torguard for years. Consistently good service that keeps be re-subscribing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry pointer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T19:33:59.000Z",
          "Titre": "It's  good",
          "Contenu": "It's  good , howver the library i use blocked the tunneling and a fow other options!!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Hassan Rouzbehani",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T06:56:24.000Z",
          "Titre": "Hello",
          "Contenu": "HiSpeed is goodBut pings are too high around 300 for all serversOnly openconnect can connect on windows"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sercan Demir",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T00:15:43.000Z",
          "Titre": "İ don't like that the VPN is disabled…",
          "Contenu": "İ don't like that the VPN is disabled everyday.  İ am having to disable the VPN and re-enable  it every day ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T03:09:51.000Z",
          "Titre": "Good price but VPN was unstable and…",
          "Contenu": "Good price but VPN was unstable and also customer service was slow and often unhelpful"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joe Sinnott",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T22:07:05.000Z",
          "Titre": "Customer retention discount",
          "Contenu": "Yes, you guys gave me a discount for being a long term customer!"
        },
        {
          "Note": 4,
          "Lieu": "GU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T04:59:44.000Z",
          "Titre": "User interface and cost",
          "Contenu": "User interface and cost. Quality is excellent also."
        },
        {
          "Note": 4,
          "Lieu": "IR",
          "Pseudo": "hp mobil Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T06:36:35.000Z",
          "Titre": "Hello,  Torguard",
          "Contenu": "HelloTorguard is benefit & useful for us in 80% times  Tanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "don petruccelli",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T17:43:16.000Z",
          "Titre": "Never had any problems.",
          "Contenu": "Never had any problems, any difficulties were quickly resolved."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T08:13:35.000Z",
          "Titre": "Overall performance",
          "Contenu": "Connection is smooth and the speed is great but it really lacks split tunneling"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "gru",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T04:06:59.000Z",
          "Titre": "Fastest VPN that i've used",
          "Contenu": "I've tried many paid vpns and Torguard has been the fastest and lowest latency. Sometimes the windows gui can be slow, but i've never had any bugs with it. You can often find a 50% off reoccurring discount online and if streaming video on services where they are sensitive to vpns isn't a priority for you Torguard is a no-brainer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Roehm",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T14:45:20.000Z",
          "Titre": "Anonymously Awesome, but Buggy",
          "Contenu": "I love the freedom of knowing my browsing habits are kept anonymous. With that being said, closing the app on a MacBook Pro has required a “force quit”, still. Sometimes my internet connection no longer functions after I have to force it to quit and I’m stuck hard restarting the Mac. You guys gotta fix this. Not everyone uses Windows or a PC."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Art Barnes",
          "Nb_Reviews": 3,
          "Date": "2022-11-02T14:08:00.000Z",
          "Titre": "Excellent service...maybe too good?",
          "Contenu": "I have been with Torguard for many years, and I am mostly pleased with the service, however, in the last several months I have noticed the speeds have slowed down some. Perhaps as more people have discovered how good their service is, the increase in numbers has caused the slowness. I will say that over the years their tech support has proven to be far better then most. They are responsive and do their best to address issues very quickly. (Their answer to the slow speed was to try switching between openvpn and wireguard, however it made little difference).Nevertheless, they are much, much better then most and I will be continuing with them indefinitely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T17:22:39.000Z",
          "Titre": "Product works well",
          "Contenu": "Product works well. Two drawbacks that come to mind: It seems to disconnect & re-connect frequently &, of course, many websites will not connect/load because they detect this is a VPN based address."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Elliott",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T00:58:38.000Z",
          "Titre": "I have only had access for just over a…",
          "Contenu": "I have only had access for just over a month without any issues.  Only wish it was faster and had more cities to choose from."
        },
        {
          "Note": 4,
          "Lieu": "LB",
          "Pseudo": "Elie Hatem",
          "Nb_Reviews": 3,
          "Date": "2023-08-19T08:55:12.000Z",
          "Titre": "Torguard is amazing for the price",
          "Contenu": "Torguard is amazing for the price. But if I think the GUI can be improved."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Colin Longstaff",
          "Nb_Reviews": 12,
          "Date": "2023-08-22T12:18:42.000Z",
          "Titre": "Generally service is good but sometimes…",
          "Contenu": "Generally service is good but sometimes cannot connect to certain sites."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T23:14:14.000Z",
          "Titre": "Best against Iran censorship",
          "Contenu": "It is really good work against Iran's internet censorship but your app isn't good enough, it crashed and force closed all the time"
        },
        {
          "Note": 4,
          "Lieu": "KY",
          "Pseudo": "Ian",
          "Nb_Reviews": 4,
          "Date": "2023-06-03T22:26:43.000Z",
          "Titre": "No Comment",
          "Contenu": "No Comment, will review the performance in 60 days"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T09:25:33.000Z",
          "Titre": "Torguard VPN review after 2 months use",
          "Contenu": "Took Torguard VPN to mainly use the server located in the Netherlands. Sadly google locates the server in the UK, which makes it useless for online shopping as you get results for shops located in the UK. It would we great if Torguard gets this corrected. Set-up was easy, the connections are stable. The mobile app and windows app were easy to set-up and use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hossein Mehri",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T23:11:27.000Z",
          "Titre": "Acceptable quality of service",
          "Contenu": "Acceptable quality of service, but I wish you activate stealth (4443) port for iPhone as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T17:01:20.000Z",
          "Titre": "I like using TorGuard",
          "Contenu": "I like using TorGuard for my personal privacy. The reason I give 4 out of 5 stars is because of the IP's not being accepted as residential IP's, Google and other sites flagging me as a bot and there are slow connection speeds occasionally as well."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "ionut",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T21:48:39.000Z",
          "Titre": "reliable service",
          "Contenu": "Great service, reliable with decent price, too bad it only offers 5 port forwarding while accepting 8 simultaneous connection"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John P",
          "Nb_Reviews": 4,
          "Date": "2023-05-27T14:54:27.000Z",
          "Titre": "Always worked well and fast with a fair…",
          "Contenu": "Always worked well and fast with a fair price that hasn't changed in years.I'm very happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Shelton",
          "Nb_Reviews": 3,
          "Date": "2022-10-02T16:22:16.000Z",
          "Titre": "I like torguard but......",
          "Contenu": "I like torguard, but constantly (well once a month or so) have issues that takes time away from time that could be spent more productively. The support team is great. Very knowledge and quick to respond, but it just seems like there could be a program out there you download and rarely have maintenance to do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fizzy C.",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T21:15:13.000Z",
          "Titre": "Great service! App needs tweaking",
          "Contenu": "I enjoy this service. Anytime that I have had any issues I have always received help. That being said, I tend to have an issue with my port forwarding. Especially after an app update. And some of the app's options are not the clearest or easiest to get to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T03:12:34.000Z",
          "Titre": "Good experience, could be improved.",
          "Contenu": "The cipher and modes of connection are good, but the server diversity is questionably suspicious. Nearly all servers on popular services such as torguard are within the 'eyes' countries. Search wikipedia for 3 eyes, 5 eyes, 13 eyes, countries.. all listed and related networked countries account to about 50 countries with massive dragnets. If torguard could acklowledge, market, and entertain advanced privacy/security services outside of those known-knowns dragnet countries it would appeal to consumers like myself, and also secure a unique selling point to bolster an already great product suite over competitors. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 7,
          "Date": "2022-11-04T17:56:26.000Z",
          "Titre": "I have no problems connecting",
          "Contenu": "I have no problems connecting, every nite an then I can't connect to a VPN, but I just switch to another, and everything works."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T07:00:21.000Z",
          "Titre": "Good service, price and value. Only bill I'm happy to pay these days!",
          "Contenu": "Used TorGuard for several years -- and still happily using it. Performance and price are good, especially if you buy during one of the service's regular 50% off sales. Early technical issues in Linux have long been solved. Customer service is decent. Happy customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Woody",
          "Nb_Reviews": 14,
          "Date": "2023-07-17T06:35:53.000Z",
          "Titre": "Reasonable",
          "Contenu": "Works well with access to many servers"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Jon Doncel",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:19:32.000Z",
          "Titre": "Fast and proper response to my doubt"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Hicks",
          "Nb_Reviews": 7,
          "Date": "2022-11-18T00:41:40.000Z",
          "Titre": "Very fast connection",
          "Contenu": "Very fast connection, but too limited in the number of cities."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T03:00:38.000Z",
          "Titre": "Stability is increased",
          "Contenu": "Stability is increased, reconnecting time is faster after disconnect, older stealth legacy is back, no issue in connection, but ip is not verified, ip no is displayed in app, Hope there will be multiple hopeing sevice , auto switching between a set of countries we select from app, because some time once it is disconnected, user have to disconnect from app, and have to select other country manually"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RoadracerRR",
          "Nb_Reviews": 3,
          "Date": "2022-08-20T18:15:06.000Z",
          "Titre": "Good stuff",
          "Contenu": "I've had torguard for years now and happy with it, but the new TorGuard tunnel (or something like that) seems to drop my wifi signal and I have to disconnect and reconnect again. That never happened before the tunnel (or whatever it's called) other than that I love the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angelina Montemayor",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T19:07:31.000Z",
          "Titre": "My comments",
          "Contenu": "Have incurred delays to being connected.  Seems to be faster in recent days however.  Several times i have incurred messages saying user name and password not recognized and don’t know that even happens.  Pls explsin"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "samaa sameh -",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T17:29:54.000Z",
          "Titre": "the services was so good also the…",
          "Contenu": "the services was so good also the support was  very helpful and responsive the only thing that  I think need to improve is the Win app is some times breaks or not synced with account configurations so I have to update it manually otherwise it was a good experience and am still using it at my work with company business account"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Francks Trane",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T23:31:53.000Z",
          "Titre": "I've been with TorGuard since 2015",
          "Contenu": "I've been with TorGuard since 2015 and for good reason. They allow you to use up to five devices on the same account. Configuration is bog easy. Their native VPN client is easy to use and is updated frequently. And their L2TP/IPsec servers are just as easily configured on the native macOS networking stack, if that's your jam (it's mine).In fact, the only reason that I gave 4 stars instead of 5 is that in recent years, they removed PayPal as a payment option. I prefer using PayPal just a bit more than I do credit card. But that's a small thing."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Myles O'Brien",
          "Nb_Reviews": 3,
          "Date": "2022-08-01T01:32:58.000Z",
          "Titre": "Very good service but website not great",
          "Contenu": "The service works very well and help service is very fast, friendly and efficient. But the website is difficult to navigate, so it has sometimes become necessary to ask the help desk in order to make changes that would normally be expected to be easily achievable by oneself."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "The Chez",
          "Nb_Reviews": 2,
          "Date": "2022-06-14T04:04:32.000Z",
          "Titre": "With WireGuard the TorGuard servers have really upped their game.",
          "Contenu": "I still enjoy the fact that Torguard allows for port forwarding where no other VPN provider seems to allow for this. I haven't figured out programming enough to not have my ports open or another way to get around that issue. With WireGuard their servers have really stabilized with great speeds. I had issues with them years ago but now I haven't had issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 3,
          "Date": "2022-06-24T18:57:13.000Z",
          "Titre": "Improvements",
          "Contenu": "While torguard is not perfect it is the best vpn out there! If I had to change something it would be in the setting’s menu where it would explain the changes that you can make so that you can have a better understanding of what you are doing. Especially for those of us that livestream most of their programs."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "AH",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T04:39:56.000Z",
          "Titre": "When less is more ...",
          "Contenu": "I've been a long time TorGuard customer.  So far, so good.  However, just that there are so many reminders that were generated when the renewal is NOT due yet.It will be good if such reminders are scaled down.  (14 Aug 2022)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TorGuard User",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T02:56:12.000Z",
          "Titre": "Congrats TorGuard",
          "Contenu": "I've had TorGuard for about 5 years or so and have never had an issue with it's ability to block my ip address, in other words...  Do it's job.  I've never had a problem logging into it and it's never frozen on me, unlike another vpn I once had.  Congrats TorGuard!!!  Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Margaret Clegg",
          "Nb_Reviews": 19,
          "Date": "2023-12-21T09:46:35.000Z",
          "Titre": "I have used this service for a few…",
          "Contenu": "I have used this service for a few years now, works well mostly, a few glitches but on the whole a good service"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Anonymous Forever",
          "Nb_Reviews": 6,
          "Date": "2023-12-12T07:42:56.000Z",
          "Titre": "Torguard just works in any condition",
          "Contenu": "Torguard just works in any condition. Always there is a way to find a hole especially in heavy restricted countries like UAE, Iran, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor..",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:42:55.000Z",
          "Titre": "Constant service that fulfils exactly what I expected",
          "Contenu": "Constant service that fulfils exactly what I have expected...Thank you"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:52:21.000Z",
          "Titre": "Easy to use interface",
          "Contenu": "Easy to use interface, stable with no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T21:30:49.000Z",
          "Titre": "Dedicated IP",
          "Contenu": "I have used Torguard for a few years now, I never had an issue to complain about. That being said, I have been reluctant to try Torguard VPN Pro before and not that I am using Pro, I really like having a dedicated IP that's for my use only... No more having to disconnect for for Microsoft login or when using peacock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GuessWho",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:05:29.000Z",
          "Titre": "Trust",
          "Contenu": "Trust. If you cannot trust your VPN provider, you may as well not even bother to have a VPN. Anti-virus makers are jumping on the VPN wagon but what they don't tell you is they keep logs AND they disconnect when torrent downloads are begun. With all the surveillance going on already today, you have to have a VPN provider you can trust to be up all the time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:05:06.000Z",
          "Titre": "The Best VPN",
          "Contenu": "I discovered TorGuard from Tom Spark Reviews a couple of years ago. It was rated number one on his VPN Tier List and it still is number one today. It is full featured; well designed; and tech support is excellent. It works on almost all platforms even on some obscure Linuxes that I play with. I feel safe and secure using it. The interface is OK but gets tiresome over time. It would be nice if TorGuard came with skins to match desktops."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T02:47:00.000Z",
          "Titre": "Protect Yourself",
          "Contenu": "I've been using TorGuard for a long time now and it simply is the best vpn on the market and also the cheapest which I found surprising but I have had zero issues with it and with it I know I'm protected compared to other vpns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Burrows",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T17:48:37.000Z",
          "Titre": "Secure",
          "Contenu": "Secure, works as promised.  Quality and peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jesus Pina",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:02:20.000Z",
          "Titre": "Best service ever",
          "Contenu": "Best service ever, keep going:)"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Leonhard",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T09:23:36.000Z",
          "Titre": "we are using torguard for about 4…",
          "Contenu": "we are using torguard for about 4 weeks, works perfectly so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tmbrtn",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:44:31.000Z",
          "Titre": "A very good VPN",
          "Contenu": "Started using Torguard in 2014 and have this VPN on my computers and mobile phones. Whenever I am doing banking on my phone or computer I double check that it is on. I'm happy with the number of devices allowed for the account and the price. Torguard has kept up with the tech and revisions."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "János Kiss",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T11:57:37.000Z",
          "Titre": "Satisfied",
          "Contenu": "SatisfiedThis service gave me what I wanted. I had a little problem with the connection, but one of your colleague solved that fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tblaze",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:41:40.000Z",
          "Titre": "I am very satisfied with torguard very…",
          "Contenu": "I am very satisfied with torguard very easy to use great prices and no issues at all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "New customer ...",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T01:50:19.000Z",
          "Titre": "Easy to renew the service"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Klant",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T09:02:54.000Z",
          "Titre": "Reliable service.",
          "Contenu": "Reliable service.It delivers what it promises.Good prices and many options"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "in",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:20:46.000Z",
          "Titre": "One of the best",
          "Contenu": "It is easily one of the best and most reliable VPN's in the market.Customer support is also very good. They reply to emails almost instantly.I would highly recommend this VPN to anyone for streaming or for security."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 7,
          "Date": "2023-12-07T23:38:10.000Z",
          "Titre": "Awesome Proxy",
          "Contenu": "Never had any problems, and fast speeds. The web site has lots of useful information. For the price you can't go wrong."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hakan Eren",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:43:49.000Z",
          "Titre": "Great Service",
          "Contenu": "It is very dependable service at a very reasonable price. I have been a customer for a long time.( I could not remember how many years, at least 7). They never let me down. Thanks for great service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brian Stauffer",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T07:26:56.000Z",
          "Titre": "Great VPN",
          "Contenu": "Been using for years. Never a real problem. The one time I had issues customer service handled it quickly."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "guppe",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:32:19.000Z",
          "Titre": "VPN works well",
          "Contenu": "VPN works well. Good customer service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Arash",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:57:08.000Z",
          "Titre": "Professional and fast customer service",
          "Contenu": "Professional and fast customer service. Respectful and highly patient staff. TorGuard is very reliable and good in all aspects. It is highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "p Walmsley",
          "Nb_Reviews": 55,
          "Date": "2023-12-18T10:59:25.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Good product good price excellent service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T11:18:10.000Z",
          "Titre": "TorGuard never let me down",
          "Contenu": "The service is user-friendly and reliable - that is all I needed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MARTIN ASHDOWN",
          "Nb_Reviews": 18,
          "Date": "2023-11-28T13:00:50.000Z",
          "Titre": "Excellent VPN",
          "Contenu": "Excellent VPN. Been using for a number of years and always found it fast, reliable and exactly what is needed to protect oneself on the internet."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike Porter",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:25:03.000Z",
          "Titre": "Plex/Torguard Issue",
          "Contenu": "I encountered an issue with an app that was interfering with Torguard...I was impressed with the speed, accuracy, and knowledge of the Torguard tech (Mike) in resolving my issues.....He was understanding and knew exactly how to fix the issue.....I highly recommend purchasing this product..not only for its capabilities, but also for the OUTSTANDING technical support provided for the product...KEEP UP THE GOOD WORKS!!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kenneth Jifkins",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:09:30.000Z",
          "Titre": "It is an easy to use product at a good…",
          "Contenu": "It is an easy to use product at a good price level. I am quite satified with the user interface and experience"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alisha Gasiunas",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:09:55.000Z",
          "Titre": "TorGuard is absolutely the best VPN to subscribe to!",
          "Contenu": "While following a YouTube VPN influencer, Tom Sparks, I decided to activate an account with TorGuard and have never regretted that decision once.  The support staff at Tor Guard are wonderful, and have gone out of their to avoid stressing me out with any questions I've had for them, which really makes you feel as if they really have your best interest at the forefront of their company's business model."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty Hallsted",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T02:20:56.000Z",
          "Titre": "Affordable and reliable",
          "Contenu": "I have a team of 5 counting myself and Torguard has been an affordable and reliable VPN service for us."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Enlightened Nostalgic",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T08:30:45.000Z",
          "Titre": "Great service, security and options.",
          "Contenu": "I have subscribed to many services over 20+ years. I chose Torguard many years ago and haven't thought about changing since. Impeccable service, fast speeds, great choice of locations, and their selection of dedicated residential locations is a must for those who want to enjoy their streaming services everywhere. They're always on top of security advances too. I don't trust anyone else. Also, support is extremely fast and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas C",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:23:19.000Z",
          "Titre": "Quality Service at a Reasonable Price",
          "Contenu": "The service has always worked whenever I've needed to use it, while this should be the bare minimum, from my experience with other service providers, it's unfortunately not always the case.I still get ~90% of my DL speeds, and ~95% of my UL speeds when connected, which is very good.The price is more than reasonable, and I am allowed to buy 6 months at a time and still get that price, instead of needing to buy 2-3 years at a time.My only real complaint is that the purchasing experience is quite poor. 1. The website can be confusing (although it has been made better since I've started using it, it's still not ideal.)2. Pricing is completely dependent on the use of 50% off coupon codes, while these codes are abundant and reusable, and they automatically apply for every renewal period, they shouldn't exist. This definitely negatively affects it on comparisons lists, and makes it annoying to recommend to other people, but it doesn't have any effect on me as a user after purchase."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Mihailo Trifunovic",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T07:45:13.000Z",
          "Titre": "I am using TorGuard mainly on my linux",
          "Contenu": "I am using TorGuard mainly on my Archlinux boxes and Android devices. Installation and setup is easy. Arch provide package in Aur but it's easy to create your own package from TorGuard webpage if u want latest&greatest. Only small problem so far was DNS resolver in TorGuard which I have to change to Google while Open DNS had some hickups."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steve Keal",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:15:38.000Z",
          "Titre": "Torguard has been very good to me",
          "Contenu": "Torguard has been very good to me, they taught me everything I know about VPNs. Giving me advice and offering me a lifetime membership to the product I have. That and if you need help the support group's response times being so low, you know if you have an issue it will be looked at promptly.  You can be confident in this product. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Pur Gun",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T19:15:57.000Z",
          "Titre": "Trusted VPN service for affordable price",
          "Contenu": "I was using TorGuard for a month now and so far it helps me to protect my online identity. Its affordable also so I recommend everyone to use it as your trusted VPN service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael J",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T23:22:20.000Z",
          "Titre": "Best VPN for Torrenteers!",
          "Contenu": "I've been using TorGuard for about seven years and am very pleased with the service. It's not as easy to use as some other VPN services I've tried, but it works, and it works with torrents! The other services I used were easier because they don't support port forwarding, which I need for torrenting. Getting port forwarding up and keeping it running can be a chore now and then. Every year or two, I have had to switch VPN servers and reconfigure port forwarding, but the great thing is that TorGuard's tech support personnel have always been there for me. They've helped me with port forwarding configuration and even with torrent client configuration. They really know what they're doing, and I appreciate that. Thanks! Have a happy holiday!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MrBlonde",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T06:26:08.000Z",
          "Titre": "12 year customer",
          "Contenu": "TorGuard App keeps expanding and improving.I haven't had to submit a c.s ticket in years :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Arthur Reimer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:08:44.000Z",
          "Titre": "Happy with their service",
          "Contenu": "We were away on vacation in Mexico and had difficulty watching some of our home country's channels on the firestick because Prime recognized Torguard IP addresses as a VPN. I sent in a request about this problem and Torguard's service offered me a dedicated IP address to try for free, which worked."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:28:09.000Z",
          "Titre": "Service works as intended",
          "Contenu": "Service works as intended, would be nice to award loyal customer more discount on the continued renewal. Thank you for the work you do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noname",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:56:44.000Z",
          "Titre": "No issues whatsoever",
          "Contenu": "No issues whatsoever. I have it installed on different systems. I also highly value the ability to use servers located in different countries.Overall, no complaints at all!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Shahin .At",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:55:32.000Z",
          "Titre": "Elite Torguard",
          "Contenu": "Torguard was one of the few VPN services that worked in Iran with heavy filternet.Thanks to them and their special discount I was able to connect to the free internet!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Mr D",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T14:55:54.000Z",
          "Titre": "Best in the VPN Market",
          "Contenu": "Great application, Great Service and Reliable. No major issues. For beginners it could be a bit complicated but for Advanced users it an Ideal one. Speeds are good and latency is the best in the Current market. But the most important thing of all it the Great Unparalleled Customer support. I have used multiple VPN services in the past but none of them have a good customers support like TorGuard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T22:21:03.000Z",
          "Titre": "This made our experience great",
          "Contenu": "This made our experience great.  Once President Trump returns to the Whit House it'll be even better for out 401(k) retirement earnings.  Thanks Torguard"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcos Raymundo",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T14:54:00.000Z",
          "Titre": "Great product",
          "Contenu": "Great experience while using and they have easy to follow instructions for setting up what you need!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Judi",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T04:56:16.000Z",
          "Titre": "Uninterrupted service",
          "Contenu": "Uninterrupted service, easy connection, customer service great if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackson",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T03:25:42.000Z",
          "Titre": "Been using this service for years now",
          "Contenu": "Been using this service for years now, normally don't leave reviews but the one time I ever needed to reach out to support I got the quickest response I've ever seen and they resolved my issue just as fast. There's a lot of these vpn providers out there that are probably fine as well but these guys have kept me happy for a long time, highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "peterw",
          "Nb_Reviews": 8,
          "Date": "2023-08-03T14:46:25.000Z",
          "Titre": "absolutly no reason to stop using them",
          "Contenu": "been with torguard for a few years now.their support people are fabulous, knowlagable, and always friendly.price is good to.have absolutly no reason to stop using them.if your a linux user like me, you will also find them incredibly receptive unlike some support centres that dont even know what linux is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen Ihrig",
          "Nb_Reviews": 6,
          "Date": "2023-08-18T06:13:43.000Z",
          "Titre": "TorGuard just works",
          "Contenu": "TorGuard just works. Whether on a random IP or a dedicated IP I have had very few problems.When I have a problem with a random IP, I just choose a different one and all is well again, simple quick and effective.The one time I had a problem with a dedicated IP Customer Service solved the problem quickly and efficiently.Slowdown through the VPN is barely noticeable on any of the TorGuard IP addresses. I have to use a speed test service to even detect it.Finally the cost is very reasonable.I'm very satisfied with TorGuard VPN!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tony Kay",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:32:33.000Z",
          "Titre": "Product as advertised",
          "Contenu": "Product as advertised. Servers are always available and if in the off chance you can't connect to your favorite, there are lots of other regionally applicable alternatives. Fair price. Two Thumbs Up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T06:02:43.000Z",
          "Titre": "Great customer service!!!!",
          "Contenu": "One email and my issue was resolved. Keep up the awesome service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Wood",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T17:47:23.000Z",
          "Titre": "You were honest in what you’re product…",
          "Contenu": "You were honest in what you’re product does."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T04:19:58.000Z",
          "Titre": "Consistent",
          "Contenu": "Fantastic, consistent product that does exactly what I need it to do when I need it. Despite the cost of everything changing in order to take more from consumers, the price has also remained the same for years."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Jarl",
          "Nb_Reviews": 15,
          "Date": "2023-12-14T00:10:36.000Z",
          "Titre": "Love vpn and that tracking can go walk…",
          "Contenu": "Love vpn and that tracking can go walk off a cliff"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Nick",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T12:53:29.000Z",
          "Titre": "TorGuard VPN service.",
          "Contenu": "TorGuard VPN service works, the connection feels stable and reliable. I find installing the VPN client to be easy. It is also easy to use. I have had the service for a few years and am very satisfied.In terms of price, I think they are at a reasonable level. I can absolutely recommend TorGuard."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TorGuard User",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T01:43:44.000Z",
          "Titre": "Mostly just works perfectly",
          "Contenu": "Mostly just works perfectly. I've had 2 minor failures over the past year. One was found to be a problem with a TorGuard server and was fixed immediately. The other was very recent, while installing a new router. I'm not sure what happened, perhaps I did something wrong on my side. Thanks for the reliable service. Also: Thanks for the helpful info pages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChicagoJoe",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T18:07:00.000Z",
          "Titre": "Always great service",
          "Contenu": "I do a tri-annual subscription due to always getting great service. When it does come time to renew, I appreciate the multiple reminders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T17:01:29.000Z",
          "Titre": "Torguard has always worked as promised…",
          "Contenu": "Torguard has always worked as promised since I signed up. I did have a problem when I switched my AV to McAfee, but that was easily solved by using the newer Wireguard protocol in my configuration"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:34:00.000Z",
          "Titre": "Great VPN service",
          "Contenu": "TorGuard has always been a remarkable VPN service offering a safe and secure Internet browsing experience, easy to use and always available when I need it, featuring convenient subscription plans and easy payment options.  Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "johnny Klaen Krof",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T17:41:44.000Z",
          "Titre": "It's a wonderful VPN I must say",
          "Contenu": "It's a wonderful VPN I must say, one of the best VPN I have used in recent time. I subscribed to a dedicated IP address, I have been enjoying it & will rate it 5 Star until they act otherwise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vex",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T00:56:11.000Z",
          "Titre": "Amazing product",
          "Contenu": "Works really well across all my devices. Many moons i have had this service, but still am constantly finding features i did not know existed like port forwarding. As Bang for your Buck goes, torguard is hands down the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hank R",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T21:27:55.000Z",
          "Titre": "This company has always been diligent",
          "Contenu": "This company has always been diligent, straight to the point, and extremely fast as finding and fixing any problems i’ve encountered since i’ve started using it. Going on 3 years and i’ve never looked back."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Graeme Lang",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:59:45.000Z",
          "Titre": "Comment",
          "Contenu": "Never had a problem and the help from staff has been great. See no need to go anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User - Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T22:47:44.000Z",
          "Titre": "Daily use, daily confidence...",
          "Contenu": "I have the lowest level protection from Torguard and it does exactly what I need it to do, with no problems, no fuss. It is flexible enough to modify my access very easily and quickly; it is inexpensive and reliable. I use it everyday..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TV",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:06:24.000Z",
          "Titre": "Great service, low cost",
          "Contenu": "Great, consistent service at a low cost!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "...",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T19:30:21.000Z",
          "Titre": "perfect for streaming",
          "Contenu": "torguard is perfect for streaming, especially for hulu live tv"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sabaryo",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T06:26:18.000Z",
          "Titre": "Customer service rocks!",
          "Contenu": "I am a satisfied renewing customer, they don’t have to go above and beyond for me, Yet, Customer service is fantastic. Really took care of me and wow me with perks like I’m their VIP!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Netropolis",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T17:06:05.000Z",
          "Titre": "Professional, Reliable and Trustworthy Service",
          "Contenu": "I have been a customer for many years.Always reliable and very easy to use.On the ONE occasion I required technical assistance, the response was fast and pleasant. (The issue was indeed at MY end)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john putz",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T23:06:01.000Z",
          "Titre": "Torguard is the very best in VPNs",
          "Contenu": "Torguard is the very best in VPNs. It is always working and the customer service is great. Lots of IP addresses to chose from and the fact that Torguard keeps no logs for the feds or anyone else to snoop into makes them #1.I will continue to use Torguard as long as I want a VPN."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ididodi Ididodi",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T00:08:44.000Z",
          "Titre": "Trully the best VPN so far",
          "Contenu": "Trully the best VPN so far. Other don't anything unlike this one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teri Hopkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T20:28:49.000Z",
          "Titre": "Torguard is the better option",
          "Contenu": "TorGuard VPN is a great choice for anyone looking for a secure, reliable, and feature-rich VPN. It's not the cheapest VPN on the market, but it's worth the price in my opinion. I highly recommend it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:04:13.000Z",
          "Titre": "Dependable and less rejections",
          "Contenu": "Not having to guess I am protected at all of the open wifi spots I visit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duane G. Jacobs",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T02:30:15.000Z",
          "Titre": "Long time Customer.",
          "Contenu": "I have been a customer for several years now and I could not be happier. I have recommended TorGuard to many others, as well. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "TorGuard User",
          "Nb_Reviews": 3,
          "Date": "2023-08-12T16:57:25.000Z",
          "Titre": "very good service",
          "Contenu": "i have been a customer of torgard for over ten years and i am very satisfied with them. I can't say anything else about good service, so I'll remain a customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T09:41:24.000Z",
          "Titre": "TorGuard has always been top-tier",
          "Contenu": "TorGuard has always been top-tier. Super fast speed and with a wide variety of countries I could connect to, 0 complaints from me. Will continue to be a customer!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T13:59:17.000Z",
          "Titre": "I'm happy to see live chat there and…",
          "Contenu": "I'm happy to see live chat there and i'm getting good speed and enjoying watching netflix and other Shows here,  with dedicated IP."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Stapleton",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:16:23.000Z",
          "Titre": "It's a good company",
          "Contenu": "It's a good company and I like doing business with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Gates",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T03:58:33.000Z",
          "Titre": "TorGuard is one of the best products…",
          "Contenu": "TorGuard is one of the best products out there for VPNs. It also has the best pricing which is a big deal when choosing protection. I’ve been using the service for quite some time and it has never been down."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Thierry",
          "Nb_Reviews": 5,
          "Date": "2023-08-30T17:01:12.000Z",
          "Titre": "A Happy man",
          "Contenu": "From day one I used ToGuard I felt me a happy man because from that day surfing became for me… safe surfing on the net."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Worley",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T22:53:28.000Z",
          "Titre": "Plenty of connection points around the…",
          "Contenu": "Plenty of connection points around the globe.  Even if I link internationally, speeds are good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A Satisfied customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T17:18:37.000Z",
          "Titre": "Reliable, simple",
          "Contenu": "Always works.  Reliable.  Helpful when there was a minor billing issue, and it was resolved, via chat, in 2 minutes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T19:24:43.000Z",
          "Titre": "Things I like about TorGuard.",
          "Contenu": "I have been with you a number of years and I love the customability of your services. I have a streaming ip and it works with Netflix. I plan to stay the course. I am very pleased with the service."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Mrsarshivi",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T17:40:45.000Z",
          "Titre": "Excellent and timely support",
          "Contenu": "Excellent and timely support, simple and advanced user interface which is excellent and reasonable price as well as their services to Iran"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alejandro Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T20:51:02.000Z",
          "Titre": "Been with Torguard for 5y now",
          "Contenu": "Been with Torguard for 5y now, always responsive and uptime for me as been 100%. Great value, highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:17:38.000Z",
          "Titre": "Super fast in resolving issues",
          "Contenu": "You are super fast in resolving any issue and I love that! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Murphy Murphy Computers",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T01:38:19.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product! Never any service interruptions. Works great! Being using the VPN for a long time now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Portolan",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T03:26:27.000Z",
          "Titre": "Torguard has the very best customer service",
          "Contenu": "Torguard has the very best customer service of any company I have ever used for any purpose. I have been a customer for years. They are the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Brandenburg",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T04:23:34.000Z",
          "Titre": "They make using a secure vpn easy",
          "Contenu": "They make using a secure vpn easy, and support all the popular pc and mobile operating systems. Good value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisha Blackmon",
          "Nb_Reviews": 6,
          "Date": "2023-08-03T03:04:16.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I haven't had any technical issues with Torguard in a very long time. Torguard provides excellent service!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "kieran",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T22:47:02.000Z",
          "Titre": "Great product",
          "Contenu": "Great product,  great company. I have using there products for many years and they work without a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:32:55.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service and price. Very responsive customer service. Extensive online \"how-to\" repository. Applications for multiple different OS."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "mvangelis",
          "Nb_Reviews": 5,
          "Date": "2023-12-12T09:42:13.000Z",
          "Titre": "Works as we want PERFECT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TorGuard User Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T20:47:51.000Z",
          "Titre": "The response was quick and they helped…",
          "Contenu": "The response was quick and they helped me fix the problem I was experiencing. Other companies take too long."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T21:17:44.000Z",
          "Titre": "Good bandwidth doesn’t slow down after…",
          "Contenu": "Good bandwidth doesn’t slow down after trial period, unlike nord vpn"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jock Kelly",
          "Nb_Reviews": 4,
          "Date": "2023-08-09T20:44:47.000Z",
          "Titre": "Consistent",
          "Contenu": "Consistent, reliable and forever present. Never fails, have been a customer for 10 years, none better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Crider",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T01:13:07.000Z",
          "Titre": "The ease of using any of my devices…",
          "Contenu": "The ease of using any of my devices apple, android, MAC, and PC ease of customizing the connection are endless."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Justin Conte (BornDigital)",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T01:31:01.000Z",
          "Titre": "Fast proxies available all over the…",
          "Contenu": "Fast proxies available all over the world.Seamless and straightforward usage all platforms"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo",
          "Nb_Reviews": 4,
          "Date": "2023-08-08T21:47:59.000Z",
          "Titre": "Great product to have on your PC…",
          "Contenu": "Great product to have on your PC ,Tablet, Phone, very reliable and great way to stay anonymous when you are online affordable and great customer service"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Niki Strøh",
          "Nb_Reviews": 11,
          "Date": "2023-07-31T22:53:22.000Z",
          "Titre": "easy to use",
          "Contenu": "minimal trouble. easy to use and support has been quick whenever i managed to mess up a setting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ace man",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T04:58:05.000Z",
          "Titre": "Never had a problem using Torguard",
          "Contenu": "Never had a problem using Torguardand they have keep the yearly price the sameLots of servers to choose from"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "a private person",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T21:14:20.000Z",
          "Titre": "Love you guys",
          "Contenu": "Love you guys.  Excellent customer service.  Amazing price for me (50% lifetime discount).  Obv happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kash",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T01:58:29.000Z",
          "Titre": "Easy to use, stable connection",
          "Contenu": "The VPN software is easy to use and keeps a stable connection. It is also reasonably priced."
        }
      ]
    }
  ]
}