{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tricky-photoshop.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emma Reilly",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T12:58:58.000Z",
          "Titre": "AVOID SCAM",
          "Contenu": "AVOID SCAM - we had tried to use this service due to their pay what you can service. They will try to make you pay a hefty price for the editing and will not accommodate and hour their pay what you can service. Very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Kelly Flynn",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T06:54:11.000Z",
          "Titre": "Never got my picture that I paid for in…",
          "Contenu": "Never got my picture that I paid for in the end after over a week of messaging back and forth I never got a reply from them I wouldn’t recommend. Sixth email sent to them and I’m still being ignored!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connie Cummings",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T20:55:32.000Z",
          "Titre": "Could not change my daughter's frown to a smile",
          "Contenu": "I asked for 3 photos to be altered. Mainly to change my daughter's  frown into a smile. And every time they distorted her  face to look very scary. And I gave them plenty of extra pictures with her smiling. Communication was there, but the execution lacked. I did get a refund. Never again will I use them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Dupree",
          "Nb_Reviews": 5,
          "Date": "2023-06-13T16:56:13.000Z",
          "Titre": "I sent a photo and requested two…",
          "Contenu": "I sent a photo and requested two different photoshops from it. One was perfect, the second had all types of clatter in it and was terrible. I notified TrickyPhotoshop several times and each time was resent the same photo with background clatter in it.The company has many great reviews, but for me, they were very UNSAT Ray Dupree"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shammie Ferguson",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T21:18:36.000Z",
          "Titre": "SCAM BEWARE",
          "Contenu": "Sent Payment for my photo they sent me the photo I didn’t like it which they told me upfront if I didn’t like my photo they’re able to do revisions for no problem… they offered to revise my photo and I still haven’t received a response and it’s been hours and they took my money.. DO NOT DO BUSINESS WITH THEM they are a scam I will be filing a complaint against them.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chanelle",
          "Nb_Reviews": 3,
          "Date": "2022-01-31T16:42:08.000Z",
          "Titre": "Better to just use a free app",
          "Contenu": "Better to just use a free app! When I asked for a photo to be restored, the results were exactly the same as I got using a free photo restoration app. The issue being, the app misshaped obvious facial features and the image ended up being distorted. After contacting this so called 'professional' company, the photo they provided had the exact same results... No attention to detail and no obvious care to rectify what a free app couldn't. Total waste of money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nadira Kaleem",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T20:47:24.000Z",
          "Titre": "Bad Customer Service!!",
          "Contenu": "They did not get back to me quickly, did not work efficiently, and just forwarded me a preview email when I asked for a response. Needed to ask multiple times for a proper response, still don’t have my two images and it has been 48-72 hours!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacklyn",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T01:15:58.000Z",
          "Titre": "Communication & execution are definitely lacking.",
          "Contenu": "I’ve already sent SIX emails indicating exactly what I want & FOUR proofs later it still isn’t correct.Communication & execution are definitely lacking. Sent the last email 4 hours ago & still waiting for a response. Hoping the next response includes the correct edits.Update: Vai contacted me directly 23 hours ago & still no proof. Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "francesca l",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T20:14:45.000Z",
          "Titre": "Terrible job, did not do what I payed for.",
          "Contenu": "Asked to change the color of the background/remove shadows. Job was done terribly. The background is very clearly edited, as the hair looks weird, they didn’t remove any shadows, and the changed my skin tone completely which I didn’t ask for. Complete waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MacGoreth",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T00:37:07.000Z",
          "Titre": "He said that the photo would be edited…",
          "Contenu": "He said that the photo would be edited 2 days after the payment was made. 8 days later, still no edit and no response from Vai, the person that was supposed to edit the photo. Wasted my time, while I could have gone else where. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D Lee",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T11:40:16.000Z",
          "Titre": "After explaining multiple times what I…",
          "Contenu": "After explaining multiple times what I wanted kept receiving something totally different. When I finally gave up and asked for a refund they stopped responding."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "PF",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T13:31:16.000Z",
          "Titre": "Extremely poor service",
          "Contenu": "I had asked for an item to be removed from a photo I wanted to post, and the editor was able to do so. However from doing the edit, the photo looked really heavily photoshopped and there were issues with the background. I asked for this to be amended and the request was ignored. In the end I paid for the photo to see it clearly and it looked very poor. I had to literally draw and circle what was wrong with the photo for the editor to see what was wrong, in the end they sent me back a photo that was almost comical as it looked that ridiculous. It was extremely poor and looked as if it was edited by someone using Microsoft paint. In the end i asked for a refund and they didn’t give me one. I now longer nee the photo as I posted something else as It took 3 days for this entire conversation. There were breaks of hours between replies. An extremely poor service and not a “tricky photoshop solution”, as my request was not complicated. Extremely poor communication and would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stuart Yates",
          "Nb_Reviews": 42,
          "Date": "2022-01-15T13:50:29.000Z",
          "Titre": "Waste of time!",
          "Contenu": "Waste of time. When to local photo shop and had picture blown up  for book promotion.  These couldn't  do it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Barbara Alway",
          "Nb_Reviews": 22,
          "Date": "2020-11-09T11:17:17.000Z",
          "Titre": "Absolutely rubbish",
          "Contenu": "Absolutely rubbish. For $50 I could have done better. Did get a refund after complaining to PayPal. Never again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elijah Ethridge",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T18:21:53.000Z",
          "Titre": "ripoff",
          "Contenu": "i looked up free photoshop and they told me 10 dollars"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Neveen",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T03:05:32.000Z",
          "Titre": "Scammers, beware!",
          "Contenu": "They take the money then stop responding"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dena   Saak",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T17:07:15.000Z",
          "Titre": "TOTAL FAIL",
          "Contenu": "I opted to use this company for one of my photos because they had a high rating. Don’t be fooled. Or maybe I got a newbie. I only gave them a 2 because I’m the beginning they were responsive but the longer this went on, a week now, that has gotten bad too. All I requested was a professional background, all 3 individuals to the photo and change a man’s tux from white to black. First the background was nothing but a solid gray 😏. The next image they sent just had 2 individuals added and the tux was still white. The next one I received was of 2 Indian people. The next one still only had 2 of the 3 added and now only the tux jacket is black, the paints are still white. I responded and told them I must be on Candid Camera. This has been a total fail. I won’t use them again and a week later I still don’t have what I asked for. Not sure how they can say “24 hour turnaround “."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T20:12:43.000Z",
          "Titre": "Edited review…",
          "Contenu": "Edited…Great customer service with good communication guiding though the process.  in Less than 24 hours i had my daughters wedding photo cropped and adjusted for enlarging the photographer failed to do. We are very happy thankyou!!! Edit-Sent photo to service to print after i gave review thinking all was good, and they tell me the photo resolution was not changed as i asked for. Im am feeling taken advantage of especially when they wanted a review right away before i had a chance to get printed and know if changes were made."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Justine",
          "Nb_Reviews": 27,
          "Date": "2022-03-30T15:27:37.000Z",
          "Titre": "Disappointing",
          "Contenu": "I used this company to replace the edges of my photo that had been removed to fit in a frame. The initial preview was ok but the bottom of the picture was missing. I asked for it to be included and was advised that it was just a preview and the whole picture would be there. I paid them £10 and received a black and white image with the bottom still missing. I informed them this was not what I requested, they then coloured my husband's army uniform which was clearly green, navy blue. A big insult, I would not recommend this service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie Michelle",
          "Nb_Reviews": 2,
          "Date": "2020-10-27T17:23:36.000Z",
          "Titre": "Super disappointed in my experience…",
          "Contenu": "Super disappointed in my experience with this company. I have sent my pictures multiple times and she doesn’t do any of the stuff I ask. I even sent the pictures with notes on them and nothing. It’s been over two weeks and I still haven’t received my pictures. This morning I received an email thinking it was finally my pictures and she had edited the pictures that had my notes on them. No clue what is going on and I’m over it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lesa Castillo",
          "Nb_Reviews": 1,
          "Date": "2020-03-07T16:56:20.000Z",
          "Titre": "I don’t recommend this website",
          "Contenu": "It was an okay job. I wont be going back. I asked her to fix some stuff after she sent the pictures back and she didn’t respond. Just took her money and ignored me. Im getting the pictures redone somewhere else. I wasted some money here. I don’t recommend this website.Word of advice to this company: if you are inclear about the instructions, ask for clarity. Theres no shame it it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Chewning",
          "Nb_Reviews": 1,
          "Date": "2020-08-23T13:05:18.000Z",
          "Titre": "Too good to be true",
          "Contenu": "My grandfather passed while in the hospital. While he was there, his son moved into his house so after he passed I couldn't retrieve anything to remember him by. I had a photo someone had taken of us at a baseball game, but it was very casual and there was some cleavage showing that I hated about the picture. Within the same day, I received an edited photo that you couldn't tell was photoshopped. I wish I did this sooner!Edit: Bait and switch. The outcome was nothing like the watermarked photo and was just using blur which made the picture look terrible. I am really sad this was too good to be true. I've blocked email contact."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KAC",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T03:04:14.000Z",
          "Titre": "I expected an 8x10 glossy printed…",
          "Contenu": "I expected an 8x10 glossy printed picture by mail. I got a jpeg that I had to get printed. But now if it fades, I can print it again."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T10:23:20.000Z",
          "Titre": "Probably wouldn’t use again",
          "Contenu": "The object I wanted removed from a photo was done so, however the quality of the photo afterwards was shocking. So blurry I couldn’t use the photo for anything. Was a little disappointed."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mrs",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T16:59:46.000Z",
          "Titre": "Paid for 3 edits..",
          "Contenu": "Paid for 3 photo edits. Got 2 which were great. They did the 3rd one incorrectly then refused to redo it saying it wouldn’t be good enough even though they had already done what I was asking for once on a different image that was very similar. Now ignoring me when I have asked for them to do the edit I have requested and paid for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glenn Binegar",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T11:03:01.000Z",
          "Titre": "Great work",
          "Contenu": "Great work. Communication was a little off from time to time.  Would recommend though.  Skills are great."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Matt Luck",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T19:45:00.000Z",
          "Titre": "Best photography company",
          "Contenu": "Best photography company, they offer good services and they keep to their terms. I will always recommend them to my close friends they will thank me later"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T18:52:42.000Z",
          "Titre": "Work is very good and I am happy with…",
          "Contenu": "Work is very good and I am happy with the results.Work flow and excessive emails are a little frustrating but I would use the service again because the results are very good."
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "Aniek Goedegebuur",
          "Nb_Reviews": 25,
          "Date": "2023-03-21T07:26:41.000Z",
          "Titre": "Service is great and the photographer is professional.",
          "Contenu": "I thought TrickyPhotoshop was amazing. Very helpful and knowledgeable, he made sure my order was correct before completing the design. I would recommend this vendor to anybody in need of a professional photoshop expert!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Fay",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T19:28:40.000Z",
          "Titre": "This is the second time I've used their…",
          "Contenu": "This is the second time I've used their services. This particular project got a little bumpy, but in the end I got exactly what I needed and the Photoshop work ended up perfect. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katherine Morales López",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T21:36:36.000Z",
          "Titre": "I went out with some friends and took…",
          "Contenu": "I went out with some friends and took cute pictures but I didn’t have time to get my toes done so I needed to look painted and they did a great job with it ! I’m happy with results ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "merle smithers",
          "Nb_Reviews": 21,
          "Date": "2023-09-09T21:58:26.000Z",
          "Titre": "My requests were carried out pleasantly…",
          "Contenu": "My requests were carried out pleasantly and helpful and I found the  customer services exceptionally good"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Senguada martina",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T17:41:18.000Z",
          "Titre": "Nice and chic",
          "Contenu": "Nice and chic. I like it. Just test it and recommend. Unbelievable!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lena NT",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T14:53:06.000Z",
          "Titre": "communication and pricing issues",
          "Contenu": "I had a very difficult experience with the company where they did things I didn't ask for, and forgot to do those I requested and payed for. The final outcome was good, but anyone working with them should factor that in beforehand. My initial instructions were perfectly clear and it was extremely frustrating to interact with them while I reiterated my ask.  Also, they have a very uncomfortable price scheme and will ask you \"how much are you willing to pay...?\" There should be some sort of settle price list in place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T19:10:37.000Z",
          "Titre": "At first I was a little skeptical…",
          "Contenu": "At first I was a little skeptical because I had never heard of them or use their services so I read their reviews and like what I was reading and there ratings so I finally contacted them and here I am writing a review and yes I will recommend them and I will use there services again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carole M",
          "Nb_Reviews": 1,
          "Date": "2020-07-11T13:34:32.000Z",
          "Titre": "Vai was very helpful",
          "Contenu": "Vai was very helpful.  She did a very good job.  The only thing I did not like was the ridiculous payment games. Before she would begin working on my second print she wanted to know how much I was willing to pay her... and then she came up with a price which I believe was high.  I did pay it and am satisfied with the job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T21:42:17.000Z",
          "Titre": "TrickyPhotoshop did a great job",
          "Contenu": "TrickyPhotoshop did a great job! They were able to remove people from some of my daughters wedding pics. I couldn't believe it! I will definitely be using them again. With that being said, I feel I could only give him 4 stars because of his pricing practices. It would be nice if he provided some kind of fee schedule. Instead he wants you to come up with what you think it's worth. Most people have no idea how much something like this cost. TrickyPhotoshop please work on your pricing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Llavero’s Keyblade",
          "Nb_Reviews": 2,
          "Date": "2021-05-04T19:02:55.000Z",
          "Titre": "Great service, great job!",
          "Contenu": "I overall really like what they did with the photo I sent in, and I would very much recommend “Trickyphotoshop”. I just hope they can find a way to actually bring the entire picture back to life. But overall the service is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T18:50:20.000Z",
          "Titre": "He did not edit one of the photos I…",
          "Contenu": "He did not edit one of the photos I sent him correctly even after I asked him to for a second time but overall he edit the other pictures exactly like I wanted him to and the response and turn around time was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allison Leadon",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T17:11:55.000Z",
          "Titre": "Great System & Edits! But slow communication",
          "Contenu": "Vai is great! I loved the edits, she did everything I asked. My only complaint is it took a while for them to email me back . I wish they had been more prompt! Overall good experience. I give them a rating 4"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keeley",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T12:04:00.000Z",
          "Titre": "My rate!!",
          "Contenu": "I do like the work but somtimes they rush me to responed or they will take my pic and not send them to me but other then that 🙃 good 😁"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NaturaLee",
          "Nb_Reviews": 2,
          "Date": "2021-01-28T05:30:48.000Z",
          "Titre": "Prompt and Professional",
          "Contenu": "Vai was responsive and did a prompt turnaround. I asked for some additional changes and Vai was gracious and accommodating. I would use Vai again."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Daniel Rotimi",
          "Nb_Reviews": 3,
          "Date": "2021-02-23T15:49:57.000Z",
          "Titre": "Very quick response",
          "Contenu": "I sent vai a photo that had been ruined and i was so happy with the results. Very quick response too."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gary Newman",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T08:01:14.000Z",
          "Titre": "Great quick service",
          "Contenu": "Great quick service. Took about 6 hours from start to finish for 1 photo.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Joseph",
          "Nb_Reviews": 3,
          "Date": "2021-07-06T15:08:28.000Z",
          "Titre": "good company...",
          "Contenu": "good company.... satisfied with the work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T17:54:10.000Z",
          "Titre": "great but the sky was a little too much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T10:10:17.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, great product"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Cecil Triegaardt",
          "Nb_Reviews": 1,
          "Date": "2020-06-24T22:47:18.000Z",
          "Titre": "A prompt and effective service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:51:10.000Z",
          "Titre": "Had to do a xmas card and needed to…",
          "Contenu": "Had to do a xmas card and needed to swap faces and make a few more adjustments . Fast service & pleasant experience! Communication was great. I was a little skeptical at first but pleasantly surprised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:41:47.000Z",
          "Titre": "Good experience, quick turnaround",
          "Contenu": "Good experience. Photo came out great and was able to use it as I intended to. Price was reasonable and agreed upon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anissa Mechling",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:42:23.000Z",
          "Titre": "Communication through the site could be…",
          "Contenu": "Communication through the site could be easier. Multiple emails make it difficult to wade through."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:30:55.000Z",
          "Titre": "I was really impressed with this…",
          "Contenu": "I was really impressed with this company.  I was a really big pain in the rump asking for revision after revision for my photo to look perfect. Not only did they put up with me not being the funnest customer, they did everything I asked and I am thrilled with the final picture"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T07:51:52.000Z",
          "Titre": "Efficient and great customer service",
          "Contenu": "Each team member I spoke with attended to the specific needs of my picture and improved the photo so much! They were so quick, efficient, and happy to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Rosson",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:19:45.000Z",
          "Titre": "The people that run this site and the…",
          "Contenu": "The people that run this site and the editing are amazing. Never once did i feel like i was being taken advantage of. They were helpful and the product afterwards is absolutely stunning and very well done. I will be recommending them to everyone in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ecaterina Avelar",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T17:09:37.000Z",
          "Titre": "Vai and Monika from TrickyPhoto were…",
          "Contenu": "Vai and Monika from TrickyPhoto were super communicative and responded to all my questions. I wanted to edit a photo to then give as a gift; my jaw dropped when I received the edited photo- it was clear and brought the memory back to life! I found my photo people!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Fisher",
          "Nb_Reviews": 5,
          "Date": "2023-12-07T20:19:26.000Z",
          "Titre": "Perfect photo",
          "Contenu": "These guys could not of been more helpful. They managed to do an even better job on my photo than i could of imagined. Removed people from pic who were even holding each other. Adapted the background to suit even adding shadow. Could not recomend more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike w.",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:02:41.000Z",
          "Titre": "Very pleasant to work with!",
          "Contenu": "I was very skeptical about the way this company conducted its business. Most businesses today is just exactly that, a business. Monika and vai actually care about their customers and are passionate about their work! Monika worked with me and made me feel very comfortable with my transaction. This is a very legitimate and reputable company that does extraordinary work. Please don’t hesitate to use them for all your photo needs,they are absolutely amazing people to work with.  Very fair on prices I can’t thank them enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicolette Pedigo",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T16:42:15.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication, fast turn around, got all of the things I wanted done on the first try. Second time using, and will definitely return."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trace",
          "Nb_Reviews": 8,
          "Date": "2023-12-11T17:42:26.000Z",
          "Titre": "I have Vai editing my photos for the…",
          "Contenu": "I have Vai editing my photos for the past years. Very reliable site, so you don't have to worry about your photos being shared in public. Fast and great editing skills! Pricing is very fair. You can't go wrong with this site!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sophia-Lily Rose",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:30:32.000Z",
          "Titre": "Really great service",
          "Contenu": "Really great service. Super fast reliable and a really good pricing system."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dawn Ball",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T00:52:50.000Z",
          "Titre": "Brilliant service",
          "Contenu": "Trust worthy company. Vai and Monika are very hands on.I had no issues. They confirmed that what i asked for was do- able.Plenty of communication during process , the watermarked picture was brilliant. I liked the story behind the company., very interesting. Prices very competitive. Once i had paid the digital copy arrived very quickly. I was guided on submission of picture thru to payment.I will be using them again shortly."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T11:50:00.000Z",
          "Titre": "I was very happy with my experience…",
          "Contenu": "I was very happy with my experience with tricky photoshop. I had to get someone erased from a photo and they did it with ease. I also loved their business motto that you choose your own payment amount and whatever you can afford, is what you pay. Thank you again for my photo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jami McCormick",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:36:22.000Z",
          "Titre": "Fast Responsive Service",
          "Contenu": "The TrickyPhotoshop experts were fast & responsive to my request for modifications. Would use this service again, thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:56:54.000Z",
          "Titre": "Wedding Photo Removal",
          "Contenu": "I unfortunately had to have someone removed from my wedding photos. The pricing was very fair and they sent me a preview of a photo before expecting me to commit. I am 100% happy with the photos and would recommend this photo removal service to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian & Nichola",
          "Nb_Reviews": 9,
          "Date": "2023-12-09T07:30:11.000Z",
          "Titre": "Brilliant company",
          "Contenu": "Excellent work. They did everything that I asked and the turnaround was quick. I would recommend this company to anyone. Many thanks to Val and Monika."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:46:00.000Z",
          "Titre": "They were easy to work with",
          "Contenu": "They were easy to work with, showed patience with persistence but didn't pressure. And I'm satisfied with the results."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Maya Rajab",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T03:23:49.000Z",
          "Titre": "Honestly a 10/10 experience",
          "Contenu": "Honestly a 10/10 experience. There was friendly communication, the photo turned out great and they are really understanding with price and how much to pay! Definitely using again for future photos. Thanks guys :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brigette",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T05:42:00.000Z",
          "Titre": "Wonderful experience",
          "Contenu": "Wonderful experience, super quick turn around and my photo was retouched exactly the way I was hoping for. In fact, it exceeded my expectations.  I will certainly use Tricky Photoshop again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniela",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:41:13.000Z",
          "Titre": "Fast, Friendly, & Efficient!",
          "Contenu": "Fast, friendly, and efficient! I would definitely recommend this company and will use them in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Julie Frost",
          "Nb_Reviews": 6,
          "Date": "2023-11-09T14:14:15.000Z",
          "Titre": "This company is just brilliant…..",
          "Contenu": "My beautiful sister passed away 6 weeks ago and I was trying to find the perfect photo of her to put on a grave memorial. I found my perfect photo but I knew I wouldn’t be able to use it because it had one of her grandchildren close up to her. I sent the photo to trickyphotoshop to see if there was anything they could do and Monika worked her magic on it and made my photo just perfect. I can only describe this company as amazing, their customer service is top notch from start to finish. I would definitely recommend these guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Franklin Hilton",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:05:55.000Z",
          "Titre": "Very good and reliable service",
          "Contenu": "Very good and reliable service. Photos look good and prices are reasonable. Very skilled and kind workers always there to help and negotiate. Absolutely recommend them ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul M.",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:07:41.000Z",
          "Titre": "Outstanding job editing our photo!",
          "Contenu": "TrickyPhotoShop did a great job with our wedding photo! Very responsive and excellent editing. And their pricing model makes their services affordable for everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madisyn",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:16:14.000Z",
          "Titre": "Super quick, super nice, super helpful",
          "Contenu": "I was really blown away by this service! I needed a photo for my family’s Christmas card, and no one was smiling at the same time in any of them… until TrickyPhotoshop! Thanks y’all!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ADJS O",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T14:50:06.000Z",
          "Titre": "This company is AMAZING",
          "Contenu": "This company is AMAZING! Needed to swap faces as the children weren’t smiling, eyes were closed or it was blurry and TrickyPhotoshop was able to help us with it all! The delivery time is very fast too and they made sure we were satisfied. Their customer service was great and will be using them again. Would highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harriet",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T16:06:42.000Z",
          "Titre": "Excellent job on a tough assignment",
          "Contenu": "The job was a bit difficult, and they made adjustments until it was right. A great job and a pleasure to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chester",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:27:16.000Z",
          "Titre": "TrickyPhotoShop b&w photo restoration",
          "Contenu": "I recently had the pleasure of entrusting my cherished black & white photo to TrickyPhotoShop. Their restoration and colorization expertise exceeded my expectations. The attention to detail brought the image to life, preserving its nostalgic charm while adding a vibrant, realistic touch. The team's professionalism and commitment to customer satisfaction make them my go-to for any future photo restoration needs. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrs Fishy",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:08:20.000Z",
          "Titre": "This company is top quality",
          "Contenu": "This company was a pleasure to work with! Great communication for adjustments to my photoshop requests. Very happy with results, exchanging my face from another photo into family picture to use for Christmas card.  Highly recommend using their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T18:06:18.000Z",
          "Titre": "We had a family picture taken and our…",
          "Contenu": "We had a family picture taken and our oldest grandson lives far away so we can never get everyone together for a complete family photo. So I sent a picture to Tricky Photoshop of our grandson and they inserted his picture into my family picture so we could have everyone in it. They helped before with other photos and are top notch. Can make anything you want in a photo possible"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony",
          "Nb_Reviews": 9,
          "Date": "2023-11-02T08:29:28.000Z",
          "Titre": "Excellent service from start to finish.",
          "Contenu": "Excellent service from start to finish.Kept up to date on regular occasions Finished result is superb.Vai and Monika very helpful.Give it a try if you need anything photoshopped. Would definitely use in the future5*****"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T05:11:26.000Z",
          "Titre": "Couldn't be happier",
          "Contenu": "Love love love how my photos turned out. Excellent editing skills from Monika and Vai. So happy that I found you guys. The reviews don't lie. You're work and your level of professionalism speaks for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:53:16.000Z",
          "Titre": "This service saved me a lot of…",
          "Contenu": "This service saved me a lot of headaches! They communicated with me frequently and I received exactly what I asked for promptly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ewen Morrison",
          "Nb_Reviews": 5,
          "Date": "2023-10-22T17:51:52.000Z",
          "Titre": "Excellent service all work was carried…",
          "Contenu": "Excellent service all work was carried out in advance until I was satisfied before money was even nentioned. The sctusl work on the photo was amazing removing a central eyesore without damaging the images I needed to retain.Thank you again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee Amos",
          "Nb_Reviews": 9,
          "Date": "2023-10-19T17:56:24.000Z",
          "Titre": "Excellent service and results.",
          "Contenu": "The service and end result for the photo editing was excellent. The finished result was far better than I had expected. I would highly recommend, not only for their great service and results but also the cost and their approach towards this. First class!! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "amanda humble",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T13:54:45.000Z",
          "Titre": "Old photo of Doberman",
          "Contenu": "Brilliant restored old photo of our first Doberman my husband will be overwhelmed on Christmas Day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LUCILLE",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T04:30:17.000Z",
          "Titre": "I am so pleased with this company",
          "Contenu": "I am so pleased with this company. I had to have one of my pictures photoshopped for my Christmas card.  The finished product was amazing. I could not tell it was photoshopped. And they were so fast from the time I contacted them until I got my finished product. I think it was two days. I will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:02:09.000Z",
          "Titre": "Monika got back to me quickly and kept…",
          "Contenu": "Monika got back to me quickly and kept me in the loop as to how the photo was coming along. They did an expert job of removing a person in the photo so that no one would know. Great skill and great seevice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TR",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:23:42.000Z",
          "Titre": "Best photo edit experience",
          "Contenu": "I read so many reviews before I decided to send my picture in to be edited. I definitely give this company 5 stars!! I needed a person removed from a photo, and they provided me a result that was amazing!! The price of this service is very fair, and I will definitely use their services again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T14:39:24.000Z",
          "Titre": "Great service, best customer service!",
          "Contenu": "Monika and Vai did a great job of working with me until I was satisfied with the photo. They were prompt with communication, and I love Tricky Photoshop's policy on payment. This was not my first time using this service, and it will not be my last. Thank you, team at Tricky Photoshop!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pleased Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T12:01:16.000Z",
          "Titre": "Delivered on time and price was amazing"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:02:38.000Z",
          "Titre": "Perfect result",
          "Contenu": "Perfect result - will be framed as a Xmas gift."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Amy T",
          "Nb_Reviews": 20,
          "Date": "2023-10-08T09:19:56.000Z",
          "Titre": "Amazing editing skills at reasonable prices",
          "Contenu": "I had a wedding photo that bugged me with its imperfections, Monika made the edits I requested and we even negotiated a price that I could afford. I’m happy with my service today and would gladly use them again in future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika Orfin",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T17:42:34.000Z",
          "Titre": "Fast Service",
          "Contenu": "Fast Service, prompt responses, great  results.  I’m very happy/satisfied with the services, Monika was wonderful! My son got married and we missed taking a family picture “TrickyPhotoshop” did an amazing job, now we have a picture that will bring us a lifetime memories! I will definitely recommend them & will use their services in the future, thanks again. Erika"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T17:37:15.000Z",
          "Titre": "Amazing work and excellent customer service!",
          "Contenu": "I couldn’t be more happy with how my photo turned out. The emails I received from Vai and Monika were very informative! The whole process took 3 days which is amazing. I would definitely recommend this company, excellent work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helene Cross",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T22:28:51.000Z",
          "Titre": "A+ Quality &Team",
          "Contenu": "Sometimes an idea pops in our heads to create something special, but we don’t know how. TrickyPhotoshop is the go-to place to make it happen. Monika and her team helped me personalize a stock photo so that it has the images of some friends, thus helping me make note cards.  Besides quality work, the response time was outstanding and the personable customer service was a welcome treat. It left me with a sense that I was working with people who really care and like what they are doing. I definitely recommend TrickyPhotoshop for your photo project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T06:37:04.000Z",
          "Titre": "Product was well designed and executed…",
          "Contenu": "Product was well designed and executed by the photo editor according to my request. I am very pleased with the quality of the photo and the speed at which I received it. I will keep TrickyPhotoshop in mind for any future Photoshop needs I may have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Jackson",
          "Nb_Reviews": 9,
          "Date": "2023-08-29T23:43:49.000Z",
          "Titre": "Great experience from beginning to end!",
          "Contenu": "I was pleased with every aspect of my experience! I needed a photo to be edited and had no idea where to go with it. I did a Google search, and TrickyPhotoshop showed good ratings, including Trustpilot, so I chose them. From the beginning, I felt I was in good hands. The communication was prompt, frequent and friendly and the emails in between explaining how the company operates were helpful. Plus I loved the results and the price was very reasonable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:31:17.000Z",
          "Titre": "Great service",
          "Contenu": "I got exactly what I wanted. Was able to give notes about changes and recorded the product quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T21:52:41.000Z",
          "Titre": "I am very pleased with the care and…",
          "Contenu": "I am very pleased with the care and attention that Monika and Vai took with my project. They were very professional and polite as well. I look forward to contacting them with confidence for any future projects and highly recommend there services."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steph Davies",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T18:05:32.000Z",
          "Titre": "Used them many times and never disappointed",
          "Contenu": "I have used TrickyPhotoshop a few times now. They are responsive and happy to take feedback to get your picture to exactly how you want it. The final products are really high quality, I have used them for cutting someone out of a picture, improving the quality of an old photograph and some changes to enhance features. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth N",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T20:41:21.000Z",
          "Titre": "What an impressive service",
          "Contenu": "What an impressive service! Monika edited two precious pictures for me, and I couldn't be more grateful and satisfied with results! Will definitely use them again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Rowley",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T01:09:42.000Z",
          "Titre": "I was really amazed how well the…",
          "Contenu": "I was really amazed how well the picture came out.  Too actually see it in color was awesome.  There was a few minor details that could of been touched up,  but overall I'd highly recommend trickyphotoshop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn W",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T16:28:57.000Z",
          "Titre": "Happy customer",
          "Contenu": "I was extremely pleased with the photo editing service I received from Tricky Photoshop. They handled my request promptly and efficiently. They even reached out to me during the holiday!! I am extremely satisfied with my finished product. Consider me a satisfied customer who will continue future business with them!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jayme",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T16:16:11.000Z",
          "Titre": "Would recommend!",
          "Contenu": "I spent hours trying to merge two photos together so everyone was looking and had a smile on their face, but couldn't get everything to line up just right. Monika was able to get my picture to look perfect - like it was never Photoshopped!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Mattis",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T23:33:43.000Z",
          "Titre": "Made an unusable photo nothing short of GREAT!",
          "Contenu": "A 70 yr 'reunion' between two 90 year olds that served in 1953 on a battleship ...   photo of them in 2023 had terrible eyeglass reflections which ruined picture and not good for the Battleship newsletter.  The work to remove the glare was nothing short of amazing, even when I did not have any other pictures of the gentlemen for comparison.  Can't wait till I need their services again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Molly Marcus",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T06:57:14.000Z",
          "Titre": "TrickyPhotoshop appears to have a team of highly skilled and experienced professionals.…",
          "Contenu": "TrickyPhotoshop appears to have a team of highly skilled and experienced professionals who have a thorough understanding of the software and its capabilities. I dealt primarily with Monica and everything I am saying about TrickyPhotoshop, I am saying to compliment her work. She is brilliant.  Not only was she proficient in the necessary computer techniques, she and her team, had solutions that met every request.  The work consistently exceeded my expectations. They made a consistent effort to understand what I needed and to deliver the desired outcome. They actively listened and asked questions to clarify if there was any doubt. Both Monica and Vai provided excellent customer service; they answered emails promptly with a warm and reassuring response.  They met deadlines and were professional in every way. They were more than reasonable in their pricing and were fair and honest in their business practices. Tricky Photoshop should definitely get the highest rating, 5 stars for sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joaquin Tedtaotao",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:03:08.000Z",
          "Titre": "Monika and this company really did a…",
          "Contenu": "Monika and this company really did a great job on handling what the customer really wants done to correct photos as per customer requested.In no time the responses were quick and I really didn't expect that to happen.They worked continuosly,regardless if it's a weekend or holidays.They really replied back for the customers request and making sure you the (customer) have the final word to go ahead and do the task as per customer's request.I urge or recommend this company to everyone that's in the same situation as mine with NO regrets.Monika....keep up the Good work!Joaquin TedtaotaoLakewood,Ca."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Socorro socorro",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T03:10:00.000Z",
          "Titre": "Birthday party pics",
          "Contenu": "Added person to picture so perfect could not tell he was added on. Fantastic job."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "amanda humble",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T10:55:14.000Z",
          "Titre": "Beautiful photo",
          "Contenu": "The tricky photoshop did a brilliant job of restoring an old photo. I feel sure that some happy tears will be shed over Xmas  well done!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JanCarol",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T02:34:45.000Z",
          "Titre": "Removed unsightly shadow",
          "Contenu": "This is the third project TrickyPhotoshop has done for me and as always they are quick to respond, willing to make adjustments until I am completely satisfied and very reasonably priced. They have done wonderful work for me. This time they removed an unsightly shadow from behind my husband’s brother’s WWII Army photo. We are very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven K",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T09:29:53.000Z",
          "Titre": "Great Service",
          "Contenu": "I was looking for someone to edit a photo. TrickyPhotoshop did wonders. Great service as they accommodated everything I needed for my photo to be well done. When I need another photo edited I will definitely be coming back to Tricky Photoshop."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "J Newlands",
          "Nb_Reviews": 6,
          "Date": "2023-07-24T15:45:44.000Z",
          "Titre": "Great service and professional",
          "Contenu": "They restored my old photograph beautifully and cleaned it up. We had several email discussions about getting the correct colour for hair and eyes and they changed it several times until I was happy with the result.I knew that they would do a professional job because I had used their services a couple of years ago and it went well.I will use Tricky Photoshop again as they are helpful friendly easily available and they are very good at what they do. I would recommend their services to anyone. Thanks very much Vai and Monika."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monique Sadler",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T15:33:39.000Z",
          "Titre": "Quick response and excellent work",
          "Contenu": "Quick response and excellent work.  Monika was able to restore 60-year-old pictures for my Dad's memorial service. These pictures will greatly enhance the tribute video being produced.  THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:36:50.000Z",
          "Titre": "Monica was brilliant she emailed me…",
          "Contenu": "Monica was brilliant she emailed me responses as quickly as possible. I sorted a photo of my Father in law and the photo was edited to perfection. I would recommend anyone on this site"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T04:37:13.000Z",
          "Titre": "They worked with me to get me exactly…",
          "Contenu": "They worked with me to get me exactly what I wanted. Very good quality at a fair price That is why I am a repeat customer."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Baldwin",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T18:49:04.000Z",
          "Titre": "Recommended.",
          "Contenu": "Very good. I had a photo that I really wanted editing, erasing background objects without affecting the subject etc, and I had tried and failed dismally to do it myself. I also wanted text added. So I sought help online and found this site. You sometimes have to take a leap of faith but well worth it. Perfect solution and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Bennie Shaw",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:19:21.000Z",
          "Titre": "I sent a Black & White photo to the…",
          "Contenu": "I sent a Black & White photo to the company and within a couple of days the photo came back in color and for a very reasonable fee.  Because of the service rendered, I have sent another Black & White photo to have them transformed to color."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Waqas Sarshar",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T20:02:42.000Z",
          "Titre": "This company has done an amazing job…",
          "Contenu": "This company has done an amazing job with all my pictures thus far surpassing my expectations. Great amazing work and reasonably priced. And something that I can’t appreciate enough is the constant communication from Vai. Going above and beyond to make sure that I was satisfied with the results. I more than happy and satisfied with the result."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shelagh C",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T21:42:25.000Z",
          "Titre": "Excellent service and product!",
          "Contenu": "Would highly recommended this company. Have used them few times. Never dissappointed. Quick, efficient, professional and helpful. Great product, price and people."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "K",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T17:07:11.000Z",
          "Titre": "Very fast response times, quality work",
          "Contenu": "Very fast response times. Did an excellent job of removing two people from my photo. Received the digital copy quickly after a payment of £15 which my husband said was reasonable for the work carried out. Would use again."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Audrey Kearns",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T23:04:04.000Z",
          "Titre": "Fantastic results.",
          "Contenu": "Fantastic results.. parents had very few wedding pictures and the best one they had was water damaged. Picture is perfect now and exactly like original photograph, delighted with results as gift for my parents 30th wedding anniversary. Was kept informed through the whole process which was greatly appreciated. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T07:33:27.000Z",
          "Titre": "Amazing work",
          "Contenu": "Amazing work! Constantly modified picture to your liking and responds quickly to your emails. This is an amazing company and will utilize them more often for future tasks. Price is affordable and you get great customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:47:40.000Z",
          "Titre": "Service was quick and easy",
          "Contenu": "Service was quick and easy. They did exactly as I requested"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CHRISTINE GOODMAN",
          "Nb_Reviews": 10,
          "Date": "2023-08-25T09:32:29.000Z",
          "Titre": "I’ve used this company quite a few…",
          "Contenu": "I’ve used this company quite a few times now, they are brilliant, nothing is too much trouble whatever you want they do, they are friendly reliable service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:18:33.000Z",
          "Titre": "Great service! Thank",
          "Contenu": "Great service!  Loved the finished product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T23:00:55.000Z",
          "Titre": "Very responsive and attentive",
          "Contenu": "Very responsive and attentive people! Did exactly what I wanted first try, with no hassle. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Claire JAMES",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T17:02:02.000Z",
          "Titre": "First Class",
          "Contenu": "A first class experience from start to finish. Monika explained the process step by step and I am thrilled with the result of a restored picture. I cannot wait to present this to my mum as a gift. Will definitely use their services again in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T18:05:59.000Z",
          "Titre": "Happy Customer",
          "Contenu": "I've been using TrickyPhotoishop for photo editing the past several years. Vai and Monika have always been quick to respond and patient with requests for modifications. I am happy with their service and product and will continue to work with TrickyPhotoishop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerold Mallett",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:48:49.000Z",
          "Titre": "TrickyPhotoshop is great!",
          "Contenu": "TrickyPhotoshop is great, the images I need corrected is done in a timely manner and the customer service is great. Allowing you to pick your price is an added plus. I highly recommend this company for your graphic needs."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Shaun Dewhirst",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T23:51:57.000Z",
          "Titre": "Professional and easy to use",
          "Contenu": "So professional, and easy to use. The whole process took 3 days and I have the finished product. Exactly what I was after, no fuss or hassel, just great work. Couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Julie",
          "Nb_Reviews": 7,
          "Date": "2023-07-04T16:08:15.000Z",
          "Titre": "Fantastic work!",
          "Contenu": "Monika and co did an excellent job on altering my photo and with a very quick turnaround! The process was clearly explained and the follow up on my comments was second to none. They are clearly a customer focused company. I have no hesitation in recommending them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:50:31.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Highly recommend!  They did an excellent job for me.  I needed a picture of my dad photoshopped for a “Celebration of life” party for him.  It was so neat, I cried my eyes out!  It was absolutely perfect!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Beth Adamson",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T15:58:44.000Z",
          "Titre": "I'm setting up my own online store now",
          "Contenu": "I'm setting up my own online store now. this service saves lots of time. Their wide range of functions, including adding or changing backgrounds is impressive. I was delighted with the free demo, it's really worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Rauhecker Crown",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T16:10:56.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Highly recommend!  My mother didn't have a recent picture of her and my father (he has been ill and bedridden for several years).  I found a group picture from my son's wedding and thought I would try TrickyPhotoshop to edit the photo.  The results were amazing.  Monika and Vai were a pleasure to work with and quick!  My mother absolutely loved it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lydia Thorsen",
          "Nb_Reviews": 30,
          "Date": "2023-11-24T18:49:38.000Z",
          "Titre": "Quick and professional",
          "Contenu": "Very quick and professional service.  Loved what they did with my photo."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jinty Agnew",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T04:57:38.000Z",
          "Titre": "Fathers photo",
          "Contenu": "Even from a different continent TrickyPhotoshop were able to carry out/complete my request in a timely and professional manner. The photo they have repaired for me was one which I thought was not fixable. It was returned as good as new. I will treasure it. Thank you. I would use again and absolutely recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maryanne",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:04:19.000Z",
          "Titre": "Nice editing job",
          "Contenu": "TrickyPhotoshop was a pleasure to do business with. I had a blotchy picture of my parents from a damaged negative and they were able to fix it for me. I even asked them to make a few changes with no problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T05:34:02.000Z",
          "Titre": "Excellent explanation(s) of the process…",
          "Contenu": "Excellent explanation(s) of the process and cost.  Most helpful as I was a neophyte in understanding the ins and outs of what to do.  I thought, for example, I had to mail the original photo.  No, not at all.  I could choose the final product from a selection of photos.  I was quite happy with the assistance and, of course, the final product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AMunoz",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T18:00:12.000Z",
          "Titre": "Great experience for memorial photo!",
          "Contenu": "Great experience working with the team at TrickyPhotoshop. They are very prompt and takes their time to meet your request from start to finish. The turnaround time is fairly quick and quality of work is very good. Had memorial photos made and I like the quality very much. Great surprise and gift to a loved one. Highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vishnu Priya",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T02:02:08.000Z",
          "Titre": "Monika was great at her work.",
          "Contenu": "Tricky Photoshop is amazing. Monika was guiding me. She edited 2 photos which are perfect and how I wanted them to be. She was also very quick at her work. Responded to me immediately. Very affordable and perfect work was done by them and her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Redden",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T14:30:34.000Z",
          "Titre": "Monika is SPECTACULAR!!! Perfect Photos!!!",
          "Contenu": "I worked with Monika and she was exceptional. She is very patient and made many changes for me, great work and the final photos were perfect!!! GREAT JOB MONIKA!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Herber Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T00:50:18.000Z",
          "Titre": "High Quality, Communication Throughout, and Quick Turnaround",
          "Contenu": "I would like to give TrickyPhotoshop five stars for: communication throughout the entire process, quick turnaround time, and the high quality of final product. From beginning to end, it was a one day turnaround and the end result turned out great! I will definitely recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T23:19:21.000Z",
          "Titre": "They do an amazing job every time",
          "Contenu": "They do an amazing job every time!  Fast and efficient"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T14:59:38.000Z",
          "Titre": "10 out of 10 service",
          "Contenu": "10 out of 10 service Everything I was requested was done to the letter and the way they do business is absolutely amazing I would highly recommend this company to edit your photos"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexiss Baker",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T05:10:47.000Z",
          "Titre": "Great Pricing Options!",
          "Contenu": "Vai is a wonderful person, they respond quickly and efficiently! They allow the customer to choose their own pricing! Will definitely be recommending their service for those in need of photo repairs!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 10,
          "Date": "2023-11-09T07:00:04.000Z",
          "Titre": "Outstanding",
          "Contenu": "The results to clear the messy background of a beach photo of my grandchild were absolutely amazing! Monika at TrickyPhotoshop is worth every one of the 5stars I gave Would defiantly use the company again. Rebecca"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "edmundo sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T15:56:16.000Z",
          "Titre": "VERY GOOD JOB",
          "Contenu": "VERY GOOD JOB,  FAST SERVICE, THE PREVIEW THEY SENT ME WAS OF GREAT HELP, AND MONIKA MADE THE CORRECTIONS I SUGGESTED IMMEDIATELY.  AFTER I MADE MY PAYMENT AND RECEIVED MY DIGITAL PHOTO I ASKED IF THEY COULD MAKE AN ADDITIONAL CORRECTION AND MONIKA DID IT, IMMEDIATELY AT NO ADDITIONAL COST. I HIGHLY RECOMMEND THEIR SERVICES!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GAZELL SIMAN",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T21:19:40.000Z",
          "Titre": "Monika was amazing with response time…",
          "Contenu": "Monika was amazing with response time and how quickly she delivered the edited image. I was happy with the pricing and the quality of the picture. I will definitely be using Trickyphotoshop again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:07:29.000Z",
          "Titre": "I have used them a few times now",
          "Contenu": "I have used them a few times now. Great results with each time. I try another company as well. It didn’t look right. This company works with you until you are satisfied. What else could you ask for. They are great and the customer service is superb. Can’t wait to use them again."
        }
      ]
    }
  ]
}