{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "trustedtechteam.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Price",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:32:28.000Z",
          "Titre": "Your codes and e-mails did not work",
          "Contenu": "Your codes and e-mails did not work. I have an activate windows on my screen.Waiting for refund, please check with this order!I have already had e-mails saying a refund is coming.Still waiting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gareth Pereira",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T15:15:54.000Z",
          "Titre": "Scam company",
          "Contenu": "Scam company!  They have been trying to take money for cancelled subscriptions for months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Shadman",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T19:48:14.000Z",
          "Titre": "The salesperson was overzealous and…",
          "Contenu": "The salesperson was overzealous and contacted me more times than I wanted. And the retargeting ads on YouTube are constantly plaguing me even after I made the purchase and told Google to block the ad. I have been a TTT customer/dealer in the past, and I will continue to buy Microsoft licenses from them. But for the love of God, get these ads to stop!"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Maureen Allard",
          "Nb_Reviews": 2,
          "Date": "2020-06-27T15:11:53.000Z",
          "Titre": "I was sent the wrong Product Number",
          "Contenu": "I was sent the wrong Product Number, which ended up causing 3 hours of support with the Intuit people and a lot of hassles all around. We finally got it resolved and the new upgraded 2020 version of QB is up and running - as far as I know... :-)Except for that problem, your service was excellent and my later discussions with Nick have been great. I am looking forward to future purchases from you folks.Thanks,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lanny Keithley",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T18:37:05.000Z",
          "Titre": "I was sent the wrong Product Number",
          "Contenu": "I was sent the wrong Product Number, which ended up causing 3 hours of support with the Intuit people and a lot of hassles all around. We finally got it resolved and the new upgraded 2020 version of QB is up and running - as far as I know... :-)Except for that problem, your service was excellent and my later discussions with Nick have been great. I am looking forward to future purchases from you folks.Thanks,Lanny"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janie Keebler",
          "Nb_Reviews": 2,
          "Date": "2020-09-13T17:33:47.000Z",
          "Titre": "Been shopping with these guys for a few…",
          "Contenu": "Been shopping with these guys for a few years now. Always have incredible deals going on and customer support is top notch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Hill",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T02:48:03.000Z",
          "Titre": "I requested a license quote",
          "Contenu": "I requested a license quote. I was asked a few questions and processed the quote. I then received the licenses with detailed instructions and the licenses are applying correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VincentT",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:40:10.000Z",
          "Titre": "Great experience.",
          "Contenu": "Great price and quick fulfillment. No problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Computer Revolutions",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:49:06.000Z",
          "Titre": "No Saving Payment Methods",
          "Contenu": "Everything about Trusted Tech Team is great but the inability to save payment methods is an annoyance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valley IT Support, Inc",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T21:18:29.000Z",
          "Titre": "I am disappointed that after the first…",
          "Contenu": "I am disappointed that after the first install of a product and it if has to be reinstalled due to hardware fail a year or two later you do not offer any support. not even a MS support number to get the issue solved.I had to use a download of the product from my action pack an then use the key provided to reinstall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PC Conqueror LLC",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T21:23:07.000Z",
          "Titre": "The prices were what sent me to Trusted…",
          "Contenu": "The prices were what sent me to Trusted Tech Team, but the service I received from Ethen in sales was great. He followed up with me through the whole process but was never pushy. If needed I will definitely use them again."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "abhilash purti",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T10:01:57.000Z",
          "Titre": "Great Experience",
          "Contenu": "When I first tried to buy Office, I inadvertently purchased a European version that does not work in the United States from another website. I was able to contact Trusted Tech Team's Sales Department and explain my requirements as well as my previous experience. They also suggested a product that was less expensive than the previous one. I bought it, downloaded it, and activated it, and everything worked flawlessly! I wish I had used this company first; it would have saved me time and money!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Misterbaccia Galupe",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T01:22:38.000Z",
          "Titre": "Straight forward- delivered as promised…",
          "Contenu": "Straight forward- delivered as promised - except I expected download link within 30 minutes. It took about 2 hours to get link, although this was late at night. I hate the website with the extremely annoying pop up for a webinar. I had to reduce the size of the page to be able to \"x\" it out but it still kept coming back"
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "Melin Da",
          "Nb_Reviews": 5,
          "Date": "2020-10-16T07:33:56.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, only issue it didn't take coupon code for $20 and the response said use a $5 instead but no access to that. It did give me $10 off at leastReason I chose this business: Best price and good reviewsReason I chose this product: Needed to upgrade to continue with online emailing access"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vic",
          "Nb_Reviews": 3,
          "Date": "2022-06-13T13:35:56.000Z",
          "Titre": "Oder process was straight forward, but",
          "Contenu": "Oder process was straight forward and customer-friendly.  I ordered the download version of a Kofax product.  The invoice/confirmation was produced immediately.  It, though, did not indicate that download instructions would be separately provided.  I went to \"Frequently Asked Questions\" to learn what could have been included with the confirmation.  Two types of software, physical media and download.  Probably easy (?) to include indication that \"Download/activation instructions will be separately provided\" (or similar) when customer has purchased a download product.  Or include similar language with each confirmation?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott W",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T21:49:04.000Z",
          "Titre": "Mostly a great experience",
          "Contenu": "Mostly a great experience.  The guides are helpful as well.  TTT did have to provide a temporary key to get me out of Eval mode to Standard.  Once this was done, the provided key worked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damon Kaufman",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T04:59:07.000Z",
          "Titre": "They did a good job",
          "Contenu": "They did a great job. We had some hiccups getting the download link due to the time of day we placed the order. We fell off the edge every way we could. An email to Tech Support fixed the issues and everything was great. Nice pickup guys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wanda Horn",
          "Nb_Reviews": 1,
          "Date": "2018-06-19T20:16:33.000Z",
          "Titre": "The last representative was helpful in…",
          "Contenu": "The last representative was helpful in correcting the error and made an effort to satisfy me for my inconvenience. Thank You for your help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shao Xun Loke",
          "Nb_Reviews": 1,
          "Date": "2018-06-15T20:48:12.000Z",
          "Titre": "great discount not available on the…",
          "Contenu": "great discount not available on the official site, good service. Will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Wibbelman",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T00:54:51.000Z",
          "Titre": "Was a little confused",
          "Contenu": "Was a little confused, finally figuired out exactly what I needed to order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TLMac",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T17:57:35.000Z",
          "Titre": "wow...that was quick!",
          "Contenu": "thanks for the quick response and follow up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat K",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:18:57.000Z",
          "Titre": "Trusted Tech Team was excellent",
          "Contenu": "My experience with Trusted Tech Team was very good.  I got quick responses from customer service, and everything I purchased worked just as it should.  I would use Trusted Tech Team again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Glick",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T17:05:06.000Z",
          "Titre": "I bought the wrong program for my…",
          "Contenu": "I bought the wrong program for my operating system.  After I ordered the correct system they promptly refunded my account for the erroneous purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert McCurdy",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:16:36.000Z",
          "Titre": "Ability to accommodate change in…",
          "Contenu": "Ability to accommodate change in delivery address at last minute.  Very much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "thomas borjon",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:18:19.000Z",
          "Titre": "TTT did a good job",
          "Contenu": "TTT did a good job, but Microsoft failed.  They followed up and continued to prod Microsoft, who acted like they could not give a rat's ass about our concerns.  Microsoft delayed until logs that would have been valuable to investigate were deleted, and there was no point in continuing the investigation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T23:29:45.000Z",
          "Titre": "Thanks for youf friendly professional support!",
          "Contenu": "I'm happy now that I've found your company to support my Microsoft.   I was purchasing from another national company that was much less responsive.  My representative there answers the phone calls and emails promptly and takes care of all of my questions and requirements.   Keep up the great work! MJ"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas C",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T22:23:43.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "I posted a question on their website and received a phone call within the hour. After noting what I needed, the company provided services immediately and at lower costs than others. The Trusted Tech Team also followed up multiple times to ensure that all was good and if I needed additional assistance.  I would use this company again and recommend it to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Fulmer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T02:12:32.000Z",
          "Titre": "Needed Windows Server Datacenter",
          "Contenu": "Needed Windows Server Datacenter, GOT Windows server, job done. Instead of faffing about with the \"VAR\" type resellers, I bought what I needed (DCE with SA) and had the license in a week. It would have been a week to setup a meeting with the \"licensing team\" at Insight, those jokers have screwed up each of three renewals in the last nine years for our MPSA position. Much prefer the direct experience with TrustedTech."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan L.",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T19:12:52.000Z",
          "Titre": "Best server licensing purchase experience",
          "Contenu": "Multiple purchases in, best prices, fastest delivery on licenses I've ever seen.  Quickly became my go to for all server licensing.  They are amazing!  Finally a company that doesn't make me hate my existence when I need to order licensing for servers :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WMT-iT",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:21:47.000Z",
          "Titre": "Purchased multiple Windows Server and…",
          "Contenu": "Purchased multiple Windows Server and Windows Pro Licenses for our business, licenses worked perfectly and customer support sent them out very quickly after the purchase. Will buy from here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Mcsherry",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:27:13.000Z",
          "Titre": "I was researching the windows 365…",
          "Contenu": "I was researching the windows 365 security product and saw many options. the support team provided me with suggestions and pricing for the various options."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Kono",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T16:52:59.000Z",
          "Titre": "Love master Luan & Trusted Team!!!!!",
          "Contenu": "Luan is a master at the art of stellar sales, service and support.  I call, he gets my order instantaneously with excellent pricing.  I also love the personalized support (had to call one time & it was my fault) - Overall a polished, superb team ... truly, a Trusted Tech Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CompuTechNet",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:29:15.000Z",
          "Titre": "The sales agent (Andreza Kenny) was…",
          "Contenu": "The sales agent (Andreza Kenny) was courteous and quick in understanding our needs and offering the best available solution.The whole process from inquiry to purchase took less than 5 minutes."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Adam Saccon",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T22:52:05.000Z",
          "Titre": "Canadian Company ordering licensing…",
          "Contenu": "Canadian Company ordering licensing from TTT they are great have great discounts on licensing even cheaper then direct from Microsoft, always transparent about changes happening. 1 small thing when we first signed up with them they promised Canadian $$ but first got billed in USD but looks like they opened a Canadian account and now bill in CAD for the same amount they promised. Truly the customer service is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:53:47.000Z",
          "Titre": "Server upgrade from 2012 to 2019.",
          "Contenu": "Sales was very easy to work with and asked questions to make sure I ordered the right Server software for upgrading Windows Server 2012.  I had a few questions and Sales checked with Tech support during the call to make sure everything was copasetic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey P",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T19:08:10.000Z",
          "Titre": "Great company to buy software from",
          "Contenu": "I wasn't sure when I researched a site to purchase my Adobe Acrobat 2020 Standard software.  But Trusted Tech came through with good ratings, a great price, and an easy download instructions.  I would DEFINITELY recommend them for anyone!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hank Vander Waal",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T05:08:43.000Z",
          "Titre": "the support / sales team was great when…",
          "Contenu": "the support / sales team was great when I realized I had purchased the wrong license they quickly canceled the order and showed me the one I needed to buy and handled the whole ting  in a very helpful manner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert Zaidner",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T12:02:45.000Z",
          "Titre": "Staff very knowledgeable and…",
          "Contenu": "Staff very knowledgeable and professional. These two ingredients that are not very common in today’s world is the key to great success.Great customer service also made my experience extremely satisfying.Thanks for a great job!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Aman Chauhan",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:06:26.000Z",
          "Titre": "Always appreciated the help from Luan",
          "Contenu": "Always appreciated the help from Luan. There was small misunderstanding about fortinet renewal, but Luan looked into it and took care of it for us. Thank you Luan for your great help!Looking forward to doing business in future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George A. Ronay",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T00:43:33.000Z",
          "Titre": "Good agent on the phone",
          "Contenu": "Good agent on the phone, very direct when answering all of my questions. Product was exactly what I needed and saved me a lot of money by not shopping locally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zack W",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T16:43:00.000Z",
          "Titre": "TTT As a CSP",
          "Contenu": "As a 365 partner, Trusted Tech Team stands out in its support team. They are a sharp contrast to standard MS support in that TTT agents are knowledgeable, amicable and seem genuinely invested in resolving your problems. Their portal can use some work, but it has been improving over the last year. Overall, they were able to save a significant amount on our licensing and provide a much better support option than Microsoft's support -- all requiring little to no effort on my end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rick",
          "Nb_Reviews": 4,
          "Date": "2023-10-27T21:50:43.000Z",
          "Titre": "windows server 2016",
          "Contenu": "ordered and received windows server and cals quickly. had an issue with the install and it was handled very quickly by their tech support. the issue was Microsoft's not theirs. will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold Hardy",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T18:13:22.000Z",
          "Titre": "I ordered the wrong thing",
          "Contenu": "I ordered the wrong thing, and when I contacted support, they quickly identified the problem and processed my refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:04:10.000Z",
          "Titre": "Andreza was amazing",
          "Contenu": "Andreza was amazing. She made sure I was taken care of even with my very small order. It’s nice to have “personal” customer service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Elchlepp",
          "Nb_Reviews": 3,
          "Date": "2020-10-30T20:17:49.000Z",
          "Titre": "Top notch outfit This is",
          "Contenu": "Top notch outfit This is.  I'd buy from them ANYTIME without hesitation at all.  Fast transaction.  Most affordable option I could fine from a highly rated online seller.  They easily earned my highest recommendation for how easy everything was getting software that is overpriced EVERYWHERE ELSE.  They're legit, I vouch for that for sure.  Intuit is often a nuisance, and getting QB Pro Desktop 2020 from here was as easy as can be.  Many Thanks TTT!Chuck Elchlepp"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane Lewis",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T21:22:54.000Z",
          "Titre": "Trusted Tech always goes above and…",
          "Contenu": "Trusted Tech always goes above and beyond when it comes to Windows Licensing....  They are always knowledgeable and helpful at troubleshooting stubborn key problems.  Nothing like ordering on the phone, or chat, the key showing up in your email and the tech staying online to make sure it gets activated.  Wish all businesses ran this way"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "carlos cuadra",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T03:20:00.000Z",
          "Titre": "Ethan Reyes was excellent to deal with",
          "Contenu": "Ethan Reyes was excellent to deal with. I will definitely be using his and trusted tech teams services once again in the near future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T17:13:48.000Z",
          "Titre": "Last Call for Quickbooks Single-Fee Software",
          "Contenu": "On my way to Intuit's website to purchase Quickbooks \"upgrade\" from 2012 to subscription-based current version, I stumbled across Trusted Tech Team offfering a single-fee license for this product.  I'm glad I did.  Unfortunately, Intuit has plugged this hole as of Dec 10. 2021.  Bad for us small fry, and it will probably put Quickbooks out of business.  Please note that I called Intuit prior to purchase asking whether or not their program files can run on a network drive.  The correct answer is yes-but only in a Windows server/Windows client environemnt--not on a NAS device.  Sheesh."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KELLY BRIGGS",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T22:43:04.000Z",
          "Titre": "Great vendor, 2 purchases in...",
          "Contenu": "Andreza is great and has been super helpful every time we need something.  Great recourse, highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Kane",
          "Nb_Reviews": 5,
          "Date": "2023-10-03T19:36:38.000Z",
          "Titre": "Purchasing from the website was an easy experience.",
          "Contenu": "Purchasing from the website was an easy experience. We only purchased licenses and the follow up emails regarding the orders, the license keys and the links to download the software payloads were easy to understand and simple to complete."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Garrett",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T21:16:41.000Z",
          "Titre": "Knowledgable sales person with answers…",
          "Contenu": "Knowledgable sales person with answers to all my questions.  Your direct relationship with Microsoft and the first line support provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Lund",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T00:03:15.000Z",
          "Titre": "License purchases are super easy!",
          "Contenu": "License purchases are super easy! Never had a problem. They also provide instructions for activation for those instances where installation and activation of some products isn't quite as easy as would be expected. (Microsoft upgrade activations.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dianne Mcmeen",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T21:01:28.000Z",
          "Titre": "Recently purchased MS Office Home and…",
          "Contenu": "Recently purchased MS Office Home and Business.  The ordering was extremely easy and upon downloading, incurred a small issue with the previous software on my system.  Nick M. was absolutely fantastic and quickly and courteously solved my issue.  He was extremely knowledgeable and went through many systems to find and solve my problem.  Highly recommend this young man.  I was very impressed.  Thank you Nick!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "johnbiz",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:46:04.000Z",
          "Titre": "Always very responsive and a great tech…",
          "Contenu": "Always very responsive and a great tech team backing up product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madelyn Mikkelsen",
          "Nb_Reviews": 1,
          "Date": "2017-11-10T19:58:21.000Z",
          "Titre": "TEN STARS",
          "Contenu": "I am MORE than pleased at the support and help received from Nick this morning.  His complete understanding of the problem and his knowledge of how to implement the solution reflects wonderfully on your company and the quality of the product.  I would definitely recommend this and, in fact, my sister in New York will probably purchase MS Office when her subscription to 365 which came with her new laptop expires next year.  So, again, thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nicola Etheridge-Spinosa",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T13:53:04.000Z",
          "Titre": "Julian was my rockstar",
          "Contenu": "Julian was my rockstar!  I needed help with server licensing (a little over my head - just a very small business owner) I've spoken to Microsoft directly as well as some other re-sellers and he was the first to explain it to me in language I can understand (not IT talk) - BAM! purchased what I needed over the phone - in and out in under 5 minutes!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Polaris",
          "Nb_Reviews": 1,
          "Date": "2018-02-20T16:10:31.000Z",
          "Titre": "Purchased a Server 2016 License for my…",
          "Contenu": "Purchased a Server 2016 License for my company from Trusted Tech Team. The price was the best on the market. Received the license key code, download link & instructions within 2 minutes of ordering and the process went extremely smooth. I ran into NO issues at all, I was and am pleasantly surprised. Love this company!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T22:41:55.000Z",
          "Titre": "The process is easy and once you get…",
          "Contenu": "The process is easy and once you get used to the installation process the whole thing comes together perfectly.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 4,
          "Date": "2020-03-04T18:27:20.000Z",
          "Titre": "Mark of Excellence",
          "Contenu": "I have chatted over the many years with technical supports and such and have been generally frustrated by the agent either with poor knowledge, lack of interest and terrible delays in response.  Kristing what the agent I have been chatting with was so Professional and helpful.  Her Professionalism, thoroughness and attention to detail was so very much appreciatedKristin even went to the extent as providing me with the web site to learn how to delete my old version. So with That Thank You for Kristin's Mark of Excellence !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Kaye",
          "Nb_Reviews": 4,
          "Date": "2022-09-19T23:49:09.000Z",
          "Titre": "Trusted Tech is a great resource",
          "Contenu": "Using Trusted Tech was easy, fast and clear.  The website made it easy to find and order a specific product. It is particularly good that one can have direct verbal communication with a knowledgeable person, without the need for chatting or emailing any questions.  I would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stewart Garzarelli",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T14:14:46.000Z",
          "Titre": "The place to go for licensing and…",
          "Contenu": "The place to go for licensing and software.  Trustworthy, competitive pricing, excellent customer service, and great delivery.  They do it all very well.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tom Wolfe",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T15:48:56.000Z",
          "Titre": "Positive, Pleasant & Prophetic!",
          "Contenu": "Julian sure saved our bacon, eh - we're in Canada. No thanks to Microsoft Support, Julian grabbed the bull by the horns and made things happen. In the end, a happy ending. Really appreciated the effort and can't recommend TTT enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mister Person",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T22:24:50.000Z",
          "Titre": "Excellent company",
          "Contenu": "They're about the only trustworthy source of malwarebytes lifetime licenses, you can't even get them from the malwarebytes company anymore. They're doing a great service to the world. Their links came quickly, keys/IDs were correct and worked rapidly, i highly recommend utilizing their services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T05:29:55.000Z",
          "Titre": "Office installation went perfectly",
          "Contenu": "Ordering MS OFFICE online these days is a bit dicey as there are multiple scammers, schemes and illicit offerings. And some of the review sites are equally unreliable. Trusted Tech Team has been around for a number of years, is BBB accredited, has a working US phone number and email, and a US address. So I took a chance and ordered. Since it was after hours the download information did not arrive until 9am EST the next day. I did not use their link to Microsoft setup, but accessed the site on my own; I would now say most probably their link is safe, but I was spooked by all the online warnings. I signed into my account (they give directions if you don't have a MS account already), entered the 25-digit code they provided and the download and installation worked like a charm. I couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor C.",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T20:51:34.000Z",
          "Titre": "These guys rock!",
          "Contenu": "These guys rock. Nick M. was able to pinpoint an issue with activating a Windows 10 license and resolved it in a timely manner. They also gave us a heck of a deal on Windows licensing in our entire organization. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Distler",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T21:15:58.000Z",
          "Titre": "MS-SQL licensing advice",
          "Contenu": "I have been a software applications consultant for more years than I want to admit.  Still, pricing out something like MS-SQL is so damn confusing.  Less that 15 minutes with Todd cleared up everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Harper",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T13:43:13.000Z",
          "Titre": "Fast and Best Prices",
          "Contenu": "Their prices were the best I found.  The quoting and ordering process was very fast and effecient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaclyn",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T19:42:22.000Z",
          "Titre": "Kristin is the BEST",
          "Contenu": "Words do not even begin to explain how grateful I am to  Kristin, the Live Chat Professional who assisted me today. She solved a very important problem for me in a matter of seconds that I had been struggling with for days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Pennock",
          "Nb_Reviews": 6,
          "Date": "2018-01-30T20:12:30.000Z",
          "Titre": "I was facing a tight deadline on my …",
          "Contenu": "I was facing a tight deadline on my licensing since downsizing my business and no longer needing to be a Microsoft Silver partner. But my licensing was all through the partner licenses so I needed to get them moved over to retail.  Julian at Trusted Tech Team was terrific at helping me get Windows 2016 and Office 365 moved over seamlessly.  What I found out is the rep's you talk to for sales are all certified MS techs, not sales people who hand you over to tech's later.  So they can answer your questions knowledgeably and back it up with support.  Julian got on line to help me get the office 365 licensing moved over,  Fantastic support and help and we joked around the whole time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T02:46:19.000Z",
          "Titre": "IT Infrastructure Overhaul",
          "Contenu": "Found the licensing I needed, purchased it and, it was delivered in a timely fashion. Excited to get the servers built and get rolling. We'll be looking to TTT for all of our licensing needs where applicable in the future. Couldn't be less painless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T23:53:36.000Z",
          "Titre": "Purchased server software and client…",
          "Contenu": "Purchased server software and client access licenses. License arrived quickly no problems with it at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Lee",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T02:50:47.000Z",
          "Titre": "Great purchase for non-subscription Quickbooks 2021 for Mac",
          "Contenu": "I was lucky to get this non-subscription version of Quickbooks 2021 for Mac before this product is discontinued. Everything is great to install it in my new IMac, works well. Hope it won't have any issue in the future. Overall, I am happy for my purchase.Sharon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:27:48.000Z",
          "Titre": "Super quick service",
          "Contenu": "Super quick service, these guys are always on the ball and everything is straight forward"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Natt Smith",
          "Nb_Reviews": 4,
          "Date": "2018-06-15T14:54:18.000Z",
          "Titre": "I'm only coming here to say Nick Masters is awesome",
          "Contenu": "I'm only coming here to say Nick Masters is awesome.  I've never had anyone act like they care and follow up personally for any software purchase ever and he was a really nice guy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stimepy",
          "Nb_Reviews": 1,
          "Date": "2018-06-10T02:47:55.000Z",
          "Titre": "Purchases window 10 Pro",
          "Contenu": "Purchases window 10 Pro, Retail.  Went as well as expected.  Easy to download, surprisingly easy to install.  (I still remember floppy disks and windows 3.1....) I would do business with this company in the future without fear!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T21:25:49.000Z",
          "Titre": "Excellent help on my unusual and complex Software installation.",
          "Contenu": "I had an unusual and complex installation of Windows Server. Julian offered more help than I have EVER received from any company, EVER!I want to congratulate Trusted Tech Team for finding an outstanding and dedicated worker. I own a business and I hope that all of my employees work as hard as Julian to ensure that our customers were satisfied. Thank you Trusted Tech Team (and of course, Julian)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April Schoolcraft",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:06:44.000Z",
          "Titre": "Great customer service and…",
          "Contenu": "Great customer service and follow-through."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frandy",
          "Nb_Reviews": 2,
          "Date": "2021-05-05T20:01:19.000Z",
          "Titre": "A grade A store",
          "Contenu": "A friend of mine, told me about this company and i decided to give it a try because of the unbeatable prices.  To my surprise, not only their prices are very affordable but more importantly, their technical support is very proactive and effective. I would definitely buy here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daryl Craft",
          "Nb_Reviews": 1,
          "Date": "2019-07-26T19:07:31.000Z",
          "Titre": "These guys are awesome",
          "Contenu": "These guys are awesome, they have gone above and beyond their call of duty to assist us with things that were not even related to our services with them. You cannot find a better Team to work with they are just great people to work with, not to mention they have an awesome sense of humor.. DC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam S",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T13:56:00.000Z",
          "Titre": "Simply the best team around...",
          "Contenu": "Honestly would not buy software from anyone else, the customer service you provide is top-notch, your staff is knowledgeable and friendly and always makes sure I am getting what I need with no upsell to something I don't. I appreciate knowing I have your team behind me at all times"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Giuliano",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T21:33:39.000Z",
          "Titre": "Exactly what I need in a vendor!",
          "Contenu": "First time and more importantly I'd purchase again. Questions were answered timely in pre purchase. Support was provided swiftly during installation.Exactly what I need in a vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike S.",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T22:39:18.000Z",
          "Titre": "It's rare when you find techs that know…",
          "Contenu": "It's rare when you find techs that know what they are doing especially when it involves Microsoft licensing.  We fixed a long standing license issue and I am very pleased with TTT.MAS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mason Smith",
          "Nb_Reviews": 1,
          "Date": "2018-02-20T16:19:18.000Z",
          "Titre": "I have used Trusted Tech Team because…",
          "Contenu": "I have used Trusted Tech Team because of the pricing was the best on the market. Their website was able to reassure me that they are a legitimate Microsoft Partner. The whole experience was perfect and without any issues. I will certainly use this company in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sami Phinn",
          "Nb_Reviews": 1,
          "Date": "2018-07-18T21:05:20.000Z",
          "Titre": "Julian is the BEST!",
          "Contenu": "My company representative, Julian, has always been amazing. He's on top of quotes, orders and any questions I have. He's extremely friendly and a GREAT pleasure to work with. I wouldn't ask for anyone else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:10:04.000Z",
          "Titre": "It was great to speak with someone who…",
          "Contenu": "It was great to speak with someone who knew what I wanted.  And they reconfirmed, after I called back.  After I received my download, the support staff helped me get started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Torres",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T21:55:28.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Matt was very prompt and knowledgeable. His interaction with me was very intuitive as he stood one step ahead the whole time. Always a fun interaction with this team, they are precise and knowledgeable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri Caldecourt",
          "Nb_Reviews": 1,
          "Date": "2020-12-26T22:46:40.000Z",
          "Titre": "You guys are wonderful",
          "Contenu": "You guys are wonderful.  I received my order promptly, and it installed just fine.  I had an issue with activation and I reached out to you and you answered within minutes.  Turns out it was an Intuit problem, not you.  Thanks for the great service and excellent support.Happy New Year!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T04:23:21.000Z",
          "Titre": "I'm happy I bought from TTT",
          "Contenu": "I received a product key and instructions to download the software from Microsoft. It work with no problems. I'm very happy with the price and ease of getting the software installed on my PC. TTT has a coupon on their website that I used and digital software is not taxed which reduce the cost. I'm happy I bought from TTT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sandra wagner",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T19:11:26.000Z",
          "Titre": "Wow, amazing support (and patience!)",
          "Contenu": "Wow, just wow.  Your Support folks were absolutely exceptional--patient, competent and helped me get my purchase completed and installed for my Amish friend who uses a computer, but cannot get on the internet.  Kind of a challenge, and I appreciated all the assistance -- thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marsha E.",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T00:40:31.000Z",
          "Titre": "Great customer service!",
          "Contenu": "I had an issue with the original download after purchasing Quick Books Premier 2020 upgrade (possibly related to my browser and/or e-mail provider); but 'Johnny' and then 'Kristen' both provided excellent customer care, walking me through the problems until final resolution.  Polite, enthusiastic, they both get two thumbs waaaay up!Would absolutely recommend TTT, and will definitely use them for future software upgrades! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan M",
          "Nb_Reviews": 1,
          "Date": "2018-02-20T16:15:13.000Z",
          "Titre": "Overall perfect experience with Trusted…",
          "Contenu": "Overall perfect experience with Trusted Tech Team! I couldn't ask for anything more. Their pricing, customer service and promptness on my orders has been extremely quick. Great Job!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GGrinnell",
          "Nb_Reviews": 3,
          "Date": "2020-08-05T14:48:42.000Z",
          "Titre": "The site is reliable",
          "Contenu": "The site is reliable.  Order was delivery as promised.  I had a glitch when I started to use the software and contacted the team for help.  Somebody answered my question in no time.  Thank you very much.  Will definitely come back if I need anything from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BOB",
          "Nb_Reviews": 2,
          "Date": "2018-06-13T18:30:05.000Z",
          "Titre": "Their name says it all !",
          "Contenu": "Glad I purchased my office program from Trusted Tech Team had problems removing Office Pro.  David assisted me and was a GREAT help could have never done it without him ! You guys are the best. Thanks, Bob"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Pesta",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T19:24:21.000Z",
          "Titre": "Best Prices and Service",
          "Contenu": "Trusted Tech Team has the best prices and helpful service I have found for software licenseing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Latesha",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T14:16:53.000Z",
          "Titre": "Omg!! This is great.",
          "Contenu": "Omg!!! I’m so excited about my purchase for my laptop. Everywhere I looked the antivirus software was so expensive and it didn’t last that long. I just downloaded to my laptop and everything is going welll. Thank you so much. The price was reasonable and I have already recommended you guys to one of my girlfriends. I’m also telling my daughter so she can purchase it as well. Thank you guys again👏🏾👏🏾👏🏾👏🏾👏🏾."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Erario",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T00:49:09.000Z",
          "Titre": "Very Satisfied Customer",
          "Contenu": "The website provided a well informed chat which enabled me to choose the correct QuickBooks product for my needs.  I registered with TTT and will likely return to purchase again when the need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie B",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T14:32:53.000Z",
          "Titre": "I am very impressed with your company",
          "Contenu": "I am very impressed with your company. You did exactly what you said you would do!  I decided to take a chance and order through you and it worked out perfectly. I definitely will recommend your company and will make a bookmark so that if I need anything in the future I can order from you. In fact I will need this again next year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Reeves",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:56:30.000Z",
          "Titre": "Agent returned quote requested &…",
          "Contenu": "Agent returned quote requested & answered questions promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Dortch",
          "Nb_Reviews": 1,
          "Date": "2018-06-06T19:26:24.000Z",
          "Titre": "Excellent customer service for purchase",
          "Contenu": "Customer service in making my purchase selection was excellent. Got all my questions answered on chat without any hassle. I am very happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dick East",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T20:34:57.000Z",
          "Titre": "I had some specific questions regarding…",
          "Contenu": "I had some specific questions regarding the software and all questions were answered through chat option.  Very good customer service.  Loaded program and ready to go!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JustAnswer Customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T15:18:06.000Z",
          "Titre": "I have used Trusted Tech for some years…",
          "Contenu": "I have used Trusted Tech for some years now and have always found them to be top notch in giving assistance when needed and asked for, having readily available  consult if needed by the customer and assistance that is at a level of understanding even for a total novice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cecily Winters",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T19:09:28.000Z",
          "Titre": "Excellent and prompt service",
          "Contenu": "After having a HDD brick on me (After ten years, go figure, right? /sarcasm) I was looking at the daunting prospect of not only having to get new hardware, but also acquire a new key for Windows. I was sent to TTT via a trusted friend and decided to ask for help and feedback from the chat support about what I needed and should do. I was paired with Kristin who not only answered my questions, but provided me with valuable feedback and support. She was very kind and professional and made my experience very personalized and very pleasant. I bought a digital Windows 10 code from the site and received it very promptly, with succinct installation instructions. As it turns out, as I was going to activate the product, my Microsoft account already had a digital Windows 10 attached to it from when I upgraded from 7 some odd year or so ago. With a laugh and some chagrin, I return to my still-open chat tab with Kristin, and inform her of my situation. Thankfully TTT has a wonderful guarantee on software purchases, and I was able to request a refund of my as of yet unused key. She was able to process that swiftly and with shared amusement at my predicament.Ramble aside, fantastic customer service, and a great source for software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori DeVoe",
          "Nb_Reviews": 2,
          "Date": "2018-06-13T20:33:09.000Z",
          "Titre": "Nick was AMAZING in resolving my…",
          "Contenu": "Nick was AMAZING in resolving my technical difficulties, he knew who I was before I could get to far into explaining who I was, my issue or tell him much of anything and he had already emailed my information needed to fix my issue. This is a true customer service gentleman."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lesly",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T19:24:59.000Z",
          "Titre": "My first time buying here",
          "Contenu": "My first time buying here, everything went smooth, customer service was great! I'm very happy with my purchase! I will definitely buy from them again! Thank you Trusted Tech Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Kwasney",
          "Nb_Reviews": 1,
          "Date": "2018-06-08T22:30:13.000Z",
          "Titre": "Great experience",
          "Contenu": "I was extremely pleased with my interaction with Trusted Tech Team. Every step of the purchase process, from the order to the download & installation was smooth & easy. Highly recommended !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Newlifecomputers",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:55:42.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication. License key worked to activate without issue. Price was also very competitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T14:31:58.000Z",
          "Titre": "Excellant Service",
          "Contenu": "They always handle my orders perfectly and this was my third purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Coon",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:12:35.000Z",
          "Titre": "Great Service!",
          "Contenu": "Super easy to purchase licenses!  Received keys very quickly and prices can't be beat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2018-05-30T18:23:17.000Z",
          "Titre": "David was absolutely the best",
          "Contenu": "David was absolutely the best! After trying to talk me thru it we decided to remote access and he helped me in a matter a minutes. The Best Service I have had with any computer Program Tech. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles D. Gibson",
          "Nb_Reviews": 2,
          "Date": "2018-10-31T14:29:59.000Z",
          "Titre": "This was the easiest most painless…",
          "Contenu": "This was the easiest most painless session I have ever had and have never worked with a more knowledgeable fellow that Julian.Thanks for everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "derisman",
          "Nb_Reviews": 1,
          "Date": "2018-06-05T21:18:45.000Z",
          "Titre": "Julian was able to answer all of my…",
          "Contenu": "Julian was able to answer all of my questions with complete satisfaction. His follow up was quick and complete making the order process a pleasant and confident experience. He followed through with all his promises and I look forward to using the product to bring satisfaction to my client as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Gesmond",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T17:54:27.000Z",
          "Titre": "These guys are awesome",
          "Contenu": "These guys are awesome. I don't leave many reviews but I will for this team.  I have been dealing with them for a couple years now and they are always helpful.  My dealings have not always been financial and they still make me a priority.  Don't waste your time somewhere else for the little money you might save.  With that being said they were the best price for us as well.Keep it up guys, your doing great!Thank you,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Smith",
          "Nb_Reviews": 2,
          "Date": "2020-11-24T22:40:33.000Z",
          "Titre": "Purchased Windows Server 2019 RDS CALS…",
          "Contenu": "Purchased Windows Server 2019 RDS CALS from them and accidently entered the wrong quantity on the order but didn't realize my mistake until after I had completed the purchase - Kristin took care of cancelling the order and entering a new order right over the chat. OUTSTANDING customer service and best price!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2020-11-06T18:37:57.000Z",
          "Titre": "I was happy to find a reasonable price…",
          "Contenu": "I was happy to find a reasonable price for the software I needed.  The purchase was easy, the chat support readily available, and the delivery immediate.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T17:38:42.000Z",
          "Titre": "Great help from tech team on placing…",
          "Contenu": "Great help from tech team on placing and following up on my order. , I am not sure I am really happy with the product but will work with it more before reviewing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert Boucher",
          "Nb_Reviews": 2,
          "Date": "2020-09-21T11:31:03.000Z",
          "Titre": "You guys are the best",
          "Contenu": "What can I say You guys are the best to deal with no issues or problems and you always follow up to make sure that your customers are satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Rodenbeck",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T06:32:19.000Z",
          "Titre": "Great Tech Support!",
          "Contenu": "Received my order. No problems there. Having issues with my PC. Having PC looked at on the 9th. Will hopefully know more and will give an update then. I called TTT, there was almost no wait time before a Tech Team member talked to me and answered my questions and told me what I needed to do to fix my problem. As I stated above, once I get the \"Bugs\" fixed with my PC I'll update  my review. Thank You TTT, I was at a lost as to what to do next. I was offered a refund but since I have 30 days to fix my PC issues and I'm confident that I know what the problem is, and what needs to be done to fix said problem. So, i'll take the PC to the shop on the 9th of July and in a few days, I'll have a fully working computer to play with. I say again: Thanks so very much for your support and I highly recommend TTT to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Antonelli",
          "Nb_Reviews": 2,
          "Date": "2020-10-15T19:39:58.000Z",
          "Titre": "Very quick and efficient",
          "Contenu": "Very quick and efficient.  I was a bit confused on how to proceed with confirmation. When I emailed support, Nick M. jumped right in and helped me out.  Much thanks to all of you at Trusted Tech and a special thanks to Nick M. !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David McDonald",
          "Nb_Reviews": 1,
          "Date": "2018-05-29T19:23:00.000Z",
          "Titre": "I stumbled onto Trusted Tech Team and…",
          "Contenu": "I stumbled onto Trusted Tech Team and am glad that I did.  Great experience and terrific customer service.  I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SWSCP",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T23:28:59.000Z",
          "Titre": "Purchased QB Desktop Premier Plus",
          "Contenu": "the purchase, download an activate process was very smooth, Trusted tech Team has been great so far!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stu",
          "Nb_Reviews": 4,
          "Date": "2018-06-12T15:22:04.000Z",
          "Titre": "Trusted Tech Team is the real deal",
          "Contenu": "Trusted Tech Team is the real deal.  I got a great price on Office 2016, and it downloaded, installed, and is working great.  Satisfied customer."
        }
      ]
    }
  ]
}