{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ultahost.com",
      "Review": [
        {
          "Note": 1,
          "Pseudo": "Marco Solito",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T18:34:47.000Z",
          "Titre": "Summarizing the absurd error that…",
          "Contenu": "Summarizing the absurd error that occurred, to avoid wasting the entire day writing the review, I paid for a macOS VPS, and what did I receive? Nothing!Support said they can neither refund me nor activate the service.Great, I will certainly recommend you to all my friends.Thank you very much."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Muhammad Asad",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:03:21.000Z",
          "Titre": "Scammer & third class servers",
          "Contenu": "Hi Everyone .I hope you are doing great. The 9 November i bought  dedicated server from ultahosting. The package name is Dedicated Servers - ULTA100 XEON and also you can check specs below down: CPU Intel® Xeon® E-2276G Hexa-Core64 GB DDR4 RAM2x 960 GB SSD DiskData Transfer Unlimited1 dedicated IPs1 GB Port speedFree 1-year SSL certificateI bought this plan and after 10 hour he setup everything fine but when i access the ubuntu server through ssh client to verify the processor he did not provide me the same processor which i got an order. After i told their technical team he said we dont have this server that's why dont give you this server. Her give me intel xeon 2176G server which is very very slow and also site load is too much. i asked the team to refund my amount he said we did not give you refund. I recommended you everyone please dont buy their service."
        },
        {
          "Note": 1,
          "Lieu": "BA",
          "Pseudo": "Milica Maric",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:38:13.000Z",
          "Titre": "Its wery low and unprofesional host…",
          "Contenu": "Its wery low and unprofesional host because not work server from first day whan y bay server."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "arTec GmbH - Berlin",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T12:00:10.000Z",
          "Titre": "Terrible customer service, incompetens sales people",
          "Contenu": "We are a user of dedicated service hosting services for this company for about 4 months.The company uses an external payment provider. That provider has double-collected payments from our cards.The company (Ultahost) could not resolve the issue properly and when we have applied for a conflict resolution (chargeback request), they threatened us with stopping our services although we have over 2 months worth of services in our credit balance because of these double booking refunds.We are of course looking for an alternative firm to carry our server over within a few weeks."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tawfik Dukhan",
          "Nb_Reviews": 8,
          "Date": "2023-10-10T15:30:28.000Z",
          "Titre": "Terrible Service, No Refund",
          "Contenu": "I had an absolutely dreadful experience with Ultahost.com, and I feel compelled to share my frustration. I signed up for their services with high hopes, but unfortunately, they delivered nothing but disappointment.Firstly, their service quality was abysmal. The website loading times were slow, and I frequently encountered downtime issues. This made it extremely difficult to run my online business effectively, leading to a loss of customers and revenue.To make matters worse, I reached out to their customer support multiple times to address these issues, but the response was painfully slow and unhelpful. It felt like I was talking to a wall, as my concerns were brushed off without any real solutions or explanations.As if this wasn't bad enough, when I finally decided I had enough and requested a refund, Ultahost.com proved to be just as disappointing in that aspect. They flat-out refused to process a refund, despite their clear failure to deliver the promised service.In the end, I wasted both my time and money on Ultahost.com, and I would strongly advise anyone considering their services to steer clear. They are unreliable, unresponsive, and have no regard for customer satisfaction. My experience has been nothing short of a nightmare, and I regret ever doing business with them."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Martin Liprt",
          "Nb_Reviews": 10,
          "Date": "2023-06-28T16:37:50.000Z",
          "Titre": "I'm new and all my VPS having network…",
          "Contenu": "I'm new and all my VPS having network outages, websites on all VPS are down many times per day, their status page about outages doesnt say anything.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Smith",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T18:15:09.000Z",
          "Titre": "Bad Hardware & Bad Support",
          "Contenu": "** Update: They keep trying to get this review removed from Trustpilot for making up things by saying this review isn't for them. This review is for you UltaHost. Moving to one star now.I started using UltaHost a few days ago. I ordered a VPS from them. Well we started having issues running two very low end websites which the first VPS server should've handled with no issue. Both websites were lagging and the CPU was jumping to 100%. Support told me I needed more resources, I didn't think this was true but I went ahead and spent more money. BUT that didn't fix it either. I reached out to another host and we set up the same two sites on one of their VPS and it ran with no issues. Not even above 50% CPU. This new VPS has the same specs as the UltaHost server. I reached out to billing to request a refund. They refunded the first cost of the stage 1 VPS but they refuse to refund the cost of the upgrade which was $78. Per their terms, I get that. However support told me that I needed more resources which didn't help at all. This was recommended by staff. The gave me credit, which I won't use because their hardware is unstable.The support team was alright.I would recommend spending more money with another host so you don't have these issues."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "M. DORMANN Hubert",
          "Nb_Reviews": 17,
          "Date": "2023-04-06T06:49:38.000Z",
          "Titre": "I thought it was a joke but no..",
          "Contenu": "I thought it was a joke but no... It happens for real. After two weeks wondering what's wrong in my setup and after some mails with my broker I asked UH support why my server latency is so slow for my NY trading... They answer it's normal I asked for a Los Angeles location. So I send my bill where it was written I asked for a NY location with a 2016 server. No apologies, no compensation. Just cold answer as it was my fault. After a night I receive my new login and password to reinstall everything in NY... On a 2022 server... OMG what is wrong with this company?"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Dunk Wulf",
          "Nb_Reviews": 6,
          "Date": "2020-08-08T09:58:07.000Z",
          "Titre": "Worst hosting",
          "Contenu": "LOL they are scammer and lyer. Deleting files 2 times, False promises and then they want 20 usd for each easy reinstall..We also get forced to give fake reviews with 5 stars or they will terminate our server.."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jeremy Biberdorf",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T20:38:06.000Z",
          "Titre": "In my many years of onlinComplete Scam - Dishonest and Incompetente business…",
          "Contenu": "In my many years of online business UltaHost is by far the worst web host I have ever dealt with. To start the live “support” rep will blatantly lie to get you to sign up. After they migrated my websites literally nothing worked…database, email and ssl. Based on the quick live chat I expected a quick fix but instead the support tickets were just ignored. Chasing it only got me templated responses and attitude. After my websites being down the whole day and nobody being willing to help I switched to a different web host. At least they offered a 30-day money back guarantee…or so they advertised across their site. Turns out they have various clauses to deny refunds to 99% of clients. You’d think their 99.99% uptime guarantee would cover me instead….nope another meaningless fraudulent “guarantee”. Now I am pursuing a chargeback with my credit card company. The following day they apparently got the hosting working acknowledging their mistakes in setting it up. Also despite multiple requests to cancel my account it is still active which I assume is another part of their scam. Stay far away from this web host. Complete incompetence and complete lack of ethics.UPDATE: Their claims about their refund policy are nonsense.  It is structured so that 99% of clients don't qualify, yet all over their website they brag about 30 day money back guarantee.  If a company is going to promote a certain benefit it needs to apply to more than a tiny percentage of people otherwise it is something they could get sued over.  I'll just get my money back via a credit card chargeback as these guys are crooks.Repeatedly Ultahost has tried to get this review removed by claiming I am not a legit customer.  Clearly this is a tactic they do hoping that people don't save their receipts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T15:35:34.000Z",
          "Titre": "One word horrible",
          "Contenu": "One word horrible, they oversell everything on their website and deliver nothing in return; their cheap hosting plans are what they are cheap because I think they run their servers out of someone's mom's basement. You get what you pay for in this case, and you get a lot less. All the 5-star reviews are from friends and family. Stay away from this hosting company unless you like headaches and stress.This is a response to the below statement; you are incorrect. I have chat logs for proof; your support was nonexistent, and you ignored all my requests.And did not provide what I paid for. You are well established only in your fantasy. You are scammers."
        },
        {
          "Note": 1,
          "Pseudo": "ALAA Rafi",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T03:46:06.000Z",
          "Titre": "Bad service..slow..no refund..cheaters",
          "Contenu": "i tried this hosting company for 2 hours only!i paid $19 via Paypal.after testing i found it was a slow hosting and had big delay when opening my website!i asked for cancellation and refund, then they cancelled my plan and did not refund me!after contacting them they said the refund was in progress! but that was a fake .THEY ARE CHEATERS . BAD SERVICE AT ALL"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris S",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T12:16:21.000Z",
          "Titre": "Good deal but shocking billing practices",
          "Contenu": "They offer competitive pricing, but terribly confusing and predatory billing practices. I chose to close one of the hosting products with them (as many people do) and requested a refund within the 30-day initial period. They made the process insanely difficult and continued to invoice me for a Mac VPS that was cancelled. They took over $60 from my bank account and insisted upon issuing it as a credit for future use with them rather than reversing the erroneous charge. They respond with very long, clearly canned email responses that do not address your concern at all. I tried hard to make them understand the nature of this issue but they kept denying responsibility. Stay away from them if you do not like bureaucracy and shady billing practices. I see most of their responses to negative reviews are mean and trying to shame the customer for doing something wrong. This is clear evidence of a business that does not like to accept responsibility when it has done something wrong. However it's true what they say sometimes, you get what you pay for, and it's on me for choosing a not-so-reputable, small hosting provider.Edit: It looks like they have issued another canned response that is completely tone deaf to the original situation. First of all the cancellation request was made within 30-days of the original month refund timeline. Second, the complaint is regarding me being charged for months after cancelling said service with them."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Oscar H",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T19:31:01.000Z",
          "Titre": "More than a month without service",
          "Contenu": "More than a month without service, the worst hosting I have hired in my life, bad, very bad, I do not recommend it at all"
        },
        {
          "Note": 1,
          "Pseudo": "Akam Barznji",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T00:03:11.000Z",
          "Titre": "wrost hosting Services",
          "Contenu": "wrost hosting packages i use 1.shared host  for 2 years 2.vps 1.5 year3.vds 9 month4.windows host 2 monthslow and down many times i have full record for donw times don't buy host from this !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olga Moskalenko",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T17:33:36.000Z",
          "Titre": "PATHETIC HOSTING COMPANY",
          "Contenu": "I opted for ULTA HOST with the hope of receiving consistent and reliable hosting services, but unfortunately, my experience has been less than satisfactory. The downtime has been significant, which, for any business, can translate to potential losses and frustrated customers. Furthermore, whenever I sought clarity regarding the server changes and the resultant downtime, I was never given a clear or precise reason. This lack of transparency and communication is concerning. A heads-up or some communication would've been appreciated, as such changes have a direct impact on my operations. I sincerely hope ULTA HOST takes this feedback seriously and works towards better customer communication, transparency, and improved service reliability.UPDATED:Team ULTAHOST knows that this is a genuine review and i'm using their services but they are flagging the review on trust pilot that the review is fake. Literally this company is full of unprofessionals."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris Thompson",
          "Nb_Reviews": 2,
          "Date": "2021-05-03T06:38:29.000Z",
          "Titre": "Billing department worst organisation ever",
          "Contenu": "They are supposed to take my payments automatically every month but every single month they don’t do that and my account gets automatically suspended until I put in a complaint, they say they will fix this but following month happens again, hopeless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rotter Tube Reef",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T15:28:21.000Z",
          "Titre": "I LEFT UltaHost after 2 weeks",
          "Contenu": "I left Ultahost after only 2 weeks. I paid a year up front and they will NOT refund the money. RIPOFF COMPANY! When I signed up I wanted to make sure the dedicated server was in the USA. They said it doesn't matter where the server is in the world. YES IT DOES! I'm in the USA and the server was in Germany. They never answered me as to where the server was. The dedicated server had issues with site load times of 25 seconds! It took a week for them to \"fix\" the issue, which was removing cpanel and replacing it with a free, cheaper-looking cpanel clone. That's not a fix. My site was down for a week. They offered to move the server to a USA server, at twice the cost, and what I wanted in the first place! Techs support only works through tickets via their site. Maybe it takes a few hours or a couple days to fix. When I had a question on server slowness, one of the techs responded by saying \"I'm talking crazy\" and \"My thoughts are not right.\" They are vain and I never felt comfortable asking questions. I was reminded by them how they are the best and their customer service shines. It doesn't. I cancelled after this 2 week disaster. They refuse to refund money for the server I used for only 2 weeks and paid a year for! They don't do refunds. They saw this review within an hour and threatened to take it down. They care more about their reputation online than supporting customers. I'd stay clear of ultahost. I never felt comfortable. They got paid a full year for 2 weeks of bad use. They said they will respond to this review with a copy of their policy, which says no refunds. They also said they will have my review removed. Any other hosting company would refund the difference for months not used. If you're ok with no refunds, slow tech support via ticketing system and vain remarks, this is the company for you."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Oscar H",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T00:29:07.000Z",
          "Titre": "Hosting with 29% uptime",
          "Contenu": "Hosting with 29% uptime, it's always down"
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Akintayo Hormolade",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T11:02:16.000Z",
          "Titre": "No customer sympathy",
          "Contenu": "They don’t care about their customers feel. They just want you to make payment and leave"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Andrei MD",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T18:01:27.000Z",
          "Titre": "Extremely Disappointed with UltaHost's Lack of Responsiveness",
          "Contenu": "I regret to say that my experience with UltaHost as a hosting company has been nothing short of a nightmare. I have encountered a serious issue of fraudulent activity running on their hosting, and my attempts to contact them for assistance have been met with utter disappointment. Their unresponsiveness and lack of support have left me frustrated and disillusioned.I initially reached out to UltaHost via email, hoping to alert them to the fraudulent activity taking place on their platform. However, despite multiple attempts, I did not receive a single response from their customer support team. It is deeply concerning that a company entrusted with the responsibility of hosting websites does not take immediate action when notified about fraudulent activities. Their negligence raises serious questions about their commitment to maintaining a secure and trustworthy hosting environment.In an attempt to seek a resolution, I also tried engaging with their live chat agents. Unfortunately, my interactions with them only added to my frustrations. Instead of providing meaningful assistance, the agents simply directed me to resend my emails repeatedly, leading to a never-ending loop of unproductive communication. It was disheartening to witness their inability or unwillingness to address my concerns and provide a satisfactory solution.As a customer, I expect a hosting company to prioritize the security and well-being of its users. UltaHost's failure to acknowledge and promptly address the fraudulent activity on their platform is a clear indication of their disregard for customer safety. The lack of attention given to serious issues and the dismissive behavior of their support staff demonstrate a severe lack of professionalism and commitment to customer satisfaction."
        },
        {
          "Note": 1,
          "Pseudo": "silinmiş üye",
          "Nb_Reviews": 4,
          "Date": "2022-07-28T22:29:24.000Z",
          "Titre": "ultahost scam or not?",
          "Contenu": "Also they do not help to refund or not solving any type of problems! My site now is not working for example!They just refuses to understand u and if u buy monthly plan u can ask for refund but not if u get yearly plan! They do work with wowonder together i think and this is the reason if u buy a plugin for that script they refuses to help u but they do like they help u. They also threating me that if i give all these info here they will never help me about anything on my server which also they not do it in anyway! I also do have screenshot proofs to post here and i will upload them once they throw any lia!THEY WİLL MAYBE EVEN TERMİNATE MY ACCOUNT FOR THİS REVİEW WHO KNOWS! THE THİNG İS THEY ARE NOT HELPİNG, THREATİNG, NOT REFUNDİNG!EDİT: MY ACCOUNT İS TERMİNATED BECAUSE OF THİS REVİEW WİTHOUT REFUNDİNG MY MONEY! NOW İ WİLL WAİT FOR 24 HOURS TO GET ANSWER FROM THEM AND İF THERE İS NO SOLUTİON İ WİLL REPORT THEM TO USA GOV"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Kurdino",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T17:53:10.000Z",
          "Titre": "service is bad",
          "Contenu": "service is to bad.they dont allow websites to upload youtube dance video clip. from turkey"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "jocelyn moroy",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T14:54:23.000Z",
          "Titre": "Ultahost has been very good last year, not anymore",
          "Contenu": "Ultahost has been very good last year, since few month, the reply for the team is not acceptable. they don't correct the problem and my server keep being down. I pay 200 usd per 3 month. I don't have the basic server..."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Yassin Emad",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T15:31:10.000Z",
          "Titre": "Very good costumer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BG It’s Music",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T12:26:39.000Z",
          "Titre": "Charged Twice and no service!!!",
          "Contenu": "Every thing was going fine until time to renew my 3 month subscription. I have been charged TWICE through paypal and Ultahost claims I have an unpaid invoice. So now I have no service AND missing almost $100. They refuse to acknowledge error on their end and have closed my support tickets instead of refunding me my money.Update: Ultahost has finally figured things out and have begin processing my refund. I still need to get it. But right now I think they need a new payment protal. Whoever they use was the source of the problem, not ultahost. I am upping my rating to 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Portall",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T11:08:00.000Z",
          "Titre": "Amazing support team",
          "Contenu": "Amazing support team. Will fix any issue you have regarding the server being offline or migrating your work from your old server. Very helpful."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Stella",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T16:02:46.000Z",
          "Titre": "Sales and Technical Support Team",
          "Contenu": "The support system is superb. The technical team is very helpful and very prompt to respond. I also like the fact that, after paying I received my vps details in no time.Keep up with the great work."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Barnabas Agorh",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T16:19:22.000Z",
          "Titre": "Quick and prompt attention in support",
          "Contenu": "Quick and prompt attention in support, I think they have dedicated team members to deal with issues,  I will recommend this service to friends who may need their service, I hope they will not change later."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "segun festus",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T12:54:02.000Z",
          "Titre": "I love their support system",
          "Contenu": "I love their support system, and service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T13:04:14.000Z",
          "Titre": "I spent a lot of time searching for a…",
          "Contenu": "I spent a lot of time searching for a VPS hosting package because I need one for my new project. Ultrahost is by far the best value for money unmetered bandwidth is something that nobody else was offering.. As for the support, it has been excellent. I'm a noob and they showed great patience and couldn't have been more helpful and accommodating. I definitely recommend them."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Zain Hassan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:50:55.000Z",
          "Titre": "A Deep Dive into Ulta Host's Features",
          "Contenu": "In a nutshell, Ultra Host has humanized the hosting experience. It's more than just a service; it's a partner in your online journey. With a fantastic interface, unparalleled support, top-notch speed, and security that you can trust, Ultra Host has won me over as a customer for the long haul. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Marek",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:54:12.000Z",
          "Titre": "Astonishing provider for VPS/VDS…",
          "Contenu": "Astonishing provider for VPS/VDS solution. Ultra fast servers, reliable price and advanced support included in product price."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "TALHA YOUSAF",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:07:46.000Z",
          "Titre": "Choosing ultahost off all the hostings…",
          "Contenu": "Choosing ultahost off all the hostings is a good decision by me. It has all the features and services that make it to the top of web hosting companies. It is easy to use, fast and secure."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Muhammad Irfan",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:52:31.000Z",
          "Titre": "Having hosted my website with Ultahost",
          "Contenu": "Having hosted my website with Ultahost, I'm genuinely impressed. Fast load times and solid uptime have significantly boosted my site's performance. The user-friendly control panel simplifies management, catering to all types of users. Their customer support team is responsive and knowledgeable. They've truly exceeded my expectations, providing reliability and efficiency that set them apart in the hosting landscape."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Jika",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:40:35.000Z",
          "Titre": "I needed a fast and moderately cheap…",
          "Contenu": "I needed a fast and moderately cheap VPS server for the needs of my team, and most importantly that there was no limit on Internet traffic, and strangely enough UltaHost provided it all in full. All operations were fast and without delays, by the way, it is an important plus that there is support for many acquiring companies.I haven't communicated with the support yet, I haven't had to, but I'm more than sure that everything is fast there."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Farha Lagoyo",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:50:17.000Z",
          "Titre": "the most supportive and easy to use…",
          "Contenu": "the most supportive and easy to use hosting company, with great VPS servise"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Masu Yazılım Bilgi Teknolojile",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:15:30.000Z",
          "Titre": "Kate helped me a out real quick",
          "Contenu": "Kate helped me a out real quick. Thanks for the fast response."
        },
        {
          "Note": 5,
          "Lieu": "GM",
          "Pseudo": "With held",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T08:49:24.000Z",
          "Titre": "Great Service",
          "Contenu": "This company is well-positioned to resolve customer pain points at all levels via their unmatched customer support team. Great service No 'buts'.... and only real solutions.They are also the most affordable out there. Excellent to be their customer."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Om Pratap Rathore",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:59:33.000Z",
          "Titre": "i am using ulta host since last month…",
          "Contenu": "i am using ulta host since last month and i and full satisfy with  servies i received , its very fast , secure and easy to use . much recomended to all ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Williams",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T23:44:56.000Z",
          "Titre": "Superior Hosting Service with Speed to Match",
          "Contenu": "What I value the most about UltaHost is its remarkable speed that outperforms the hosting company I was with for 15 years. My continual quest to boost my WordPress site's performance became redundant since UltaHost ensures pages load seamlessly.I'm particularly fond of their pick-and-choose method for add-ons, as it allows me to only pay for what I find necessary, saving me from wasting money on unneeded services. The platform is incredibly user-friendly; a simple login, a selection of the desired action or contact, and following the prompted options is all it takes. The transfer process was impressively swift, clocking in at just 3-4 hours, a stark contrast to the days I had expected it to take. Their customer service is top-notch, offering thorough explanations and help with complicated installations that are beyond my expertise.UltaHost has been a revelation for me. Its speed, intuitive interface, and stellar customer service have greatly enhanced my website's performance and my overall user experience. I strongly advocate for it to anyone seeking a dependable and effective hosting service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T22:04:28.000Z",
          "Titre": "I was with other hosting companies like…",
          "Contenu": "I was with other hosting companies like contabo and or ovh cloud and kept getting problems from both those providers especially contabo. I ended up coming to vulta which doesnt have the most wack IAP and will not be going anywhere else. I have sense then ordered other services."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Gleb",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T12:47:37.000Z",
          "Titre": "I Pay for basic \"Linux VPS Hosting\"",
          "Contenu": "Hey there 👋 3 September, i pay for Linux VPS Hosting in Singapore,Asia. After some tests, realized that the server is not fast enough for my current location - very high ping. 8,415 km - distance from Moscow to Singapore. I contacted support and they changed it to another server from the list of available servers! Thank you very much, it became faster to respond about 10 times. For the price of $5.67 USD for the basic configuration, you will get a great server + instant support!!! Thank you very much, I hope Russia will not cut off the Internet and I will stay with you 😀🙏. Very satisfied with the price and quality of service. 😻(Для ребят из России, оплачивал виртуалкой pyypl, может кому-то пригодится, все прошло с 1 раза)"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Bernard Kioko",
          "Nb_Reviews": 4,
          "Date": "2023-10-31T13:30:44.000Z",
          "Titre": "Excellent Service and Support",
          "Contenu": "These guys are excellent. They setup my server in quick and helped me to setup my apps. Any issue that i had was resolved quick. Their speed is very developer friendly. I recommend them unreservedly."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Eivind Simensen",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T21:26:33.000Z",
          "Titre": "When it comes to support",
          "Contenu": "When it comes to support, I can only give them the thumbs up. I have no experience with setting up a VPS but there were no problems with this at Ultahost. The support agent who helped me should get 5 stars. Fast server and great support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beelzebub",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:50:37.000Z",
          "Titre": "Ultahost is the best place for hosting…",
          "Contenu": "Ultahost is the best place for hosting with fast and nice support teams"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Mrityunjay Singh",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T17:17:25.000Z",
          "Titre": "I never see bird price and get serving…",
          "Contenu": "I never see bird price and get serving fast like this, All supporter teams so friendly with responsible and solved all the problem those I requested all time. I strongly recommend all business owner website try with UltraHost for long time business partner hosting, you will get the best like mine too.i cant explain there services, what a services he is offer, love you manFaithfully Yours,Mrityunjay Singh, Founder YariApp.com"
        },
        {
          "Note": 5,
          "Lieu": "UG",
          "Pseudo": "Rain Baker",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T12:21:47.000Z",
          "Titre": "Best VPS Hosting website",
          "Contenu": "I recently bought their VPS hosting plan. Since then, my website speed has increased significantly. They recommended the best plan for my large website and it works so well without having to use a CDN. Everything was handled well by their team from migration to setting up. Am indeed very happy with their hosting."
        },
        {
          "Note": 5,
          "Lieu": "KH",
          "Pseudo": "Vanthan Tes",
          "Nb_Reviews": 4,
          "Date": "2022-05-05T15:54:05.000Z",
          "Titre": "I never see bird price and get serving…",
          "Contenu": "I never see bird price and get serving fast like this, All supporter teams so friendly with responsible and solved all the problem those I requested all time. I strongly recomment all business owner website try with UltraHost for long time business partner hosting, you will get the best like mine too.Faithfully Yours,Vanthan, Web Dev"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Rafi Ullah",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T13:41:17.000Z",
          "Titre": "I have tried bluehost",
          "Contenu": "I have tried bluehost, godaddy and other major companies, but all have the server security issues for wordpress, and malware got entered.luckily i found ultahost, and got hosting from them, i have around 100 websites with them now, all are absolutely working and none of them has issues.their support is also quick in terms of tickets and live chat.Keep it up to take care at best of your servers, as we want to keep ourselves happy with the websites up and running.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "SC",
          "Pseudo": "MediaHouse",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T11:26:32.000Z",
          "Titre": "The company is true to the service",
          "Contenu": "The company is true to the service they offer. The combination of Hosting package and Cpanel really gives your server the boost it needs.UltaHost also never disappoint towards their customer service and they respond as quick as possible to solve any issue or concerns you may have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Porter",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T02:32:46.000Z",
          "Titre": "Great products. Great customer service!",
          "Contenu": "Ultahost has gone above and beyond in terms of customer service, price and quality of service! Their team does an all around amazing job. The servers are fast and I have yet to have any server related issues at all. They are constantly updating softwares  so security issues are minimized. I can't say enough how pleased I am with their services."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Fanie Ferreira",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T22:27:13.000Z",
          "Titre": "UltaHost VPS and EMail Service",
          "Contenu": "Ever since I've taken up a VPS and Email service from UltaHost, the team has been really helpful in assisting to get my environments setup superfast and talking to each other.  The onboarding and payment experience was also seamless, giving me access to my VPS, directly after payment. I would definitely recommend them for your hosting needs."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Umair shah",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T19:10:10.000Z",
          "Titre": "I like ulta host because it's online 24…",
          "Contenu": "I like ulta host because it's online 24 hours, whatever problem you have with your website, they will solve it, I think it's better than other companies"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashby Adams",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T08:34:37.000Z",
          "Titre": "One of my friends suggested ultrahost…",
          "Contenu": "One of my friends suggested ultrahost web hosting service for my project, and since then, I haven't made a switch. Their customer support is fast, and I haven't had problems with downtimes. I recommend everyone to try them out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T20:37:19.000Z",
          "Titre": "setting up a new VPS is a daunting task…",
          "Contenu": "setting up a new VPS and migrating websites to it is a daunting task but Ultahost staff , especially Michel were awesome. everything went smoothly and the staff was there to help me every step of the way with great patience and kindness. my sites are loading fast and I love the MyVesta control panel, very user friendly, much easier to use than Cpanel."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "baptiste maubert",
          "Nb_Reviews": 4,
          "Date": "2023-06-24T18:18:23.000Z",
          "Titre": "Good support, serious service",
          "Contenu": "Well I am not specialized in VPS, I was a bit lost, but support came and answered quickly my differents requests, efficiently.Furthermore some day after I had some issue as well with a connection but when I have asked for help by opening a ticket, by copy past the message error, they resolved almost immediatly.They are obviously serious and I am looking forward staying with their service for as much time it can be."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kimmy Badilla",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T10:49:11.000Z",
          "Titre": "They resolved my queries within…",
          "Contenu": "They resolved my queries within minutes. Overall service is good and thumbs up for me, the web speed and performance are also good, looking for better service in the future you must try Ultahost."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Posocial Official",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T15:03:15.000Z",
          "Titre": "Ultahost Review from Posocial.com",
          "Contenu": "I loved ultahost hosting services, because it's cheap and well secure, very fast in loading and i also like their support team for their wellness and fast respone time on case created. I really recommend their serivces for other.Thanks to the ultahost for helping posocial.con"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adam Wright",
          "Nb_Reviews": 3,
          "Date": "2020-07-20T14:15:06.000Z",
          "Titre": "Brilliant customer service and…",
          "Contenu": "Brilliant customer service and attitudes. Can’t fault them one bit. They have been very fast and helpful with any of my problems and questions.Extremely fast hosting. Sites run pinpoint perfect. Scalability and pricing options are the best On the market for VPS. Websites run very fast."
        },
        {
          "Note": 5,
          "Lieu": "GY",
          "Pseudo": "Clement Spencer",
          "Nb_Reviews": 2,
          "Date": "2020-07-20T14:05:12.000Z",
          "Titre": "Cheap and Helpful",
          "Contenu": "I first saw this hosting being recommended by two theme developers on Evanto. On checking them I decided to start with one of there shared hosting, to my surprise the prices were very affordable. Now I am no Techy person but they were always there for me when I mess up.  I would \"Definitely Recommend\" them because I am still hosting my site there today. NOTE: I WAS NOT PAID TO GIVE THIS REVIEW"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Ugonna JohnBosco Ezeomedo",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T04:54:53.000Z",
          "Titre": "This company has saved me a lot of…",
          "Contenu": "This company has saved me a lot of hosting stress. As a web designer, hosting and managing my client's websites had been stressful until I came across Ultahost in February 2020. Already a year and not complaint. Their customer service is topnotch."
        },
        {
          "Note": 5,
          "Lieu": "MW",
          "Pseudo": "CIM AGENCYTZ",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T05:36:03.000Z",
          "Titre": "I love this Ultahost.com is very very…",
          "Contenu": "I love this Ultahost.com is very very good company for me Because Everything you need is on time and more from support teams is very organized i like what you are doing everyone God bless you all from the office thank you again and again."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "TrueBrain",
          "Nb_Reviews": 5,
          "Date": "2023-11-09T12:32:25.000Z",
          "Titre": "Great hosting company",
          "Contenu": "Great hosting company. I have a Wordpress hosting plan and the speed of website is beautiful."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Mutlucan İltir",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T10:05:59.000Z",
          "Titre": "Great service and great customer support"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Andrew Frankspartts",
          "Nb_Reviews": 2,
          "Date": "2021-05-08T14:07:49.000Z",
          "Titre": "I'm very satisfied with their services…",
          "Contenu": "I'm very satisfied with their services and quick responseto resolve my problems. I was having doubts at first because of the rumors I was hearing about they being bad rumors. but I prefer seeing is believing so I give then a shot with purchasing vps server. and truth be told all went smoothly without problems so Thanks for the amazing service and keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "w camp",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:57:27.000Z",
          "Titre": "Of all the technicians on staff, Klemens excels!",
          "Contenu": "Of all the technicians on staff, Klemens provided the utmost care and attention to correcting a gigantic problem that another UltaHost technician caused in January. It will be a long-term fix but Klemens remains dedicated to finally correcting it.I wish the other technicians had his drive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stuffy",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:41:12.000Z",
          "Titre": "Exceptional VPS Hosting Experience with…",
          "Contenu": "Exceptional VPS Hosting Experience with UltraHostI have been using UltraHost's VPS platform for the past few months, and I am thoroughly impressed with the exceptional service they provide. From robust performance to top-notch customer support, UltraHost has exceeded my expectations in every aspect.Performance:The performance of UltraHost's VPS is nothing short of outstanding. The servers are lightning-fast, ensuring that my websites and applications load quickly and efficiently. I've experienced minimal downtime, and the reliability of their infrastructure has greatly contributed to the seamless operation of my online projects.User-Friendly Interface:Navigating UltraHost's user interface is a breeze. The control panel is intuitive and well-designed, allowing me to manage my VPS effortlessly. Whether it's deploying new applications, adjusting server settings, or monitoring resource usage, UltraHost has made it simple and user-friendly.Scalability:One of the standout features of UltraHost is its scalability. As my online projects grew, I needed a hosting solution that could adapt to increasing demands. UltraHost's VPS platform allowed me to easily scale my resources, ensuring that my websites and applications continued to perform optimally even during periods of high traffic.Reliable Customer Support:The customer support at UltraHost is truly commendable. Whenever I've had questions or encountered any issues, their support team has been quick to respond and incredibly knowledgeable. Their dedication to customer satisfaction sets them apart, and I always feel confident that any concerns will be addressed promptly.Affordable Pricing:UltraHost offers competitive and transparent pricing plans. I appreciate that there are no hidden fees, and the value I receive for the cost is exceptional. The range of plans caters to various needs, making it accessible for both small businesses and larger enterprises.Security Measures:Security is a top priority for UltraHost, and it shows. The VPS platform is equipped with robust security features, including firewalls and regular backups, providing peace of mind for me as a user. Knowing that my data is secure allows me to focus on growing my online presence without worrying about potential threats.In conclusion, UltraHost's VPS platform has proven to be a reliable, high-performance, and user-friendly hosting solution. With excellent customer support and a commitment to security, UltraHost has become my go-to choice for VPS hosting. I wholeheartedly recommend UltraHost to anyone in need of a dependable hosting service."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Melody Lucero",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T03:55:52.000Z",
          "Titre": "The support team in Ultrahost is always…",
          "Contenu": "The support team in Ultrahost is always there whenever you needed them. very satisfied with the decision to host with them. The pricing is very competitive compared to what you get. Satisfied! 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "swapfanatic",
          "Nb_Reviews": 3,
          "Date": "2021-12-25T15:33:24.000Z",
          "Titre": "great reliable service however its…",
          "Contenu": "great reliable service however its cpanel version,sucks,its not user friendly.The developers i hire from time to time find it very difficult to understand,lets face it its not cpanel.Otherwise,its been a very great workhorse to have on hand for my site."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "amin",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T20:13:51.000Z",
          "Titre": "Great site, great support, great servers",
          "Contenu": "Frankly, guys, dealing with support on this site is great. They respond very quickly and do not delay in helping, and their servers are great and fulfill the required purpose. I recommend this company with confidence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ariel M",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T21:11:18.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "If you don't reach out to customer service to help resolve the issue then of course there are going to be angry customers. I like to try to figure out the issues on my own and when I couldn't identify what was wrong with my server, I reached out to customer service and they were able to walk me through it."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Samuel Olaoye",
          "Nb_Reviews": 2,
          "Date": "2021-12-26T15:48:17.000Z",
          "Titre": "A very great host",
          "Contenu": "Ultahost is a very superb hosting company with very impressive customer support staff and very fast servers. I greatly recommend it. They have a range of products tailored to your needs, their pricing is very fair and they deliver a great hosting environment. It is a very good hosting company."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "ابو الوليد حمدان",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T16:41:44.000Z",
          "Titre": "give a try and you will never regret",
          "Contenu": "this host has amazing price and supper fast and unlimited customer support servicei tried many great hosts before it for many websites but swear to god this host is keep surprising me with its unlimited strength point."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Deil Official",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T19:11:13.000Z",
          "Titre": "Best hosting service on #INTERNET",
          "Contenu": "This is the best hosting service on Internet!!! I am always happy with support..they help me alot with anything i asked!!! Love them all!! Best regardsFrom Czech RepublicDalibor Kolompár \"Deil\"Touchdown World"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Konstantin",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:32:08.000Z",
          "Titre": "great, easy-to-configure hosting",
          "Contenu": "used this platform to rent few vps for my university studies"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Cara Lopez",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T12:53:46.000Z",
          "Titre": "Speed is great and affordable price for…",
          "Contenu": "Speed is great and affordable price for it's quality, I am eager and happy to continue using them for years to come.Hoping to have a good releationship with them!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Stephanie Cole",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T17:10:39.000Z",
          "Titre": "I discovered Ultahost through my friend…",
          "Contenu": "I discovered Ultahost through my friend and I can say that since then, it’s been Ultahost or nothing. I love that their customer service works. They listen to your problems and figure out how to fix it. I strongly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "roberto rosado",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T23:40:38.000Z",
          "Titre": "The customer service is a A+ Roland…",
          "Contenu": "The customer service is a A+ Roland Smith gave me an awesome hand on my server configuration and playtubescript installation, including help on DNS cloudflare configuration and more. Ticket response are very fast and right now i downgrade my site from dedicate server to VDS on ultahost and the site is moving smooth. I downgrade because im short of money. Recommend this hosting server to any one."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Promise Alozie",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T14:45:32.000Z",
          "Titre": "An amazing support team",
          "Contenu": "An amazing support team, they go out of their way to offer additional premium services for free to their existing clients. Services like script installations and configuration. I will be with them for as long as they keep this awesome momentum."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Chandana Munasinghe",
          "Nb_Reviews": 2,
          "Date": "2022-01-03T09:03:28.000Z",
          "Titre": "It works great for my video hosting…",
          "Contenu": "It works great for my video hosting site.  and when I am in trouble, very professional technical support they can give you , and reasonable price. really value for invested money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nitchev Casseus",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T22:43:57.000Z",
          "Titre": "Really amazing customer service and support teams",
          "Contenu": "Excellent customer service and support team. Unfortunately I was one of those impulse customers that left a bad a review when the issue could have easily been fixed by reaching out. Thank you for all the help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mavie Navarro",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T15:38:01.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service, received instant replies to all my queries! Anytime of the day, you can count on them! I am highly recommending them to others!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Liza Obille",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T14:00:04.000Z",
          "Titre": "Perfect web hosting service",
          "Contenu": "Perfect web hosting service. As a developer i highly recommend ultahost as a hosting option. 24/7 friendly and responsive support team. Reliable servers with high speed and affordable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Brown",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T05:10:17.000Z",
          "Titre": "Really Good Customer Service.",
          "Contenu": "Really Good Customer Service.Very helpful with setting up platforms for us. They even went above and beyond by helping to upload a custom platform that I was having a trouble with."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "emmanuel",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T19:14:30.000Z",
          "Titre": "the best on the market",
          "Contenu": "I have used many services and brands, but as there are not two ... they are the best in customer service 24/7, they always help you in everything, charming, friendly, and super economical, and the servers are of the best quality, really I recommend it 100% do not hesitate they are the best that exists right now in the market"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "step",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T05:31:21.000Z",
          "Titre": "One of the fastest and most open…",
          "Contenu": "One of the fastest and most open interfaces web hosting software for people who want every portion of the site custom-built! 10/10 provider."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Nonye CSN",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T10:47:25.000Z",
          "Titre": "As a 47 years old woman who decided to…",
          "Contenu": "As a 47 years old woman who decided to try out web hosting, I can say that Ultahost made my learning and practice very easy. I had little to no issues at all."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "joshua ebhoghemhenrio",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T14:13:05.000Z",
          "Titre": "Ultahost provides very good hosting…",
          "Contenu": "Ultahost provides very good hosting service with different types of Features.i will say they are currently the only host online right now the best everi have tested and i can testify"
        },
        {
          "Note": 5,
          "Lieu": "MU",
          "Pseudo": "Manish Neermul",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T13:03:22.000Z",
          "Titre": "Excellent in all ways . Security, support , price",
          "Contenu": "I have been at various hosts for the last 16 years .. I can firmly say this is one of the best value for money package around . Support is very quick , backups provided at no additional fee , they even got their own server protection.  Ultahost is surely among the best around.  I am very happy with them."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Eric Wanga",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T17:26:16.000Z",
          "Titre": "I love these guys.....[ ultahost] great service ever!",
          "Contenu": "I love these guys.....[ ultahost]1. They are always available 24/72. They are quick in taking action no matter what...3. Very professional and friendly4. Affordable 5. I can go on and on and on....."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Saurabh Jha",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T07:39:03.000Z",
          "Titre": "Awesome Service UltaHost",
          "Contenu": "i used many hosting during 10 years of my online journey.UltaHost is the fastest hosting speed and the best customer support.and it's cheap too.unbelievable company"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Damilola David Jesuskid",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T11:46:25.000Z",
          "Titre": "i used many hosting during 10 years of…",
          "Contenu": "i used many hosting during 10 years of my online journey.UltaHost is the fastest hosting speed and the best customer support.and its cheap too.unbelievable company"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sohail Akhter",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T03:49:02.000Z",
          "Titre": "Very Best Hosting I use 1 year.",
          "Contenu": "Very Best Hosting I use 1 year.Best support team . Quickly response my all massage'sThanks ultahost.com"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Unyime Udofa",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T19:46:30.000Z",
          "Titre": "There are very exceptional in all…",
          "Contenu": "There are very exceptional in all aspect of their hosting services, I will recommend the company to anyone over and oner again.thank you Ultahost"
        },
        {
          "Note": 5,
          "Lieu": "RW",
          "Pseudo": "Aime Jayd Manihimwe",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T07:38:56.000Z",
          "Titre": "UltraHost been the best host ever in my…",
          "Contenu": "UltraHost been the best host ever in my life it has great service and support you won't ever find anywhere they are the best I recommand them"
        },
        {
          "Note": 5,
          "Lieu": "IR",
          "Pseudo": "dean",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T08:01:12.000Z",
          "Titre": "UltaHost is reliable",
          "Contenu": "UltaHost has very fast and reliable services. they have responsible support team."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "FG Smart Service",
          "Nb_Reviews": 2,
          "Date": "2020-08-12T11:02:03.000Z",
          "Titre": "I've only been using this hosting…",
          "Contenu": "I've only been using this hosting provider for a short time, but I am very surprised how well everything works, the support team is very friendly and helps with all problems, I used Namecheap for a long time until I found Ultahost, I am not very familiar with this prorammier topic and it has happened that I broke something on my side and ultahost was always very helpful and always helped me. I am glad that I found this provider, it makes my work a lot easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Hart",
          "Nb_Reviews": 3,
          "Date": "2020-12-06T13:05:44.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, fast service.  Highly recommend.  I am renting a server and they have been helpful setting it up and responding to any help requests I submit."
        },
        {
          "Note": 5,
          "Lieu": "KM",
          "Pseudo": "Bacar Azhar",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T17:39:57.000Z",
          "Titre": "New hosting plateforme but the only one…",
          "Contenu": "New hosting plateforme but the only one good hosting plateforme on the market.Very easy and have more independant operations usingSheeper and Friendly supports"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Denisse Mordeno",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T07:54:48.000Z",
          "Titre": "I like Ultahost",
          "Contenu": "I like Ultahost because it is intuitive and reliable. To me, it should truly be a staple in the web hosting provider sector/community."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "André Dantas",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T20:48:02.000Z",
          "Titre": "The support here is really awesome",
          "Contenu": "The support here is really awesome. I´ve never seen nothing like this. I have a problem, I call in the chat and boom... everything is set up. Congratulation for being like this."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Paolenmang Haokip",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T13:41:06.000Z",
          "Titre": "Ultahost is one of my best hosting…",
          "Contenu": "Ultahost is one of my best hosting service for years, great team, affordable and fast response from the team.Highly recommend to all user."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Conrad Strauss",
          "Nb_Reviews": 8,
          "Date": "2022-04-21T17:42:05.940Z",
          "Titre": "Fantastic company use them for…",
          "Contenu": "Fantastic company use them for clonehat.com. Super fast super nice people 110 or 1 mil stars. Really great company!"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Jsent Jboss",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T22:20:23.000Z",
          "Titre": "i haven't had any problen with the…",
          "Contenu": "i haven't had any problen with the hosting till now and I use it for a social network the server is always active I am happy I choose them"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Globull",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T13:48:47.000Z",
          "Titre": "Ultahost is the best hosting company in…",
          "Contenu": "Ultahost is the best hosting company in the world. they give you great value for your money and funny how you pay less for this. I am so impressed with their service that I will keep broadcasting their great service to the world"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reneile Baker",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T12:07:04.000Z",
          "Titre": "Super easy to use and very friendly…",
          "Contenu": "Super easy to use and very friendly staff. If you have any problem with your website all you need to do is open a ticket and they will fixed it in a few hours. I am running  about 5 website on ultahost and I must say its the best."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Carlos Senso",
          "Nb_Reviews": 4,
          "Date": "2020-05-26T14:46:40.000Z",
          "Titre": "The best Hosting server provider I had",
          "Contenu": "The best Hosting server provider I had, Just after testing their service made me go full on working with Ultahost."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Paul-Alain AMBASSA",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T12:29:06.000Z",
          "Titre": "100% Satisfied",
          "Contenu": "I am happy with them. the services and support are very good.Always available to assist you for any issueAlso reliable, and fast hosting . I did not get server down or time out.The best value for money. it is cheap."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Mahbub hassan Sagor",
          "Nb_Reviews": 2,
          "Date": "2020-06-11T16:52:30.000Z",
          "Titre": "Amazing its very first service…",
          "Contenu": "Amazing its very first service provide..ultahost is the best server provider. Thank you for supar fast support❤❤❤"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Alexander Purple",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T22:15:05.000Z",
          "Titre": "A simple review ..",
          "Contenu": "A simple review ... AWESOME SUPPORT SERVICE!No need for much discussion. Try it yourself and thank me later!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Archker",
          "Nb_Reviews": 2,
          "Date": "2021-12-25T12:51:44.000Z",
          "Titre": "wonderful hosting provider",
          "Contenu": "great hosting provider! very helpful on all questions and setup assistance. When there was a problem they fixed it quick!"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Felipe Silva P.",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T21:55:05.000Z",
          "Titre": "really good hosting!",
          "Contenu": "good customer support and fast response over a big issue ocurred during the service."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nelmer Tuazon",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T09:38:25.000Z",
          "Titre": "Ultahost review",
          "Contenu": "Ultahost is a high quality brand I highly recommend this because I've had good experiences with them in the past."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rochelle Ariate Visey",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T13:38:42.000Z",
          "Titre": "Such a great web hosting provider…",
          "Contenu": "Such a great web hosting provider because it has a lot of features and it is easier to use. I like it and I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T19:43:16.000Z",
          "Titre": "ULTAHOST'S Outstanding Service",
          "Contenu": "ULTAHOST'S Outstanding ServiceMy server has performed well as my traffic and active users numbers have increased."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Ümit Karakaş",
          "Nb_Reviews": 3,
          "Date": "2022-10-19T15:16:11.000Z",
          "Titre": "it is realy good realy the best hosting…",
          "Contenu": "it is realy good realy the best hosting company i did have i tyr lot of hosting company and i did find the best ULTAHOST."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Kin Storees",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T19:23:08.000Z",
          "Titre": "I love Ultahost",
          "Contenu": "I love Ultahost. I was skeptical when I joined last two months, but their money back guarantee convinced me. I’m glad I used them."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Yaro Ibrahim",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T22:57:08.000Z",
          "Titre": "My Stellar Hosting Experience with Ultahost: A Comprehensive Review",
          "Contenu": "I recently embarked on my blogging journey, and amidst the myriad of hosting providers available, Ultahost emerged as the beacon of reliability and excellence. From the outset, Ultahost has proven to be a game-changer, offering a seamless hosting experience that has significantly elevated my blogging career.Reliability and Performance:Ultahost's unwavering commitment to reliability has been a cornerstone of my positive experience. Their servers consistently deliver optimal performance, ensuring that my blog remains accessible and responsive at all times. The uptime has been nothing short of impressive, translating to a seamless browsing experience for my audience.User-Friendly Interface:Navigating through Ultahost's user interface is a breeze, making it an ideal choice for both beginners and seasoned bloggers. The intuitive design simplifies the management of domains, databases, and other essential features, allowing me to focus on creating content rather than grappling with a complex control panel.Customer Support:Ultahost's customer support deserves special commendation. Their responsive and knowledgeable team has been a lifeline during occasional technical hiccups. Whether it's a simple query or a more complex issue, the support team at Ultahost has consistently provided prompt and effective solutions, fostering a sense of trust and reliability.Feature-Rich Hosting Packages:The array of hosting packages offered by Ultahost caters to a diverse range of needs. From shared hosting plans for beginners to more robust options for experienced bloggers, Ultahost ensures that users can find a package tailored to their specific requirements. This scalability has allowed me to seamlessly upgrade my hosting plan as my blog has grown in popularity.Affordability and Value for Money:One of the standout features of Ultahost is its affordability without compromising on quality. The hosting plans are competitively priced, offering excellent value for money. This affordability has been a boon for me, especially in the early stages of my blogging journey.In conclusion, Ultahost has not only met but exceeded my expectations as a hosting provider. The combination of reliability, user-friendly interface, exceptional customer support, feature-rich packages, and affordability positions Ultahost as the epitome of what a hosting service should be. For anyone seeking a hosting provider that goes above and beyond, Ultahost comes highly recommended based on my exceptional experience."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Lucia Ordanza",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T04:25:57.000Z",
          "Titre": "Switching to Ultahost is one of the…",
          "Contenu": "Switching to Ultahost is one of the best investment I have ever done, they have never disappointed me with their service, whenever I needed help, they are always available with no excuses, all staff are friendly and very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Paa",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:36:29.000Z",
          "Titre": "Great customer support experience",
          "Contenu": "Their support services have always been reliable and helpful."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Ardian Krasniqi",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T03:36:20.000Z",
          "Titre": "Never had an issue with them their…",
          "Contenu": "Never had an issue with them their support is top notch and that’s why I am staying with them."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Omar",
          "Nb_Reviews": 3,
          "Date": "2021-12-25T13:44:05.000Z",
          "Titre": "Reasonable Prices - Excellent Support",
          "Contenu": "I recently began utilizing Ultahost's WordPress beginner plan; the pricing are really reasonable, and the customer service is excellent.Before I started with Ultahost, I asked a lot of questions via chat, and they were incredibly helpful in determining which package would be best for my little business."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Baillie Barber",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T18:48:46.000Z",
          "Titre": "Absolutely amazing service",
          "Contenu": "Absolutely amazing service, I bought the basic package to test out my scripts, I got them installed for me and I will definitely be upgrading soon, Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "CD",
          "Pseudo": "Verlen Munzemba",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T13:05:21.000Z",
          "Titre": "Great service",
          "Contenu": "UltaHost offers great service, support is always ready to assist, I really liked UltaHost, if you need a dedicated server worthy of the name, come to UltaHost"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Freddy Rivera",
          "Nb_Reviews": 1,
          "Date": "2021-08-15T08:29:16.000Z",
          "Titre": "Awesome Support",
          "Contenu": "I have a many issue and needed help in many of my setup and small tweaks here and there which a normal individual cannot but the support team is so helpful and cooperative, it is solved in matter of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Gbarpul",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T17:02:44.000Z",
          "Titre": "Great support Team at UltaHost",
          "Contenu": "Great support, very fast hosting Provider they are awesome, you should check them out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donny Albino",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T01:41:14.000Z",
          "Titre": "I give them a five stars the best web…",
          "Contenu": "I give them a five stars the best web hosting site so far. Quick response and support. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Trisha Anne",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T04:08:54.000Z",
          "Titre": "Amazing provider!",
          "Contenu": "It is a very well-organized web hosting provider. It has great pricing, and it is very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Armstrong",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T00:47:54.000Z",
          "Titre": "My experience with has been great",
          "Contenu": "My experience with has been great. I asked for a reset and it was done. It’s been operating on its level. Thank you so much"
        }
      ]
    }
  ]
}