{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "unitelvoice.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hayden James",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T17:38:25.000Z",
          "Titre": "Read the other 1-star and 2-star reviews FIRST.",
          "Contenu": "Read the other 1 and 2-star reviews here. They also manually charged my credit card without my authorization. I'm in the middle of reporting this and uploading supporting docs to relevant authorities. They refused to refund the transaction and FIRST discuss the amount due, since I had already paid $16.15 the day before. As such I requested that they close and cancel my account, to which they said they have to send me a confirmation email first. However, to manually run my credit card for an amount that leaves credit on my account, they did not email me first to authorize it. Terrible customer service at best, and possible illegal handling of customer and payment data. Will continue to get to the bottom of this as I find others with similar experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Hughes",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T19:07:09.000Z",
          "Titre": "My 3rd day calling and begging for…",
          "Contenu": "My 3rd day calling and begging for help.  We switched to an unlimited plan but they are still charging us on the old plan.  We have spent $1000 in 30 days trying to keep our customer service line open.  No resolution.  Cannot recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sujith V",
          "Nb_Reviews": 2,
          "Date": "2020-07-23T22:46:57.000Z",
          "Titre": "RUDE, ARROGANT, PATHETIC SUPPORT STAFF.",
          "Contenu": "Pathetic, rude and arrogant support staff, went on to block our account making own assumptions. If you do not like to listen to your customers, STAY OUT OF THE INDUSTRY."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Aakarsh Bansal",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T23:02:04.000Z",
          "Titre": "There customer service is pathetic and…",
          "Contenu": "There customer service is pathetic and they are even not educated to treat the customers without any information or anything they suspended my account and while asking they don't have any answer and they hung up on me this is not a service which you guys are providing to the customers I must say I am going to file a chargeback straight away and I will not recommend unitel voice to anyone"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mike Cooper",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T05:11:38.000Z",
          "Titre": "At least Dick Turpin had the decency to…",
          "Contenu": "At least Dick Turpin had the decency to wear a mask."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T01:28:33.000Z",
          "Titre": "I am very disappointed",
          "Contenu": "I am very disappointed. Horrible Customer Services."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emma Lewis",
          "Nb_Reviews": 3,
          "Date": "2020-04-15T02:14:00.000Z",
          "Titre": "This service was good until I tried to Cancel!",
          "Contenu": "This service was good until I tried to cancel. Lots of emails and a phone call got me nothing. I have been charged again and I am trying to dispute it. I have sold my business so this service is not needed. Why would you Make it such a pain for Someone to cancel? Not happy!"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Adrianna B",
          "Nb_Reviews": 1,
          "Date": "2019-03-08T05:42:54.000Z",
          "Titre": "They charged me after I contacted cancel",
          "Contenu": "They charged me after I contacted to cancel months ago."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "June Ware",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:11:13.000Z",
          "Titre": "It was so helpful with the initial…",
          "Contenu": "It was so helpful with the initial extension set up, thank you for your support. The courtesy free 100 word greeting will help our company's image!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April Cruel",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:47:20.000Z",
          "Titre": "Greg was awesome",
          "Contenu": "Greg was awesome! This call lasted about 5 mins at the most. He was super help and knew exactly how to handle my needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Franci Saunders",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:26:57.000Z",
          "Titre": "quick service - great results",
          "Contenu": "quick service, chat turned into a call very easily to solve the problems I was facing, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon Jefferies",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T21:47:46.000Z",
          "Titre": "I bought a new IPhone and needed some…",
          "Contenu": "I bought a new IPhone and needed some assistance in setting up the app again. It was after hours but through a chat session I was able to quickly get the information I needed and get reinstalled."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dorinda Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:11:48.000Z",
          "Titre": "I was completely intimidated by this…",
          "Contenu": "I was completely intimidated by this process but the customer service support team was so helpful and amazing. Their customer service is top rated. 10 stars. Thank you for making this process easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven R.",
          "Nb_Reviews": 4,
          "Date": "2023-10-31T01:32:57.000Z",
          "Titre": "Super fast and easy to get a 1-800…",
          "Contenu": "Super fast and easy to get a 1-800 number.  Unitel has great customer support and communication, both chat and by phone.  This is my second time using them (second business line)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Datalogics, Inc.",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T15:55:21.000Z",
          "Titre": "The Unitel team set up our voice mail correctly and quickly",
          "Contenu": "The Unitel team set up our voice mail boxes promptly and correctly. It was easy to speak to the sales and support team to get our questions answered. We were transitioning 4 lines from 5gstore and use Verizon OneTalk so it was not a simple setup. They recommended the most cost effective option and provided training on their web dashboard as well. We are now up and running with voice mail transcription!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dentapay",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:55:28.000Z",
          "Titre": "UniTel has amazing customer service",
          "Contenu": "UniTel has amazing customer service. I’ve used them for two separate businesses and I highly suggest them. Greg was fantastic today!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JESSE RUPP",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T14:50:26.000Z",
          "Titre": "HIGHLY recommended",
          "Contenu": "HIGHLY recommended. Every time you call in you get the problem solved almost immediately. The phone service plans is cheap. Sometimes business does not do very well. The affordable prices is what keeps the customers. Thank You all Enviro Medic LLC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "North Oak Standings LLC",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:43:55.000Z",
          "Titre": "I could not be happier with my phone…",
          "Contenu": "I could not be happier with my phone service. You will be an industry leader. Price, quality, and versatility are unmatched."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrence",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T18:03:27.000Z",
          "Titre": "I tried Ring Central (0 Stars)",
          "Contenu": "I tried Ring Central (0 Stars), and my rep kept sending me info about pricing, fees & taxes.  But each time I did the math, the price was higher than his email.  He finally cut me off in a hissy fit.  I contacted Unitel and was told the price shown was exactly what I would pay.  I asked for a contract and was told, \"No contracts needed\"!  They even professionally recorded my messages.  So what's not to love?  Do yourself a favor and call these guys first.  You won't be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Alan Davis",
          "Nb_Reviews": 1,
          "Date": "2017-12-07T17:20:00.000Z",
          "Titre": "Cudos to Unitel.",
          "Contenu": "I am writing to compliment Unitel, Bob B., a caring and communicative  manager and a member of its staff; Diana H.. Diana has come to our assistance several times since we began our project, national business consulting. Diana made me love Unitel. Diana is professional, helpful and knowledgable. She even told me about features Unitel offers, which I didn't know were invented yet! She has a sweet personality too. She seems to really like her job. (She speaks English. That's a plus!) She is a problem solver and she must be a great asset to Unitel and source of workplace pride for you. It is because of Diana's \"can do\" spirit that we now consider ourselves Unitel customers for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melody",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T19:41:21.000Z",
          "Titre": "Super friendly to work with",
          "Contenu": "Unitel has quick turnarounds for requests and support. They have products and services for a reasonable cost that other service providers dont"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Genson",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T17:34:21.000Z",
          "Titre": "Jenni V is priceless!",
          "Contenu": "Jenni is an excellent representative of the company.  She was friendly and out-going, answered my many questions and stayed on the phone with me through every step of the process while I signed up online.  I felt like I had a friend helping me rather than a company.  Wonderful customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AJI",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:35:21.000Z",
          "Titre": "Great customer service",
          "Contenu": "With the help of your customer service agent, the set up was very easy. She explained everything to me and walked me through each step. Setting up my voice mail message was easy too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Curtin",
          "Nb_Reviews": 2,
          "Date": "2019-08-28T16:43:12.000Z",
          "Titre": "Diana is an incredible representative…",
          "Contenu": "Diana is an incredible representative for your company.  After speaking with her this morning I feel like my business phone system is now in good hands.  Great tech and customer support 10 Stars! I will recommend your service to my colleges who currently use Grasshopper. Thank you, Sean P. Curtin Vaxonsite, LLC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T14:38:53.000Z",
          "Titre": "Needed help with disabling the…",
          "Contenu": "Needed help with disabling the voicemail feature from an extension that gave my address and office hrs. Customer service said voicemail couldn't be removed, but like magic, she added time to the end of my ext greeting file so that callers would not hear the beep right away. Great workaround. Super friendly and quick. Very impressed with Unitel Voice and sales/support staff. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miles",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T21:49:38.000Z",
          "Titre": "Great communication",
          "Contenu": "The teams communication has been very good from my intro sales call through implementation thus far. While we havent fully begun using the platform the app seems pretty straightforward. It was a little tricky to set up the extensions, but if you take a little time to watch the tutorials and read the follow up emails anyone can figure it out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Kasper",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T21:32:26.000Z",
          "Titre": "I am so impressed with Jenni V",
          "Contenu": "I am so impressed with Jenni V.  She was a true professional and super knowledgable about your product and helped guide me to understand both the mobile and computer part of the set-up for our new UNITEL number.I would continue with your company forever as long as you have associates like Jenni.Cathy KasperDirector of OperationsREsource Los Angeles Realty"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Blair",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T19:34:28.000Z",
          "Titre": "Excellent Customer Service!!!",
          "Contenu": "I am a teacher/tutor who is struggling to put together an online tutoring business. Taylor is without a doubt, one of the best customer service representatives I’ve ever dealt with. She walked me through the entire setup process with a positive attitude and humor.  She was extremely knowledgeable and answered all of my questions. Whatever you are paying her, it’s not enough. Give that girl a raise!!!  Thank you Taylor!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Wentzel",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T00:53:50.000Z",
          "Titre": "Taylor was great today in solving our…",
          "Contenu": "Taylor was great today in solving our communication issues through our softphone.  It's been a nice start to this relationship and UniTel has applied solutions to our many growing business needs.  Thanks for all your help and availability when we call.Ossom Corp"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "edward t hanley",
          "Nb_Reviews": 1,
          "Date": "2018-05-21T21:47:24.000Z",
          "Titre": "Unitel support - Jenni",
          "Contenu": "To whom it may concern,This is to commend Jenni, a member of your support staff. You should be proud to have Jenni represent you. She is professional and knowledgeable without being dour. Her enthusiasm and cheerfulness as well as the expeditious manner in which she resolved my issue all speak well for your company. Thank you Jenni!Edward T HanleyApogee Health Solutions844 344 7330"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The BlackListed Are Unifying For Peace",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T18:30:59.000Z",
          "Titre": "Taylor Makes this Company a Future Fortune 500 favorite to Watch",
          "Contenu": "Taylor, was great! Professional, intuitive, trustworthy, and honest. She is the type of representative which will make me doubt anything others say if it conflicts with her guidance to me. She gets customers service right, and the onboarding and experience felt so good along the way. Taylor for President of the USA! Okay, maybe the last line is a bit of hyperbolic rhetoric but all the others are true. Winks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALINA BRANSCOMBE",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T22:24:09.000Z",
          "Titre": "Great Customer Service Dina",
          "Contenu": "Dina, was very helpful in supporting me. Her service exceeded my expectations. I am happy to know that you have hired such a valuable person who went above and beyond to make sure I understood everything she explained to me. Dina, you are a great asset to the team and company. Keep up the extraordinary work and continue to shine your bright light!!! Excellent customer service. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virgil Moore",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T20:19:03.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great Customer Service!  Through the buying decision phase, I had many questions.  After purchasing the service I had many other questions.  The support team has been the most courteous, professional, and helpful I have ever worked with.  UniTel's product is the perfect virtual phone system.  I would recommend to anyone who wants to sound professional.  And the price can't be beat!  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Washington",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T16:43:14.000Z",
          "Titre": "I had trouble with my uploaded greeting…",
          "Contenu": "I had trouble with my uploaded greeting superseding the default greeting.  I started out on chat and then Jenni wanted to talk to me personally to go over some items.  She was very helpful, friendly and tried several different updates to get it running smoothly.  Presto, up and running within minutes of speaking to her. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 4,
          "Date": "2020-03-05T20:43:08.000Z",
          "Titre": "Phenomenal Customer Service!",
          "Contenu": "We found UniTel Voice through a Google search and was immediately impressed with their level of customer service! Taylor was the Customer Success rep that handled the setup of our service. She was polite, friendly & professional. We had nothing but pleasant interactions with UniTel and would highly recommend their service. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 2,
          "Date": "2021-10-11T22:24:30.000Z",
          "Titre": "I had difficulty understanding the…",
          "Contenu": "I had difficulty understanding the setup process.  I called their Help number, and I was able to get direct, helpful, patient and competent assistance.  The system, and the end results are great!  The speed at which they were able to assist with the setup was amazing.  The personalized recording that they created for my business was fast, accurate, and professional. I still think that the instructions to set up the system can be improved, however their help desk made up for it 10 fold. Kudos to the staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle K",
          "Nb_Reviews": 3,
          "Date": "2019-03-29T17:09:45.000Z",
          "Titre": "Frank definitely lived up to his last…",
          "Contenu": "Frank definitely lived up to his last name.  ;)He was very helpful, had a pleasant demeanor, took the time to answer all of my questions, took down notes when I made suggestions, and even provided me with additional info regarding my account and how to utilize it better.I've been in customer service for over 30 years; his customer service skills are superb! If only all of my calls for support went this well with other companies...Kudos Frank!Danielle Carey,Carey Pest Management"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moussa Silue",
          "Nb_Reviews": 4,
          "Date": "2020-09-03T22:45:24.000Z",
          "Titre": "What a great customer Service support! Thumbs up!",
          "Contenu": "AS a new UniTel Voice customers, I was having some difficulty setting up the system all by myself. I reached out to customers support twice the same day and Wendy expertly took me thru all the setup steps based on my custom requirements. And even gave me examples of how I can best express my greeting.  To say the least, I was impressed.  I am glad to have chosen this company for my 800 phone service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Morrison",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T16:24:39.000Z",
          "Titre": "Unitel has unparalleled customer service!",
          "Contenu": "From the very first support email I sent, I was connected to Jenni, and every issue I had was quickly and easily resolved.  To have a real person with actual emotions in the email is something I’ve never received from a web based service company and I’m beyond impressed.  She is the epitome of customer service and it is a pleasure to converse with her.  I am a Unitel customer for life.   Thanks Jenni!Steve Morrison, Owner DTS Custom Snare Drums"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ran Perhar",
          "Nb_Reviews": 3,
          "Date": "2022-03-23T19:11:43.000Z",
          "Titre": "Excellent service.",
          "Contenu": "The system is intuitive enough to make it easy to use. Customer service is superb. Response to my service request was prompt. Frank's methods of walking me through the setup was systematic. Way to go Frank!UniTel voice is a good business partner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Malijo Renaissance",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T20:57:25.000Z",
          "Titre": "Diana was professional",
          "Contenu": "Diana was professional, patient though for a while I though she was going to loose it but she remained calm ,collected and help through the long process.She went above and beyond her call of duty.Thank you Diana ,you are my kind of customer service person !!!Thank you Frank you were great also.Because of quality service I received ,I wind up referring 2 of my friends to Intel VoiceRachel K"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T00:45:04.000Z",
          "Titre": "Best Virtual Phone Service Small Businesses.",
          "Contenu": "From my personal experience, Unitel Voice is the best! I have tried some big name virtual phone companies, but none of them compares to Unitel Voice. Their customer service and technical support always unbeatable. The staff is always willing to go above and beyond to please their customers. I STRONGLY recommend them for any small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawanna Hardy",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T01:19:35.000Z",
          "Titre": "I just wanted to thank Frank super for…",
          "Contenu": "I just wanted to thank Frank super for being so SUPER!! I was confused about how to set up my ringtone to my cell phone and format I should use? Frank not only helped me set up my business line but he also walked me through different formats that would fit my small business. Frank was also patient, professional with great energy made me feel like no question was to somber to ask. Great customer service . Thx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Neal",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T13:17:45.000Z",
          "Titre": "So Far so Good the system is the only…",
          "Contenu": "So Far so Good the system is the only one I found that does not charge per employee but rather for their services and # of phone lines like everyone should. Their support is super helpful, system was easy to set up I didn't even use their videos and was able to set it up. Great price, Great service support, Easy set up. eliminated 50 robo calls per day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S.S",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T01:10:23.000Z",
          "Titre": "Taylor Smith was the best ever, She was so patient and humble and also she walked me through steps just to make sure that i was setup perfectly. She was so professional and understanding as well as p",
          "Contenu": "Taylor Smith was the best ever, She was so patient and humble and also she walked me through steps just to make sure that i was setup perfectly. She was so professional and understanding as well as providing me with options and alternatives. I am happy to be using Unitel Voice. Thank you Taylor for your customer service honestly. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Dagne",
          "Nb_Reviews": 1,
          "Date": "2017-10-31T17:36:22.000Z",
          "Titre": "\"efficient and informative",
          "Contenu": "\"efficient and informative. no run around or circling back to where we started. Which has happened on other platform chat forums, We've been with Unitel Voice for 5 yrs now and consistently pleased.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tipasmusic",
          "Nb_Reviews": 1,
          "Date": "2018-07-31T22:50:27.000Z",
          "Titre": "Starting a business is nerve-racking",
          "Contenu": "Starting a business is nerve-racking, to-say-the-least.  Last week was especially painful; and this week was looking like more of the same.  That is, until I called UniTel Voice to check my acct. and reschedule my setup!  Fortunately for me, Jenni answered the phone.  Jenni had a calm voice, which was immediately settling.  She did what most customer service has forgotten.  SHE LISTENED!!  The entire process took less than 15 mins.  Fifteen minutes and I have a more positive outlook.  I've gotten more done in 4 hours, than I did in two days last week.  Courtesy, professionalism, kindness, all goes along way.  Grateful!!  WAY TO GO UniTel Voice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny Devor",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T23:05:52.000Z",
          "Titre": "Top Notch Service / A+",
          "Contenu": "The service I have received from UniTel Voice has been outstanding. As a teacher I would grade them an A+ .I have had to contact customer service serval times and I have chosen the chat option. I have never waited more than one minute to connect. Then all question were handled swiftly to my satisfaction. They were super helpful to this non-tech customer. Thank you UniTel Voice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shelly",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T17:13:27.000Z",
          "Titre": "I'm speechless at how wonderful and…",
          "Contenu": "I'm speechless at how wonderful and super easy this system is to have, and set up once being help by I believe Kevin. I hope I'm correct on his name. Well I recommend anyone looking to start there business to use this phone system .... Honestly the best everything I can possible think of. Thanks UniTel As my business grows I will be keeping you guys on for service.Honored"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Steiner",
          "Nb_Reviews": 1,
          "Date": "2019-04-12T13:30:59.000Z",
          "Titre": "The team at unitel could not have been…",
          "Contenu": "The team at unitel could not have been better! From Kristen who arranged the pricing and options that best fit our needs to Frank who made the implementation seemless, it was an awesome customer experience. It is nice to get over the top customer service which unfortunately is hard to find anymore. I recommend unitel to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T20:34:14.000Z",
          "Titre": "Fantastic Support With A Calming Voice",
          "Contenu": "When I called today, I was overwhelmed with setting up a business phone. With all of the many options to choose from and finding the best fit for me seemed hard.However, the sales manager was very patient with me throughout the process. She helped make the process easier. She answered all my questions, even though I repeated them over and over again. However, it didn't seem to bother her, and she continued to guide me through the process. The professional customer service that I received assured me that going with UniTel Voice was the right decision. Thank you, UniTel, for a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Havis",
          "Nb_Reviews": 2,
          "Date": "2020-04-21T17:01:36.000Z",
          "Titre": "Great customer service!",
          "Contenu": "I am extremely pleased with UniTel Voice so far.  Their customer support is awesome - they helped me via online chat before I even signed up and then after sign up, they helped me set up everything in the system and that was wonderful customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Complete Trucking",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T20:07:02.000Z",
          "Titre": "This company and their service is amazing",
          "Contenu": "This company is amazing and they offer amazing VoIP services! Their help is outstanding and they go above and beyond to help their customers in person! No call centers from across the planet. If you ever have a question or need some help, their support team is right there for you. Setting up the system was a breeze, even for a beginner as myself, and when I needed some help they were right there for me. This company treat you as family, not just as another customer and I would highly recommend them to anyone trying to find a great VoIP provider to a great price!Thank you UniTel Voice!!Five Stars from us here at Complete Trucking, LLC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Smith",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T23:37:41.000Z",
          "Titre": "The chat person recognized my problem…",
          "Contenu": "The chat person recognized my problem quickly and fix it right away. Also, the chat person answered my questions. Good job!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rebecca P.",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T18:07:02.000Z",
          "Titre": "Very pleased with this service for small business",
          "Contenu": "I just signed up with Unitel for a toll free number for my new small business. Their customer service is very quick, knowledgeable and helped me with ALL of my questions in minutes. The chat feature on the website is always available and so far I'm very happy with Unitel as my choice for a toll free number provider!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica D",
          "Nb_Reviews": 2,
          "Date": "2020-10-28T17:29:32.000Z",
          "Titre": "Love UniTel!",
          "Contenu": "Loved using UniTel to establish a business number for my business. The customer service is great, sending emails to check in and make sure I had everything setup the way I needed it. They even created a professional voice-mail message for me so I didn't have to record it. Will definitely use them again for my next business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vergil S",
          "Nb_Reviews": 3,
          "Date": "2022-05-13T20:57:13.000Z",
          "Titre": "To Be Frank",
          "Contenu": "Frank is one of the most professional and personable Representatives I've encountered in years, very knowledgeable and informative. He made our transition seamless, we are new Business owners, Kudos to Unitel for having him on their team, he's definitely an Asset. Vergil and Monica Smith Shanae Transport LLC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renita Adira",
          "Nb_Reviews": 4,
          "Date": "2021-05-11T03:31:31.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "The support tech Frank who assisted me with setting up my service was knowledgeable and very helpful. He was detailed, patient and so helpful. The customer service support was beyond helpful. Before I booked my consultation with Frank I had  Kim who was another customer representative who helped me as well. I am pleased with the initial set up of my services. Thank you both for still making customer service a priority."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aedryan Methyus",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T20:16:53.000Z",
          "Titre": "Very Impressed With Unitel's Features & Customer Support!",
          "Contenu": "I recently purchased a toll free vanity number and a monthly plan with Unitel Voice. I am very impressed with the amount of awesome features that are included in their plans and their USA BASED customer support has been amazing! Thanks Unitel!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tawanna Huff",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T13:55:29.000Z",
          "Titre": "I typically avoid speaking with…",
          "Contenu": "I typically avoid speaking with representatives nowadays but I was just so confused by the setup process that I was forced to and boy am I glad I did. The service rep was very knowledgeable and efficient. He had me setup in a matter of minutes.  I'm using UniTel for my small business and I would highly recommend them for yours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Cockerham",
          "Nb_Reviews": 2,
          "Date": "2020-09-02T16:41:02.000Z",
          "Titre": "Unitel Voice A Great Addition To My Business",
          "Contenu": "I would like to say that Unitel Voice is a great addition to my business. The script and voice over is professional and keeps my home number safe. I haven't had the time to really study some of the options, so, as soon as I'm able, I want to try out some of the extensions and other additions to the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronny Harris",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T17:53:10.000Z",
          "Titre": "Jenni V",
          "Contenu": "Jenni V. was more than helpful. My customer experience with her was Awesome!!! She did an excellent job of explaining UniTel's Voice services and it's many features.Thanks,Jenni"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Castillo",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T21:59:17.000Z",
          "Titre": "Old user Loving New Features and Chat Help!",
          "Contenu": "Wow - so many new features and options since I last actively used Unitel.  The assistance via the Chat session was very helpful.  Taylor was patient with me, able to configure on his end, and answered all my questions.  I'm excited to get my team using the Mobile App and all the new features.   Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2018-12-28T18:57:41.000Z",
          "Titre": "Great experience!",
          "Contenu": "I am not one to often review companies, but today I felt the need to.  I reached out to Bob with UniTel, and the response was incredibly quick and very helpful.  i enjoyed our interaction, and definitely recommend working with him/them!  Thanks for all the efforts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W Woodard",
          "Nb_Reviews": 1,
          "Date": "2020-08-29T01:26:51.000Z",
          "Titre": "Signing up with Unitel Voice",
          "Contenu": "Since signing up for Unitel Voice, I have been impressed with every interaction and communication. They have all the FAQs and all the ANSWERS TOO! I will definitely recommend your service!Thanks for good service!WVW Enterprises, LLC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sylvia Michel",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T20:03:21.000Z",
          "Titre": "Frank Super was awesome!!",
          "Contenu": "Frank Super was awesome!!! He was very nice and patient with helping me set up my phone service. He explained everything very well and assisted me in uploading my voicemail greeting. It’s people like him that make the setup process easy and smooth!!!! This man deserve a high pay raise!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corry N Kikia Rochelle",
          "Nb_Reviews": 1,
          "Date": "2019-04-22T18:40:08.000Z",
          "Titre": "I like the service UniTel Voice…",
          "Contenu": "I like the service UniTel Voice provides. Their support is very helpful. When I needed assistance, they helped me get my voicemail/greetings/extensions set up properly! Their prices are reasonable also!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JT Taylor",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T04:19:34.000Z",
          "Titre": "I switched over to UniTel Voice from a…",
          "Contenu": "I switched over to UniTel Voice from a very large and well known competitor because the competitor was raising their prices. I got more value for less cost with UniTel. Their tech support was amazing! Very helpful in getting me sorted out and everything to work exactly how I wanted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittni Finlay",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T20:06:09.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service, I am so happy with everything at UniTel Voice! Between their customer care, the quality of products, and their helpfulness over the phone.....I am truly pleased. I especially love the fact that I don't have to show my own personal number when calling my clients!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrington Wyatt",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:29:39.000Z",
          "Titre": "Very knowledgable customer service…",
          "Contenu": "Very knowledgable customer service representative. Very easy and fast set up process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A R",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T03:39:18.000Z",
          "Titre": "UniTel Voice - A Company That Actually Cares",
          "Contenu": "UniTel Voice's level of service is well above any other company. They do not have all the features some of the big players have, but they make up for it with the fact that they truly try to find a workable solution to any problem I have. UniTel's staff values my company and proves it by taking any problem or concern I have as seriously as I do. I actually had started to transfer my numbers out after being sold on bad information and nonexistent features by Nextiva. Mid-transfer I reversed the move as I realized that UniTel was more responsive and helpful with me leaving than Nextiva was at migrating in my numbers as a new customer. UniTel does it the right way whether the customer is onboarding or switching to a competitor. That statement alone shows they do care, and in today's world that is near impossible to find."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Harmon",
          "Nb_Reviews": 3,
          "Date": "2021-02-18T19:17:19.000Z",
          "Titre": "I had the opportunity to deal with both sales and service.",
          "Contenu": "I had the opportunity to deal with both the sales and service teams. Both representatives were professional, knowledgeable and in my instance showed great patience. I am new to UniTel Voice and I am sure the product will be as great as the personnel. As a startup business it is comforting to know that I have the support of a great team and a great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Somen Saha",
          "Nb_Reviews": 1,
          "Date": "2020-12-17T20:52:09.000Z",
          "Titre": "These guys are great - A+ experience.",
          "Contenu": "These guys are great. Their user-interface is clean and intuitive. Pricing was one of the best that we shopped and their customer support is exemplary. If you are a small/medium business, you will do well to get them on your side."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Vanessa Joy Pineda",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T19:30:51.000Z",
          "Titre": "FRANK IS THE BEST!",
          "Contenu": "Loved the support/assistance he has given me! It's EXCELLENT in fact. You're the best, Frank. You just saved and helped our company. Please keep on providing excellent and adequate services. Stay safe! God bless you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devir Zivan",
          "Nb_Reviews": 2,
          "Date": "2019-08-01T20:37:46.000Z",
          "Titre": "Incredible customer service and product for a very affordable price",
          "Contenu": "I couldn't be more impressed with UniTel Voice. I did a lot of research before deciding on a new phone service to switch our company over to. UniTel not only had all of the features we were looking for, but it had them at a significantly lower price than their competitors. What I didn't expect is the quality of services I've received since joining. I've reached out to their support team and communicated with multiple representatives during the process of setting up our account. They were all incredibly knowledgeable, helpful, and friendly. They were even willing to set it all up for me over the phone. This may sound too good to be true but take it from someone that did a lot of research and has a business that's centered around high quality customer service, UniTel Voice is the best VoIP provider you will find."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Grimes-Hardie",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T21:26:30.000Z",
          "Titre": "Make Unitel your first stop!",
          "Contenu": "I have used Unitel Voice several times, always to great results.  The thing to understand is that they try to make it easy for you to accomplish your communication goals. It is best to have a conversation with customer service so that they can explain how they can help your business with call management, messaging, incoming call protocols and more. Make this your first stop to solve your communication issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Turner",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T19:19:03.000Z",
          "Titre": "Best Customer Service...",
          "Contenu": "Today was my second call to UniTel Voice Customer Service.  Both calls were answered promptly and found the reps to be courteous and professional.  Today, I spoke with Taylor who helped me with some setup questions.  She resolved things promptly and was very informative.  I am impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki Bartlow",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T21:52:32.000Z",
          "Titre": "Great job by Dina in assisting me today…",
          "Contenu": "Great job by Dina in assisting me today and other times I have asked for assistance.  Everyone at UniTel Voice has always been extremely helpful to our company.  Thank you so much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Classy Auto",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T17:46:05.000Z",
          "Titre": "Frank at Uni Tel is an absolute…",
          "Contenu": "Frank at Uni Tel is an absolute Rockstar!! What a blessing to have him help me this morning! Caring, kind, and professional. He answered all of my questions with grace and love. He truly was fantastic! Thanks Frank!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tessa",
          "Nb_Reviews": 9,
          "Date": "2023-06-12T18:51:07.000Z",
          "Titre": "The young that I got.",
          "Contenu": "The young that I got not only Listen to me before hand he was swift and explain to an old lady as my self, It was a great experience Thank You Greg :)"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Andre Esbizaro",
          "Nb_Reviews": 1,
          "Date": "2019-04-11T16:36:12.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "I chatted online with a person from their Customer Support Team. She promptly called me to make sure everything was working for me. Outstanding Customer Service! Thank you UniTel Voice and Jenni V. for the great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T19:08:13.000Z",
          "Titre": "Frank was AWESOME!",
          "Contenu": "Frank was AWESOME!!  He was super helpful, walked me through each step and left me feeling confident to on-board the rest of our team.  Super appreciate his time and knowledge!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy L.",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T19:22:31.000Z",
          "Titre": "Great Communication !",
          "Contenu": "Jenni V  your rep  was very knowledgeable and helpful  in solving in my situation . Worked with me patiently and got the problem resolved .  Thanks for answering call when i need assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Sherwood",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T17:53:01.000Z",
          "Titre": "Jenni made it clear!",
          "Contenu": "Jenni was incredibly helpful and patient with me as I had very basic questions about transferring our 800 number to UniTel. She gave me clear answers and set up a meeting with a technician to get my account going."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamilyn Reiser",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T01:47:18.000Z",
          "Titre": "Unitel is simple and easy to use!",
          "Contenu": "Unitel is simple and easy to use! I've had a few businesses before but never any that needed an IVR or Toll-Free number. UniTel has made my transition so simple, easy, and very affordable! I love the professional greetings!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Heintz",
          "Nb_Reviews": 2,
          "Date": "2019-04-17T13:37:03.000Z",
          "Titre": "Diana was great to work with!",
          "Contenu": "Diana was great to work with. She waited patiently as I chose my toll free number while texting with my colleague and even participated in helping me find the right number that worked for my business. You have a great employee with Diana."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swipe N Clean",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T18:52:31.000Z",
          "Titre": "Great plaform along with excellent customer service",
          "Contenu": "Great platform along with excellent customer service. Taylor has been really helpful in getting setup with Unitel. Highly recommend you give them a shot!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Mrozovich",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T14:18:34.000Z",
          "Titre": "Unitel sales and support were amazing…",
          "Contenu": "Unitel sales and support were amazing from day 1. Very transparent and helpful to get us the services we needed at a great price point and so far the service itself has been rock solid."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sim Dova",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T00:15:54.000Z",
          "Titre": "Excellent service rep",
          "Contenu": "Don't know about Unitel Voice.  It is too new.  But the service rep was EXCELLENT.  So knowledgeable and professional.  And most important to me, PATIENT.  If Unitel Voice is as good as their reps, I will be completely satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheri Stoutenburg",
          "Nb_Reviews": 1,
          "Date": "2019-04-25T16:43:45.000Z",
          "Titre": "Wonderful Assistance!",
          "Contenu": "In having to learn about our company's different accounts and several phone numbers we pay for I called UniTel for assistance.  (Honestly did not learn too much on the website) Diana was incredibly helpful explaining how the numerous plans work, what we pay for and what we can do in our future plans to maximize our UniTel accounts. We will continue our relationship with UniTel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gkr",
          "Nb_Reviews": 3,
          "Date": "2021-12-19T16:12:30.000Z",
          "Titre": "LOVE everything about Unitel Voice.",
          "Contenu": "LOVE everything about Unitel Voice.We're a small non-profit. We've been using Unitel Voice for a year and a half or so. The set up was easy. The overall quality of the product is SUPERIOR. The features and functions are full and broad.Before I joined the nonprofit I used RingCentral at our own business and I can tell you that this rivals any full blown phone switch PBX. And their tech support? (Here is where you expect me to complain - but no complaints at all.) Unitel Tech Support is freakishly amazing!!!! Helpful. Quickly available, Consistent. Amazing. We love everything about Unitel Voice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scotts Level Solutions /We Buy",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T14:48:56.000Z",
          "Titre": "I am very pleased with the UV Service…",
          "Contenu": "I am very pleased with the UV Service thus far. Particularly with the professionalism of Frank Super who did a great job in helping me set my phone system up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon Jefferies",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T16:58:24.000Z",
          "Titre": "Great Affordable Service for Small Business",
          "Contenu": "Overall, I'm pretty pleased with your service. It's affordable for a small business, simple to operate, and it works. Perfection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audrey Helms",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T14:22:04.000Z",
          "Titre": "Best Customer Service I've had in ages",
          "Contenu": "Best Customer Service I've had in ages. Jenni Vento & Frank are the Best !!! I just got started & would highly recommend this Company to everyone. I really appreciate you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelson Velazquez",
          "Nb_Reviews": 1,
          "Date": "2020-09-04T18:35:09.000Z",
          "Titre": "The life line is always on at UniTel Voice",
          "Contenu": "I've been a customer of UniTell Voice for approximately three months now. The customer service is responsibly awsome. When I needed assistance they answered the call. Covid-19 is no match for this company. UniTell Voice was there, no wait,, no hold,, no problem. They were there when I needed them. In today's times, that means alot to me. Thank you UniTel Voice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jude Gilford",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T22:41:42.000Z",
          "Titre": "Even Better than Anticipated!",
          "Contenu": "Excellent and patient service from UniTel Voice to set up my new number. Would not hesitate to recommend Unitel Voice to make your business life simpler!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kemble Hildreth",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T18:05:35.000Z",
          "Titre": "Unitel Voice is easy to use, simple to setup, and affordable!",
          "Contenu": "Unitel makes our company look good with the automatic phone assistant!  Setup was easy, the pro voiceover was great, and we really enjoy the entire service.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BARRY",
          "Nb_Reviews": 4,
          "Date": "2022-04-01T20:40:18.000Z",
          "Titre": "Jenni was great",
          "Contenu": "Jenni was great! She pinpointed the problem before I had a chance to explain the issue. I am totally satisfied with her skill level. I would rather have her assist me when ever I have an issue... excellent job JENNI!👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candace",
          "Nb_Reviews": 3,
          "Date": "2019-05-08T13:25:27.000Z",
          "Titre": "Taylor S was great in helping me…",
          "Contenu": "Taylor S was great in helping me resolve a potential serious issue with our service.  Unitel is so easy to work with and everyone I have dealth with so far has been awesome!Thank you, Taylor and Unitel!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Jones",
          "Nb_Reviews": 4,
          "Date": "2023-04-06T22:36:43.000Z",
          "Titre": "Wow, The Best Above the Rest",
          "Contenu": "Wow, this is the short version of my experience with UniTel Voice. Well, I must admit I had such low expectations when I first contacted them about getting a business line number. So many products and services to choose from in the marketplace. However, after going on their website, it was quite easy to open up your account and choose a number. Then, I reached out to them via email. I explained to them that I need help retrieving my 1-800 number and setting up my extensions. Then this happened; I got a phone call from one of the representatives. I explained my dilemma. He immediately set up a time and day for me to speak with someone to help me. Frank, the tech, called me and walked me through the whole process and set up everything to my specifications. I was blown away. I didn't know what to do. Within two days, I was able to call my new business number, and hear all the lovely extensions working as promised. Plus received notifications through my email about the phone calls.Overall, I highly recommend UniTel Voice. They are in a class by themselves. They provided me with a no-nonsense approach to products and features, outstanding customer service, and weren't trying to sell me features I wasn't going to use. Thank you, Frank!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miss H",
          "Nb_Reviews": 3,
          "Date": "2021-04-05T20:47:02.000Z",
          "Titre": "Wendy was very helpful",
          "Contenu": "Wendy was very helpful, professional, and an expert in the field. Thank you for being patient and answering the 1.5 million questions I had (not literally, of course.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Martinez",
          "Nb_Reviews": 2,
          "Date": "2019-10-04T21:58:11.000Z",
          "Titre": "Excellent customer service experience with Taylor Smith",
          "Contenu": "Excellent customer service experience with Taylor Smith. She was friendly, personably, knowledgeable and informative. Taylor not only addressed my issues but even recommended additional ways to streamline our service and avoid any further issues. She’s was great. Plain and simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shereka Austin",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T21:54:41.000Z",
          "Titre": "I had a great an awesome experience…",
          "Contenu": "I had a great an awesome experience with this company when I called I spoke with the agent Taylor and she was very helpful and knowledgeable of everything that the company offered and she also helped me to pick out the right vanity number for my business. I definitely will be using this company and referring order people to this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Perez",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T17:43:03.000Z",
          "Titre": "UniTel Voice - It is the best choice!",
          "Contenu": "We've been very pleased and impressed with the personal service from Kim, Taylor and Frank... it's a great system with great people! Thanks, Joe"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emani's LLC",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T18:30:19.000Z",
          "Titre": "Amazing",
          "Contenu": "I absolutely love Frank and Unitel Voice. They made this process sooooo easy. They offer so many features and they explained everything in detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Berman",
          "Nb_Reviews": 2,
          "Date": "2019-10-09T00:08:28.000Z",
          "Titre": "I am so impressed with your team",
          "Contenu": "I am so impressed with your teamSpecifically diane and KristennI tried to get grasshopper to move my linesThey didn't Your team held my hand Spoke directly w grasshopper It still took another call to them Your team got on this and in less thsn 4 hrs had me up and running This was over 45 daysUnitel stated with me the entire wayNot pointing fingersJust solving the issues Kudos"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 4,
          "Date": "2021-02-16T00:12:19.000Z",
          "Titre": "BEST Decision Ever!!",
          "Contenu": "I am a marketer so I know about good customer service... BUT, I don't know anything about setting up a phone system!I did research online and read reviews. In fact, some of the reviews on this Trustpilot page helped me make up my mind to go with UniTel Voice.I watched the videos and was able to pause the video and follow instructions for set-up - EASY! After set-up I tested and had some additional things I wanted to fix. I was able to find answers in their easy-to-navigate \"Help Desk\" page.Then I still had a few questions so sent some questions to their support email... I was shocked to get a phone call from an actual person who thought it might be faster to help me over the phone - it was!! With my permission, he was  even able to make some small changes with my permission - again - EASY :).I am just starting out with one employee - me - but can see that I will be able to grow with this phone system and am very happy with my decision!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ikuku global",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T00:29:00.000Z",
          "Titre": "Frank is star",
          "Contenu": "Frank assisted me in setting up my phone number today and i had the best experience ever. I highly recommend this company"
        }
      ]
    }
  ]
}