{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "vagaro.com",
      "Review": [
        {
          "Note": 1,
          "Pseudo": "Alan Coates",
          "Nb_Reviews": 5,
          "Date": "2023-12-26T20:20:00.000Z",
          "Titre": "stay away",
          "Contenu": "My mistake not concentrating, got signed up by mistake. Will report as scam  STAY AWAY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonimous",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T23:08:51.000Z",
          "Titre": "I booked an hair appointment through…",
          "Contenu": "I booked an hair appointment through Vagaro and the hair saloon was permanently shut down. As I called Vagaro, they told me that they manage only the platform and there is nothing they can do to give me $225 dollars back that the hair saloon charged upfront. I will definitely not use anymore Vagaro because it’s not a platform that controls the status of the businesses on their platform as well as doesn’t help its customers to get the money back for scam like the one that happened to me."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Alexander Avdeev",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T04:42:51.000Z",
          "Titre": "NO WAY TO CANCEL",
          "Contenu": "DO NOT SIGN UP — THERE'S NO WAY TO CANCEL UNLESS YOU HAVE A CALL WITH THEIR BOSS AND THEY WILL CHARGE YOU ANYWAY. This company is trying to hide behind some made-up GDPR compliancy and actually BLATANTLY LYING and trying to cover up their unethical business practice. Their account specialist will misinform you and try to make you have a call, which probably will never happen (and why should it?)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 19,
          "Date": "2023-10-17T20:36:14.000Z",
          "Titre": "They are easy to contact while selling…",
          "Contenu": "They are easy to contact while selling it to you and them they will ghost you as soon as they have your payment information. This has been terrible customer service and I would give zero stars if I could. No one cares and no one is there to help."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jackie",
          "Nb_Reviews": 2,
          "Date": "2021-12-17T18:09:22.000Z",
          "Titre": "Run from Vagaro!",
          "Contenu": "Stay far away from this booking software. I am now trapped with them as they make the transfer process nearly impossible in order to begin using a new service. I don't even know where to start, they nickle and dime you to death for fundamental add-ons like COVID Forms, Intake Forms. They charge $40 a month (you read that right) to run and automated transfer to your Quickbooks software. Their customer service is often snarky and unhelpful, sometimes just not responding to email inquiries at all. Their payment processing platform is unorganized and antiquated. Don't make the mistake I did, go with Acuity or Square appointments instead."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T05:41:13.000Z",
          "Titre": "Don’t make the same mistake I did…",
          "Contenu": "Awful company, appalling customer service. I purchased a $140 payment terminal from them which died in a year (we are a tiny business and aren’t hard on the device). It took over a month to try to work through the issue and in the end they wouldn’t repair or replace and told me I had to buy a new one. They also make it impossible to transfer your client info out of the platform so it’s incredibly difficult to transfer to a new platform. I dislike them so much I’m willing to do that to not have to use this overpriced booking platform. Don’t make the mistake I did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Temples",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T23:44:12.000Z",
          "Titre": "Stay away, money hungry",
          "Contenu": "I am in the process of finding a hair salon software for my business.I signed up for a free trial with Vagaro using my personal email address so I can try it out before considering it as an option. When I thought \"huh, I can consider it an option, but I need to talk to a sales person to ask more questions\", I booked a Demo call, using my business' email address. I talked to a guy named Gerardo. At the end of the call, he asked me if I wanted to do a trial, and I said that I had started one but hadn't gotten a chance to use it. This is when things got weird and negative... Gerardo said that he needed to talk to support to figure out how to move forward, as I already had a trial on my personal email account. Then he reached back to me and said that I had to sign up for a new trial using the link he will send me (with his name on it). I was going to do that, but I needed to first make sure to cancel the trial I had started on my personal email address. Turns out that when Gerardo talked to support, they blocked my login privileges to the account I had started a trial on, as I couldn't login or reset my password. I thought \"Maybe Gerardo closed that account for me\", so I went ahead and sent Gerardo 2 follow up emails to confirm that my previous account was closed and the trial was effectively cancelled. He never replied.. Completely ghosted. For no reason. Maybe he left the company? Maybe he was fired? No idea... But then, to my surprise, I was charged one month of membership last Friday. How infuriating, not only I had already spent my time trying to login to this account multiple times and following up twice with Gerardo, but I had to now deal with them to refund the charges... So, after spending more of my time on calls and emails, they said that they won't refund anything. I don't even care about the $90 at this point, I just care about the morality of the entire situation. How in the world would I actually consider their software if this is how they treat potential customers?I could never recommend Vagaro :("
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Soaring Chris",
          "Nb_Reviews": 3,
          "Date": "2021-12-23T02:47:26.000Z",
          "Titre": "Appaling Service.",
          "Contenu": "Appaling Service.Taken payment for subscription to a buggy service, when i cancelled the subscription, they lock your account despite you prepaid for a month, and then send an email that there will be no refund .. Basically service not rendered. Just plain out fraud."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Yasmin El-Chgar",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T12:50:39.000Z",
          "Titre": "I signed up to 2 days ago",
          "Contenu": "I signed up to 2 days ago. After 15 minutes, I called to cancel my prescription. They did not refund me the £30 which is very unusual using it for 15 minutes just to see what they offered me. Do you not use this company?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kerry Keys",
          "Nb_Reviews": 8,
          "Date": "2022-12-26T01:32:43.000Z",
          "Titre": "Awful company",
          "Contenu": "Awful company. They keep taking money from my account, despite me asking them several times to cancel it. AVOID!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Cohen",
          "Nb_Reviews": 14,
          "Date": "2022-07-03T18:10:52.000Z",
          "Titre": "Not happy with this service at all",
          "Contenu": "Not happy with this service at all. When you are pre-client stage, they will do everything they can to make the sale. Once you are a client, suddenly the same things they did for you in the past becomes \"not possible\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michele Brickner",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T14:13:34.000Z",
          "Titre": "Seems like a good platform at first",
          "Contenu": "Seems like a good platform at first. It's not! They lure you in with the credit card reader, which they then charge you for if you cancel before a year!! They should make a better platform, so that I won't want to cancel. Everything is an add on and it's BS."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Carla",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T23:44:14.000Z",
          "Titre": "if i hear another 'your hair salon is…",
          "Contenu": "if i hear another 'your hair salon is slaying' spotify advert I might just combust"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle Cornelius",
          "Nb_Reviews": 3,
          "Date": "2022-06-08T05:57:19.000Z",
          "Titre": "Bad service",
          "Contenu": "Bad service. Buggy. Not exactly what they sell. Nickel and dime you over every little thing. Bad vibes."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T22:21:53.000Z",
          "Titre": "Crappy payment service doesn't work"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenna Vitale",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:09:55.000Z",
          "Titre": "Rectified Issue After doing bad business",
          "Contenu": "****UPDATE: After 5 days since the incident, I received a refund in my account for the charge.  The company did in fact rectify the issue. I am still rating them 3 stars due to their customer service not being positive and solution based from the start. Original: STAY FAR AWAY!!!!!!  This is a company with ZERO morals or humanity.  We run a non-profit organization that provides mental healthcare to homeless youth.  We had a free trial for 30 days- because of how difficult it is to navigate their site- i was 1 day late to cancel the free trial.  Because of this, I was charged the monthly rate.  When I contacted support and told them we will absolutely NOT being using their software, they told me they cannot refund the charge.  So basically they are charging me for a whole month that im not using- and even worse charging a community service based organization for something that we will not use.A total money hungry company with no ethics!They have a one size fits all and horrible customer service.. STAY AWAY!!! they dont care about people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T05:01:22.000Z",
          "Titre": "Handy to access/schedule my clients",
          "Contenu": "I find it very handy to access my client list, develop my services and send mass text, I would like more webpage options, but it works for what it is. I also appreciate getting new clients from this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea Idelson",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T15:49:03.000Z",
          "Titre": "very easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Reagle",
          "Nb_Reviews": 1,
          "Date": "2024-01-03T01:32:04.000Z",
          "Titre": "IT'S A 10/10!!",
          "Contenu": "I couldn't be happier to have used Vagaro for ALL of my business needs. When I mean all, I mean POS, scheduling, email marketing, Intake forms, SOAP note forms, you name it! Plus, they have an option for \"Daily Deals\" which has helped spread the word to NEW and existing customers. PLUS, their customer service is spot-on and efficient. THANK YOU VAGARO!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "peachy keen waxing studio",
          "Nb_Reviews": 1,
          "Date": "2023-12-27T23:21:45.000Z",
          "Titre": "The video tutorials provided have been…",
          "Contenu": "The video tutorials provided have been a big help for setting up my business profile. Over all, the site is easy to navigate, clean, and user friendly (especially for someone like me who is not the best with technology). The client portal is easy to use as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camille Scott",
          "Nb_Reviews": 1,
          "Date": "2024-01-03T04:07:31.000Z",
          "Titre": "Tailored Experience!",
          "Contenu": "I love the tailored experience Vagaro offers to make it fit my business. It's user friendly and beautifully presented to potential clients/customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miranda",
          "Nb_Reviews": 3,
          "Date": "2023-12-26T02:42:31.000Z",
          "Titre": "using it 7 years still love it",
          "Contenu": "We have been using vagaro for over 7 years and we love the easy / stylist friendly / practical way it is set up. Our clients love the text reminders and all the features it offers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan Tipton",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T23:56:29.000Z",
          "Titre": "Starting my own business",
          "Contenu": "Starting my own business, vagaro has been very helpful. I especially like that you can create your own website through them and it will automatically sync with info on vagaro. the other features they offer are super helpful as well, like the forms, daily deals, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edith",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:32:09.000Z",
          "Titre": "We used Insight before and it was so…",
          "Contenu": "We used Insight before and it was so limited .Vagaro really help my business to have thing going in the right way.Storing credit card on file have completely eliminated no shows or last minute cancellations.about 4 guest had a problem with that option, which showed us that they don't give our business same respect as we are giving them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cshisa Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-27T23:19:24.000Z",
          "Titre": "I love Vagaro",
          "Contenu": "I love Vagaro. Vagaro has helped me book clients easily. I love how affordable it is to new business owners.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Blake",
          "Nb_Reviews": 1,
          "Date": "2023-12-25T21:56:05.000Z",
          "Titre": "GREAT tool and user friendly",
          "Contenu": "GREAT tool and user friendly! Vagaro has multiple add-on that are valuable at a reasonable cost. Has everything you need to run your health based business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iasmine Monzon",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:06:30.000Z",
          "Titre": "Vagaro's customer service is great",
          "Contenu": "Vagaro's customer service is great. They take all the feedback we give them and actually use it to implement and better our experience. I do wish it could be integrated into more softwares, but that means theres room to grow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heidi Schulte",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:12:34.000Z",
          "Titre": "Easy to navigate both on consumer and…",
          "Contenu": "Easy to navigate both on consumer and business side. I love that Vagaro is a well known booking site as well. Many local practitioners use it as well, so it makes for a familiar experience for clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Portillo jr",
          "Nb_Reviews": 1,
          "Date": "2023-12-26T22:48:17.000Z",
          "Titre": "Simple and easy to use and always…",
          "Contenu": "Simple and easy to use and always updating. The support team is to die for never an issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Briana Olsen",
          "Nb_Reviews": 1,
          "Date": "2024-01-02T04:44:25.000Z",
          "Titre": "Brio's Massage Therapy LLC",
          "Contenu": "Great company to use to spread the word of my business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsey Walterscheid",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T18:10:06.000Z",
          "Titre": "Simple. User friendly. GREAT customer service.",
          "Contenu": "Simple. User friendly. GREAT customer service. The ONLY complaint I have is that its fairly slow. I am very happy we started using Vagaro."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Payer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:19:16.000Z",
          "Titre": "It's an all in 1 program…",
          "Contenu": "I really enjoy that Vagaro has all my needs as a salon owner. I highly recommend, very easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:29:09.000Z",
          "Titre": "One Stop Shop for my Spa",
          "Contenu": "This software is easy to configure and easy to navigate.   Customer service is amazing.  They are always eager to assist."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mikayla Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:43:05.000Z",
          "Titre": "So far i am really really enjoying all…",
          "Contenu": "So far i am really really enjoying all the added feature for booking appointment and how you can set individual prices for each employee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-12-23T20:12:08.000Z",
          "Titre": "Easy to use",
          "Contenu": "Vagaro is easy to use. Payments are always on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evelyn S",
          "Nb_Reviews": 1,
          "Date": "2023-12-23T19:36:22.000Z",
          "Titre": "Vagaro meets all of my needs and then…",
          "Contenu": "Vagaro meets all of my needs and then some.  And for a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla Arroyo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:35:54.000Z",
          "Titre": "very easy to book appointments i can…",
          "Contenu": "very easy to book appointments i can have everything in one place love it :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordyn Alaniz",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:42:33.000Z",
          "Titre": "Love vagaro!",
          "Contenu": "I love using vagaro. It is simple, user-friendly, but it does all of the things you need it to do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:08:15.000Z",
          "Titre": "The back office is awesome easy to…",
          "Contenu": "The back office is awesome easy to navigate and simple to understand. Customer service is exceptional, ontime and very informative."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "US Salon",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:47:57.000Z",
          "Titre": "Love Vagaro Software",
          "Contenu": "Nice app, i like the way Vagaro is working. Every salon should have Vagaro."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "yvonne and thanks for your order",
          "Nb_Reviews": 6,
          "Date": "2022-04-28T10:48:30.386Z",
          "Titre": "5 STAR CUSTOMER SERVICE",
          "Contenu": "Having read the negative reviews I have to say that the service I have received is brilliant.  I am a small business and struggle with IT , the team have talked me through on the phone on how to use the booking app and always at the end of a phone if I need them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Master Glow Med Spa",
          "Nb_Reviews": 1,
          "Date": "2023-12-26T21:12:27.000Z",
          "Titre": "I love Vagaro",
          "Contenu": "I love VagaroIts very cool"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Abi",
          "Nb_Reviews": 15,
          "Date": "2023-08-31T11:27:48.000Z",
          "Titre": "Fantastic value for money",
          "Contenu": "I tried Vagaro for my salon and I must say I am so impressed with the functionalities and support I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlene Perkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:30:31.000Z",
          "Titre": "Simplicity",
          "Contenu": "Very accurate information and easy to navigate!"
        }
      ]
    }
  ]
}