{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "vaporbrothers.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian A",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T23:10:16.000Z",
          "Titre": "Bought the vaporbrothers original…",
          "Contenu": "Bought the vaporbrothers original desktop vaporizer. Half the time it just burns your flower. It's a piece of garbage for almost $300. Wouldn't ever recommend this product to anyone. False advertising on their website says it works well for flower vaporizing. I hate it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marne Bass",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T04:25:51.000Z",
          "Titre": "My issue is with the EXORBITANT price",
          "Contenu": "My issue is with the EXORBITANT price. These things used to be under 20$, I used to buy them at the headshop for $6. What a ripoff, but that was probably your intent from the beginning. Greedy d**ks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Andel",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T14:38:23.000Z",
          "Titre": "Vaporizer clogged on 3rd pull and…",
          "Contenu": "Vaporizer clogged on 3rd pull and continues to clog over and over and over again.  This is with rough grind weed.  I will never purchase this again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Kolpacki",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T22:51:48.000Z",
          "Titre": "We have always received quality…",
          "Contenu": "We have always received quality products from this company.  Our last order had to products with wires hanging out of the bottom of the devices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LEE BONNER",
          "Nb_Reviews": 2,
          "Date": "2020-06-26T21:03:51.000Z",
          "Titre": "Good response to question"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Andrew Mosher",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T16:36:55.000Z",
          "Titre": "Bought the Pen",
          "Contenu": "Bought the Pen. Came with charging cable that didn't fit the mini-usb port.  Frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "t-dub",
          "Nb_Reviews": 6,
          "Date": "2022-12-04T15:32:59.000Z",
          "Titre": "I spent $800.00 to buy a VB2 Multiconverter ...",
          "Contenu": "I spent $800.00 to buy a VB2 Multiconverter for concentrates. This was upgraded after a failure to a VB2.5 which had a different medical grade heater.  When that failed I mailed it in for a circuit board short circuit repair and never got it back again.  Seems Linus just closed up shop.  He told me he couldn't get an engineer to fix it.  Well whatever, I'm still out a VERY expensive vape.  It was fun while it lasted though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicholas Jaiser",
          "Nb_Reviews": 2,
          "Date": "2020-06-19T20:09:20.000Z",
          "Titre": "Toxic plastic INSIDE of the bowl?! Super Lame",
          "Contenu": "The unit arrived with a dent on the front of the wood.Most disappointing...is that the \"glass\" and \"ceramic\" bowl has cheap, toxic plastic right in the middle!? Looked like it was part of the ceramic bowl in the pictures. The description doesn't even mention that there is toxic plastic INSIDE the bowl which comes into contact with the heat! Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T18:24:49.000Z",
          "Titre": "I am an avid vaper...",
          "Contenu": "I am an avid vaper and was replacing my Silver Surfer.   I don’t find the Vapor Brothers unit as user friendly and easy to use.  I purchased the hand held model.Compared to the Silver Surfer I give it a C-.  I should have gotten another Silver Surfer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robinson Alan",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T15:38:22.000Z",
          "Titre": "I had an ordinary experience with…",
          "Contenu": "I had an ordinary experience with vaporbrothers.com overall. It was almost good, but could have been better. They offered a decent selection of products, and the prices werent too bad. However, the order proccess was a bit disapointing. My order came in two days later than the promised delivery date. The customer service was ok, so at least they responded to my complaint. I'd give them 3 stars for the overall experience though, nothign specail, just average."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Rothaus",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T18:46:03.000Z",
          "Titre": "ordered a round bowl that gathers the…vapor and rcvd. an oblong one",
          "Contenu": "ordered a round boel that gathers the vapor and rcvd an oblong one.very long time for return.  excuse was   they do not go to mailbox every day .  and the return time was much too long. my return to you was by ups$!(9).  your return to me ws us post office and delayed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric S",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T05:11:44.000Z",
          "Titre": "Pony up for extra screens",
          "Contenu": "I’ve had my Vape Box about 5 years now, and it’s the only thing I’ll smoke out of. I recently replaced the whip for about $45. I expected to get one identical to the whip it came with, and it was for the most part, however the screen was very light and easy to push through. During the first week of use, I had to remove the hose to set it back into place after accidentally pushing it through. Which isn’t easy to do—lots of twisting and pulling required. I went to discard the burnt remains, and the screen must’ve fallen in the trash with it. In retrospect, I should paid the $4 for the extra screens. On one hand, I appreciate how the screens can be changed out with ease (they get dirty), on the other, it is way too easy to push it through. Hope they’re able to resolve this, until then, just buy extra screens."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bradford Chinn",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T16:26:44.000Z",
          "Titre": "Keep trying. Still waiting",
          "Contenu": "Let's see...first they send me ceramic whips instead of glass.  Then couldn't figure out how to fix it.  Finally got glass bowls but still don't have my glass handles, although I returned the wrong ones.   Love the product but they messed up good this time"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Eliah Halpenny",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T03:15:10.000Z",
          "Titre": "You have reduced the size of the glass…",
          "Contenu": "You have reduced the size of the glass attachment, the main piece and the price is $34!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thai",
          "Nb_Reviews": 5,
          "Date": "2020-06-19T18:38:35.000Z",
          "Titre": "You NEVER answer the phones and then…",
          "Contenu": "You NEVER answer the phones and then return calls at an odd times so that i never get to talk to anybody about what i need. I have been a devoted customer since 2012. I need a new bowl and have never seen it available on the site. It's the one that came with my unit. Don't want to order it to find it doesn't fit and can't get any one to tell me....... WTH???? Have points, I think, but can't talk to a live person to understand how I can utilize them. ONLY the fact that I love this vaporizer has kept me a customer. I order hoses and connectors every year for the last eight years or so."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carter Smith",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T16:41:19.000Z",
          "Titre": "I love vapor bros",
          "Contenu": "I love vapor bros. Products are always the best and everyone loves them. But when I buy an extra whip and pay more for the fancy silicone hose and you just don’t give me any hose? INCOMPETENT HORSE CRAP"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ro Do",
          "Nb_Reviews": 3,
          "Date": "2020-08-01T18:58:48.000Z",
          "Titre": "Kind of slow with shipping"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARDELL SARKELA",
          "Nb_Reviews": 3,
          "Date": "2020-08-10T20:04:29.000Z",
          "Titre": "All good but price"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leonard",
          "Nb_Reviews": 2,
          "Date": "2020-06-19T20:20:06.000Z",
          "Titre": "Average",
          "Contenu": "The unit works ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Delaplane",
          "Nb_Reviews": 6,
          "Date": "2023-03-14T19:40:32.000Z",
          "Titre": "Ordered new ceramic mouthpiece",
          "Contenu": "Ordered new ceramic mouthpiece. Shipped promptly and received in tact.  I thought shipping was a little expensive for sending just a ceramic mouthpiece ($5.99 for a small piece that weighs about an ounce)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margi",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T15:54:43.000Z",
          "Titre": "I would order again from Vape Brothers.",
          "Contenu": "The kit I ordered was incomplete as it was missing a whip handle so I called the company and they not only sent me what I was missing but they replaced a piece of the kit that had come with a hairline fracture . Both arrived within days. I am satisfied with the purchase I made and the customer service was good. I would order from Vape Brothers again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles M",
          "Nb_Reviews": 5,
          "Date": "2022-10-18T06:36:31.000Z",
          "Titre": "We love your vaporizer",
          "Contenu": "We love your vaporizer. I have been partaking of the herb for close to 70 years and this is one of my best experiences  Hope to do it for many more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norman Weild",
          "Nb_Reviews": 5,
          "Date": "2021-11-08T18:01:47.000Z",
          "Titre": "Very good product and good service",
          "Contenu": "Very good product and good service, my vaporizer arrived quickly and well packaged, the product is the best."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Brandt",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T15:16:33.000Z",
          "Titre": "Vapor Brothers home unit",
          "Contenu": "Hi there  I was not impressed with my new unit.  It takes a while to heat up and I couldn’t get hardly any vape out of it.  Thanks to Google I realized that I could adjust the unit.  All I can say now it works great. Great Flavor and a nice amount of vape.  So it Works Fine.  Vape Away!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "private customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T17:40:14.000Z",
          "Titre": "they always respond----good…",
          "Contenu": "they always respond----good natured----good product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LINDA LANGMAN",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T15:54:13.000Z",
          "Titre": "I traded I in my old unit for a 40%…",
          "Contenu": "I traded I in my old unit for a 40% discount on a new one! I love it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 4,
          "Date": "2020-06-27T12:58:38.000Z",
          "Titre": "Enjoying after all these years.",
          "Contenu": "I have had my Vaporbrothers vaporizer since 2008, and it has worked tried and true all these years. Vaporbrothers even had a replacement for the mouthpiece which I accidentally broke. The only thing that has been an issue is cleaning the whip part. There really isn't any way to do it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Rider",
          "Nb_Reviews": 1,
          "Date": "2020-11-26T22:24:33.000Z",
          "Titre": "I have had a classic vaporizer with a…",
          "Contenu": "I hhave had a classic vaporizer with a handblown water chamber Vapor Brothers for over 10 years. I broke one of the glass fittings and the service staff found a replacement part that fits my unit. Didn’t rxpect that to be possible.Thank you for making my day!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T16:54:48.000Z",
          "Titre": "Just like new",
          "Contenu": "Just like new. OG glass broke in the move. Little more then I expected to pay but no compromising the quality. Recommend flame/heat resistant oven glove. I've been suprized by the heat high;) or top on the glass after longer operations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheldon",
          "Nb_Reviews": 3,
          "Date": "2021-01-01T22:15:31.000Z",
          "Titre": "Customer service was top notch but...",
          "Contenu": "Customer service was top notch but I feel the quality of the glass whips has decreased. My cat knocked my original vapor brothers hands free whip on the floor and broke it. I've had that whip for at least a decade. The new one just doesn't have the same quality. Glass isn't as thick and the shape of the whip is different. I've learned to use it ok but if it was to fall on the floor I feel this one would break more easily so I'm definitely being more careful with this new one. I've have the hands free whip that can be broken down and cleaned more easily but it doesn't seem to vape as well as the solid glass one. Just my experience."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Salomon",
          "Nb_Reviews": 3,
          "Date": "2020-09-16T06:22:58.000Z",
          "Titre": "nobody is perfect",
          "Contenu": "Hi,Your guys are great, the service is great.  When I asked for advise the response was quick, but not allways clear and on the problem I had. I don't believe in 5 stars because nobody is perfect even not Vapor brothers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. Prince",
          "Nb_Reviews": 2,
          "Date": "2022-02-08T05:27:10.000Z",
          "Titre": "Beautifully Crafted",
          "Contenu": "Great product, beautifully crafted. Highly recommended! Only 4/5 because of order miscommunication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Essex",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T12:22:26.000Z",
          "Titre": "4 Stars for Vapor Brothers",
          "Contenu": "Communication about product was great, product works great, enjoyed stickers I received with shipment as well. Overall great experience, shipping seemed a bit expensive to me though. Cheers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jeffrey marshall",
          "Nb_Reviews": 4,
          "Date": "2021-03-25T13:48:56.000Z",
          "Titre": "Box whip",
          "Contenu": "This is a great product. I've been using them for years. Shipping is a little slow or I would have given it a five."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 1,
          "Date": "2020-08-05T04:07:51.000Z",
          "Titre": "They supply what I need at a reasonable…",
          "Contenu": "They supply what I need at a reasonable price.  A grassroots kind of business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Rendessy",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T16:17:08.000Z",
          "Titre": "I really liked the new wip",
          "Contenu": "I really liked the new wip, but I think the price is to high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2020-12-04T12:13:04.000Z",
          "Titre": "nice folks",
          "Contenu": "nice folks, good products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Lawrence",
          "Nb_Reviews": 3,
          "Date": "2021-09-20T17:37:34.000Z",
          "Titre": "Nice",
          "Contenu": "Nice fast heating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric H.",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T11:48:31.000Z",
          "Titre": "Quick and efficient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Wood",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T18:10:02.000Z",
          "Titre": "Good service",
          "Contenu": "Good product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Gilreath",
          "Nb_Reviews": 6,
          "Date": "2020-06-26T18:50:25.000Z",
          "Titre": "Good job",
          "Contenu": "Good job guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Engwall",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T16:54:34.000Z",
          "Titre": "A simple purchase was easy to make and…",
          "Contenu": "A simple purchase was easy to make and was delivered quickly. What more does anyone want?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Truthmissile",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T13:55:41.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service! Great price, quality, saves money - it’s a product that has improved my life in countless ways. As a decades long customer, Linus and his team have created something special!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Narayan",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T23:18:42.000Z",
          "Titre": "Nice quality glass parts",
          "Contenu": "Nice quality glass water pipe adapters and really nice tubing, both the vinyl and silicone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorraine Roberts",
          "Nb_Reviews": 3,
          "Date": "2023-08-12T03:59:45.000Z",
          "Titre": "I’ve been a customer for a very long…",
          "Contenu": "I’ve been a customer for a very long time. I’ve never been disappointed you ship out quickly your product is always good and your prices are fair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Dahlen",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T00:04:17.000Z",
          "Titre": "Exceptional Service",
          "Contenu": "The quick turn around for my upgrade to the VB-1.5 was appreciated.The call to offer to repaint my box was nice though I preferred the original wear patina for my OG unit.The 1.5 is a cooler vape."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alina Pipe",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T15:18:50.000Z",
          "Titre": "Love this company",
          "Contenu": "Thanks vaporbrothers - I've been using the same hands free vaporizer daily for 15 years now, since about 2008 -  still going strong! Just purchased new ceramic screens, whip and glass mouth piece and the international shipping was still fast and without any issues! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dallas Berry Sr",
          "Nb_Reviews": 3,
          "Date": "2023-07-22T21:09:12.000Z",
          "Titre": "The company has been around for a long…",
          "Contenu": "The company has been around for a long time. I am a long time user of many of VaporBrothers products. Over the years the products I own served me well. Their upgraded products are even better today and they have plans to keep adding to and improving their products. I am well satisfied with VaporBrothers products and can’t wait to see what comes next."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jef newby",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T22:47:14.000Z",
          "Titre": "What a wonderful upgrade",
          "Contenu": "What a wonderful upgrade. It's like having a new vapor box. Couldn't be happier with the upgrade"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick G.",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T19:18:24.000Z",
          "Titre": "Vapor Brothers...The Best...Hands Down.",
          "Contenu": "Vapor Brothers not only makes a Superior vaping product, but they also back it with great customer support.  Friendly, helpful and communicative...everything you want when dealing with a Company.  I've been using a VB box since 2004, with NO complaints, especially once they began using ceramics.  I encourage Everyone who uses Herbs to try the VB box, it will change your world."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dean",
          "Nb_Reviews": 3,
          "Date": "2023-04-16T04:51:48.000Z",
          "Titre": "I had one before that was more durable…",
          "Contenu": "I had one before that was more durable (ceramic and glass in a 2-part system) but this one does the job - just be careful - It's one-piece glass, and inherently more fragile than the old model. 5 out of 5 for performance - just be careful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda S",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T05:34:01.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, fast shipping, great transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Brophy",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T16:12:50.000Z",
          "Titre": "This is the best vaping device I’ve…",
          "Contenu": "This is the best vaping device I’ve ever found and their service is just as good. Orders are shipped promptly and these guys are committed to helping veterans and the less fortunate by refurbishing used vaporizers and giving them away. I’ve been doing business with them for over 15 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T22:08:12.000Z",
          "Titre": "Vapor Brothers are the Gold Standard",
          "Contenu": "We have purchased multiple vaporizers and other equipment over the years.  All VB products have performed as intended and we give them the highest review possible.  Even when vaporizers have lost a little heating power after being on 24/7 for months on end, we have just boxed them up and sent them back to VB to be refurbished and returned to us as good as new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juliano RAW Brotman",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T04:57:25.000Z",
          "Titre": "50 YEAR STONER - I KNOW WHAT UP & IT'S THE WOOD BOX!!!",
          "Contenu": "50 YEAR STONER - THE WOOD BOX HITS BETTER THEN ANYTHING ON THE MARKET...ADD THE CERAMIC WHIP AND THIS IS ALSO THE CLEANESTand because you have these repaired if anything ever goes wrong with them mine has been working for 15 years now straight every day 20 times a day but if anything ever should go wrong they are repairable so they are also the most green"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KJ Price",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:44:55.000Z",
          "Titre": "Customer service excellence",
          "Contenu": "My son’s birthday was coming up and it happened to fall over a holiday and they still sent the product out and it arrived on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Perala Gardiner",
          "Nb_Reviews": 3,
          "Date": "2023-03-05T02:17:34.000Z",
          "Titre": "thank you for maintaining your high standards",
          "Contenu": "I re-read your web site.  Just want to thank you for maintaining your high standards for quality reduction of impact on human health.I wouldn't buy vaporizer products anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keisha Moody",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T14:00:39.000Z",
          "Titre": "Everything you need in this package",
          "Contenu": "I got my new sidekick for dry flower and oils from vaporbrothers todayI read all the instructions and proceeded to have my first experience  with the sidekick l found it really easy to use and it works great!! Very happy  thanks vaporbrothers ☆☆☆☆☆"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Harck",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T12:11:40.000Z",
          "Titre": "Spare Parts",
          "Contenu": "Very long term user, and in spite of the exceptional build quality, I have on occasion needed to purchase parts to return my old school Vapor Brothers device to its original glory. Silly stuff like a new whip and new feet for the box when one fell off and was not recovered. It is so very cool that Vapor Brothers continues to stock these parts and make them available for immediate shipment. Customer for life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orchid",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T04:22:53.000Z",
          "Titre": "Vaporbrothers are the best",
          "Contenu": "Vaporbrothers are the best. I like the old school simple vaporizer best. Their service is exceptional and they don't waste time getting my orders to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrina Hooper",
          "Nb_Reviews": 2,
          "Date": "2022-04-22T06:15:45.825Z",
          "Titre": "Vapor Brothers makes top quality…",
          "Contenu": "Vapor Brothers makes top quality products in a country that now lives in a time of cheaply made temporary things that eventually end up in the trash. They also make products that will most probably keep you from getting lung cancer so you just can't go wrong purchasing your items for your vaporizing needs from this amazing company."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Wawrzyniec Michalski",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T12:06:02.000Z",
          "Titre": "They know how to find approach to clients",
          "Contenu": "Recently I have decided to refuse smoking cigarettes and starting smoking vapes. At least I understand that vapes contain less harmful substances than cigarettes, however they are also bad for people. Anyway, it was my very first step on my long way of getting rid of this awful addiction. I chose this store in order to ask managers which vaporizer would be the most suitable for my needs. They advised me couple of such ones and I believe that I have never met such an attitude from the staff. They were very polite to me and explained everything in details even if they saw that I had no idea about vapes at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessa Rego",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T17:37:19.000Z",
          "Titre": "Everything sent smoothly",
          "Contenu": "Everything sent smoothly, arrived quickly, as ordered. Parts all worked well, good documentation. Easy to determine what I needed online. I've been a happy customer for years.Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 3,
          "Date": "2022-09-05T19:02:22.000Z",
          "Titre": "Everything I get from you guys is…",
          "Contenu": "Everything I get from you guys is first-class.  I just replaced my old hose from the original vaporizer I've used for years with that new silicone hose. It's so much better than the original hose I wish I had bought it sooner.  Not only is it built to take high heat, a common attribute of silicone, but it is much more flexible. It's a pleasure to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan R.",
          "Nb_Reviews": 4,
          "Date": "2022-05-30T23:59:37.000Z",
          "Titre": "An honest review",
          "Contenu": "I've bought several products (including my original vaporizer) from Vapor Brothers, and I can honestly say they are unlike many other companies. Good prices and excellent customer service. Who gives a lifetime warranty in todays  times? I don't write reviews often, but will for a company that I believe in and want to see grow and flourish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PissedConsumer",
          "Nb_Reviews": 3,
          "Date": "2022-07-19T17:57:21.000Z",
          "Titre": "Just picked up a replacement wand for…",
          "Contenu": "Just picked up a replacement wand for the box in the guide shack, supper happy with the shipping and speed, I only wish you still had the wands with worts. MAJOR shout out to my boi Linus for hooking up the stickers!!! Anytime you guys are in Washington let me know. I run the skagit, the sauk, the methow, the Wenatchee, and some rare multidays down the rogue. I also know amazing guys on the Skykomish River. Keep up the amazing work, and we'll keep up the free advertising!"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Thomas Burke",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T03:41:43.000Z",
          "Titre": "This vaporizer is the real deal",
          "Contenu": "This vaporizer is the real deal, the inventor, an engineer, built it to last. I have used them for over ten years, lost one, but never have worn out any despite daily use. Linus the inventor started up himself and still runs the company. No BS just good quality and delivery. Thx to the VB team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T06:02:43.000Z",
          "Titre": "Helpful and personable customer…",
          "Contenu": "Helpful and personable customer service. Shipping and processing were fast even during holidays. Product functions better than expected because it is simpler to use than expected. If their name is on the product, I’d trust that it’s worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Erickson",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T20:43:28.000Z",
          "Titre": "I bought my first VB1 about 15 years…",
          "Contenu": "I bought my first VB1 about 15 years ago and loved it. It lasted many years until I bought my new one and that one works wonderful also. I was so thankfulwhen I explained my health condition VB was helpful in getting me a unit that was refurbished and at a medical discount. My brother has the same genetic condition that I do and wanted one also so I bought him a refurbished unit and he is very thankful and uses it regularly. The kindness and professionalism VB staff showed me was a truly shining example of good people. Thank you so much for your help and support. VB is the best choice in the industry!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aleks",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T22:20:10.000Z",
          "Titre": "Upgraded to a new hands free unit after…",
          "Contenu": "Upgraded to a new hands free unit after years and years of having an OG. I also purchased some extra accessories. Once received the 1st package noticed some stuff was wrong they quickly and easily exchanged all problems.. Excellent service 100% happy and would buy again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asha",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T17:46:01.000Z",
          "Titre": "A great",
          "Contenu": "A great, personable company, and the vaporizers work splendidly. My husband had emphysema (successfully healed with Chinese herbs -- check out Wei Institute or your local acupuncture doctor). Vaporbrother's vaporizer enables him to still enjoy smoking marijuana without hacking and stressing his lungs. Wonderful!!! Thank you all!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Long Time Customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T17:05:30.000Z",
          "Titre": "Purchased as a replacement for my…",
          "Contenu": "Purchased as a replacement for my original Vaporbrorhers vaporizer which worked great for aprox. 20 years. Simple to use and maintain.  It just works.  My interaction with Vaporbrothers has always been excellent. Enough said!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C A",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T13:31:09.000Z",
          "Titre": "Great experience!",
          "Contenu": "Package came quickly, was well packed and discreetly labeled. Loving the Sidekick so far, works great, easy to use, versatile, easy to clean (and you can clean the whole vapor path), has a bunch of included accessories, charges quickly and I love that it comes with an extra set of batteries.My one gripe is that the screw holding on the screen seems to have been tightened by the hand of god himself and despite following the instructions and even trying some WD-40 on it, it just will not budge. I can clean it by soaking the whole top lid in alcohol but I'm not sure how I'll be able to replace the screen down the line without replacing the entire lid. But I don't think that's on the seller, and my experience with them has been excellent! Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Harris",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T15:48:56.000Z",
          "Titre": "This is a great company",
          "Contenu": "This is a great company. Best and original box vape. The best skillet cartridges. The customer service is impeccable. I highly recommend this company for all your vaping requirements.😎"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Lou Devling",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T06:23:14.000Z",
          "Titre": "My old vape is new again",
          "Contenu": "My vaporizer is old, but they gladly fixed it, cleaned it, and returned it in a way timely manner! I'm happy about that since I really prefer using my vaporizer- it's much less irritating. Thanks to everyone at Vaporbrothers.com!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George M",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T01:06:18.000Z",
          "Titre": "I absolutely love my vapor bros VB1 I…",
          "Contenu": "I absolutely love my vapor bros VB1 I am a long time lover of this device it’s so amazing, everything about it is awesome!I may have recieved one with a blem though as it wobbles on its little rubber feet …. but besides that it’s the best on the market and always has been !! Mahalo from big island Hawai’i"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E-Dog",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T02:14:02.000Z",
          "Titre": "This is a great company and a…",
          "Contenu": "This is a great company and a phenomenal American-made product that really makes a difference in your health. You will stop coughing up brown phlegm. Because I primarily vape with the VB-1 instead of smoking, I am still able to run long distances (5-6 miles) without getting winded, despite being in my later 40s. My first VB-1 lasted through 15 years of daily use...as in, leaving it on for 12 hours every day. About a decade in, I needed to order a replacement whip, and it cracked shortly after receipt. I wrote VB and they sent me a new whip free of charge. This kind of customer service turned me into a loyalist. I just ordered my second VB-1 and it works like a charm."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Californian",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T23:39:39.000Z",
          "Titre": "Excellent Product!",
          "Contenu": "We were able to find out everything in detail on your website, and placing the order was easy and painless. We had previously had a very old Vaporbrothers double barrel, so we were very familiar with your brand. We also appreciate that orders are customizable, and that extra parts can be ordered separately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellis Siegal",
          "Nb_Reviews": 3,
          "Date": "2023-01-10T03:02:01.000Z",
          "Titre": "I have purchased from Vapor Bros",
          "Contenu": "I have purchased from Vapor Bros. many times, the website is excellent, and easy to place an order. I especially like that you can ask for a priority shipment.I am a former resident of Anaheim and know Gardena well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Delaplane",
          "Nb_Reviews": 6,
          "Date": "2022-02-26T12:35:17.000Z",
          "Titre": "Great product",
          "Contenu": "Called with questions when placing my order.  Service person was very polite and helpful.  Items arrived in only a few days.  From order placement to delivery it was a totally positive experience.  Used the new VB 1 now for a week and love it.  Excellent quality on all items.  We are in Florida now for the winter, but I plan to order another VB 1 when we return north to keep there.  Great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd N",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T21:26:10.000Z",
          "Titre": "The best customer experience ever",
          "Contenu": "I decided to buy a Vaporbrothers VB1 based on a friend’s recommendation. I knew very little about herb vaporizers and submitted questions by email and text message. My text message was answered in about 10 minutes—at around 10:45pm. I got an email response the next morning and I worked with the same person to get an order placed. I received my VB and still had questions. I called the helpline and was actually referred to an advisor who, if I understood correctly, is a superfan offering volunteer support. In short, my experience with Vaporbothers has been outstanding and second to no other customer service experience. I wholeheartedly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim L.",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T19:32:41.000Z",
          "Titre": "Absolutely awesome.",
          "Contenu": "Easily one of the best customer service experiences I've had. I had questions about some of the glassware they sell, and their team was incredibly friendly and responsive. Shipping was fast and hassle-free. Thanks again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisabeth W.",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T19:09:02.000Z",
          "Titre": "I LOVE Vaporbrothers!",
          "Contenu": "I LOVE Vaporbrothers!! I bought my first one 14 years ago. It survived daily use, moving six times, and being dropped twice. I just took advantage of the trade in policy for a new one. (So kind. Love that, thanks!!) The couple days waiting for delivery - I missed my VB so much! This time I got the orange box & hands free whip. I LOVE IT! Not only is the box cool looking, it is the greatest vape around. The airflow is awesome- unmatchable. Ahh… no smoke. Just dense, great tasting, medicinal vapor. Thanks for making such an amazing product. Thanks for rewarding customer loyalty, donating vapes to those in need and being such kind, hard working, fun group of people. Vaporbrothers rule!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SL",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T04:20:21.000Z",
          "Titre": "Great experience all around",
          "Contenu": "Great experience all around:- helpful videos to understand the different VB-1 options- straightforward checkout- clear expectation of estimated delivery time- email with link to USPS tracking- shipment arrived on time- proper packaging, arrived complete and undamaged- very clear setup instructions- everything worked, first experience was as expected- used accrued points to order a free item, awesome bonus :)- still working great, use daily"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bing's Buddery",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T17:32:44.000Z",
          "Titre": "Fantastic service and products!",
          "Contenu": "I needed some parts to help get my VB1 going again, and Linus and the team at VB were over the top kind and helpful.. I highly recommend this company both in terms of products and customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T02:29:23.000Z",
          "Titre": "Thanks for fulfilling our order…",
          "Contenu": "Thanks for fulfilling our order promptly! Everything arrived as described, and we appreciate the extra screens provided to replace the couple that were damaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T23:23:28.000Z",
          "Titre": "Fast shipping and great communications",
          "Contenu": "Fast shipping and great communications. I had the vaporizer within three days of placing my order. Packaging was excellent and everything was exactly as ordered. I have been using their vaporizer since 2005 and would highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristopher Gasparo",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T08:01:01.000Z",
          "Titre": "Whip adapter guru.",
          "Contenu": "I needed a adapter for my whip because I got new equipment, and the woman on the phone figured out the exact piece I needed, and it was to my door in just a few days. There’s a reason I have supported Vapor Brother’s since 2001, they are still the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theophilos Theophilou",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:35:26.000Z",
          "Titre": "I think Andrés did an excellent job…",
          "Contenu": "I think Andrés did an excellent job assisting me. He answered all my questions and gave me a lot of help for my order which I recently received. He also helped me get a discount with the points I had earned and helped me decide what to get on my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Rosa",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T03:40:31.000Z",
          "Titre": "All the puff you want or need",
          "Contenu": "I am very pleased with this purchase. I get all the flavor with zero combustion. It arrived way sooner than I thought it would and it's been plug and puff from the moment it arrived. Customer service unparalleled!  I highly recommend this for anyone who has trouble smoking without coughing out a lung like me. It's hot enough to know you're smoking but not so hot your lungs cry out. Perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lcubed",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T16:30:34.000Z",
          "Titre": "Great Customer Support!",
          "Contenu": "The staff at Vapor Brothers was available and went out of their way to help answer a newbie's questions via email and over the phone.I also like knowing the unit is made from quality, safe materials."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Chase",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T17:11:37.000Z",
          "Titre": "Long time fan",
          "Contenu": "This was a simple order for 2 vaporizer whips - the soft silicone ones. They arrived quickly. I have been dealing with Vaporbrothers for more than 10 years. They are always friendly and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Turbo Shields",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T09:56:38.000Z",
          "Titre": "Got the torch 2.0 and now waiting on…",
          "Contenu": "Got the torch 2.0 and now waiting on glow to come in stock to review also this is dabsquad nation on Facebook showing major love hope we can get the glow soon and keep the word going fam"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam S",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T06:35:46.000Z",
          "Titre": "I have had my box since 2006 box #81708…",
          "Contenu": "I have had my box since 2006 box #81708 Still going strong today. Thank you for the most amazing product from any industry let alone the cannabis industry. In a world full of fly by night gimmick products my BV1 is still a highly respected unit among those that know."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Staci",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T15:56:41.000Z",
          "Titre": "First time user and needed assistance",
          "Contenu": "First time user and needed assistance. The customer service was quick and super helpful! They educated me and took the time to make sure my experience was hasslefree. Great customer service and product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk Gissing",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T16:36:18.000Z",
          "Titre": "excellent",
          "Contenu": "It could not have been any better, smooth and expeditious."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Mixon",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T12:02:12.000Z",
          "Titre": "I’ve been a Vapor Bros",
          "Contenu": "I’ve been a Vapor Bros. customer for over 10 years. Each time I need replacement parts for my unit, I’ve been helped to make sure I get the correct parts. This last order, I made a mistake ordering parts and I received a message that my order did not match what I had ordered in the past. If not for the  help I got, I would have been sent the wrong parts. These guys are the epitome of superior service!Thanks for your attention to detail I highly recommend Vapor Bros. Sincerely,Tim Mixon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T01:38:05.000Z",
          "Titre": "I've done business with Vapor Brothers…",
          "Contenu": "I've done business with Vapor Brothers for close to 20 years.  The products are made well and they're constantly improving desktop vape units via accessories (that are also made well).  Once I even sent in a desktop yet for a warranty repair and it was a very smooth process.  Great company in my book!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aseel Maher",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T15:00:07.000Z",
          "Titre": "I recently purchased a vaporizer from…",
          "Contenu": "I recently purchased a vaporizer from VaporBrothers and I am extremely impressed with the quality of their products and their customer service. The vaporizer itself is very well-built and easy to use, and the vapor it produces is incredibly smooth and flavorful. They also went above and beyond to answer my questions and ensure that I was satisfied with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri Hudson Connor",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T16:32:01.000Z",
          "Titre": "My box of 8 years broke down a few…",
          "Contenu": "My box of 8 years broke down a few weeks ago. It was well loved. I had trouble figuring out how to get it fixed. Vaporbrothers helped me the whole way!!! Great personal service!! I got it repaired and back in record time and it’s up and running great!! Love my vape box and love this company. I highly recommend Vaporbrothers!! Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T07:37:40.000Z",
          "Titre": "Always quick and reliable to boot",
          "Contenu": "Always quick and reliable to boot. I first purchased from them over a decade ago and it still works great. Just needed to stock up on whip tubes and filters. Amazing craftsmanship."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SEA",
          "Nb_Reviews": 3,
          "Date": "2022-04-05T01:06:25.000Z",
          "Titre": "Wish I Hadn't Waited So Long to Get One!",
          "Contenu": "I had been exposed to the original box vapor for years and finally decided to get one. It's just so smooth! Super easy to set up and use and couldn't ask for better customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Young",
          "Nb_Reviews": 2,
          "Date": "2022-02-07T21:55:12.000Z",
          "Titre": "Great shopping experience and awesome customer service…",
          "Contenu": "Great shopping experience and awesome customer service. When a problem with one of the items came up, customer service contacted me promptly with a solution for my problem and quickly shipped my items. Would definitely buy from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keisha Moody",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T13:08:28.000Z",
          "Titre": "A better way",
          "Contenu": "When I decided quit smoking for my health Vapor Brothers gave me what I needed it not only greatly improved my health it raised the bar of my whole experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Russell",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T19:05:50.000Z",
          "Titre": "Super customer service",
          "Contenu": "Super customer service! We were cared for personally and had great communication all the way through! Thank you VB! We will return again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Shaffer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T08:13:33.000Z",
          "Titre": "Vapor Brothers are reliable",
          "Contenu": "Vapor Brothers are reliable and make quality gear for the season consumer.When I made a mistake on my order they fixed it no problem."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Eva David",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T04:09:51.000Z",
          "Titre": "One of very few companies I can always trust",
          "Contenu": "I have yet to try my new product because I want to keep it unused for international travel. However, before I purchased it, I reached out to customer service with a question. They reached out to the designers of the product looking for an answer and came back to me with one. That was all I needed to know to buy it. I received it very promptly! I trust the research they do into products before offering them on their site. I have been so satisfied with my OG vaporizer from them, and got loved ones into them too. It is good to have companies that really care about offering the best products for their users. It's cool to know they have as much love for the practice as I do, and they're looking out for us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Proctor",
          "Nb_Reviews": 2,
          "Date": "2022-03-20T06:56:08.000Z",
          "Titre": "Pleased Vaporbrothers Customer for over Eight Years",
          "Contenu": "Excellent packing and timely shipping of product as advertised and expected at end usage.  Ordering is graphically descriptive and easy to see each product.  My experience with customer service includes personal follow up from an owner and is among the best.  I'm pleased to be a Vaporbrothers customer for over eight years for all VB1 product and supplies."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "tyrellx86",
          "Nb_Reviews": 2,
          "Date": "2022-04-20T13:40:00.042Z",
          "Titre": "All good!",
          "Contenu": "Very kind and courteous support, quick replies, quick delivery. Can totally recommend :) Vaporbrothers VB1 still running strong after 2 years of heavy usage!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Engwall",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T15:40:26.000Z",
          "Titre": "I needed a small part of my vapor whip…",
          "Contenu": "I needed a small part of my vapor whip and ordered it from Bapor Bros. online. I got a confirmation of the order, it was shipped the next day and I received it as promised. Yes, that’s the way things are supposed to work, but post-Covid things are rarely as they should be. This order was a relief."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Debilzan",
          "Nb_Reviews": 6,
          "Date": "2022-10-21T04:58:33.000Z",
          "Titre": "3rd vaporizer in 16 years",
          "Contenu": "3rd vaporizer in 16 years. I love this product. the quality is amazing, my last vape lasted 11 years( and I vape everyday, all day.). I can't stand burning bud anymore, These are the best vapes out there. I try to get my friends to buy also. Great instructions and accessories too. Please stay in business and I'll buy from you till death do us part. Thanks again. My lungs thank you too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Enos Jr",
          "Nb_Reviews": 5,
          "Date": "2022-11-15T15:44:06.000Z",
          "Titre": "Desktop Vape with the EZ whip combo!",
          "Contenu": "Top quality products that perform better then any other I have tried. I have been using the desktop version for over 10 years and very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thai",
          "Nb_Reviews": 5,
          "Date": "2022-09-23T21:43:19.000Z",
          "Titre": "I have been a customer 12 years",
          "Contenu": "I have been a customer 12 years. They are always wonderful and helpful and I have a vapor bros box that has been on 24/7 since 2013. Literally never shuts off. I love it. Gave my first box to my best friends son who had cancer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Pollock",
          "Nb_Reviews": 4,
          "Date": "2022-10-22T08:05:06.000Z",
          "Titre": "Vaporbrothers has the best products and…",
          "Contenu": "Vaporbrothers has the best products and the best customer service! I recently purchased the Sidekick and I absolutely love it!! Will never buy from anyone else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T20:02:38.000Z",
          "Titre": "Great quality parts and helpful…",
          "Contenu": "Great quality parts and helpful customer service. Still the best vaporizer, have been using it for over a decade and no other brand is as reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elsewhere",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T23:08:07.000Z",
          "Titre": "The classic VB1 vaporizer is hands down the best vaporizer I’ve tried.",
          "Contenu": "Vapor Brothers are always very helpful and responsive when asking questions.  The classic VB1 vaporizer is hands down the best vaporizer I’ve tried."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tayla Allen",
          "Nb_Reviews": 4,
          "Date": "2022-04-04T05:03:30.000Z",
          "Titre": "Excellent product representation!",
          "Contenu": "Excellent product representation and above-average customer service make this a terrific company. All of the products worked as expected, and we offer them the best rating possible. Great product that was shipped quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T03:21:55.000Z",
          "Titre": "Easy  to use web site",
          "Contenu": "Easy  to use web site, loved the discount. Arrived when said and was packaged very well. The grinder is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Crosby",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T17:07:49.000Z",
          "Titre": "Best products on the Market",
          "Contenu": "Best products on the Market. I highly recommend any of their products. The box vape is the cleanest, best way to vaporize and once you do it you will never go back to any other way"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Kemp",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T23:24:39.000Z",
          "Titre": "I have had this product for over 15…",
          "Contenu": "I have had this product for over 15 years and it worked great until it didn't. I loved it so much I had to get another. I wish I seen that I could trade the old one in. I got the General's kit. The hydrator/bubbler is the best addition! Also love the ceramic screens."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Skelton",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T18:57:56.000Z",
          "Titre": "Thank you for delivering in a quick…",
          "Contenu": "Thank you for delivering in a quick manner. Everything as ordered and expected. Will continue to do business in the future. Excellent quality product and use experience."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Salomon",
          "Nb_Reviews": 3,
          "Date": "2023-01-23T10:39:38.000Z",
          "Titre": "The quick response from you",
          "Contenu": "The quick response from you, although it all happend at New years evening. Gratis workshop and very efficient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neel Chang",
          "Nb_Reviews": 4,
          "Date": "2022-12-31T10:18:31.000Z",
          "Titre": "Everything works smooth",
          "Contenu": "Everything works smooth, love the green color, bubbler is nice, handsfree feature has a snug feel to it, and the woodwork is nice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Kwolek",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T02:10:09.000Z",
          "Titre": "I initially ordered the wrong product",
          "Contenu": "I initially ordered the wrong product, they were super helpful, canceling the order, and getting me exactly what I needed in a prompt and professional manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T16:34:23.000Z",
          "Titre": "Thank you so much!",
          "Contenu": "Thank you so much!! Vapor Brothers was way better than the knockoff I purchased many years ago :) Exactly what I was looking for! Keep up the good work :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Head",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T12:49:13.000Z",
          "Titre": "Always had great service and hands down…",
          "Contenu": "Always had great service and hands down the absolute best way to partake of the plant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T16:08:48.000Z",
          "Titre": "I have ordered from this company…",
          "Contenu": "I have ordered from this company several times and their products are always high quality and shipped quickly. I am a customer for life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Korie Schmidt",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T19:19:25.000Z",
          "Titre": "Most excellent",
          "Contenu": "The manager / owner showed me the shop when I picked up my purchase. He was really nice friendly and accommodating. Thank you !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara Ward",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T18:24:51.000Z",
          "Titre": "Vapor Brothers is fabulous!",
          "Contenu": "Everyone over at Vapor Brothers is fabulous! Always helpful and a joy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAH",
          "Nb_Reviews": 7,
          "Date": "2022-10-19T18:43:25.000Z",
          "Titre": "Very helpful people Excellent products…",
          "Contenu": "Very helpful people Excellent products quick delivery can’t say anything more positive I will use them all the time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ran Lu",
          "Nb_Reviews": 4,
          "Date": "2023-06-04T12:42:19.000Z",
          "Titre": "I love their service",
          "Contenu": "Great people to work with and i love the security of the net! The new fence looks fantastic. Thank you for the job well done and the peace of mind with the added safety."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T01:24:20.000Z",
          "Titre": "Very helpful …",
          "Contenu": "The person who called was very knowledgeable and helpful.  The order arrived shortly thereafter.  Everything was fine."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Graeme Bird",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T00:07:30.000Z",
          "Titre": "Great service to international customers",
          "Contenu": "Great service to international customers through trying times with shipping  etc. Super impressed with the communication with the staff - nothing is a problem and  the items requested were provided with additional parts included free of charge. I highly recommend dealing with Vaporbrothers  - they have great products and know how to please their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cesar Sandoval",
          "Nb_Reviews": 2,
          "Date": "2022-02-27T05:31:15.000Z",
          "Titre": "Love their products.",
          "Contenu": "Love their products, Been using for more than 10yrs. Ordering is quick and simple. And no problem with deliveries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen",
          "Nb_Reviews": 3,
          "Date": "2022-07-12T03:34:45.000Z",
          "Titre": "long time customer-three vape boxes…",
          "Contenu": "long time customer-three vape boxes over the years.........always prompt, discreet and reliable-game changing product..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli Jarvis",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T13:51:55.000Z",
          "Titre": "They are straight forward and include…",
          "Contenu": "They are straight forward and include great service with their outstanding top of the line products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mai Dao",
          "Nb_Reviews": 3,
          "Date": "2023-01-11T06:35:41.000Z",
          "Titre": "Immediate order processing and prompt…",
          "Contenu": "Immediate order processing and prompt mailing - I was pleased with how quickly my order arrived. Great service will definitely buy from Vaporbrothers again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur Kechabashyan",
          "Nb_Reviews": 3,
          "Date": "2022-04-01T18:52:48.000Z",
          "Titre": "All is well when VaporBrothers original…",
          "Contenu": "All is well when VaporBrothers original parts do exactly as they are made for clean and durable way of enjoying my herbs, Thank You My Brothers and Sisters there great to be your enjoyer of sweet gear"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dara Sattler",
          "Nb_Reviews": 4,
          "Date": "2022-02-15T16:56:34.000Z",
          "Titre": "I have had the same Vaporbrother's…",
          "Contenu": "I have had the same Vaporbrother's vaporizer several years and only have had replaced the hose once.I highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny M.",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T00:18:22.000Z",
          "Titre": "The product came on time and met…",
          "Contenu": "The product came on time and met expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lupton",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T01:57:55.000Z",
          "Titre": "Quality new hands free glass for my new…",
          "Contenu": "Quality new hands free glass for my new unit. I couldnt ask for more in a desk top Vaporizer.I’d give Vapor Bros 11 stars if I could"
        }
      ]
    }
  ]
}