{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "voiply.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jan M.",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T17:22:35.000Z",
          "Titre": "Terrible company",
          "Contenu": "Their app is terrible and their customer service is worse. They don’t seem to understand simple request and so I had to cancel before I even got started. Of course, I have to wait for my refund, which I paid for the full year."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Torres",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T05:49:46.000Z",
          "Titre": "Took forever to port number",
          "Contenu": "Took forever to port number. Your iPhone app is terrible. Waiting to try ATA device.  If I can’t FAX through it I will cancel service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Family Emercency",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T17:23:19.000Z",
          "Titre": "Sales support is a chat bot",
          "Contenu": "Sales support is a clueless chat bot that gives you wrong information. I wanted a service that supports Cisco IP phones because I have a bunch of these clunkers sitting around. I asked on the sales support chat if this is possible with a residential/home plan. The bot said: yes. I signed up and paid almost $300 for a yearly plan and some hardware, and instantly wanted to find out how to configure my Cisco phones. It turns out - they don't support it. Now I wasted 2 hours of my life and possibly a lot more, because they have not confirmed the cancellation of my order yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gail Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T21:47:52.000Z",
          "Titre": "Your salesman told me my internet…",
          "Contenu": "Your salesman told me my internet (Hughes Net) was compatible with your service.  IT IS NOT!  Now I'm subjected to waiting more than a week with NO phone service and a charge to reinstate Century Link."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Castillo",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T04:08:30.000Z",
          "Titre": "False Advertisement - No free calls!!!",
          "Contenu": "The company provides before signing, a way to check if the number(s) you will be calling the most are included in the plan. We call Spain. We have two important numbers: one landline and one mobile. Both checked numbers indicated no cost (included within the plan). After setting the system, after some struggle calling, I managed to call, and I got the message: 11 cts./min., both numbers. I called customer service, and they confirmed that those rates are correct!... We are canceling before the 30 days. Going back to VONAGE! (BTW, the call quality was not great!)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gautam Murugesh",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T09:26:52.000Z",
          "Titre": "Telephone service not working",
          "Contenu": "IM not able to receive calls since day 1 and have issues with the app too. It has been very frustrating calling the help center and not getting these resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T22:35:55.000Z",
          "Titre": "I still have not begun service",
          "Contenu": "I still have not begun service. My # hasn't been ported yet. I have been working on this since March 13 and am wondering if I will even get to try it out. I EXPECT a 30-day trial on this IF I EVER GET CONNECTED."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T04:26:44.000Z",
          "Titre": "I can not even connect my modem to the…",
          "Contenu": "I can not even connect my modem to the internet, when I spoke with one of the customer service and they can't help me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Byron Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T01:00:15.000Z",
          "Titre": "Calls keep dropping",
          "Contenu": "Calls keep dropping. Cannot identify problem,Almost useless to me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T04:51:19.000Z",
          "Titre": "You did NOT offer set up assistance on…",
          "Contenu": "You did NOT offer set up assistance on the.phone or in the box.  This service is not for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T23:43:46.000Z",
          "Titre": "Slow service",
          "Contenu": "way to slow for service and getting installed. Not happy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T01:20:33.000Z",
          "Titre": "My grandstream ATA never arived"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn Moore",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:45:35.000Z",
          "Titre": "Hardware is cheap and doesn’t work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louise Singleton",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T18:03:55.000Z",
          "Titre": "phone  does not  work!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:39:27.000Z",
          "Titre": "Number still hasn't been ported",
          "Contenu": "Number still hasn't been ported. Have been waiting but keep getting asked to review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ric",
          "Nb_Reviews": 4,
          "Date": "2023-11-05T15:39:46.000Z",
          "Titre": "The purchase and ease of",
          "Contenu": "The purchase and ease of, was very easy and straight forward. However, there was an issue with the Port Out of our phone number, which we had for 30 yrs. During the purchase we were advised that the Port out could take 7-10 days. The link to the Port Out page never appeared, in fact, I was taken back to the Dashboard page several times. We waited for several days and then someone said they could no call us, we had Dial tone throughout, so I mistakenly returned all the previous supplier's equipment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen McGory",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T23:00:55.000Z",
          "Titre": "Company is not upfront with their terms and it takes forever to make and receive calls!",
          "Contenu": "I'm not satisfied with my new service at all! It takes forever to get a dial tone and making and receiving calls is a real hassle. I may have to quit altogetther and send everything back to you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T14:45:51.000Z",
          "Titre": "My internet was not good with their…",
          "Contenu": "My internet was not good with their service. Only had it for less than a month and I had to go back to my original service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SANDRA BLACK",
          "Nb_Reviews": 3,
          "Date": "2023-02-27T03:22:55.000Z",
          "Titre": "This company is ok",
          "Contenu": "This company is ok. They seem to be out of date for todays company. I wanted to keep my same phone number and they could't provide that feature. They also require too much to get set up with the company"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:29:53.000Z",
          "Titre": "Phone no phonehas",
          "Contenu": "Phone has not worked for a week"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bow",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:02:03.000Z",
          "Titre": "Some issues but overall pretty good...",
          "Contenu": "I paid for Voiply for 1 year and chose one of the phone numbers available from their menu. Long story short, we could call out but couldn't receive them. After several texts and calls to customer support they resolved the issue...the number in question was a number that had been used but was no longer active (seems to me they should know that, maybe not). Also, I indicated that we had Starlink and would like to use the Starlink router-I was told that wouldn't be a problem but it was. We had to purchase another router to make it work. I'm giving 3 stars but am thankful for the people in customer/tech support that resolved the issues...especially Anna."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T19:49:34.000Z",
          "Titre": "Area code dilemma",
          "Contenu": "The staff we talked to on the phone were friendly and seemed eager to help. However, my main question remained unanswered, regarding having to dial the area code. We live in an area code where that is not required per the FCC. We are not used to having to dial the area code, and others here wouldn't know they have to do that to reach our particular phone. I think this would be a good thing for your company to work out, since there are other areas around the country like ours, and I would think this needs to be resolved not just for us but for others like us. In the short time we have had this system, we have found sometimes one must dial the area code to reach our land line, and sometimes not. Conversely, sometimes calling out from the landline, we must include the area code and sometimes not. We are still trying to figure all that out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan R",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T02:43:07.000Z",
          "Titre": "Still unable to use VOIPLY",
          "Contenu": "Still unable to use VOIPLY since purchase on 3/23 due to no portage of # from previous carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony A",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:43:33.000Z",
          "Titre": "The Customer Rep answer the call right…",
          "Contenu": "The Customer Rep answer the call right away ,Practically no waiting .They gave concise answers to all our questions and  were very knowledgeable .Though we did not receive a bill we hope it was correct without any hidden charges ,which Many phone companies have"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob A",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T03:17:04.000Z",
          "Titre": "Everything works great but took along…",
          "Contenu": "Everything works great but took along time to transfer phone number and asking  questions about call forwarding took a lot to figure it out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MLM",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T21:35:18.000Z",
          "Titre": "A generally positive experience",
          "Contenu": "Franz, who helped me set up the Opal router was incredibly helpful. I could not have set it up on my own, even with step-by-step instructions and how-to videos. Voiply speaks PC not Mac.Almost everyone I've visited with has been friendly, helpful, and knowledgeable,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T15:58:42.000Z",
          "Titre": "Excellent customer service on chat",
          "Contenu": "Excellent customer service on chat. Directions for set up were not consistent with what actually occurred while I was trying to set up the system. I attempted set up and got frustrated. Took a break of several hours and went at it again. By luck I made a little progress. I went to chat and was assisted in completion. Had I known it was going to be as complicated as it was I would not have signed up for Vioply. I am not tech savvy. I hope the system works without difficulty. If it doesn't, I will likely discontinue the service. Without the help of the Chat rep, I would have quit and not even started the service. It took a couple hours even with the Chat rep. The Chat rep was very patient with me. So far, Vioply is working flawlessly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. A. BRAGG",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T19:06:03.000Z",
          "Titre": "Satisfied but disillusioned!",
          "Contenu": "I'm 95% satisfied with the setup but the one problem I encountered was with the adapter connectivity and the fact that the only way I can get a replacement is to return the entire setup. I feel that is quite unnecessary and I was told I could go out and buy another adapter and get a refund. That's a bit of an inconvenience so I'm just hoping the connectivity will retain the continuity and I won't have to get another. Also, I think its absurd that AT&T would provide Voiply with a phone with their logo yet they would not provide the same phone through their company....absurd....which required me to get a different carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:58:51.000Z",
          "Titre": "Plugging it in was very easy",
          "Contenu": "Plugging it in was very easy. While trying to adjust it, I made one mistake and soon I will undo it -- all calls in on the VOIP number cause my cell phone to ring, not that I can answer them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth",
          "Nb_Reviews": 8,
          "Date": "2023-10-10T04:53:43.000Z",
          "Titre": "I do not like the 3-4 second delay…",
          "Contenu": "I do not like the 3-4 second delay before the person who has called you can hear your voice.  Sometimes people are too impatient and hang up after the first hello."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Von Tucker",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T14:46:07.000Z",
          "Titre": "Possible Deal Breaker",
          "Contenu": "I do not like the fact that if more than 10 digits are entered it is assumed to be an international number.  In fact, I will probably find another company because of it. With today's voice systems it is not unusual to have to reply to several prompts by selecting numbers on the dial pad when contacting a company.  Those additional numbers are automatically added to the phone number by me  phone,  When I attempt to redial such a number Voiply assumes it is an international phone number and charges me for the call.  I did not have that with Vonage and it may well be a deal breaker"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Coleman",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T15:54:24.000Z",
          "Titre": "New Customer's Opinion",
          "Contenu": "As a new customer, I am pleasantly surprised at the ease with which I was able to connect the adapter and use the phone line. Voiply agents have been very helpful and professional whenever I have had to contact them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T19:01:51.000Z",
          "Titre": "Easy setup",
          "Contenu": "Easy setup. Porting my old number went well and also automatically closed my account at ziply which was a bonus.  Overall a very good startup!  I also paid for a year after 1st month getting 2 months for free, a nice bonus.. I would recommend to my friends, I’m saving 60)/month"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A. Parker",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T01:40:08.000Z",
          "Titre": "Responsiveness to customer’s issue.",
          "Contenu": "Responsiveness to customer’s issue.One shop stop and not forwarding calls to different areas or people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Garnet Sleighter",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T01:18:27.000Z",
          "Titre": "Dissatisfaction",
          "Contenu": "I am satisfied with all aspects, with the exception of losing my phone service every other week and having to speak with a rep to get it back online."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James McGlasson",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T23:14:56.000Z",
          "Titre": "It was a slow process and there are…",
          "Contenu": "It was a slow process and there are occasional breaks in the connection. Seems to get netter with time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlotta",
          "Nb_Reviews": 7,
          "Date": "2023-03-04T16:03:27.000Z",
          "Titre": "The equipment arrived promptly",
          "Contenu": "The equipment arrived promptly, it was easy to install and the number was ported over rather quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T08:14:03.000Z",
          "Titre": "So far the service is great",
          "Contenu": "So far the service is great. And your customer service is excellent so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "One Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T00:19:25.000Z",
          "Titre": "So far happy with Voiply",
          "Contenu": "So far happy with Voiply, the best phone reps I have ever dealt with. Did everything they said they would to get me up & running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T18:47:21.000Z",
          "Titre": "My experience with this company for transfer my phone from another company is very good",
          "Contenu": "My experience with this company for processing was very good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marvin",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T19:01:01.000Z",
          "Titre": "Purchase and installation were easy",
          "Contenu": "Purchase and installation were easy, transferring old phone number a little confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob P",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T21:39:54.000Z",
          "Titre": "Easy to connect and startup"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T23:30:18.000Z",
          "Titre": "Affordability and ease of instalation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quang Mai",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:45:03.000Z",
          "Titre": "It's time to get rid of landline phone …",
          "Contenu": "The process of converting landline phone to VoIPly is very simple and easy. Adapter arrived on time, and setting it up could not be made easier. Voiply's responses are top notch, I was able to chat on line with their reps, and even to talk to real-person via phone without much waiting. The reps were polite, courteous, knowledgeable. Although I've just subscribed to Voiply recently, my experience with calls' quality is very good. Only small problem was the time it took to port my number, but Voiply did make adjustment to my bill to reflect that.  All good, so far.  Thank you, VoIPly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry from California",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:34:19.000Z",
          "Titre": "Happy we changed to Voiply.",
          "Contenu": "It was very easy to transition to Voiply; although it took a few days to receive incoming calls because we wanted to keep the same landline number. It works just as well as our much more expensive ATT phone line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Heley",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:39:27.000Z",
          "Titre": "Ease of sign up and porting",
          "Contenu": "Ease of sign up and porting. Everything was done via the Voiply site. Each step along with expected times was communicated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:07:42.000Z",
          "Titre": "The switch over was very easy and the…",
          "Contenu": "The switch over was very easy and the service has been great so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John S",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T13:55:07.000Z",
          "Titre": "Very easy to set up.",
          "Contenu": "Very easy to set up.Voice quality is wonderful.Voice mail works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelo",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:20:31.000Z",
          "Titre": "Customer support",
          "Contenu": "Although I had difficulty hooking it up with my TMOBILE internet, your customer service rep spent a great deal of time helping getting it working. Works perfectly now.My only disappointment is the $5.00 tax on the monthly payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:43:50.000Z",
          "Titre": "Easy set-up and wonderful customer support",
          "Contenu": "Easy set-up, seamless phone number transfer, and friendly, efficient, effective customer service.  Very impressive all around!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 5,
          "Date": "2023-10-08T07:06:50.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, device was delivered quickly and had good instructions for setup, working as it was described.  Porting took place in the projected timeframe.  The system apparently does not recognize Eastern Daylight Time as it keeps my time an hour behind, but I hope that will be ok when the time changes again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin Karges",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:38:14.000Z",
          "Titre": "Works Well After Set Up",
          "Contenu": "It took some tweaking but once the System was set up properly it worked grea"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:00:57.000Z",
          "Titre": "Simple",
          "Contenu": "Simple, straightforward and works as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sue Eisenman",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:59:33.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service.  Willingness to help in getting the device hooked up.  It was so easy I didn't need any help.  I was ELATED at how easy it was.  Have had so much trouble with other companies, this was a welcome relief!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyim",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T15:34:38.000Z",
          "Titre": "VOIP service",
          "Contenu": "Had the VOIP service for nearly a month now.  The calls most of the time are crystal clear except for occasional echoing on the 5G home internet connection.   (Not your fault) Plan to switch back to FIOS once contract ends to clear this issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:27:39.000Z",
          "Titre": "The transfer went smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T23:01:02.000Z",
          "Titre": "Very happy",
          "Contenu": "They delivered as promised. Setup was easy, porting phone number happened flawlessly (took several days as stated up front), quality of audio is very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel Hopkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T00:00:20.000Z",
          "Titre": "Honesty and professionalism",
          "Contenu": "Honesty and professionalism. Due to personal problems just now connecting the service. The installation was as simple as following the instructions. Wil read terms later will not rush thought them. The only clinch is the lack of a help phone no. in the box. I will phone to confirm my understanding of the billings etc. Do you have an affiliate program?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Preston",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:55:53.000Z",
          "Titre": "Easy Changeover",
          "Contenu": "Change was easy. Materials provided worked great and the instructions were easy to follow. Prep, reading and installing the phone modem, and making new calls only took about 15 minutes."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "PapiG",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T22:18:50.000Z",
          "Titre": "The overall experience switching from Magicjack",
          "Contenu": "The overall experience switching from Magicjack to Voiply was excellent.Once my number had been ported, everything fell into to place.There are some issues with the SMS service though.  I am unable to receive any 2FA sms messages from services like Facebook are not received on my end.Also, when calling from the apps to someone, the caller id does not show as my number on their end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:51:50.000Z",
          "Titre": "The product is a godsend for people…",
          "Contenu": "The product is a godsend for people like my mother, who after having the same number for 65 years could move to an assisted living in another state and people can still call her. If she had to change it then miscellaneous people would not have her number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDWARD H",
          "Nb_Reviews": 5,
          "Date": "2023-08-10T07:41:40.000Z",
          "Titre": "Easy to install the Voiply box",
          "Contenu": "I received the Voiply box, easily installed it following the directions, and I was ready to go!  The box was just like the one I had from Vonage, so it was easy to swap out the wires and begin saving more money on my VoIP telephone bill. I also appreciate the Voiply app on my cell phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohammad+Ziaee",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T04:51:42.000Z",
          "Titre": "We just switched to VOIPLY -it is so…",
          "Contenu": "We just switched to VOIPLY -it is so fantastic -Great customer support from beginning to end of the process. The team are really informed and go the extra mile at every stage. I would recommend them unreservedly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HW",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T17:06:57.000Z",
          "Titre": "VOIPLY Onboarding process",
          "Contenu": "Communication throughout the entire process.  Updates were provided to me via texts and or email.  Tracking numbers were issued and allowed me to notice where my packages were at all times.  My number porting was completed on schedule.  I can look forward to a year full  of prepaid billing since I opted to pay ahead 1 full year.  I really appreciate this as does my budget!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Scriven",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:51:18.000Z",
          "Titre": "Very Happy",
          "Contenu": "I am 66 years old and was worried about trying to do the installation myself. It went very easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T03:53:05.000Z",
          "Titre": "Outstanding Service",
          "Contenu": "The package with the equipment arrived very promptly.  It was easy and quick to set up. The instructions were precise.  The service of the phone system is outstanding.  While I have only been using it for a short while.  I am very satisfied so far and would recommend it to anyone needing a second line. The cost is a real bargain,  I believe I will be with this company for years to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Kunkel",
          "Nb_Reviews": 4,
          "Date": "2023-06-16T04:37:40.000Z",
          "Titre": "I had Phonepower VOIP for years and…",
          "Contenu": "I had Phonepower VOIP for years and their price kept going up.  Not only is Voiply less expensive but their Robocall defender has virtually eliminated nuisance & telemarketing calls.  PEACE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy Parks",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T00:06:44.000Z",
          "Titre": "So many VOIP companies to choose from…",
          "Contenu": "So many VOIP companies to choose from but this small   scale business had everything we needed at a reasonable price. What stands them apart is the support.  The plug and play would have worked if I had the correct apparatus on our end.  The live chat techs stayed with me with suggestions and advice until it all worked well.  Note the problem was always on my end. Nice to have courteous and knowledgeable persons to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "satisfied customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T15:47:41.000Z",
          "Titre": "The people online and over the phone…",
          "Contenu": "The people online and over the phone were from the U.S., not India or Bangladesh, and could actually speak English without some heavy foreign accent. That is appreciated. They were polite and explain everything well, including what the new bill would be. The transition was simple. A little better communication would help telling how when changing from on voip to another, you simply have to change the old device for the new once the porting of the number is complete. That was not written down clearly, but I figured it out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Chapman",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T16:07:27.000Z",
          "Titre": "Great 👍 customer service",
          "Contenu": "Great 👍 customer service, from shipping the adapter for the phone set up to activate was excellent. You guys were there when I had questions. The phone works great. I have already recommended your service to friends and neighbors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trent Smith",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T21:07:36.000Z",
          "Titre": "Everything went off without a hitch",
          "Contenu": "Everything went off without a hitch, number was ported on time the equipment arrived before promised. Plugged everything in and was online in about 5 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T14:31:52.000Z",
          "Titre": "Everthing went smoothly",
          "Contenu": "Everthing went smoothly. No problems  at all. I got to keep my same telephone  number. I was thankful  for that. I gave 5 stars. Everybody was kind and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T22:16:26.000Z",
          "Titre": "This was super easy",
          "Contenu": "This was super easy. We had an existing VOIP line through a different provider and were paying $70 MORE a month over the Voiply rate. Voiply ported our existing number over, kept us up to date through the process, and we are up and running without issue. No issues at all after a month or so. No brainer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Farouk M Ferouz DDS",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:55:21.000Z",
          "Titre": "Ease of porting and signing up",
          "Contenu": "Ease of porting and signing up Only problem I have now is that I am getting a whole bunch of robo calls I have registered with the federal agency my number I don’t want to pay extra for another service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Taylor",
          "Nb_Reviews": 5,
          "Date": "2023-07-09T01:34:40.000Z",
          "Titre": "System worked flawlessly & Support team was great",
          "Contenu": "It took some time to complete the porting but once that was achieved the system worked well and has continued to do so for the last two days.  The support team always responded very quickly to any questions I had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Cleary",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T03:03:28.000Z",
          "Titre": "Everything was on time and well…",
          "Contenu": "Everything was on time and well explained, even for a technologically impaired person like me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deidre",
          "Nb_Reviews": 11,
          "Date": "2023-10-05T23:37:45.000Z",
          "Titre": "Easy transition to Voiply",
          "Contenu": "The transition from Xfinity to Voiply was very easy. I was pleasantly surprised by how fast and easy the process was.Customer service was helpful and friendly when I reached out to them. Great price as well!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Walter Medak",
          "Nb_Reviews": 11,
          "Date": "2023-04-29T07:03:56.000Z",
          "Titre": "Lower prices for more features",
          "Contenu": "I started the move from another provider to Voiply around a week ago. As of yesterday, everything was moved over and is working well. Updates were sent to keep me in the loop as to what was going on. Calls are clearer than the other place too.I'm paying slightly more than half of what I was before, which is always a bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin Kennedy",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T10:03:49.000Z",
          "Titre": "VOIPLY COMPARED",
          "Contenu": "Sign up, hook up & use all very easy & so far quality fantastic! Price much better than the big carriers!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Kaylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:34:43.000Z",
          "Titre": "Love this phone service",
          "Contenu": "Love this phone service! Love the savings which is important when one is on a fixed income!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID SWIGER",
          "Nb_Reviews": 3,
          "Date": "2023-04-09T02:24:53.000Z",
          "Titre": "Happy and impressed!",
          "Contenu": "Friendly staff that answered my questions quickly.  Kept me informed during the transfer of our phone number. And fantastic tech support resolving a minor technical issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T21:14:53.000Z",
          "Titre": "There were a few glitches -but success",
          "Contenu": "There were a few glitches due to the wireless network implementation, but the VOIPly support team hung in there & got it fixed..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher W.",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:17:32.000Z",
          "Titre": "Staff at Voiply are very helpful",
          "Contenu": "Staff at Voiply are very helpful, polite, and thorough, and are happy to help with any questions you may have. Easy sign up and number porting process made it that much better. I am now receiving the exact same phone service that I was previously, only now it.cost.leas than half what it.used to cost. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Robbins",
          "Nb_Reviews": 5,
          "Date": "2023-03-03T05:16:51.000Z",
          "Titre": "Excellent communications",
          "Contenu": "Excellent communications.  Answered all my questions very concisely and very understandsable.  The system worked right out of the box with no issues.If you need to have a landline, Voiply is the way to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T03:56:30.000Z",
          "Titre": "Hold up was on Verizons end",
          "Contenu": "Hold up was on Verizons end.  The speed of port over was quick once Verizon got off their butts.  Clarity of connection with Voiply is wonderful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David S",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T01:03:42.000Z",
          "Titre": "Awesome customer support & value",
          "Contenu": "Awesome customer support, crystal clear calls, a dead simple portal, perfect soft phone app,  unlimited calls to 50+ countries and ruthless robo-call-killing functionality at a stunningly low price make for a truly unbelievable bargain. Bravissimo 🎉"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T03:31:51.000Z",
          "Titre": "You folks were a big help in porting…",
          "Contenu": "You folks were a big help in porting the phone number. Jury is still out on whether or not your system is better than the old one. Yours is certainly cheaper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T23:07:41.000Z",
          "Titre": "My purchase with you was easy as…",
          "Contenu": "My purchase with you was easy as compared to Vonage who never made it happen. Completion was quick an easy and your customer service is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T17:30:33.000Z",
          "Titre": "SO easy to set up!",
          "Contenu": "SO easy to set up! So far I'm impressed! Old number was ported quickly and efficiently and making and receiving calls are a breeze.  Thank you as I was afraid of getting rid of my old landline but so glad we did!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T06:12:45.000Z",
          "Titre": "My experience with your company was…",
          "Contenu": "My experience with your company was great. Everything worked just like the way it was described.  And customer service just wonderful.I wish companies like AT&T CIULD LEARN FRON YOU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vilas",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:32:57.000Z",
          "Titre": "Your timing for the number port and…",
          "Contenu": "Your timing for the number port and customer service was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Cain",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T03:58:55.000Z",
          "Titre": "Great service",
          "Contenu": "Voiply is a great service with excellent features. The website mobile mobile app are surprisingly useful and feature-rich. Online support is very responsive. Five stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MrsFordU",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T06:37:23.000Z",
          "Titre": "Shipped really fast",
          "Contenu": "Shipped really fast, very easy to install and works perfect with my internet company and was half the price bill for home phone through an internet/ cable provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob McDowell",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T04:48:26.000Z",
          "Titre": "Adios land line",
          "Contenu": "The transition from my old land-line to VoIP was seamless.  The equipment arrived on-schedule and everything worked beautifully."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Cook",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T17:28:03.000Z",
          "Titre": "Your company may it easy for customer…",
          "Contenu": "Your company may it easy for customer like me to afford a home phone. I love the service.I have a family member that is interesting; give her a call.803-514-7310...I recommend her about your service.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:00:38.000Z",
          "Titre": "The online ordering process and Number Porting.",
          "Contenu": "The online ordering process and assistance with porting my number was fast and easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANNE GANKA",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T03:04:56.000Z",
          "Titre": "We were misled and did not end up…",
          "Contenu": "We were misled and did not end up keeping your service because the information and service we received was less than stellar."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Goyda",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T21:13:50.000Z",
          "Titre": "Great Customer Experience",
          "Contenu": "Customer service was very responsive, both via email and the chat window.Device was easy to install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Woody",
          "Nb_Reviews": 3,
          "Date": "2023-05-03T11:59:05.000Z",
          "Titre": "Home phone",
          "Contenu": "This was a very easy process, from ordering to installing. I can tell no difference between my previous service and this one except for the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Eaton Haridas",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T15:23:27.000Z",
          "Titre": "The whole process was so easy",
          "Contenu": "The whole process was so easy!  I was paying cable $30/month for telephone service.  Big savings with Voiply, and the reception/sound are better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 5,
          "Date": "2023-06-02T02:25:41.000Z",
          "Titre": "I am quite satisfied with the service…",
          "Contenu": "I am quite satisfied with the service provided by Voiply. It fulfills the basic requirements of phone service, though some features are limited compared to others. However, the Voiply team has assured me that they are planning to introduce many changes that will make this service more feature-rich. I have noticed that Voiply offers some features that other VoIP providers do not. As a long-time VoIP user who migrated from a major competitor, I acknowledge that the documentation provided is minimal and can be frustrating. Nevertheless, the technical team has been accommodating and understanding in addressing my concerns. I highly recommend this service, and advise users to review ALL the SIP ALG information on the website, which will make a significant difference."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T18:38:43.000Z",
          "Titre": "Smooth Transition",
          "Contenu": "Given the price and ease of transitioning our home number from my other service, this was a good decision.  The telephone conversation quality with Voiply is better than our prior cable-based service so I recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nap Low",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T02:29:01.000Z",
          "Titre": "Very easy to setup the adapter",
          "Contenu": "Very easy to setup the adapter, has to wait for my to be ported over but was kept informed throughout the process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T14:09:29.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience.  Communication was great. And you can't beat the price.  I have had the phone for over 3 weeks now and no issues can hear clearly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Chalifourustomer",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T19:17:13.000Z",
          "Titre": "Easy to plug up had some trouble with…",
          "Contenu": "Easy to plug up had some trouble with voice mail but customer service solved the problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T16:42:23.000Z",
          "Titre": "It works as advertised",
          "Contenu": "It works as advertised.  It was a quick and easy set up, just plug ethernet cable and phone line into the box and that's it.  Call quality was good. Overall, it works well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn S.",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T01:20:43.000Z",
          "Titre": "Customer Service",
          "Contenu": "Customer Service was superb they spent a lot of time resolving my issue.  I worked with several individuals until we got it resolve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Marsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T15:45:42.000Z",
          "Titre": "Our service was hooked up in record…",
          "Contenu": "Our service was hooked up in record time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharese McCommons",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T00:45:22.000Z",
          "Titre": "Starting new phone service",
          "Contenu": "Delivery of my device was quick.Setup was easy.Number porting went well.Very satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T13:11:46.000Z",
          "Titre": "Saving me 40.00 per month and just as…",
          "Contenu": "Saving me 40.00 per month and just as clear and reliable as AT&T was. All AT&T is is a voip itself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Boulden",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T18:52:47.000Z",
          "Titre": "Customer support extremely helpful",
          "Contenu": "Customer support extremely helpful. Problem getting into account on line, due to a my error."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:24:18.000Z",
          "Titre": "it works well",
          "Contenu": "it works well, as expected so far.  purchased 2 weeks ago."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T19:51:02.000Z",
          "Titre": "so far so excellent",
          "Contenu": "so far so excellent, the service is A 1, no problem with the calls, and everything is very clear, Thank youYou are the best company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Uhl",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T05:08:12.000Z",
          "Titre": "Great Experience!",
          "Contenu": "Everything about the process was professional and efficient. So glad I made the change."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T16:51:32.000Z",
          "Titre": "Setup was simple and uneventful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ole Geezer",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T16:30:30.000Z",
          "Titre": "It was easy to connect",
          "Contenu": "It was easy to connect. I had it working in a short time. And it is still working, not the same with my previous phone named Ooma"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Msgdew",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:26:30.000Z",
          "Titre": "Works great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "REBECCA PEARMAN  REBECCA KIRCH",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T03:40:33.000Z",
          "Titre": "Great phone service at a great price",
          "Contenu": "Voiply has been easy to set up and get our number ported. So far the phone service has been fine!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wanda",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T18:04:37.000Z",
          "Titre": "I had a lot of trouble getting set up",
          "Contenu": "I had a lot of trouble getting set up. (My own fault), but the reps worked with me and patiently guided me and got everything worked out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T03:49:25.000Z",
          "Titre": "Satisfied",
          "Contenu": "All of the problems I had with my other carrier ended when I switched to Voiply."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Collins",
          "Nb_Reviews": 8,
          "Date": "2023-02-19T02:06:29.000Z",
          "Titre": "Your service so far has been great got…",
          "Contenu": "Your service so far has been great got me up and running in no time and your price is good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerMimi",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T23:05:23.000Z",
          "Titre": "So far",
          "Contenu": "So far, I feel Voiply is here to help people get good phone service and not to just make money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul G",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T03:35:11.000Z",
          "Titre": "We got ported over and the voice…",
          "Contenu": "We got ported over and the voice quality is very good!I don't know how to make calls to England yet. So, I'll be in touch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Williams",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T04:58:22.000Z",
          "Titre": "Easy to use and reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert McCarthy",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T15:59:00.000Z",
          "Titre": "Easy signup",
          "Contenu": "Easy signup, Phone number retention and transfer of calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JCM",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:27:45.000Z",
          "Titre": "Setup is very easy",
          "Contenu": "Setup is very easy. Fixed outgoing call problem quickly over chat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JW - Spencer, IN",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:09:46.000Z",
          "Titre": "Great Value and service",
          "Contenu": "Very happy with the service and the price. Porting my number was extremely easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YMC Colorado",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T01:36:40.000Z",
          "Titre": "Very good service and tech help",
          "Contenu": "I hooked up a new landline through Voiply. Everything worked smoothly with no hitch. Have great service!  Give them a try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SISSY",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T15:22:26.000Z",
          "Titre": "Happy with Voiply.…",
          "Contenu": "It was easy to sign up and get connected. Wish I would of done it sooner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine jeffery",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T00:16:39.000Z",
          "Titre": "They were very helpful and patient with…",
          "Contenu": "They were very helpful and patient with my issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T02:22:02.000Z",
          "Titre": "Good Service",
          "Contenu": "It took 7 days to port my number as I was told. The service works well and I would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CUSTOMERS",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T02:01:47.000Z",
          "Titre": "Very easy",
          "Contenu": "The customer service is very good and everything happened on time and very smoothly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:04:30.000Z",
          "Titre": "Simplew",
          "Contenu": "The entire process was made very simple and daily emails on the progress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles A",
          "Nb_Reviews": 8,
          "Date": "2023-02-18T00:20:55.000Z",
          "Titre": "Easy sign up",
          "Contenu": "Easy sign up, Thanks for porting. Great features, like voice mail to my cell phone!  Who needs a landline???"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T04:10:07.000Z",
          "Titre": "Handled the situation",
          "Contenu": "There was a issue with your system but your tech team discovered it and fixed it.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dot",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T00:03:31.000Z",
          "Titre": "Customer service completely solved our installation problem.",
          "Contenu": "I needed help during setup; problem was solved with one phone call..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T03:20:42.000Z",
          "Titre": "Quick delivery of product",
          "Contenu": "Quick delivery of product, ease of setup, price of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Rife",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T18:30:51.000Z",
          "Titre": "The switch over was very easy and done…",
          "Contenu": "The switch over was very easy and done in a timely manner.So far we are very pleased with the service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Lorenz",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T17:26:26.000Z",
          "Titre": "everything went very well",
          "Contenu": "everything went very well. Customer service is very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T19:40:15.000Z",
          "Titre": "Reasonable price",
          "Contenu": "Reasonable price, easy to set up. Plus NO contracts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T21:49:57.000Z",
          "Titre": "great communication and they got…",
          "Contenu": "great communication and they got everything right"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARIA",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T15:04:47.000Z",
          "Titre": "Easy setup",
          "Contenu": "Easy setup, phone sevice works great no issues so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:17:17.000Z",
          "Titre": "good service",
          "Contenu": "Easy installation, prompt replies"
        }
      ]
    }
  ]
}