{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "voipstudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dwaine Shears",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T10:43:09.000Z",
          "Titre": "Hated it.",
          "Contenu": "Hated it. So difficult to manoeuvre and use. Easiest thing to do was to cancel my account after the first hour- so there is that."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Pravin Krishnan",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T06:09:35.000Z",
          "Titre": "I stil have issues connecting to…",
          "Contenu": "I stil have issues connecting to certain countries. Have sent numerous messages to helpdesk and also called."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "John Doe dsafdsfdas",
          "Nb_Reviews": 43,
          "Date": "2022-07-25T11:28:00.000Z",
          "Titre": "I didn't register completely at the…",
          "Contenu": "I didn't register completely at the time now voip is sending frequent emails as \"reminders\", I consider it spammy and annoying.Inform your marketing department to increase the time span between emails, I'll register whenever I have time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2014-06-12T18:51:02.000Z",
          "Titre": "good customer service but lacks good phone service",
          "Contenu": "We have been using Voipdito for a few months and have had many problems. Most have been resolved but it's just one thing after another. Many of the problems have not been fixed. Some basic features like voicemail transfer and call parking (using a desktop phone) are not supported.\rOur vendors and customers are getting upset at us for all the problems they have trying to get a hold of us. Sometimes we try to answer the phone but nothing happens.\rVoipdito has potential in the future but I would not recommend them now."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Varun",
          "Nb_Reviews": 10,
          "Date": "2019-11-10T11:06:19.000Z",
          "Titre": "App doesn't work to answer calls!",
          "Contenu": "I just signed up for this service, seeing the fantastic reviews on TP. I feel really bad to write such poor reviews for the VS service. I signed up for the service, considering I'll be able to answer my calls from the app. The worst thing is, you have to keep the app always open to get it work properly. This is unlike any other app such as WhatsApp, facebook or other messaging or calling service. The second is, even after keeping the app open always, I don't receive calls, but I find in my email that I have a voicemail. I should receive voicemail only when I don't answer calls. In addition, sometimes, I only get just 2 ringtones and the phone is cut off. It's difficult to answer calls within 2 ringtones. They must work on the app, so that t works properly; or else they should not advertise - \"answer and manage calls from app.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rosanne",
          "Nb_Reviews": 1,
          "Date": "2016-08-04T15:41:04.000Z",
          "Titre": "Problems w/Mac compatibility",
          "Contenu": "Trying to integrate my Jabra Storm wireless headset with my MacBook Air and having major difficulties w/input - output options.  I need this setup for work-related duties."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dylan Duffy",
          "Nb_Reviews": 49,
          "Date": "2020-09-02T08:38:49.000Z",
          "Titre": "Bad news, not for B2B",
          "Contenu": "Unfortunately, they aren't what they are made out to be.I am going to keep this quick and factual, I signed up with VOIP Studio 1-2 months ago, setup was quick and easy. I requested a post-pay account, was told that this was fine - ported all my numbers in and then bang, got told I needed to add credit to make calls... this doesn't seem like a post pay account to me.We are a business, we can't be adding credit every month - PAYG is not a normal business model for B2B.I decided to leave and yes it's in the terms but got hit by a extortionate porting out fee, watch out for that. Incredibly high when most providers including BT/TalkTalk and most other providers would not dream of charging a porting out fee.I am in the process of porting my numbers out, some of them haven't completed yet and they have completely locked my account, meaning I may have lost numbers. Just another reason this is not for B2B use.If you are a proper company looking for a phone system do not use VOIP Studio."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "David Rogers",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T03:09:01.000Z",
          "Titre": "I don't know why",
          "Contenu": "I don't know why, but they blocked my account. Looks promising but customer support needs improvement."
        },
        {
          "Note": 1,
          "Lieu": "TN",
          "Pseudo": "Abbess",
          "Nb_Reviews": 1,
          "Date": "2014-06-04T13:10:35.000Z",
          "Titre": "VoIPdito sucks",
          "Contenu": "- Bad voice quality\r- Stuck int he middle of conversation\r- Conversation interrupted"
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Anonym",
          "Nb_Reviews": 1,
          "Date": "2014-09-27T22:58:29.000Z",
          "Titre": "No refund",
          "Contenu": "I used their service for a half day and they banned me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Poor Customer Service",
          "Nb_Reviews": 2,
          "Date": "2021-10-21T11:35:51.000Z",
          "Titre": "poor customer services"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andreea",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T13:15:24.000Z",
          "Titre": "Bad connection",
          "Contenu": "Bad connection and service."
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Semih",
          "Nb_Reviews": 1,
          "Date": "2018-11-05T12:07:15.000Z",
          "Titre": "my account is blocked"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Deberry",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T23:26:19.000Z",
          "Titre": "now that I can make call",
          "Contenu": "now that I can make call, the text feature sends texts from some other number. Also, I can't just paste something that I have copied from some where else GEEZ LOUISE"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony M.",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T23:16:47.000Z",
          "Titre": "Decent product",
          "Contenu": "Decent product. Could use a bunch of work."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 32,
          "Date": "2021-03-15T11:14:57.000Z",
          "Titre": "Signed up for a trial of their 2k…",
          "Contenu": "Signed up for a trial of their 2k bundle, which includes call minutes to landlines and mobiles in multiple Countries.The website is very clear that this does not include ALL numbers in the relevant Countries, I thought it was worth trialling the service.My experience was that the inclusive plan was not inclusive enough.  So I decided to look for a truly all inclusive plan"
        },
        {
          "Note": 2,
          "Lieu": "DO",
          "Pseudo": "Mariel B",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T03:19:24.000Z",
          "Titre": "Disappointed",
          "Contenu": "We are spending a lot of money in your platform and still we cannot get the automatic recharge option to work well. Our team's productivity is severely affected by dropped calls. The first week of calls was also horrible, we had to contact support at least once a day. I really hope you can address these issues in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick P",
          "Nb_Reviews": 1,
          "Date": "2015-01-18T16:13:20.000Z",
          "Titre": "No Response to emails but nice user portal",
          "Contenu": "I received an email from VoipStudio asking if there was anything else they could assist me with. I spent an hour typing an email, I never got a response. I followed up with 2 more emails and still nothing.. I believe VoipStudio sends out automated emails and never follows up on anything. This is a GREAT platform with fairly ease of use but they need to work on their customer service. Horrible"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Robert Hughes",
          "Nb_Reviews": 1,
          "Date": "2015-01-13T11:21:39.000Z",
          "Titre": "If no experience then difficult to setup & lack of communication!!",
          "Contenu": "Overall the solution is good but due to the lack of support in the setting up of it I would not be surprised if many people install it then just move on? The solutions meets my requirements but at the same time could benefit from some improvements and additions.\r After 2 weeks I am still waiting for an account manager to assist with the setup? and there is no telephone support which is frustrating??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2018-06-06T04:41:53.000Z",
          "Titre": "It would have been better if I would…",
          "Contenu": "It would have been better if I would have been told there is a $50 charge to pick my own toll-free # or given a refund for the purchase."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "swayersuk",
          "Nb_Reviews": 1,
          "Date": "2018-04-05T18:13:53.000Z",
          "Titre": "Support",
          "Contenu": "chat support is not great. Rather I prefer to have phone support to save time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2018-01-08T17:56:09.000Z",
          "Titre": "service was on floor due to end of …",
          "Contenu": "service was on floor due to end of trial - not there when I needed it"
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "Mykhaylo Oleshchuk",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T14:34:51.000Z",
          "Titre": "It took us 3 weeks to set everything up…",
          "Contenu": "It took us 3 weeks to set everything up so the free trial lasted 1 week"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T05:24:21.000Z",
          "Titre": "So far the process has been confusing…",
          "Contenu": "So far the process has been confusing for me. After my trial I couldn’t figure out how to purchase a plan. After finally getting in contact with customer service, I was able to get the help I needed. I found out I could not purchase on my mobile device, I had to log in on a computer. I have not used the phone service yet to give more details."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Research Support",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T16:58:39.000Z",
          "Titre": "Customer Service Challenges and Permission Design Flaws",
          "Contenu": "When someone on my team with Admin privileges tried to go in and set up our payment method it would not work.  So the system creates a single-point-of-failure by design.  The customer service response was slow and frustrating as we worked hard over five days to add a payment method and avoid any service disruptions.  We called the number and it simply told us to submit a ticket which we had done.  We just went in circles for 5 days trying to get a payment method added only to learn that ONLY ONE ACCOUNT was allowed to do that, despite them sending notifications to MULTIPLE accounts that we needed to add a payment method.  This is a poor design in the permissions model they have implemented and it is not apparent to the customer."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Amyable",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T14:03:29.000Z",
          "Titre": "Beautiful Call App with amazing…",
          "Contenu": "Beautiful Call App with amazing features. But why is it that when you copy and paste a number you cannot delete a number either from the first or middle numbers except from the last number.I want to be able to remove and add any figure from all angles, please look into it thanks."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Durs",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T15:55:47.000Z",
          "Titre": "More transparency required",
          "Contenu": "Service is great. However, the pricing is not transparent on their page. It does not say about the monthly subscription fee for the phone number."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Simon Bridgen",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T18:19:33.000Z",
          "Titre": "Initial impressions are good",
          "Contenu": "Initial impressions are good. Simple and easy to setup."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Shahzad",
          "Nb_Reviews": 1,
          "Date": "2017-07-17T08:42:34.000Z",
          "Titre": "Good service overall!",
          "Contenu": "Good service overall!I have signed with VOIPSTUDIO as pay as you go. I have not yet purchased a phone and using my computer to listen to phone calls. Initially the software was kindda difficult but then I understood it. When I tried to record my voice message, it took me 50 attemps but it does not record for more than 3 seconds. The voice is coarsed.I think if I buy a phone then maybe it will be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "gene",
          "Nb_Reviews": 1,
          "Date": "2017-11-03T14:44:51.000Z",
          "Titre": "Works generally well",
          "Contenu": "Works generally well. Many useful features that one needs to learn such as internal conference calls and text messages via mobile phones. Difficulty to call US 800 numbers and some international numbers sometimes--It say wrong number even if it right. Calls' sound is pretty good with nice connections. Customer service is excellent with great associate Alf*nso."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Korotev",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T16:26:53.000Z",
          "Titre": "Don't tell me what my contact list needs!",
          "Contenu": "The interface is fine.  A little overkill for me, but I get it.What I DON'T get and have canceled my account because of, is the contact list requirements.Silly as it sounds.Google is perfectly happy with the contacts.csv I have developed. So  is SKYPE.  I can not, however, import that exact same .csv file into VOIPSTUDIO without getting (what they perceive to be) errors.Example:  I want to save the name of my online banking phone #. ONLY.To keep VS happy, I have to enter a first and last name and who knows what else just to satisfy their requirements which I don't know or even care about.It's my contact list, not theirs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2017-03-10T18:15:23.000Z",
          "Titre": "Cuts in and out regardless of our 100Mbps internet speed.",
          "Contenu": "The phones and website are great tools. However, we have a very good internet connection and the connection is still not very good. It will drop 2-3 seconds at a time every 30 seconds or so. Now every phone call consists of \"I'm sorry, I didn't catch that,\" and \"Can you repeat that?\" several times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 6,
          "Date": "2014-07-25T11:49:31.000Z",
          "Titre": "Technical Support Technical",
          "Contenu": "VoIPdito.com has knowledgeable support staff, but they speak at the level of low level technology rather than use case.  They would also be better served by taking control of the computer having issues (this is very easy).  This would be more efficient that back and forth private messages."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Damien",
          "Nb_Reviews": 1,
          "Date": "2016-12-10T20:39:14.000Z",
          "Titre": "I like what I am seeing but..",
          "Contenu": "The CP looks very good and the features are easy to understand as well as friendly to us.I just have a problem with the App Client... apparently developed by an un-authorized/certified developer... :-)This need to get fixed in next update."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nick Ison",
          "Nb_Reviews": 5,
          "Date": "2015-07-22T09:48:26.904Z",
          "Titre": "Good, but room for improvement",
          "Contenu": "VOIP STUDIO staff are helpful and set-up was simple and painless. Call quality is fine most of the time, however calls do seem to drop regularly. \rOur first attempt at conference calling was diabolical. The call quality was so bad we had to give up and find another solution - not great considering we were speaking with a new client. \r We have only been using the service for one week. We would have liked to trial it for longer before committing to the service, however the one month trial only includes 100 minutes which we used quickly. Another week of use should put us in a position to decide if it is fit for purpose as a long term solution. It is certainly well priced."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2014-06-18T14:21:37.000Z",
          "Titre": "good alternative for standard phone",
          "Contenu": "It is not bad, many numbers but not from all over the world for ex. Russia is not availible. sometimes conversation qualiti is perfect but sometimes it is a dissaster.\rit is O.K."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2020-01-07T12:29:06.000Z",
          "Titre": "Have so far found the Windows App…",
          "Contenu": "Have so far found the Windows App tempremental, iPhone app seems ok although very limited.Will have to revert to IP desk phone to see if this is more stable."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Aneeq Hashmi",
          "Nb_Reviews": 1,
          "Date": "2015-02-11T01:20:52.000Z",
          "Titre": "SFDC CTI Integration without the Apex code",
          "Contenu": "Works well, albiet a bit clunky to configure. And there is no standard softphone or interaction log support within SFDC nor support for Apex based screen pops"
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Priscilla",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T14:01:43.000Z",
          "Titre": "chat support issue",
          "Contenu": "The chat support dont seem to have a clue about the product, they just send what we can already see on the website for their answers to our questions"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2016-03-09T17:35:21.000Z",
          "Titre": "Unreliable connection quality but good concept",
          "Contenu": "I've used them before in the UK with high speed wifi in the office and a fiver connection. They told us the poor connection was our fault.  Having now tried again some 12 months later, in France, little has changed sadly.  VOIP is a great concept but must be executed well or you sound like a dodgy call centre to your clients.  I take great exception to their team telling me the problem is our end all the time (despite trying on laptop, iPhone, France, UK, NZ etc..).\r I'll finish my 2 weeks remaining on trial and see if it improves.  At this point its not very useable.  \r I'm also not keen on hidden \"premium\" numbers.  They say that its all you can eat for a flat fee to landlines for example (UK and abroad) yet charge additional cash credit for \"premium\" numbers, of which there seems a never ending supply.  Again, they claim this is standard but the same numbers with our other VOIP provider are included.  Go figure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2015-05-06T12:38:26.000Z",
          "Titre": "Lots of features but rough around the edges",
          "Contenu": "The site and software offer a loot of features for the money but the user experience needs work.  I've used Nextiva in the past and their layout was far more intuitive and polished.  May I recommend a first time setup popup upon first login that walls the user step by step through the process?  Also, when I try to click on the question mark to get more info the help window dynamically changes to the topics at hand but the links to said topic don't work in any browser (Chrome, IE, Firefox).  You could also supplement the user guide with a separate quick start guide which would also aid the user big time.\r You have a robust system with pricing unmatched elsewhere so your potential in the marketplace is huge.  If you address the initial barrier of setup and make the user interface more intuitive you're set to dominate the marketplace!\r Last, a live chat for support would be a huge help as well.\r I'm happy to give more feedback on specific areas if that would be helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 1,
          "Date": "2020-03-16T13:05:47.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, haven't really had an opportunity to use it fully but it is doing the job. Easy to set up."
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Istvan",
          "Nb_Reviews": 1,
          "Date": "2014-09-08T18:26:17.000Z",
          "Titre": "Rates are good, but the interface is complex, difficult. Requires experience.",
          "Contenu": "I recommend it very cheap tariff telefonálhtsz europa all countries."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Channing",
          "Nb_Reviews": 1,
          "Date": "2017-12-12T12:30:36.000Z",
          "Titre": "Some bugs but support is really quick …",
          "Contenu": "Some bugs but support is really quick to respond"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2018-07-31T14:19:19.000Z",
          "Titre": "Good service",
          "Contenu": "good service and will recommend the service"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dominic",
          "Nb_Reviews": 3,
          "Date": "2018-04-04T20:29:46.000Z",
          "Titre": "Good quality service and easily…",
          "Contenu": "Good quality service and easily affordable"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jayde",
          "Nb_Reviews": 1,
          "Date": "2016-08-18T17:53:16.000Z",
          "Titre": "Phone",
          "Contenu": "I seem to have alot of phones on my desk."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2016-10-18T01:56:27.000Z",
          "Titre": "Low cost, good features, persitently poor quality",
          "Contenu": "I rolled out VoIPstudio in our small office to replace our somewhat antiquated PBX and physical phones following an office move. Setting up the new system was fast and easy - much faster and cheaper than transferring our existing landline service from one location to another within Central London (traditional telephony is appalling!). This lowered our fixed and variable telephony costs significantly, especially as we later expanded into a Canadian office; the free in-network calls and conferences have saved us many international calls. I was initially pleased with the full-featured system and responsive customer support.However, caveat emptor: the PC client has many issues with functionality that have persistently gone unfixed despite repeated requests over the years. I currently have four tickets 'Awaiting Support response' for over 18 months.Contacts do not sync properly. International phone numbers are not saved correctly. There are many, many call quality issues - nearly every call has audio issues on one side or the other. The supplied PC client in particular distorts audio if the computer is used for anything else. We now mostly use third-party clients on Android/Windows phones, but those have limited functionality unless paid for, which would significantly increase the cost of this solution. In response, we have been told the system works better with dedicated hardware phones, which contradicts the impression given by the website that PC softphones can be used, which was a major factor in our decision to buy.These issues have been extremely frustrating and from past experience are unlikely to ever be addressed. My team have repeatedly asked me to source an alternate supplier, but so far the system is just barely usable enough that changing over has not been a high enough priority. The pricing is also very competitive. As such, we have continued to use VoIPstudio despite the persistent quality issues until we get a chance to research and implement a better alternative."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2017-03-21T12:23:42.000Z",
          "Titre": "Its ok",
          "Contenu": "Its ok the interface is a bit dated"
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "nancy",
          "Nb_Reviews": 1,
          "Date": "2017-09-01T15:26:36.000Z",
          "Titre": "Support team not so promptly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2017-06-18T13:09:33.000Z",
          "Titre": "Service quality is average."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "RA",
          "Nb_Reviews": 1,
          "Date": "2015-11-04T08:51:53.545Z",
          "Titre": "Hidding charges",
          "Contenu": "I have been a customer of VOIPStudio since last year (2014). I started off as a monthly subscriber and when I realized the charges were too high for limited phone usage, I switched to PAYG (pay as you go). That was months ago. for 3.99. Obviously, I didn't realize that setting up numbers as separate users charges you are charged separate fees as well. So while asking why the new number I transported from another VOIP company to VOIPStudio was 5 instead of 3.99, they noticed that I have not been charged 5euros per phone. \r Long story short, nowhere in their website says you will pay 5.00 per phone. when I selected the PAYG, it clearly charges my account for 3.99. If their invoicing is not setup properly to charge the correct amount then it is their problem not mine. I was told now I have to pay for all of this months of not paying the 5 additional fee. VOIPStudio charged my credit card immediately without notification or without my permission or authorization. I noticed the charged while reviewing my credit card.  I asked VOIPStudio whiy they charged my CC since I had no balanace and paid each month. Now, VOIPStudio has raised the invoice again charging me setup fees and monthly fees. I could have left my phone where it was at 5/month fee. Now the same phone is charged 3.99 + 5.00.. Not a great deal...and I will be switching soon again, which cost money as I already paid for porting my phone to VOIPStudio. \r So my current charges went for 11/month to 28+ euros month. I decided to cancel one number (the one I transported in the first placed from another provider) and now that reduced my billing to 23/month. Which is still high for not using the service.\r I also have bad connection/quality using ZOIPER. Not their direct fault as this is a third-party software but I can't really enjoy the service any longer as the only way I can use the service is using ZOIPER and everybody complaints on the phone of the quality (they can't hear me, calls drop in the middle or I cannot connect at all).  Time to look for another solution.\r Over customer service is prompt and always answers my question in a timely manner but I can't use the service. I keep using my cell phone or Skype to make calls.\r Make sure you ask for ALL fees to be disclosed, because their website (when you sign up) or when you asked them, do not tell you this."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-07-09T21:31:52.948Z",
          "Titre": "good voip service",
          "Contenu": "I like this voip service"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Sonny Bergendorff",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:45:07.000Z",
          "Titre": "Great option",
          "Contenu": "Great option, only missing integration to call direct within Hubspot app on iOS."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Idiosys2@",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T12:58:43.000Z",
          "Titre": "So far having good experience",
          "Contenu": "So far, the experience is good. I was bit confused about to do the set up process by myself by checking their video tutorial. I request them to create more detailed manual on this to ease the process. Initially, the call was not popping up into my phone until I opened my app. After, I gave manual permission, it is shown now. Please implement a process to have all required permission during installation.Regarding Ring Group, IVR etc, a new user is required to have when to choose what. It would improve customer's experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samantha Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T17:39:08.000Z",
          "Titre": "The software works",
          "Contenu": "The software works, it does exactly what we need. We are still in the set up phase though, and we've been finding it difficult to get higher level questions answered from support. For example, we had set up a ring group and assigned a phone number, but the calls were still not going through. When we went to support, he quoted the manual at us, which we had already read and followed. What we needed was better help trouble shooting when things didn't go as expected. We did end up figuring out the issue ourselves though, it just took a while. The set up is now working as expected, and it's an incredibly useful system for such a low price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T15:04:59.000Z",
          "Titre": "Great so far.",
          "Contenu": "Only been using the system for a month but so far impressed with the features, a few tweaks I would make but that is from my own bias and knowledge of the 3CX system. I would recommend VoIPStudio for SME's due to the userfriendly-ness of the online portal and clear, simple pricing structure. Although they still charge per SIP which I believe is an outdated method they are not as unreasonable as other providers. The support team was very quick when I had an issue."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Shallymar Dug-a",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T11:24:00.000Z",
          "Titre": "Good VOIP Phone service for Freelancers",
          "Contenu": "It is hard to navigate the system at first glance, and I had trouble setting up the system. However, the support team is very responsive and was able to act immediately on my concerns.The quality of the call is good but it takes time for the call to proceed. The subscription plan is reasonable and perfect for a freelancer like me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T23:58:56.000Z",
          "Titre": "really good provider with acceptable…",
          "Contenu": "really good provider with acceptable customer service. The web Ui and iPhone app are not pretty or very nice but they work and their pricing is very attractive."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Abdulrahman Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T11:40:11.000Z",
          "Titre": "[Updated] Don’t trust this company or their customer service",
          "Contenu": "Update:They refunded me the full amount and also offered me a cash back on the month that I paid for, and I continued using their service.Update:Very bad customer service, I sent an email before purchasing to ask about certain features like using my personal phone number and calling outside Europe, etc.They responded with yes and they gave my the feature for the first half month, and then suddenly without any notices during the month they changed the rules and deducted money for every single call I made, while I was supposed to have 17xx minutes left in my bundle.And when I contacted the customer service they promised they return the money if I used a Spanish number, and so I did, then they replied with \"Call Credit spent on making calls won`t be returned.”Very bad and unprofessional.My previous review:I haven’t tried all the features yet, but so far, so good, I’m really impressed of the quality of the calls, The first call wasn’t that good, but the rest are really good.One more thing I still want to know if the recording feature is working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "INL UK",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T11:23:52.000Z",
          "Titre": "Perfect dialer for our business",
          "Contenu": "Easy to use and affordable per minute outbound calls.  It has all the basics we need like call monitoring, call transfers, and a softphone which works incredibly for manual dialing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jenny I",
          "Nb_Reviews": 2,
          "Date": "2022-05-27T12:37:03.000Z",
          "Titre": "I use VoIPstudio in my business…",
          "Contenu": "I am using VoIPstudio in my business and it is excellent.  I deducted a star due to the confusion of how to move from the free trial period to paying customer and was out of a phone service for a day due to this misunderstanding.  So be sure to activate/pay/understand how you move to paying customer if you need your phone line operational.  To recap, I am very happy and it is a cost effective solution that works well."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "TPY",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T00:56:37.000Z",
          "Titre": "Pretty good service",
          "Contenu": "Pretty good service, does what it is supposed to and support responds pretty fast. Their mobile app DOES need improvements though."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Stephen Horrell",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T18:07:18.000Z",
          "Titre": "The call quality is great and if there…",
          "Contenu": "The call quality is great and if there is an issue , one of your staff are always on hand to assist. There are very few errors and most calls connect."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Nicola Smith",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T09:25:25.000Z",
          "Titre": "Very easy to set up",
          "Contenu": "Very easy to set up, and straight forward to make and receive calls. I like the answer machine function, and being able to call straight from my laptop."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stephen O'Connor",
          "Nb_Reviews": 2,
          "Date": "2022-01-27T09:30:54.000Z",
          "Titre": "Just need to tighten up customer…",
          "Contenu": "Just need to tighten up customer awareness vs running out of minutes/time to make calls etc"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gordon Brown",
          "Nb_Reviews": 8,
          "Date": "2022-04-08T09:30:32.000Z",
          "Titre": "Overall well priced for good service…",
          "Contenu": "Overall well priced for good service but the extra charge for a number is not clearly identified on the website"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Amaka Janet",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T14:06:31.000Z",
          "Titre": "I am happy with this phone system",
          "Contenu": "I am happy with this phone system, it's well detailed, easy to operate, and highly recommend"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Cruso srl",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T09:43:06.000Z",
          "Titre": "Your customer service is available at…",
          "Contenu": "Your customer service is available at any time, it is a great help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald Horton",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T17:04:13.000Z",
          "Titre": "VoIP Review",
          "Contenu": "VoIPstudio’s enrollment and setup was easy and straightforward. The app is intuitive and simple to navigate."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Gmgmgm Ififif",
          "Nb_Reviews": 2,
          "Date": "2022-04-21T06:30:58.087Z",
          "Titre": "Use with confidence.",
          "Contenu": "VoIPstudio is very good and useful."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard Hadley",
          "Nb_Reviews": 3,
          "Date": "2022-06-07T12:31:15.000Z",
          "Titre": "Really good product and useful for our…",
          "Contenu": "Really good product and useful for our business"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Michael Wenz",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T20:43:39.000Z",
          "Titre": "Excellent and Fast Customer Service & Great Voice Quality",
          "Contenu": "After my 30 day trial expired I tried to subscribe to the Pay-as-you-go service for outgoing calls. Unfortunately, my payment was held up due to their anti-fraud detection software. Once I contacted customer service they sorted out this issue quickly. All customer service queries have been answered within one hour. The voice quality of each cal has been superb. So far I never lost a call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Xavier Smith",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T13:11:20.000Z",
          "Titre": "Great So Far",
          "Contenu": "Admittedly, I've not used VOIP Studio a ton, but that's because I've been setting up some other parts of my business that don't involve telephony.  What I have used and tested so far is has been a stellar improvement over my prior solution, so I'm looking forward to putting everything through the test next week when things go live.  Overall, this was a good decision so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aniekan",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T13:25:43.000Z",
          "Titre": "Great app and it integrated seamlessly…",
          "Contenu": "Great app and it integrated seamlessly into Zoho CRM platform. I'm really pleased with VOIP Studio. I docked one star because I was contacted for an onboarding meeting with a calendar invite but there was no follow through even though I accepted the meeting. The setup instructions might also be tweaked to be more intuitive. I had to stumble around for a bit to figure it out. Other than that it's been great so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Affinity Benefits Consulting",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T16:36:04.000Z",
          "Titre": "VoIP Studio robust and affordable",
          "Contenu": "VoIP Studio is a highly affordable solution for my small business. The sound quality is great and the feature set can't be beaten. I did experience a few hiccups with the mobile app, but their support was super quick to provide assistance and resolve the issue. BTW: When using an Android device, I recommend using their VoIPstudio Lite app."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Avinash",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T09:14:47.000Z",
          "Titre": "easy to use interaface great features",
          "Contenu": "easy to use interface and manage certain rules on users and features, the only issue is a few bugs which force one to re-login multiple times, and checkout page auto-update the basket. apart from that, the tool is really good, the support is outstanding I have always got a response for a ticket less than <2 hrs"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Donna B",
          "Nb_Reviews": 8,
          "Date": "2020-05-04T15:43:05.000Z",
          "Titre": "The customer service is excellent",
          "Contenu": "The customer service is excellent, I know that as I've had to speak with them a couple of times as the system is quite as initiative as we initially though and we've missed a couple of calls. It's been user error on my part but frustrating as it's not easy to identify the issue not know more about the system, and I'm not normally a technophobe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ellen Bolus-Edmonds",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T21:19:09.000Z",
          "Titre": "Very stable connection",
          "Contenu": "Very stable connection.  Superb customer service.  I would have given it  5 stars  if the contacts upload format is more flexible.  We buy US lead lists in the usual phone number formats (no country code, with parenthesis for area codes and spaces).  These are not recognized by the system and I had to take extra steps to get my numbers uploaded."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Joe Farr",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T08:58:17.000Z",
          "Titre": "So far so good",
          "Contenu": "We are currently using running the free trial to see if we will stick with VoipStudio. So far it has been really good. Easy to navigate and get started. I have had a bit of trouble with eh Android app on my phone but the support team were responsive and helpful. Even though I am in Australia the response times have been great. We are broadening the trial to more of our staff to really put VoipStudo through its paces but think we will be going ahead and signing up for the full version."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mohab shams",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T10:17:05.000Z",
          "Titre": "Some bugs",
          "Contenu": "So the first thing here is the connection when calling, this is an issue you have to solve Second the prices are still very high for me as a B2C company There are still some bugs you have to fix in the mobile app There is nothing more than these issues so i can see the voip studio is a brilliant app"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Ilze",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T13:28:24.000Z",
          "Titre": "New user satisfaction",
          "Contenu": "Hi, the number porting when smooth sailing although we were given a wrong date. But no complaints from my side. Quality is good and the dashboard is something to get use too. I have already recommended VoIPstudio to a friend who is using our office space (not our telephones) who wanted to recommend something to their friends living in England and running a business."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2018-07-05T02:32:46.000Z",
          "Titre": "Definitely worth trying",
          "Contenu": "Still new to making this vendor and every day necessity, but so far so good.  Quick response time to customer service and billing questions. Service works as advertised and at a good value.Negatives where that I couldn't test by forwarding my old Google Voice number to the service because it specifically blocked and I had to jump through a few hoops to get my US credit card to work, but they handled all those sufficiently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patti",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T15:35:21.000Z",
          "Titre": "Documentation thorough, ticketing system responsive, Salesforce integration a plus",
          "Contenu": "VoIP has been very helpful and their documentation is very thorough.  Their ticketing system for help is responsive and their pricing is very reasonable, especially for a small business starting out with VoIP.  Their integration with Salesforce was key for our company.  The only reason they don't have 5 stars for me is that they don't provide phone support."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 10,
          "Date": "2017-11-27T11:57:21.000Z",
          "Titre": "Excellent - Thank You",
          "Contenu": "I have been using the trial version of VOIP Studio for a month and have just transitioned to the normal version - this was based on how the trial system worked, the ease of use, functionality, attractiveness of the user interface and costs of use - and comparisons to similiar VOIP systems. In my opinion, VOIP Studio compares favourably and I am so far very impressed with all aspects of the system."
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2018-02-25T19:01:09.000Z",
          "Titre": "Excellent service overall",
          "Contenu": "Excellent service overall. Call quality, wide variety of options and settings and well working helpdesk. Actually the service covers all areas one would expect from a comprehensive VoIP solution - call forwarding, landline or mobile numbers for calling, recording, etc. We experienced some issues with Windows desktop client (support for W7), but was solved by helpdesk."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shaya",
          "Nb_Reviews": 2,
          "Date": "2019-05-20T12:11:16.000Z",
          "Titre": "Decent call quality",
          "Contenu": "Decent call quality, good value, exceptional responsive and helpful customer services. BUT I felt that the pricing was not transparent. The cost is not simply \"per user\" but per number as well. I only found this out when the invoice came in.The android app is poor; the chrome browser extension broke other websites."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Freddy",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T23:15:20.000Z",
          "Titre": "The platform is very complete and useful",
          "Contenu": "The platform is very complete and useful. The service is packed with a lot of useful features. However, voice quality is not as HD as I expected. Also, the Android App is not so \"user friendly\". Other than, those 2 things, I believe this service is complete and good for businesses of all sizes."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2016-04-08T10:55:17.000Z",
          "Titre": "Great",
          "Contenu": "Great customer service. Sometimes the connection is not that great in sound quality (low volume or low resolution or echo), although good average, but I have better experience with google hangouts or zendesk voice. \rHowever, the prices are great, especially if you have a low call volume, and this is the only service i know that gives you a local number with a great choice of different areas for each country"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Executive entrepreneur",
          "Nb_Reviews": 1,
          "Date": "2016-04-09T11:39:58.000Z",
          "Titre": "Powerful system but ironically a phone service with no support number to call",
          "Contenu": "There is a learning curve to overcome that was / is often frustrating when there is no phone number to call for.support. 100% of support is text based live chat or email support. Very disappointed about the support icon on their home page with the \" head with microphone boom\" not being a real feature, but after 30 days of learning, voipstudio is the most affordable, expandable, powerful system I've tried."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tina",
          "Nb_Reviews": 2,
          "Date": "2015-12-10T08:45:29.130Z",
          "Titre": "Happy User",
          "Contenu": "Been with two other VoiP providers and now moved to Voip Studio. What a good move - already the service is more stable than last provider and functionality of calling options is great, as we all work from different locations, the call routing is a plus. \rPresence status for colleagues would be helpful - but that is the only reason that i did not award 5 stars  -  i would do 4.5 if that was an option"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2018-06-09T12:50:59.000Z",
          "Titre": "Great Service and Support!",
          "Contenu": "The product works great, the pricing is just right for my needs and the mobility angle (answering the call from my desk phone, laptop or mobile) is absolutely spot on.  The missing star (would only have been half a star if it were possible) is due to a lack of documentation I could find online around where to get SIP details and so on but the person on the end of the Webchat sent me a link that took me straight to the information I needed.  Never looking back on this purchase !"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Augustus, UK Sales Manager",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T15:30:28.000Z",
          "Titre": "A telecommunication solution that satisfied our needs…",
          "Contenu": "Hamilton Apps UK needed a telecommunications solution and after treaching out to other providers, It was agreed that VOIPstudio provided the functionality and capability required.As a growing business, we have also found the solution to be scalable. I gave 4 stars because there is always room for improvement in any solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The D-X Radio Show",
          "Nb_Reviews": 1,
          "Date": "2015-03-25T15:50:15.000Z",
          "Titre": "Good product, nice features & good customer service...",
          "Contenu": "I'm new to VoipStudio. It took some time and a bit of reading to find out how to set up most of the advanced features. I really love the fact that I was able to connect my own 3rd party multi-line SIP soft phone. The actual working of the telephone service seems to be stable and quite adequate. The customer service team is very responsive and helpful. I believe that is their best asset."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kel Thompson",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T18:30:42.000Z",
          "Titre": "When you are looking for a telephony …",
          "Contenu": "When you are looking for a telephony service, you want reliability. I would full marks for that to Voipstudio. Only thing I don't like is that the dashboard looks a bit complicated. But that doesn't stop me from recommending this service provider. Economical, best quality and efficient. It has got loads of features in it too."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graham",
          "Nb_Reviews": 1,
          "Date": "2017-11-06T15:34:40.000Z",
          "Titre": "Simple setup and configuration",
          "Contenu": "Simple setup and configuration. Good call quality with no issues connecting or interruptions to service.Easy to add credit and view details of calls made.Very happy with system. My only criticism is the desktop application looks a little tired and dated and it is sometimes easy to 'lose' where the call controls are (on a multi-screen setup). It wasn't immediately obvious how I should get the dial-pad up to enter dial-tones (for voicemail etc) or how to hang-up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. Myles M",
          "Nb_Reviews": 1,
          "Date": "2018-07-25T00:53:03.000Z",
          "Titre": "i'm still in the trial phase and…",
          "Contenu": "i'm still in the trial phase and considering it for my start-up.  So far, I like what I am experiencing.  I would have given them a 5-star, but a couple of things held me back: 1) difficult to get phone support and 2) once your minutes are out, your phone call cuts out.  Other than that, it has been great!"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2017-11-14T13:49:07.000Z",
          "Titre": "Nice people to work with",
          "Contenu": "Nice people to work with.  This service stands so far above Skype that it is hard to believe.  Although both appear to have the same services, VolPstudio's services or features are actually usable and, if you have a problem, there is a real-live-person to step you through the problem.  Try that with Skype!  Although getting everything set-up was NOT as easy as they say; we were able to do so with out a computer tech.  If you are using Skype, changing to VolPstudios is a real no brainer."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "EyeGroup",
          "Nb_Reviews": 1,
          "Date": "2016-02-10T17:34:26.000Z",
          "Titre": "So close to 5-stars",
          "Contenu": "My only criticisms focus on the inability to easily connect to other (external) SIP addresses, and that the dashboard is not overly intuitive, although this is really because there is so much functionality to play with. This is a good thing, but the self-help would be better, in an ideal word.\rTruly great support staff though. :)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "KVH",
          "Nb_Reviews": 1,
          "Date": "2017-06-26T11:26:29.000Z",
          "Titre": "I have found VoIPstudio very easy to …",
          "Contenu": "I have found VoIPstudio very easy to use. The manual is fairly comprehensive, and if there is anything I cannot find there the online ticketing system has worked very well so far. The voicemail and SMS functionality is also good. The web portal is a great way of keeping track of all your calls, texts and voicemails."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 10,
          "Date": "2018-04-04T12:56:51.000Z",
          "Titre": "I have just migrated from Ring Central…",
          "Contenu": "I have just migrated from Ring Central and find the support and system very good.  I was paying £33 a month with ring central and have reduced that to £3.99/month for the system + phone calls.Ringcentral is a better overall system but the cost is expensive per head.  This does everything you need at a fraction of the cost.  Also, you can use the system to look like you are dialling out from a mobile, which ring central cannot do.With regards to calls, I find them better quality than ring central."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "John Radly",
          "Nb_Reviews": 1,
          "Date": "2015-03-16T15:36:27.000Z",
          "Titre": "Good but could be better",
          "Contenu": "I have been using voipstudio for only about couple of days, but can say few things about it. Dashboard layout is good as most of the options are available on the one single page without having to navigate to diffrent links. But could not find if it could be configured on SIP softphone. Not sure if that option is available or not as could not find any info about it. As well incoming numbers are available at slightly higher rates compared the other options available at present."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The African-American Resource Guide",
          "Nb_Reviews": 1,
          "Date": "2015-03-25T14:15:49.000Z",
          "Titre": "Average products & features, but great customer service...",
          "Contenu": "I am new to VoipStudio, but I have already experienced some of the good characteristics of this company. They offer decent and functional business telephone service and features. And if I were to rate them on this alone, I would have given them 3 stars. Their customer service is what boosted them up to 4 stars, in my mind. VoipStudio Customer Service seems to sincerely want to address any issues or concerns you might have, in a timely manner. And the \"follow-up\" is amazing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nadia",
          "Nb_Reviews": 1,
          "Date": "2017-10-11T12:56:31.000Z",
          "Titre": "Their reception quality is lightyears …",
          "Contenu": "Their reception quality is lightyears better than my previous provider Nextiva. That said I did have difficulties setting up payments with my US card carrier, luckily though I had a UK one I can use. Their reception quality is lightyears better than my previous provider Nextiva so was worth the trouble."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Luigi Raimo",
          "Nb_Reviews": 1,
          "Date": "2015-07-14T10:33:47.000Z",
          "Titre": "Great VOIP however LDAP not great.",
          "Contenu": "Voip quality is fantastic, good control panel little complicated at first but with the free trail you can play with it till you understand it. LDAP imports won't work on your handsets, however they have a feature called CLICK2CALL where if your loged into your username you click the number on your address book and it calls your extension and connects the call. However built in LDAP lookup for address books would be better and would allow caller ID. Feature packed service with lots of options."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2018-10-10T01:50:36.000Z",
          "Titre": "Fantastic support, great supplier relationship",
          "Contenu": "We have been trialing VoIPstudio as an alternative to our current provider. They were very highly recommended by their wholesale channel which opens the door to a far greater level of customer support and a smoother onboarding experience than we could have reasonably expected. Setting up and establishing a test case number was painless, and while a full migration of all of our DID services is likely to create some complications we now have full faith that VoIPstudio are well positioned to shepherd us through this with a minimum of hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ariana",
          "Nb_Reviews": 1,
          "Date": "2019-08-07T12:54:12.000Z",
          "Titre": "Excellent customer service; Baseline Salesforce Integration",
          "Contenu": "Excellent customer service. The Salesforce integration has a few quirks such as you need to manually sign in each day and it doesn't automatically log the call to the contact. Overall, we are still getting used to it but the features and integration is what sold us on it!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Gerrit",
          "Nb_Reviews": 1,
          "Date": "2015-09-05T16:56:47.238Z",
          "Titre": "Good customer service",
          "Contenu": "I needed a Voip Number to represent landline number in Spain for my business. If you are not a pro with these things, it can get quite tricky. The support team answered all my questions quickly. And when I still had not set up everything at the end of the trial period, the trial was extended with no fuss. Great\r I would give it five stars, but I really dislike the user interface, which seems very unintuitive and cluttered to me. Needs a big makeover in my eyes. But if you like MS Windows, you will like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ty Stutts",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T21:01:58.016Z",
          "Titre": "Straight Foward POWERHOUSE communication system",
          "Contenu": "When you first look at VoIP Studio's control panel you probably won’t be blown away with a visually appealing design, however if you take the time to move in to this powerhouse communication system you will learn that this is by far not only the most affordable system on the market, but one of the  simplest. Even if you are not accustom to PBX or VoIP you will find that this cloud system is easy to set up in just minutes. Unlike most systems VoIP Studios pricing is straight forward and easy to understand."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2018-03-09T11:46:28.000Z",
          "Titre": "Seems to do what it says on the tin.",
          "Contenu": "Seems to do what it says on the tin.Only 2 minor problems so far. Calling a Tele-comference system the DTMF numbers were not recognised correctly. Plugging in a headset to the pc after the voip-studio loaded didn't work. Had to restart voip studio before it found the headset."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Midwestnomad",
          "Nb_Reviews": 2,
          "Date": "2015-12-19T18:33:18.380Z",
          "Titre": "Best VoIP in the market",
          "Contenu": "I've been a big fan of VoIP since the technology become commercially viable.  Being a customer to top branding for many years, VoIP Studio by far offers best quality and features.  Best if all, pricing structure is most competitive, bar non!!!\r I recommend VoIP to any business owners."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-05-28T08:09:52.758Z",
          "Titre": "Voip Studio is cost effective so far.",
          "Contenu": "Good: Voice quality is great; free computer app; cheap 3 party smartphone app; pay as you go; free inbound calls; call recording included; can fax from any extension.  \r Support: It is responsive. However, it is the ticket system.  You do have to understand how VoIP phones work and the way you would like to setup the system.\r Bad: No free US telephone numbers; fax is per minute charge for outgoing calls.  Can be time consuming to setup.  However, it can be done.  Pricing is confusing. However, you can get clarity via tech support."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Booker",
          "Nb_Reviews": 2,
          "Date": "2017-09-08T09:46:53.000Z",
          "Titre": "Platform works well and economical in use …",
          "Contenu": "The technology platform works well and is economical so attractive. What is not apparent at first is the charging model. You may form the impression that the headline fee covers everything, which it does not. Only when you get the invoice do you see how the product is charged. The charging model is fine in practice, but just opaque to a new user. It is really setup for charging to a card. It can cope with sending invoices and receiving payments to their bank, but you have to allow for the delay that process takes in applying the funds to the phone account."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Inv",
          "Nb_Reviews": 5,
          "Date": "2020-06-14T15:24:53.000Z",
          "Titre": "great to work with",
          "Contenu": "great to work with, full of features, basic plan for me was only $5 as i only have incoming calls (FREE!!!!). with Callinstudio, you pay 3cents for every incoming too and $9 per month. Great dashboard; but the APP does not install! some error 403."
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "Tyna Harrison",
          "Nb_Reviews": 1,
          "Date": "2018-01-31T12:25:14.000Z",
          "Titre": "Ease of set up and use",
          "Contenu": "The initial set up was very simple and easy to understand plenty of support information easily accessible, had an issue with an FTP client arranged a support call with VoipStudio technical support and it was resolved in a matter of minutes - excellent service great product."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Brandon Sowell",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T12:10:38.000Z",
          "Titre": "VoipStudio Great for WAH jobs",
          "Contenu": "VoipStudio is a really good service for individuals in need of a work from home phone. I work from home using this service and have an uptime of at least 97%. Prices are the best I have seen hands down especially if you dont require outgoing calls."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Giles Button",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T16:30:05.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, functionality is really good, excellent value for money. would highly recommend. Only reason I wouldn't give 5* is the interface could be better, e.g. not as slick as RingCentral, but it's half the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TKC",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T15:16:51.000Z",
          "Titre": "Good solution for foreign-based companies to have a local number",
          "Contenu": "We are a U.S.-based company that has a sales team in the UK. We needed our UK team to have a local phone number but also be able to make international calls, as they take care of our foreign sales as well. VoIPstudio has been a good solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark T",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T14:33:57.000Z",
          "Titre": "Very good, reasonably priced.",
          "Contenu": "I like this service. It is flexible and highly useful. It is inexpensive. Pricing is transparent. You can customize the settings, and most important of all, you can get ahold of someone who will help you. Try this with Ooma Ring Central or Zoom phone. I would rate VOIPstudio above both. Very good help screens and video tutorials. Where could there be improvements? The web interface you are asked to use is a bit difficult to navigate. The app they offer needs to be seriously overhauled. IF they had a better app that allowed you to view your settings, easily check messages when out of the office, and reply to tickets, I would give it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ata",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T09:46:16.000Z",
          "Titre": "Reliable service and decent customer…",
          "Contenu": "Reliable service and decent customer support. Made the switch from another provider, so far, definitely proved its worth. One criticism is to do with their UI/UX, the functionality is there but the looks and feel have a lot of room to improve."
        },
        {
          "Note": 4,
          "Lieu": "AL",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-05-06T09:10:12.000Z",
          "Titre": "All systems go",
          "Contenu": "The issues i have had previously with Voip systems is calls not always connecting, dropping out and crackly lines. Since starting with Voip studio this has become a problem of the past which leaves me more time to focus on building my business rather than fixing IT issues!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adam Pritchard",
          "Nb_Reviews": 4,
          "Date": "2020-03-05T14:17:33.000Z",
          "Titre": "All the software features that you want…",
          "Contenu": "All the software features that you want are there - call recording, voicemails, group ringing etc - and the service is reliable. Dashboard and UX needs to improve as you have to go looking for these features, but its good when you find them!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2018-05-05T13:22:22.000Z",
          "Titre": "Great service offered",
          "Contenu": "Great service offered. I took me less than 30 mins to set up fully functional PBX. 1 less star because I only struggled at time of making payment as it was asking to first download softfone and make test call. That was confusing. Everything else is great."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nick Raimo",
          "Nb_Reviews": 1,
          "Date": "2015-07-14T10:28:32.514Z",
          "Titre": "Good quality minor teething",
          "Contenu": "To test this service I took a 30day free trail and divert all my incoming lines to this temporary number this allowed me to work out how it would work live. There was a bug which could of been my side or there's unsure but it fixed it self when I reset my phones and my IVR options. Phone quality is same on any voip service its all down to your connection rather than there service we have a decent ping of around 20ms and a down speed of 40mb with an up of 10mb, we can run 3 calls without any problems and we have a website server running on this connection plus 3 laptops being used."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Zander",
          "Nb_Reviews": 1,
          "Date": "2018-02-14T09:40:21.000Z",
          "Titre": "A Solid 4 ⭐️⭐️⭐️⭐️",
          "Contenu": "Whilst there are many companies offering a VOIP solution- VOIP Studio allowed us a 30 day trial. This enabled us to try the product with zero commitment to see if the solution was right for us. The call credit seems to last for a long time too which is great. The only thing I dislike is that there is a telephone number for sales and ongoing support has to be done via an online portal. This stops it being 5 stars. I must add we have used to support portal many times and they have very quick to respond and solved every issue. I just prefer to speak to someone there and then rather than raise a support ticket."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ross Perchonok",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T13:23:12.000Z",
          "Titre": "Great so far",
          "Contenu": "Great so far. The set up was easy, however retrieving messages is proving to be difficult. The tutorials are helpful, but have now watched numerous times and am still befuddled....a normal mode for me though."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Zakaria O.",
          "Nb_Reviews": 1,
          "Date": "2015-03-03T14:32:37.000Z",
          "Titre": "Trying VOIP Studio after several other options",
          "Contenu": "I have been dealing with VOIPstudio for my business purposes.\rUntil now, it has been a reliable service (altought not used for long).\r The setup is quite clear and after a bit of learning, the possibilities are great.\rWould recommend."
        },
        {
          "Note": 4,
          "Lieu": "MT",
          "Pseudo": "David K.",
          "Nb_Reviews": 1,
          "Date": "2016-01-20T10:05:55.000Z",
          "Titre": "Good service at a decent price",
          "Contenu": "VOIP Studio was recommended to me and I was pleased with the service. Easy to set up, decent pricing, removes the need for any hardware. For a a startup and mid-sized company, it's a great start. Excellent support team and service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2018-03-29T12:26:02.000Z",
          "Titre": "Review",
          "Contenu": "teething problems from the start as we were not able to call certain numbers  due to there being a charge. Sorted now. All tech support are very professional and efficient.Overall, just what you might expect when switching"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ben King",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T20:46:44.000Z",
          "Titre": "Great sound quality and value",
          "Contenu": "Started using the service this week In Spain when we had to start home working. What a marvellous product it is. Clear voice quality and the national call minutes package is great value. Definitely recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scot",
          "Nb_Reviews": 1,
          "Date": "2019-11-19T12:06:50.000Z",
          "Titre": "It took a little time getting use to…",
          "Contenu": "It took a little time getting use to the different functions and were.  Overall after about an hour of using VoipStudio I found it to be easy to use.   I wish for other es that there would be written instructions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2018-02-27T12:02:53.000Z",
          "Titre": "We have just started to use VoIP studio…",
          "Contenu": "We have just started to use VoIP studio and I love it.It was so easy to set up and just as easy to use. We have four users in our office and its great for all our needs and its easy to transfer calls between us."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ollie",
          "Nb_Reviews": 1,
          "Date": "2018-02-07T13:09:06.000Z",
          "Titre": "Pretty good overall",
          "Contenu": "Pretty good overall, but a few tweaks could be made on things like the number box recognising international dialling codes when you paste the main number into the box, so you don't have to input them manually."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2017-12-17T12:28:01.000Z",
          "Titre": "VoIPStudio for small business",
          "Contenu": "VoIPstudio seems to do all that I want. Setting up is straightforward, although the user manuals could be easier. There seems to be a lot of features here which are going to take time to sort out and set up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2016-07-07T02:54:06.000Z",
          "Titre": "Excellent Customer Service and Serves Puerto Rico",
          "Contenu": "I had looked into every VOIP service and VOIPstudio was the only one that would service Puerto Rico and at a good cost. Very flexible plans. Customer service is very good but no phone support, just web."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Julie",
          "Nb_Reviews": 3,
          "Date": "2016-03-14T08:25:05.000Z",
          "Titre": "So far so good....",
          "Contenu": "We began using Voipstudio.com in our new business last week and have had excellent results. Clear and easy to use we feel the system is something that can grow hand in hand with our developing business."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2016-11-03T19:16:59.000Z",
          "Titre": "VOIPStudio Reveiw",
          "Contenu": "VOIPStudio is a great service, with an easy transition for porting numbers from other service providers, and the user interface is well organized, clear, and allows us to manage the phone very easily."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T09:16:53.000Z",
          "Titre": "Very good support",
          "Contenu": "We just started to use VoIP in our office. From the start on, we received fast feedback from the experts of the support. We set up the users and after a short while, we were able to start calling."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "christelle",
          "Nb_Reviews": 1,
          "Date": "2018-11-22T10:13:36.000Z",
          "Titre": "Good service and connection",
          "Contenu": "Good service and hassle free connection. The dashboard and set up takes a bit of time to get used to, as there are lots of options and potential add ons. Would definitely recommend VoIPstudio."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ari Sharma",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T11:49:43.000Z",
          "Titre": "Pretty good solution",
          "Contenu": "Pretty good solution. Some challenges with McAfee as it flags it as a virus overall good tool some niggles with Audio integration which can sometimes be frustrating."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon Burns",
          "Nb_Reviews": 3,
          "Date": "2015-03-16T09:25:14.000Z",
          "Titre": "US Sip Phone",
          "Contenu": "Had a few issues getting the phone and account set up, however Renier at VoIPStudio was quick to help and solved all issues straight away.\r Will be going back to them shortly for further numbers."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Ferguson",
          "Nb_Reviews": 1,
          "Date": "2017-01-24T14:24:40.000Z",
          "Titre": "VoIPStudio -  a fresh feel",
          "Contenu": "Whilst the interface is possibly not as refined as some other providers the service is definitely top notch.  So far no issues with either call quality or dropped call.Keep up the good work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Ireland",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T11:39:42.000Z",
          "Titre": "A Pleasent Experience.",
          "Contenu": "This is my thoughts on the VoIPstudio cloud business phone system. First contact is with their website and why I should be a customer. On deciding to be customer they said I have thirty days to try their system. I was presented with their Dashboard to setup the system. I do have some experience with VoIP and SIP so it wasn't too hard. I did have a couple of questions which were handled by Customer Service Chat. Website has credentials for setting up  IP Phone which went without problem. I provided my own device. They have a softphone available to use to begin with if you wish. Transferring to paid customer was very speedy and the invoices were self explanatory. Cost is very inexpensive on both options. Their manual could be a little more step by step for people not quite as experienced. So far I am satisfied with the results. Look it over and see if it is right for you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "yasmin golchin",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T14:26:16.000Z",
          "Titre": "Voipstudio is a great APP and very…",
          "Contenu": "Voipstudio is a great APP and very reasonable priced; maybe too much Call center facility for my need ( i just need to queue calls , as in a radio station, that's all)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leebrian",
          "Nb_Reviews": 1,
          "Date": "2016-08-18T19:12:34.701Z",
          "Titre": "Helpful and good service.",
          "Contenu": "Phone service is good. Technical support and sales went the extra mile to answer questions and help me get my hardware setup. They even help set up hardware that was not sold by them."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Daniel Hughes",
          "Nb_Reviews": 2,
          "Date": "2017-01-24T12:21:23.000Z",
          "Titre": "Voip Studio - Good?",
          "Contenu": "System seems to manage calls very well.  So far call quality is good.  Dashboard seems basic but I haven't really looked into the capabilities as yet.  Yep, I would say it is good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Marcus O'Donnell",
          "Nb_Reviews": 6,
          "Date": "2016-01-12T18:46:00.926Z",
          "Titre": "New customer... happy so far!",
          "Contenu": "Having recently completed my 30 day trial I decided to continue and purchase the full product. I have always found the sales and support guys to be helpful, quick, and professional too."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Guido, Italy",
          "Nb_Reviews": 2,
          "Date": "2015-03-24T14:50:26.000Z",
          "Titre": "4stars Review",
          "Contenu": "1. Great administration webportal\r2. Great audio quality on international voip calls\r3. Very affordable prices\r4. Very easy to configure...the best voip solution for every BB Bold"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Maher",
          "Nb_Reviews": 1,
          "Date": "2015-04-09T10:27:29.000Z",
          "Titre": "Perfect support",
          "Contenu": "The service is professional and flexible for users' various needs. Takes time to get used to it ,  however the support is unbelievably helpful and nearly with immediate respond"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Vova Scutelnic",
          "Nb_Reviews": 1,
          "Date": "2017-01-24T14:23:08.000Z",
          "Titre": "VoIPStudio for Business",
          "Contenu": "So far?  Well, all good really.Straightforward interface.  Had a couple of issues with calling certain companies but apart from that very good.  Pricing is highly competitive."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris T-D",
          "Nb_Reviews": 1,
          "Date": "2015-06-22T09:52:26.791Z",
          "Titre": "Initial issues but quickly sorted",
          "Contenu": "Was testing this as a replacement for our existing service.  Couldn't seem to get it working and contacted support who were very quick to help and resolve. So far so good."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ATEFEH DERAKHSHANFAR",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T16:33:29.000Z",
          "Titre": "Easy to install"
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2017-08-10T12:02:16.000Z",
          "Titre": "Generally good",
          "Contenu": "Generally good, although a bit of a problem getting my iphone app (Bria) to work with it.  Their instructions were bad but the technical support eventually got me though."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "SL",
          "Nb_Reviews": 9,
          "Date": "2023-10-26T17:09:41.000Z",
          "Titre": "Excellent service and support",
          "Contenu": "Have been using Voipstudio for many years. Their support is the the best you can find.  Always available and always fix the issue.  The prices are very inexpensive and the service is awesome.  Works on our office phone lines and our cells.  Just had an issue that they remoted in and fixed straight away.  Thank you to Renier on support :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Boodge Wellz",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T09:57:23.000Z",
          "Titre": "T-pilot has always been there",
          "Contenu": "I guess because trust pilot has always been here but in the background. That's about a solid brag or boast... thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Foulkes",
          "Nb_Reviews": 4,
          "Date": "2023-05-15T00:38:59.000Z",
          "Titre": "Easy porting of home phone",
          "Contenu": "Easy setup and arrangement to port my domestic phone line away from bt to voipstudio, I can finally shut my bt line down completely since they cancelled our fibre install and we moved to starlink.Plus many more features than would ever be available with a bt line, for a third of the price!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Edmonds",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T13:11:25.000Z",
          "Titre": "Excellent service - perfect for a home fibre connection",
          "Contenu": "Excellent service from VoIPstudio. I found it very easy to get set up in no time at all. The user interface is intuitive and the online help articles and videos are a bonus. Perfect for my new fibre connection at home now that I no longer have a phone line."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Parker",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T13:26:44.000Z",
          "Titre": "I used VoiPStudio to set up a local…",
          "Contenu": "I used VoiPStudio to set up a local phone mailbox service to be used by charities and clubs etc. I'd tested out a lot of other similar VoiP providers, but their interfaces were really hard to navigate.  I found the VoIP studio interface quite intuitive and I was able to create the mailboxes and associated IVR.The support seems really good, there is always someone available to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Agan",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T23:50:08.000Z",
          "Titre": "I switched to VoIPstudio because…",
          "Contenu": "I switched to VoIPstudio because the price and features seemed like a good fit. I will say I'm pleasantly surprised with the features!!! Their platform is substantially better than what I was using before. My only complaint is that they don't offer MMS which is frustrating but everything else is so amazing!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Mihaly Tordai",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T16:50:56.000Z",
          "Titre": "We looked for an affordable HubSpot…",
          "Contenu": "We looked for an affordable HubSpot solution for VoiP and VoiP Studio was very effective for that. Call quality is not completely perfect, but given the price, it's a good deal.Their 2K Minutes Bundle is a good offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Gardner",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T21:29:25.000Z",
          "Titre": "Fantastic Soft Dialer - Integrates with CRM",
          "Contenu": "I have used VoIP Studio as a single license and loved how it integrated with my CRM. The pricing is fantastic, and hard to find a lower cost anywhere. The auto-attendant handles my calls and routes them any way I like. Now I use it for a team of seven, and we love the chat feature. I was always getting texts and emails; now, I can answer quick questions without checking my phone."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Giu Temeron",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T13:57:33.000Z",
          "Titre": "Best in business",
          "Contenu": "Very impressive how quickly and seamlessly is to get a number up and running with VOIP Studio. They provide a great pool of services and functionalities and we are very happy working with them, starting to scale up to more numbers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rachel Barnett - Gentle Frog,",
          "Nb_Reviews": 3,
          "Date": "2022-09-21T19:39:50.000Z",
          "Titre": "Works as expected, no hassle!",
          "Contenu": "I have been testing this over the last month, so far this is really great! It works like it should for calls, texts and forwarding to my virtual answering service. And it's no hassle.. I tried a few other services before this and they were unnecessarily difficult."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MRS. JACQUELINE EDWARDS",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T06:49:25.000Z",
          "Titre": "Not being an IT expert the install was…",
          "Contenu": "Not being an IT expert the install was so easy. I spoke with the customer service team and within minutes of my question the support team had set up my platform and my users. I am so comfortable with the knowledge that they are there to assist at any time. Thank you VoIPstudio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danyal Najmi",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T03:29:17.000Z",
          "Titre": "Just started using voip studio for my…",
          "Contenu": "Just started using voip studio for my company Rosetta Languages to set up our phone system.  They live up to all the great reviews!  Excellent responsive support every step of the way."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Clarise Balahadia",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T01:20:36.000Z",
          "Titre": "It was my first time using the…",
          "Contenu": "It was my first time using the VOIPStudio app & I can say that it's really worth the money to spend with & w/ very friendly & approachable Support System. I have a lot of questions with the Support but they answer me always directly which helps my VOIP experience much easier."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard P",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T08:46:18.000Z",
          "Titre": "Finally a company where you can pick up…",
          "Contenu": "Finally a company where you can pick up the phone and speak to a knowledgeable person without any phone ques.Very helpful company to deal with at affordable rates.."
        },
        {
          "Note": 5,
          "Lieu": "GE",
          "Pseudo": "Danil Yutish",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T12:33:19.000Z",
          "Titre": "Great service for VIOP telephony",
          "Contenu": "Great service for VIOP telephony. Good price. High quality connection! And most importantly, very responsive support. Thank you very much! I wish you much more prosperity."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ogi_CEO",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T18:57:04.000Z",
          "Titre": "I've got VoIPstudio on trial to see if…",
          "Contenu": "I've got VoIPstudio on trial to see if it fits the needs of my contact center.  So far, I'm happy with the functions and ease of use.  The calls are coming in clear too and I have not experienced any downtime.  They have an excellent Support team as well.  Kudos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Zhao",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T21:21:20.000Z",
          "Titre": "I have used VOIP.MS and Flowroute",
          "Contenu": "I have used VOIP.MS and Flowroute. VoipStudio is best in term of user interface and values.Only thing I like to be improved is the guide of the IP Phone SIP configuration should be posted on the WebSite.However the support is very fast on this."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Henry Davis",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T23:25:21.000Z",
          "Titre": "Great Calling Application",
          "Contenu": "Great Calling Application, also the feature of recording its too good for us. Best voice quality.Thank youHenry Davis."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Bullseye Agency",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T15:12:00.000Z",
          "Titre": "Great support",
          "Contenu": "However the platform is working fine, sometimes a little problem can happen.Contacting support via Chat is really easy, and a solution is there. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris Davies",
          "Nb_Reviews": 9,
          "Date": "2023-01-26T12:25:54.000Z",
          "Titre": "So far so good!!!",
          "Contenu": "So far so good!Just upgraded to the paid 2K plan after a month trial. I've used plenty of VOIP sytems and they always cause issues, this seems to be fine. One standout is the customer service. Any issues or questions i can get hold of someone easily to help. The team are friendly and incredibly helpful. Look forward to many years of happy use. Chris"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Stoycho Stoychev",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T07:26:58.000Z",
          "Titre": "Very nice tool at a very good price",
          "Contenu": "Very nice tool at a very good price. Easy and intuitive settings, clear and fair pricing, and a 30-day free trial to test it. The customer service is very helpful and responds fast to my questions. I am very satisfied and give it 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Portobello",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T14:48:15.000Z",
          "Titre": "Glad I found Voip Studio",
          "Contenu": "I found Voip Studio through Google. It is not on top of the search after typed in \"Voip\" into the search box. However,  I am glad I found it. I am happy with the call quality and prompt tech support. The cost is reasonablly affordable.  They have Voip Studio for business and Voip Home for residential use.  Making your choice base on your need for it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ruben Carol",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T10:25:01.000Z",
          "Titre": "VoIP Studios has great communication",
          "Contenu": "VoIP Studios has great communication ! As a first time user, they walked me through the steps to get up and running if 5 minutes. Anytime I have a question, I know that they are just a live chat away"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Fredrik Jessing",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:53:33.000Z",
          "Titre": "Easy to set up"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Kike Moronkeji",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T19:01:06.000Z",
          "Titre": "It's so convenient and makes it easier…",
          "Contenu": "It's so convenient and makes it easier to connect with customers. I like that it records call logs. This is a good way to track number of calls, duration etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N. Pereira",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:10:03.000Z",
          "Titre": "Helpful support",
          "Contenu": "Very helpful support that guided me through all the necessary steps to setup the system. The whole environment is very straightforward and easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "KG",
          "Pseudo": "Pierre",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T06:29:53.000Z",
          "Titre": "Great service, easy set up",
          "Contenu": "Great service, easy set up, Rainer was very helpful and jumped on a call with me to explain some of the features when I had questions. Recommended"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "E Stockdale",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T16:28:50.000Z",
          "Titre": "I have been using this service for a small business",
          "Contenu": "I have been using this service for a few months now, simple and easy to use plans, allowing me or my associates to be flexible with calling from a local number. Recommend the service for flexibility and local service numbers."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "BEZUIDENHOUT MELANIE ALICE",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T07:27:37.000Z",
          "Titre": "Great service, well advanced",
          "Contenu": "VOIPSTUDIO is a great one and its features are super good with advanced settings. Their mobile App is absolutely flexible to use no complications just simple with greater features."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T15:20:07.000Z",
          "Titre": "Excellent",
          "Contenu": "After searching for a VOIP caller, our problems were all solved once we came across VOIP Studio. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Rocio Villarreal",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T12:05:59.000Z",
          "Titre": "Renier has been great",
          "Contenu": "Renier has been great, always answered my questions in a matter of minutes, found me the best option and best price for what I needed."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Mac",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T10:38:31.000Z",
          "Titre": "This company helped us get the numbers…",
          "Contenu": "This company helped us get the numbers we need. They are responsive to tickets. Hopefully, they continue to provide good service."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Ebrahim Alhaj",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T15:17:48.000Z",
          "Titre": "I really happy to work with VoIPstudio…",
          "Contenu": "I really happy to work with VoIPstudio since 2020 for my personal use, but now more happy to work with them for my business Codemina Ltd UK very efficient service and quick support."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Alaita",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T20:24:55.000Z",
          "Titre": "I got excellent support on setting up…",
          "Contenu": "I got excellent support on setting up and the service has generated good lead and conversion for my business. I am so pleased I chose VoIPstudio."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steven Eccles",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T18:24:19.000Z",
          "Titre": "quick set up",
          "Contenu": "quick set up, tons of features that are extra costs elsewhere, Really impressed so far!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Birkhill Taxis",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T19:23:02.000Z",
          "Titre": "I said best service ever any issue they…",
          "Contenu": "I said best service ever any issue they solve very quickly and guy I don't know his but .... Best guy on customer service ever .... never seen any one behind the phone top man .... save so much time"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "José Manuel",
          "Nb_Reviews": 7,
          "Date": "2022-12-03T03:28:17.000Z",
          "Titre": "Excellent VOIP solution",
          "Contenu": "The sound quality of the Voipstudio it's great. It allows, at a reasonable price, call worlwide over VOIP."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Norised Deltoff",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T20:15:11.000Z",
          "Titre": "I have using VoIPstudio for a number of…",
          "Contenu": "I have using VoIPstudio for a number of months and I am very happy with the service and quality of calls. Affordable and good quality service."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Abdullah Noor",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T00:35:57.000Z",
          "Titre": "Easy to use",
          "Contenu": "We are facing some distortion some time. But overall its amazing, easy to use and all features are outstanding."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nigel Cross",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T10:09:13.000Z",
          "Titre": "Feature Rich Service",
          "Contenu": "VoIP Studio offers all the features you would want in a VoIP system all at one affordable price. It is also very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Strahil Aleksandrov",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T21:23:11.000Z",
          "Titre": "from my experience so far I can say…",
          "Contenu": "from my experience so far I can say that they are serious and that their systems work"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Vipul Chavda",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T19:08:29.000Z",
          "Titre": "Excellence VoIPstudio service",
          "Contenu": "I have recently use VoIPstudio service. their support system is very excellence. they have done very good job supporting my business. 100% Recommended."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Abdullah khan",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T14:05:00.000Z",
          "Titre": "compare to other voip providers",
          "Contenu": "its very easy to dial from voipstudio manually and also you get the recordings of all calls and my overall experience with voipstudio is very good cmpare to other voip providers thats why i like it."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "CHI WAI YAU",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T07:02:05.000Z",
          "Titre": "Very good",
          "Contenu": "Very good, he really worked well and solved the problem of telemarketing for our business."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Mattias Comploi",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T19:29:58.000Z",
          "Titre": "Very easy to use and love how much you…",
          "Contenu": "Very easy to use and love how much you can personalize. Customer service is awesome too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yoav Chudnoff",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T23:34:01.000Z",
          "Titre": "Works well without issue from desktop…",
          "Contenu": "Works well without issue from desktop and mobile. Trying to get a grasp on SFDC integration."
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Andreas",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T11:31:14.000Z",
          "Titre": "Awesome service got it working on my…",
          "Contenu": "Awesome service got it working on my desk phone really fast and everything works as intended."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "al o",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T10:18:43.000Z",
          "Titre": "The best app with a tremendous team…",
          "Contenu": "The best app with a tremendous team want to thank Nike for his swift response and amazing help"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T15:19:21.000Z",
          "Titre": "Straight forward voip system",
          "Contenu": "Straight forward voip system, easy to use, great on hand customer service, clear line, and affordable for anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T19:52:46.000Z",
          "Titre": "Easy to enroll and great for starting…",
          "Contenu": "Easy to enroll and great for starting small business and having an official business line."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Patrik Frei",
          "Nb_Reviews": 3,
          "Date": "2023-04-04T11:17:15.000Z",
          "Titre": "Support is very quick and free test…",
          "Contenu": "Support is very quick and free test version really helps to check if service works for you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel Bolton",
          "Nb_Reviews": 3,
          "Date": "2023-01-25T18:41:19.000Z",
          "Titre": "Great response to any queries we have",
          "Contenu": "Great response to any queries we have. Easy porting of number. Still so many features we need to learn"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom T",
          "Nb_Reviews": 5,
          "Date": "2023-03-24T15:48:06.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support! Peter was really great and helpful. The best VOIP provider we ever had."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Winterburn",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T15:03:19.000Z",
          "Titre": "Great efficient service",
          "Contenu": "Great efficient service, they give you a generous free trial credit and their pricing is very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anshuman",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T19:01:39.000Z",
          "Titre": "Very complete feature set delivered…",
          "Contenu": "Very complete feature set delivered through a powerful platform at economical price. Knowledgeable, responsive support team. Perfect for startups!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Mckeen",
          "Nb_Reviews": 9,
          "Date": "2022-04-05T20:33:30.000Z",
          "Titre": "Easy to set up account and friendly…",
          "Contenu": "Easy to set up account and friendly knowledgeable team to help when required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cyan Consultants Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T21:19:50.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Excellent Customer Service, a lot of services to choose from and numbers available anywhere in the world."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Connor Training",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T09:22:41.000Z",
          "Titre": "VoIP integration with CRM",
          "Contenu": "in our digitization process the software has been a godsend, we are using it with the integration with Zoho CRM and it is just awesome"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Wezley Westwood",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T15:34:27.000Z",
          "Titre": "Great for collab, at fair prices",
          "Contenu": "Great for my company, to collab with employees, with fair charging rates"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Oleg Troyanovskiy",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T17:45:14.000Z",
          "Titre": "Voipstudio is great VoIP company",
          "Contenu": "Transparent and versatile options in services. Easy to use. Cheap Rates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Uintah FP",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T03:32:03.000Z",
          "Titre": "Mostly intuitive set up",
          "Contenu": "Mostly intuitive set up, many features and good controls of processes."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Habib Nuri",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T05:08:02.000Z",
          "Titre": "The call Quality and the customer…",
          "Contenu": "The call Quality and the customer support was the best experience that I had."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Artem Arzamasov",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T09:50:48.000Z",
          "Titre": "excellent service with a really good…",
          "Contenu": "excellent service with a really good priceI can recommend"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Andrew Ley-Greaves",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T19:42:17.000Z",
          "Titre": "Renier at customer support was…",
          "Contenu": "Renier at customer support was excellent and talked me through the set-up procedure.Many Thanks, Renier."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Tetiana",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T06:44:30.000Z",
          "Titre": "so far I LIKE EVERYTHING",
          "Contenu": "so far I LIKE EVERYTHING, GOOD SERVICE, GOOD TECH SUPPORT"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Martijn Hoogland",
          "Nb_Reviews": 2,
          "Date": "2023-04-26T00:10:40.000Z",
          "Titre": "Support replies quickly",
          "Contenu": "Support replies quickly, and the dashboard works great"
        },
        {
          "Note": 5,
          "Lieu": "TN",
          "Pseudo": "Alex Rodman",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T20:51:00.000Z",
          "Titre": "Good services and high quality"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Phone-A-Taxi",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T22:11:03.000Z",
          "Titre": "Great service",
          "Contenu": "Customer support is outstanding Great service from start to finish 👏"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "inigotest estradar",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T01:25:54.000Z",
          "Titre": "Perfect experience with VOIPStudio",
          "Contenu": "Perfect experience with VOIPStudio I Can wait to get calls and start with this magnificent experience"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ellen",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T18:36:23.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, easy to use software."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lyndon Beard",
          "Nb_Reviews": 16,
          "Date": "2023-03-01T17:58:33.000Z",
          "Titre": "Able to set up quickly efficiently"
        },
        {
          "Note": 5,
          "Lieu": "XK",
          "Pseudo": "Petrit Bahtiri",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T18:59:04.000Z",
          "Titre": "Good Connection",
          "Contenu": "The Work with it and thr connection are very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee Suarez",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T06:39:09.000Z",
          "Titre": "good pricing",
          "Contenu": "good pricing, easy to navegate and fast customer support"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Spyros M.",
          "Nb_Reviews": 3,
          "Date": "2023-04-24T11:16:37.000Z",
          "Titre": "Great support",
          "Contenu": "Great support! The cloud software is very easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "RAMP VIRTUAL SERVICES SOLUTION",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T09:17:55.000Z",
          "Titre": "Very good dialer",
          "Contenu": "Very convienient, cost effiecient, user friendly."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Adler Group",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T21:15:09.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful. System seems to work well."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Matthias Pyck, CIO Agioglobal",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T18:09:26.000Z",
          "Titre": "We were looking for a easy and good telephone experience",
          "Contenu": "We were looking for a easy telephone solution. After doing some comparision we immediatly experienced a completely different experience. Fast responses to our questions, fast onboarding, extreme user experience. Easy interface and a nice price setting. At last I felt very satisfied as what should voip be. Receiving call, doing calls and transferring calls with ease. And with a great quality. VoIPstudio prooves what they offer!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T12:07:36.000Z",
          "Titre": "Excellent Service!",
          "Contenu": "My Company has been looking for a VoIP provider for some time and we have trialled every provider possible and we found VoIPstudio to beat them hands down!Their pricing is affordable and they do not restrict features. Calls are clear and crisp, and unlike other providers who have a lag, you do not get a phone echo.We've requested to port two numbers into VoIPstudio and their support is excellent, they reply within under an hour."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris Smith",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T14:24:41.000Z",
          "Titre": "A great sea-change for Print Team",
          "Contenu": "Having been with our previous provider for many years and noting that they held our VOIP as a grey, no-go area, we have been delighted to change over to Studio-VOIP and stand amazed at Anthoni's skill in sorting out our system in such a short time. Nothing was too much bother for him and we now have a system set up that's much better than before with none of the enigmas."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "tony iannone",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T17:19:20.000Z",
          "Titre": "Excellent application and support",
          "Contenu": "Excellent application and support ! increase business contact with their good quality"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sierra Golf First aid Group",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T20:30:31.000Z",
          "Titre": "Establishing First Aid on call - Spanish Urbinization",
          "Contenu": "VOIP assisted us in forming and establishing  an on call/forwarding for The First Aid Group response team for our Spanish Urbanization.  People now in need of first aid can easily phone and receive immediate care and attention.  Great service from Antoni at VOIP, Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Maughan-Brown",
          "Nb_Reviews": 1,
          "Date": "2020-09-17T13:55:20.000Z",
          "Titre": "Free trial period seriously impresses.",
          "Contenu": "I have just finished the 30 day free trial with VolPstudio. Having done quite a lot of research I am confident that their offer is, on paper, the best on the market. The free trial period has convinced me that in practice they are as good as they look on paper! In particular, their support is very impressive: prompt, friendly, thorough and effective. At this stage I would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Victor",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T17:44:38.000Z",
          "Titre": "I wanted to test the VOIP technology…",
          "Contenu": "I wanted to test the VOIP technology and looked for a VOIP provider from anywhere in the world. After reviewing many companies, I was really lucky to find voipstudio.com The website is quite impressive and the prices for the service and the international call rates are quite reasonable.I signed up for the service and I am glad I did."
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "Claudiu Antonio Mihai",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T13:19:27.000Z",
          "Titre": "Fantastic  Service",
          "Contenu": "Fantastic  ServiceMy Account manager was very polite and very prompt I received an email and a call straight after i finalized my account.They're platform is user-friendly and easy to use and to deposit.Very clear information and very organized.Im very happy so far.Regards"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "giovanni",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T18:40:37.000Z",
          "Titre": "but it's great",
          "Contenu": "but it's great! the android app, creates a caller log on the default app (dialer) of the smartphone !! in this way I can share the caller's number and have other functions that I have on the default app and I can call with my Italian mobile. Buy Italian number immediately."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "NIKO DIMO",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T16:44:39.000Z",
          "Titre": "The best customer service",
          "Contenu": "The best customer service, self managed platform and excellent features."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Benjamin Wlodawer",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T21:03:34.000Z",
          "Titre": "its a great app",
          "Contenu": "its a great app, easy to set up and works perfect"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Ian Scott",
          "Nb_Reviews": 4,
          "Date": "2021-10-21T03:52:13.000Z",
          "Titre": "Great Service/Great Support!",
          "Contenu": "Great Service/Great Support!I recently spent some time researching how I could port my landline to a VOIP service due to some circumstances that have left me away from my office. I eventually landed on VOIPstudio - and was very impressed with the support I received and how quickly my questions were answered.I especially loved the fact that they have an app for Linux operating systems which was a HUGE plus for me - that's all I use on my desktop PC and laptops.I've now been using their service for a week - phone calls are crystal clear, no drops, and I couldn't be happier knowing I'm no longer missing business phone calls."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ajith T",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T08:30:07.000Z",
          "Titre": "Fantastic voip service",
          "Contenu": "HiWe are using voipstudio for our international customer service desk. It is a fantastic interface with lot of user friendly options. Admin console and call center desk available. We really recommend voipstudio for those who are searching for a professional support"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Rick Ruiz",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T17:39:58.000Z",
          "Titre": "Best voip service I've used",
          "Contenu": "Best voip service I've used in the last ten years.  Hands down!  Customer service is top notch.  Got big help from the rep Alphonso while I was setting up the phones.  I'm sure I'll stick with voipstudio for the long run."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "NEtasha sharma",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T22:02:21.000Z",
          "Titre": "AMAZING SERVICE",
          "Contenu": "AMAZING SERVICE , BEING IN A CALL CENTER INDUSTRY AND TO GET SUCH SMOOTH SERVICE IS GREAT , I AM HAPPY USING VOIP STUDIO FOR THERE IVR AND CALL RECORDING AND LIVE RECEPTION FEATURES , LOOKING FORWARD TO USE IT IN FUTURE TOO . I HIGHLY RECOOMEND IT ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T23:52:41.000Z",
          "Titre": "VoIP studio is a great system",
          "Contenu": "VoIP studio is a great system for the coop user looking for all the functionality needed to run a call que etc and a reasonable price to get it up and running.  The chat support is always quick and helpful.  I always turn to VoIPstudio"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Albert Cox",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T19:44:39.000Z",
          "Titre": "Absolutely brilliant",
          "Contenu": "Absolutely brilliant. Was recommended to use 2 companies for Voip. The first one was okay on the phone, but this one was superb. The reason I say this was because the guy on the phone was exceptionally patient with me, stayed on the phone and answered all my questions (which there were a huge amount, as I knew absolutely nothing about Voip).Took the trial and when it was near the end phoned up again and spoke to another guy from the technical team who again, was extremely patient with me and talked me through every aspect of the Dashboard and how to access info etc.I'm not one for reviews, but this is massively warranted. Very pleased and just signed up on an ongoing monthly basis."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Real Estates Vision",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T15:03:57.000Z",
          "Titre": "Every thing is good up to now.",
          "Contenu": "Every thing is good up to now.Best wishes Saleh Alselami"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Darren Arrowsmith",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T14:49:45.000Z",
          "Titre": "Very simple to set up and use also very…",
          "Contenu": "Very simple to set up and use also very good prices"
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Cyrus Vaziri",
          "Nb_Reviews": 3,
          "Date": "2022-03-23T17:31:47.000Z",
          "Titre": "Affordable, functional VOIP",
          "Contenu": "Good documentation, relatively easy to get started with the basic services, straightforward pricing models."
        },
        {
          "Note": 5,
          "Lieu": "UZ",
          "Pseudo": "Zizi",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T16:40:10.000Z",
          "Titre": "Great quality"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Kees van Veen",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T17:45:12.000Z",
          "Titre": "Same offer everywhere, but service / features ?",
          "Contenu": "Everybody can offer the same product, however service matters, and that's exactly where VOIPstudio makes the difference.Furthermore about the product, it is pretty feature rich !"
        },
        {
          "Note": 5,
          "Lieu": "TZ",
          "Pseudo": "VICTOR EVARIST",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T06:48:22.000Z",
          "Titre": "It was a simple process in registration…",
          "Contenu": "It was a simple process in registration after that I found a very supportive live support that offered great assistance, in a very significant time. They are reliable and provide what they say they do."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Armand Pers",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T14:11:10.000Z",
          "Titre": "easy and intuitive",
          "Contenu": "so far so good, easy to setup, intuitive interface and excellent support (live chat and tickets). web app, browser, and phone app, all working fineThe setup was smooth and straight forward"
        }
      ]
    }
  ]
}