{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "vr-wave.store",
      "Review": [
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "bridie dundon",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T13:14:52.000Z",
          "Titre": "VR Wave are unthrustwordy",
          "Contenu": "One week on and we are still missing money that vr wave have held and absoloutley no corerespondence from vr wave"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "bridie dundon",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T08:47:43.000Z",
          "Titre": "Vr wave are not trustworthy and are scammers",
          "Contenu": "Vr wave took money from my paypal account and i recieved no comfirmation email from them and they deny taking the money. It showed Antony e commerse instead of vs wave. 250 euro gone from my account;im going to attempt to retrieve my money by contacting paypal. Do not trust these scammersI replied to vr wave by email and got no response and they gave me no order number and are denying the recieved  my money. Kindly check the reciept attached and i have correspondence from the bank showing vr wave took my money 2 times one was reversed and the other one is still pending, there was no attempt to rectify this from vr wave they gave no reference number and im still missing money for a purchase i made and it was never acknowledged. I have heard nothing more from vr wave since i replied to there email and i can prove this as i took screenshots"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Broome",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:55:56.000Z",
          "Titre": "Ordered on 10/10",
          "Contenu": "Ordered on 10/10. It is now 11/24 and I still don't have them. Disappointing. This is not what was advertised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ribbon HeartVR",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:26:15.000Z",
          "Titre": "Wish they could have worked for me.ough with the…",
          "Contenu": "Mine initially came through with the incorrect prescription on one lense. I sent in a request to support to have it replaced, which they did. However, this lense was also an incorrect prescription. When I sent to ask to have it fixed again, they sent me a video to show me how to \"put the lense in\"....So I kinda gave up at that point. (and no, I wasnt putting it in wrong)I really wanted these to work, but sadly I'm at least going to be taking my business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rocky “Rocky B” Beats",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T14:56:49.000Z",
          "Titre": "weak customer care",
          "Contenu": "I accidentally ordered the wrong product. They do not accept returns or give refunds in that case. I can't even resell the lenses it's illegal. I'm just out $114.I found another competitor company that would have accepted a return and fixed the mistake and purchased from them. This is the difference between being money focused vs customer focused."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PAPAYA",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T03:54:39.000Z",
          "Titre": "Took a whole month to get my lenses",
          "Contenu": "Took a whole month to get my vr glasses. Customer service was unhelpful until I pretty much had to reach out 5 times to get some kind of help. My first shipment was stuck in transit and no one helped me and all they would say is \"we will keep a look out on it\"... horrible service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Mark Whitcombe",
          "Nb_Reviews": 12,
          "Date": "2023-06-19T15:23:32.000Z",
          "Titre": "ordered lenes for the psvr2 was told i…",
          "Contenu": "ordered lenes for the psvr2 was told i would receive an email 6 - 8 days after ordering telling me the delivery date. 2 weeks later still no email and there customer service team is awful. buyers beware do not use this company total scam. there are far better companies offering the lenes and much much betters service. they ask you to contact there customer services and then dont reply will never use again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:46:31.000Z",
          "Titre": "Wrong prescription made",
          "Contenu": "I ordered prescription lenses for my Quest 2. I triple checked all info was correct and included a photo of the prescription from the doctor’s office as asked. Two weeks later when they arrived, I followed to video instructions, pausing at each step to make sure I did it correctly. Put it on and everything was blurry as it is normally without my glasses on. Emailed the company and they replied that I must have installed them incorrectly and told me to follow the video instructions. I included a photo of the card they included in the box with what prescription lenses were made and none of the information was what I gave them. They have not offered a refund or a replacement."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T08:41:39.000Z",
          "Titre": "Ordered two pair but received only one…",
          "Contenu": "Ordered two pair but received only one pair. Customer support not replying back although I have been following up for over two weeks now. Very unfortunate experience with VR Wave knowing that I have been a customer for many years..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl Ricard",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T01:19:55.000Z",
          "Titre": "Lenses insecure in HP Reverb G2",
          "Contenu": "Purchased these lenses with the expectation they would correct my vision with the HP Reverb G2 headset. The improvement wasn't as good as I expected; but, even worse, the right eye piece wouldn't stay on the Reverb Lense, it kept falling off. I actually had to tape it in place. I emailed the problem to VR support, and they asked me to make a video of it and send it back. Obviously, that was their way of deterring a customer complaint. I will be ordering a new pair of lenses from another source that has magnetic attachment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T18:54:14.000Z",
          "Titre": "Good lenses painful fit",
          "Contenu": "Prescription came in correct.Lens/lense holder put a ton of pressure on each side of my nose where they contact. Very painful and uncomfortable. I can't play with them on at all. The magnets are nice, but leaving the bands on also put the same pressure on friends who don't need prescription lenses. Big waste of money because I can't enjoy playing while they're on."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jay Broughton",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T22:22:02.000Z",
          "Titre": "These are the worst vr accessory I have…",
          "Contenu": "These are the worst vr accessory I have had the misfortune of coming across.  A prominent sim racing you tuber recommended them so I jumped on it.  I can't speak for other headsets but for the reverb g2 they are shocking.The pair I received came well packaged but the lenses themselves do not fix to the headset correctly and when they do semi hold on the glass itself falls out.  Not as advertised.  I have a new set from a different company inbound but they can't be any worse."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy K Busch",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T18:57:03.000Z",
          "Titre": "Worst product experience ever!",
          "Contenu": "The lenses sent to me didn't fit on my headset, I immediately reported it to support amd have been going back and forth with support for 2.5 weeks with no resolution. I just want my $68 back and am now getting ghosted! Worst product experience ever!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha Knepper",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T07:01:49.000Z",
          "Titre": "VR Wave perscription lenses are terrible git.",
          "Contenu": "The vision improvement is great but make the quest 2 to uncomfortable to wear for even 5 minutes. Tried returning all Vr wave would say is try glasses spacer or move lenses out. Like I didn't try that before emailing the first time. They would not even return email after the first email. They won't take them back. VR Wave perscrition lenses are horrible and customer service is even worse!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Lopez",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T16:35:55.000Z",
          "Titre": "Awful service, go to reloptix!",
          "Contenu": "I thought the Index was going to be magnetic, but instead they are press on. As well as taking two months for them do arrive. My roommate ordered from reloptix and they were magnetic, correct prescription, cheaper cost, and arrived within reasonable time. Do your research, as I will not be ordering again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Fairbanks",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T22:37:34.000Z",
          "Titre": "Never arrived",
          "Contenu": "They shipped 14 days ago with “priority” shipping through DHL. DHL despite having the correct address keeps refusing to deliver, despite having contacted them many times. And VR waves customer support refuse to acknowledge my request to cancel and refund the order. Do not order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S P",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T05:20:42.000Z",
          "Titre": "RUN AWAY!!",
          "Contenu": "RUN AWAY!!Received defective lens without a magnet, making it unusable. Four unanswered emails to support now. Do not buy from this company!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie Cakez",
          "Nb_Reviews": 6,
          "Date": "2023-05-05T01:00:22.000Z",
          "Titre": "Don’t bother",
          "Contenu": "The adapters are extremely difficult to put onto the quest pro because they have too many imperfections. Neither side has come out of their mold correctly. They also have the magnets placed incorrectly and lopsided so the rx lenses that stick on once the adapters are installed, do not sit flush creating an incorrect prescription angle/axis. The lenses themselves don’t look great or provide much clarity. The plastic they’re made of also rub black paint onto my face even after cleaning them repeatedly. It took me over half an hour to get the adapters on and I was only successful because I warmed the plastic slightly so they would fit over the quest pro gasket and into the grooves. (Yes I watched the installation video multiple times). I’ve been wearing glasses for 35 years and had many types of lens adapters for all kinds of devices and do not consider myself new to clicking pieces of plastic together. If you’re a multi player household and need to remove the magnetic lenses for each user, you’re not going to have a good time with these. They’re extremely finicky and fall off with the lightest touch or movement of the pd. I purchased from here because they were the only store with quest pro lenses available for purchase and regret it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trish Ciaffone",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T22:01:16.000Z",
          "Titre": "Did not fit, damaged VR lens, company ghosted!",
          "Contenu": "My son got a set of these things, the Rx is correct, but they did not fit his VR headset. He contacted the company and sent them a video to show them the issue. The lenses have scratched his VR screen because of the poor quality and being the wrong size. After a couple of exchanges, the company has not responded to him in over a week. Beware! If yo do have problems, you are probably SOL! (Edit: they emailed my son and told him to break the lenses and video it then send them the video. He responded by pointing out their return policy says they will only issue a refund if the lenses are returned in the same condition they were received in. Interesting. So no, we will return them intact, in the packaging, the printed box as they were received. SMH...)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Falzarano",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T04:36:43.000Z",
          "Titre": "I sent them my prescription",
          "Contenu": "I sent them my prescription, when I got the lenses the right eye was blurry. They told me to take them to my eye doctor to verify the prescription. My eye doctor said that the PD was not correct. They blamed me for the mistake and said they could not refund me. Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Bond",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T23:40:55.000Z",
          "Titre": "Buyer Beware.",
          "Contenu": "I have purchased 3 sets total. 2 sets for my Oculus 2. They work great. The third set was for my Reverb 2. It didnt last a week. The rubber/plastic holding the lens has deformed. Every time I try playing the right lens falls off. Now the lens has actually come off looks like its glued in 3 spots. I contacted support and they sent me to the install video. That was 3 days ago and Havent heard anything back. I dont know how there are so many good reviews for this product. If you go the Youtube video for the installation there are comments about the same issues I have had. It is a common problem. Please beware!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NN_SixtyEight",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T12:51:13.000Z",
          "Titre": "Very bad after-sales service",
          "Contenu": "An update on the review I initially left (below this text). Since I posted the review, VR Wave added a reply to the review which was very polite and asked me to get in touch so they could sort the problem out quickly. I did get in touch, four more times over 2 weeks and have received no communication back from them. It's clear that they use their reply on bad reviews to make it look like they quickly deal with issues but I can tell you this is not the case. I am still waiting for the correct order to be sent to me.Here's my original review...I ordered a pair of Quest lenses and due to my eye prescription being slightly strange (I have issues with my left eye), I followed up with an email explaining that although my prescription did not exactly match my order, I wanted the zero magnification lens for my left eye (to use as a lens protector). They replied quickly saying no problem. They shipped as per my prescription which is not what I asked for so I contacted them and did not receive a reply. I have since emailed them four times and not had a response. They were very quick to reply before I paid but once my money was in, nothing - not impressed. However, I must say the product itself is great."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Leave me alone",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T06:20:26.000Z",
          "Titre": "Constant spam",
          "Contenu": "One purchase from this company and they will send spam almost daily as though this is the type of product purchased weekly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Carpenter",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T10:28:56.000Z",
          "Titre": "Do not buy from VR Wave",
          "Contenu": "Do not buy from VR Wave. They are a scam company. I bought my lenses on December 29, 2022. Said they would be shipped within 2 weeks. I inquired about what was going on the 16th of January and they said they were going to work on it. Package says it is still in transit from Hawthorne, CA and has not moved in a month. I will be telling everyone in the VR Community to watch out and do not buy from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AZWildkat",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T22:08:36.000Z",
          "Titre": "Just received my lenses - JUNK",
          "Contenu": "Just received my lenses. Piece of junk. Lenses pop-out of rubber support and do not stay secured.  Lenses do not attach to HP Reverb G2 so as soon as you try to put headset on, the lenses pop off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cj christerson",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T20:41:09.000Z",
          "Titre": "Good lenses, terrible customer service",
          "Contenu": "Update: They responded immdeiately to my review but it still took them a few hours more to actually send that email. Theyre sending a return label, trying out the lenses in the meantime in hopes it'd change my mind. Honestly though i havent really noticed a difference between these $70 vrwave lenses and the $20 lenses i got from amazon. Im sure if i actually needed a glasses prescription that these can come with these would be awesome, but for just the anti blue light and anti glare i havent noticed a difference at all honestly. Will update to 3 stars at least once i actually get the return label, send it back and get refunded-------------------------------------------I saw/heard about how good these lenses were from VR youtubers, these looked good so ordered them for the anti glare/blue light stuff, didnt need the glasses prescription part of it so it hurt that they were still $70 after shipping but still ordered anyways. Saw the same kind of anti glare/blue light lenses on amazon for $20 and ordered those in a heartbeat since its way cheaper since i didnt need the prescription part. Tried cancelling my order via support email and chat on the 12th. Today i still got this order anyways, never got an email back from support (after being told to contact the support email specifically by the chat on here) and still got charged the $70 anyways. Emailed support AGAIN and still not a single word from them. The lenses from here are good sure, but really only a better option than the MUCH cheaper alternatives if you need the prescription part as well, if not the cheaper versions on amazon work just as well and their customer support wont screw you over."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T05:53:20.000Z",
          "Titre": "Where is my order",
          "Contenu": "Where is my order? I'm still waiting over a month for it to be delivered. Of course wanted with you many times but have not heard back once. What is going on with your company? Is this all just a scam?? Where is the product I paid for?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 3,
          "Date": "2022-09-07T17:15:07.000Z",
          "Titre": "Terrible for the Reverb G2",
          "Contenu": "Ordered these for my Reverb G2.  First, one lens was not in the holder, second they don't fit over the G2's lens.  At this point a total waste of money.  I am just glad that I didn't damage the lens on my G2."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VENTURA-POLANCO",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T02:05:14.000Z",
          "Titre": "Hasn’t even arrived yet",
          "Contenu": "Hasn’t even arrived yet, and its been over a month waiting, and when i get in contact with them, all they have to say its: “it’s going to be fulfilled in the 1st of April” I know that we are still in the 1st week, but I will be moving out of my current address soon, and I don’t want my stiff to be lost in the mail!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T13:51:56.000Z",
          "Titre": "Very unsecure and constantly fall off",
          "Contenu": "Very unsecure and constantly fall off. It was a waste a money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen L",
          "Nb_Reviews": 2,
          "Date": "2022-08-18T01:40:32.000Z",
          "Titre": "Lenses don't fit under quest 2",
          "Contenu": "Lenses don't fit under quest 2. Even with spacer they press on my nose so hard it's painful."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nicholas Pantelas",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T03:11:33.000Z",
          "Titre": "I don’t know",
          "Contenu": "I ordered the Meta Quest 2 lens with the meta-quest pro lens came instead"
        },
        {
          "Note": 1,
          "Lieu": "MT",
          "Pseudo": "Reuben Bonnici",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T19:12:35.000Z",
          "Titre": "I saw many reveiews on youtube so I…",
          "Contenu": "I saw many reveiews on youtube so I decided to buy. It shipped from China and what I got was not a branded and a different version than all the reviews on youtube. It doesn't even fit properly on the lens. Just looks like a fake item but I booked from what should have been the official shop. Totally disappointed and they never answered me back after I complained."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shiloh",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T23:09:40.000Z",
          "Titre": "I purchased these lenses for $138.00",
          "Contenu": "I purchased these lenses for $138.00.  My nose hits the lenses and moves them off of the magnets quite frequently.  Very frustrating!  Now VR Wave wants me to spend an additional 30 plus dollars, plus shipping, to buy their face cushion to fix this problem, so then I will be over $170.00.  I could barely justify spending $138.00 the first time.  I didn't know that this was an issue otherwise I wouldn't have bought the lenses!  Not happy!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 7,
          "Date": "2022-04-09T18:05:04.000Z",
          "Titre": "finally got my halo strap",
          "Contenu": "finally got my halo strap. What a disappointment, when trying to tilt up the headset the whole thing slides off my head. You can tighten the strap tight enough to get a headache but still comes off. Very difficult to line up the sweet spot on the lenses and then when moving you loose it. Do not waste your money on this headband."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TW",
          "Nb_Reviews": 2,
          "Date": "2022-03-09T15:17:02.000Z",
          "Titre": "I should of listened to other reviews…",
          "Contenu": "I should of listened to other reviews but thought they were exaggerating. BUT THEY ARE NOT. I received an emal product had shipped than received an email it is at the shipping dock to ship and that a tracking number would be sent. Never received the tracking number. Hopefully I will get my product. A little worried due to other reviewers never got theirs. Wish I never ordered the lenses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Humphrey",
          "Nb_Reviews": 2,
          "Date": "2022-03-06T00:59:50.000Z",
          "Titre": "Absolute garbage",
          "Contenu": "Absolute garbage, the Plano is not magnetic, ok fine but these will touch your eye when attached, let me repeat they will touch your eye when attached, and that is if you can get them attached with the lense still inside, they fall out the gasket immediately. I demanded a refund as soon as I got them and all they sent me was a how to video, I will be calceling my card and declining the purchase , while ASLO contacting the better business bureau."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Gordon",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T05:19:26.000Z",
          "Titre": "Reverb G2 lenses are garbage",
          "Contenu": "Reverb G2 lenses are garbage. Cheap material lack firmness to hold lens and remain in place. Not possible to secure lens in correct position without falling off or moving. One lens fell out while placing on HMD. Can not get it back in retainer. Set is useless and VR Wave support does nothing to address the problem. They send me videos of how the lenses 'should' work then ignore my concerns and comments.VR Wave refuses to take the product back or refund my money."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Samantha Kreger",
          "Nb_Reviews": 6,
          "Date": "2022-01-17T03:17:18.000Z",
          "Titre": "So far, not a great experience",
          "Contenu": "So far not a great experience. The product hurt the bridge of the nose and I’ve heard the same from other reviews. Have asked for a refund. They have provided suggestions to fix, but I told them I’ve done them all. They asked me to send a video. I asked if I could just send back and be refunded. No response yet. Not feeling great about what the outcome is going to be."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Benjamin Liang",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T04:59:09.000Z",
          "Titre": "Bad product quality and customer services",
          "Contenu": "My order doesn’t match up my daily eye glasses prescription. I provided my prescription document with the order, but the lenses I received are blurry. I contacted the customer service by email. I don’t receive a reasonable answer regarding my order issues. The products are bad, so are customer services!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken Williams",
          "Nb_Reviews": 5,
          "Date": "2022-04-01T03:19:19.000Z",
          "Titre": "Completely screwed my order and won't resolve the issue.",
          "Contenu": "Sent me the wrong prescription; sent me back a single correct lens.  I purchased blue light addons that were missing from the lens as well.VRWAVE lies to paypal during dispute and I've had to file a chargeback with my bank.  BEWARE OF THE POOR QUALITY QA AND CUSTOMER SERVICE."
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "Filip J",
          "Nb_Reviews": 3,
          "Date": "2021-12-22T08:05:44.000Z",
          "Titre": "AVOID LIKE PLAGUE",
          "Contenu": "I bought prescription lenses for oculus quest 2 and paid for faster shipping. Instead of getting them in 16 days as advertised, I waited more than 30 days and never got them. Support team was rude, basically said \"we dont care\" and offered to refund 3% of the price I paid which doesnt even cover shipping expenses. AVOID THIS STORE!!!EDIT: we already discussed this via email which costed me a year of my life. No thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ricardo Moreno",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T04:23:50.000Z",
          "Titre": "I order my lenses for oculus on…",
          "Contenu": "I order my lenses for oculus on November 30 , you send me a email to know and review my purchase, well I didn’t receive nothing yet no even updateds for shipping, just wonder how much longer is going to take , every day when I check for updates all I see is this : Your package is on its way to a USPS facility. Sign up to get updates, and we'll send you a delivery date and time when available., very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh DiGiallonardo",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T10:36:17.658Z",
          "Titre": "I ordered these weeks ago and have received no updates",
          "Contenu": "Since this company has decided to keep me in the dark in terms of where my order is, I will be leaving a 1 star rating. They did reply to my first email where I was trying to get shipping information or an update of any kind. They blamed it on supply chain issues, yet I had received what appears to be an automated update that stated my order was in the final stages of production weeks ago. If I do not hear from this company soon, I will be disputing the charges with my bank and moving on to a more communicative company that is willing to provide me with necessary information on my order."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Luis Cespedes Lacasa",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T14:45:54.000Z",
          "Titre": "I received my lenses today and when I…",
          "Contenu": "I received my lenses today and when I put them into the quest 2 and I see worse than without them. I checked the order and they make my lenses with the near vision values. I think that the settings to use are the ones for far vision. Its true that the values I put in the order where the near vision ones but they told me  to send my prescription and they didnt correct my choice so I´m not sure where is the mistake. They are now useless ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Groshans",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T17:29:46.000Z",
          "Titre": "Still don't have the product",
          "Contenu": "Still don't have the product. And I have no idea where they are and how much longer I have to wait for them. One thing I'd like to recommend would be to keep your customers up to date on where their packages are. Don't have to go as crazy as Amazon where we can literally see where our package is. You could just send an email here and there informing us that the package has been shipped or that it's out for delivery just something so we know that the package didn't just fall off the face of the earth."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Dean R English",
          "Nb_Reviews": 4,
          "Date": "2021-07-15T21:25:55.000Z",
          "Titre": "Very painful.",
          "Contenu": "Terrible……can I see better, yes. Are they comfortable, no. If I can’t use them for more than a couple minutes before the pain sets in they are useless. They dig into my nose and forehead. I solved this by filing down the top magnet post and rounding off the sharp inner sides. I shouldn’t have to do this and is a major oversight. If you have larger IPD and can set them to setting 3 on the Q2 then you wouldn’t have an issue. I have a 61 which is average."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Skip R.",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T15:57:38.000Z",
          "Titre": "Goggle vision is worse than without the lenses",
          "Contenu": "Got the DJI FPV lenses.They needed a long time to make them.My vision through the DJI goggles is worse than before.I am far sighted and gave them all the required numbers.Wearing the goggles, the parameters on the left and right side of the screen are blurry.In addition I have to move the goggles up on my face very high in order to see the center part clear.They made the focus point way too low on the lenses.They are not worth the $105 I paid.From what I am reading in the reviews, their customer service is not up to par and I'll dispute the charge on my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris A.",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T23:16:12.000Z",
          "Titre": "No support team helped fix my issue.",
          "Contenu": "I ordered the set for the HTC Vive Cosmos Elite from them about a month ago, but they sent me two different lens caps. I also tried to get in contact with their support team before the holidays in order to remedy this. They asked for pictures and videos of the set so I sent what they requested, but they responded with an instructional video for the wrong headset. I have been waiting for their response, but none came even after the holidays. It's been so long, that I think they just don't care about the problem now. I'll just issue a chargeback, I'll let the bank deal with their support."
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "Prvi Smurf",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T09:27:44.000Z",
          "Titre": "Product never arrived, they offer 5% refund...",
          "Contenu": "After paying for faster shipping, they used the same unreliable shipping method as if I didn't (checked it with the shipping service). Package gets lost and they offer 10$ refund??? Save your money and time people, don't do business with these guys"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "C.B",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T11:33:11.000Z",
          "Titre": "Ship lenses without checking them, Slow support responses and more!",
          "Contenu": "I did order a pair of of lenses for my index i have received them in about 10 days, Unfortunately those lenses are useless as they did cut them and mount them on the assembly without taking in account the lense axis and the way those lenses are mounted in the device itself and i see worse with them on then without.Their support is also generally not good and very slow everytime you write to them for any reason they take at minimun 24 hour to reply back to you.Additionally its a chinese company not from USA, lenses are shipped from china."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S W",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T00:44:40.000Z",
          "Titre": "It's a pain in my hind parts.",
          "Contenu": "It's a pain in my hind parts to get clean and washed properly.The magnets aren't nearly strong enough; the inserts frequently fall off and flop around inside, which could potentially scratch my lenses"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Wayne",
          "Nb_Reviews": 3,
          "Date": "2021-12-16T04:05:58.000Z",
          "Titre": "Still no product in sight after almost 14 days",
          "Contenu": "It's been 13 days..almost 14 days and I still don't have a tracking number. I emailed them twice and they gave me a (on both occasions) copied/pasted answer of \"sorry for the inconvenience...upon checking, your order is with our shipping department and you should get a tracking number soon.\" Those emails were 5 days apart. I am about to ask for a refund. It is just getting annoying. I hate companies like this.*I've been in touch with you. I emailed you just now. You guys gave me a tracking number and you claimed that it is in transit already when in reality, upon checking, you just created a USPS label. Come on now! This deserves a 0 star for false info."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Yakoub",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T03:54:35.000Z",
          "Titre": "Customar satisfaction is the last thing…",
          "Contenu": "Customar satisfaction is the last thing you car about .first of all there was a delay shipping this order second of all they made the wrong Leans  even though I supply prescription I stuck with something not working"
        },
        {
          "Note": 1,
          "Lieu": "LV",
          "Pseudo": "Vladimirs Salikins",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T16:13:50.000Z",
          "Titre": "your lenses cannot be fixed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Boivin",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T05:46:28.000Z",
          "Titre": "Not good service or product",
          "Contenu": "So far nothing but trouble 1st set they sent o1 lens not o2 offer me 15 for there screw up net set of lens don't fit right the lens touch and will not fit flat now I'm out 230$ and still no lens"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shawnInCarlsbad",
          "Nb_Reviews": 3,
          "Date": "2021-12-24T21:03:29.000Z",
          "Titre": "The adapters to fit on the quest are too blurry for me to use",
          "Contenu": "The adapters to fit on the quest are excellent but the lenses are too blurry to look through.  I get Halls around all the text and it's too fuzzy or let to read anything on screen comfortably"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T03:30:35.000Z",
          "Titre": "Didn’t receive my order",
          "Contenu": "It had been more than 14 days and I didn’t receive any update regarding my order if it shipped or not. I contacted support team and they said your order still under preparation!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Glenn A",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T00:43:06.000Z",
          "Titre": "DON’T TRUST THEM",
          "Contenu": "DON’T TRUST THEMOrdered 4 items including prescription lenses. The lenses were delayed in production but that happens and figured okay. Then when they eventually shipped I was expecting everything to arrive as they refused to send the other items earlier. To my surprise the lenses only arrived. There had been no communication about the missing items. Followed up asking for them to send the other items and got standard responses. I have kept following up and still nothing a month later.  I also have requested they cancel the remaining order and refund the money owed 3 times and they ignore this request. Still waiting. TERRIBLE COMPANY TO DEAL WITH NEVER TRUST OR BUY FROM THEM.EDIT: In response to the reply. There is no record of a shipment being picked up. The saga continues.  Please note this was there response to 3 requests to a refund over a 1 month period."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Phillips",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T15:22:16.000Z",
          "Titre": "Brand New Lenses Broken Out of the Package",
          "Contenu": "I was super excited to get my lenses after waiting weeks and upon receiving them, first time opening the package, 2 of the lense magnets in the frame were popped out. At first I thought maybe just put them back but they don’t stay in, the fall out and stick to the base making it impossible to play wearing the right lense entirely. After contacting customer support they did to watch the install video and I told them install isn’t the problem because I can’t install them period. The magnets aren’t staying in the frame. I didn’t pay $120 and wait 3 weeks for a bad set of lenses even the lense is perfect but I can’t use them due to the basically broken frame. Im waiting on a response but the only acceptable resolution is for them to replace my broken lenses with new ones because this is frustrating that out of the box they were broke. I’ll be waiting for a response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "XCHG REX",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T16:26:44.000Z",
          "Titre": "Terrible shipping and terrible customer service - 0 stars",
          "Contenu": "I ordered the Q2 halo headset adaptor and face cushion.  I paid an extra $20 for expedited shipping.  It has been 8 days and the product still says \"Paid, unfulfilled\".   I used their chat portal on the site to request a refund/cancel the order, they said \"someone would contact me\".. a few days later someone did call me to tell me they would not be cancelling my orderer number, but they had shipped my products just now instead, and they do not have a tracking number for me, apparently it is coming from China, which I would have never ordered if I knew that fact, no instead they say on the site the products ship from the US.   OK, so now it has been like 10 days and I still have no products, my order on their site says \"Paid, unfulfilled\" and I am not happy.   Will not order from vr-wave.store ever again, terrible shipping and terrible customer service.   Good luck!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Humphrey",
          "Nb_Reviews": 2,
          "Date": "2022-03-13T02:25:02.000Z",
          "Titre": "Absolute garbage",
          "Contenu": "Absolute garbage, Plano for G2 will. Not. Clear. Your. Face.lenses always fall out. Contacted them for a refund and they refused to give me one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake Hulse",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T17:15:52.000Z",
          "Titre": "Company uses a bait and switch sales…",
          "Contenu": "Company uses a bait and switch sales tactic.  Prescription lenses for the Oculus Quest 2 are advertised for $30 but when you go to check out they are really $75.  You can buy non-prescription lenses only for $30.Tried to understand this difference from customer service who was very snarky with me and only offered a 5% discount they give everyone for subscribing to the news letter.UPDATE:Companies response indicates prescription lenses can be purchased for $30; however, as soon as you add a prescription to the lenses, it jumps as I stated before.  Not sure how you can consider plain lenses without a prescription value \"Prescription\" Lenses.  Still a bait and switch tactic.My suggestion, stop lying to people.  Just put the base rate for PRESCRIPTION lenses and offer Plano lenses without a prescription for $30.  Prescription lenses start at $75 from what I can see."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ted Schmitz",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T18:50:50.000Z",
          "Titre": "Not happy!",
          "Contenu": "I recently ordered and received a set of corrective lenses for my DJI FPV goggles from VR Wave. After installing them, as per the YouTube instructional video produced by VR Wave, I noticed the image changed, but was not improved from before they were installed. I contacted VR Wave by replying to an email they sent me-they said I could contact them this way. I received no reply.I then went on their website and submitted to them my experience. Their reply was I should take the lenses to an optician to check if the prescription is accurate. I should not have to do this. It would probably cost more than the lenses and I don't know if I could find an optician that would do it. I sent them an image of the prescription from my ophthalmologist as they requested and I double checked the information I entered on the order form. The eyeglasses I purchased worked fine with this prescription. I replied to their response with the information I wrote above. I will update this review if I can."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Rob Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T06:36:37.000Z",
          "Titre": "Product was terrible.",
          "Contenu": "Product was terrible.Lenses just fall off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gimpy Rules",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T06:44:27.000Z",
          "Titre": "The halo strap is garbage",
          "Contenu": "The halo strap is garbage. The band at the top does nothing and it always wants to ride up.Don't waste your money on this garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Aliotta",
          "Nb_Reviews": 3,
          "Date": "2021-09-10T12:15:02.000Z",
          "Titre": "Kinda disappointed",
          "Contenu": "The lenses themselves are great, clean and just right. The problem is they don’t smooth the edges of the plastic frames like they would on glasses. No, theirs are a sharp 90 angle and It leaves very large marks on my face and doesn’t allow me to really get the headset as tight as I want it. Also it’s uncomfortable and limits the time I play with them on. This is with the spacer in on my headset. I’m only on day two with them so still feeling them out but so far I’m kinda disappointed…Update: While removing my headset the frames of the lenses actually cut my face. Working with support now, hopefully they can resolve this. If it keeps taking over a day for a response I’m going to contact my lawyer but I don’t want to do that so fingers crossed.Update 9-10-2021: Support has ghosted me. I feel like I maybe should sue them for the cut on my face. There was no warnings on the packaging that the lenses could cut you… since they don’t want to fix the issues…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthoni Bounleutay",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T18:38:33.000Z",
          "Titre": "I don’t even know if I’ll get my item.",
          "Contenu": "I’ve waited almost 20 days and still haven’t received the product. They are asking me to drop a review and I don’t even have the item I purchased. I spent a good amount of money and have heard nothing from them about when it’s going to arrive. They gave me tracking info that doesn’t even say that’s it’s on its way. I’m sure the product will be nice and if it isn’t well, this was a waste of time and money. At least keep the consumer updated and wait till I actually receive the item before asking for a review. They sent out emails saying “your order is complete, here’s how to set it up.” I don’t even have the item yet. Just disappointed on how this company runs things. I’ll add more once I actually receive my lenses. And I can’t even email to the support email you guys sent. It doesn’t exist. Thanks for the help haha.This has been the worst experience I’ve had for waiting for a shipment. Days have gone by and no updates. They continue sending me the same info saying my order will be shipped but over 20 days and nothing. Worse order I’ve made."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T00:11:57.000Z",
          "Titre": "Product is terrible",
          "Contenu": "Product is terrible. Support was incompetent and terrible. They have fake people on YouTube manipulating reviews.Worst company ever!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dave Maak",
          "Nb_Reviews": 6,
          "Date": "2022-01-30T14:29:56.000Z",
          "Titre": "Reverb G2 lenses. Bad start but happy ending.",
          "Contenu": "I needed these for my reverb G2 so I ordered some. Cant fault the service and delivery however I found the product to be very flimsy and poorly made. The lenses are so loose in the rubber cups that just they just fall out when setting the headset down or just trying to clean them. The rubber cups don’t really attach to the eyepieces by anything other than slight tension and can also be easily dislodged by touching them. Not really impressed with them considering the price. They were only reading glasses type too, not prescription lenses.Update 29.1.2021As I said previously I can’t fault their customer service and they quickly sent me a replacement set with no fuss. The first thing I noticed with the new ones was that the lenses were a lot more secure in the rubber cups, which tells me the original ones were defective and I was justified in my claim. All things said and done the product is excellent, including packaging and presentation, and you can rest assured that in the rare event something slips through quality control, they will rectify the issue swiftly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TW",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T02:02:08.000Z",
          "Titre": "Lenses are constantly popping off",
          "Contenu": "Lenses are constantly popping off.  Not any clearer than the pre-made ones for a fraction of the cost"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JV VJ",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T13:21:21.000Z",
          "Titre": "Horrible customer service and unknown product",
          "Contenu": "Very disappointed and frustrating to deal with. If you plan to place an order, pay, and never plan to contact customer service then they might be ok. Otherwise expect a headache. I placed an order for about 180USD in early March. I have a very strong prescription and sent customer service an email with my prescription and additional instructions that included waiting until a specific day  that week to start production so I could confirm with my doctor what my prescription was (the appointment was scheduled and everything. The date was specific). I was told that if they were able to postpone they would inform me. They never did and shortly after I received an email saying they started production. I thought \"fine, I get it. They could have at least contacted me however.\" I didn't pursue the issue. Received 2 more emails in the coming weeks about how my product was almost ready to ship and in the final stages of production. More than a month after I placed the order I emailed customer service asking what the status was. I was THEN told that my order had not been started and was put on hold and asked me to confirm the prescription that I already sent and was never told needed to be confirmed or my order was postponed. I asked to cancel and refund my order and a week has passed and I have not heard back or received my refund. 0/10 customer service and ?/10 product. Will not recommend to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Sopcak",
          "Nb_Reviews": 2,
          "Date": "2021-12-28T22:56:37.000Z",
          "Titre": "Sorry,I can't review these lenses…",
          "Contenu": "Sorry,I can't review these lenses because I haven't received them yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randall SMITH",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T02:28:10.000Z",
          "Titre": "Still the wrong lens and still no…",
          "Contenu": "Still the wrong lens and still no refund for your mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-02-27T20:48:57.000Z",
          "Titre": "My experience with this company has…",
          "Contenu": "My experience with this company has been horrible.  First I placed an order for the prescription lenses on February 8th.  Shipping time is stated 12 -16days.  I received a couple of emails stating that they received the order, working on it, getting ready to ship out.   On February 22nd I receive and email stating that it has shipped and given a tracking number.  I checked the tracking number and it states; Shipping Label Created, USPS Awaiting Item with a date of February 14th.  On February 24th I receive and email that states \"We are excited to let you know that we have completed your VR WAVE order. We have forwarded your order to our shipping facility and a tracking number will be sent to your email once available.\" - so I make a call that the tracking number shows USPS awaiting item.  The representative states that it is on its way and is currently in Carol Stream, IL - I am in Ohio, so I gather another day to two it should arrive.  It did not.  So I contacted them again and the representative said that it is being sent out and should arrive shortly.  He stated that they were sending it out today (Friday the 25th).  I checked the tracking again and it showed again, USPS awaiting item.  I inform him of this and he stated yes it was shipped out today (Friday the 25th) and that it is on the way.  I asked if it was shipped today why didn't I get a tracking number like the last time it shipped?  He stated to be patient and it should arrive soon.  So today, Sunday, I get an email stating \"We hope you are enjoy VR WAVE's products!\".  Still have not received the product, very unreliable customer service and run arounds are all that I have received. 20 days and still have not received anything.  And to be honest, not even an 'I'm sorry'"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Lee Lowe",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T12:45:14.000Z",
          "Titre": "My experience with this company has…",
          "Contenu": "My experience with this company has…My experience with this company has been horrible. First I placed an order for the prescription lenses on February 6th. Shipping time is stated 12 -16days. I received a couple of emails stating that they received the order, working on it, getting ready to ship out. On February 22nd I receive and email stating that it has shipped and given a tracking number. I checked the tracking number and it states; Shipping Label Created, USPS Awaiting Item with a date of February 14th. On February 24th I receive and email that states \"We are excited to let you know that we have completed your VR WAVE order. We have forwarded your order to our shipping facility and a tracking number will be sent to your email once available.\" - so I make a call that the tracking number shows USPS awaiting item. The representative states that it is on its way and is currently in Carol Stream, IL - I am in Ohio, so I gather another day to two it should arrive. It did not. So I contacted them again and the representative said that it is being sent out and should arrive shortly. He stated that they were sending it out today (Friday the 25th). I checked the tracking again and it showed again, USPS awaiting item. I inform him of this and he stated yes it was shipped out today (Friday the 25th) and that it is on the way. I asked if it was shipped today why didn't I get a tracking number like the last time it shipped? He stated to be patient and it should arrive soon. So today, Sunday, I get an email stating \"We hope you are enjoy VR WAVE's products!\". Still have not received the product, very unreliable customer service and run arounds are all that I have received. Almost 30 days and still have not received anything. And to be honest, not even an 'I'm sorry' Plz don't reply with email here. I have like 5 times. Same response.  Here is your tracking number. It's been in the same spot for 2 weeks. Bad business!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Weber",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T19:28:02.000Z",
          "Titre": "Cant get anything right",
          "Contenu": "Prior to ordering through this company all communications were very speedy. I even received my order a couple days early.  Thats where the positive experience stops. After installing the inserts I wasnt able to see any better than with no glasses. When I put my regular glasses back on everything was clear again. After removing the inserts. I tried looking through each one out of the headset. It appears the left lens is the issue. I emailed the company letting them know my problem. Several hours later I received an email with instructions on how to install the lenses. I emailed them back to insure them I had things installed properly. I was then asked to submit photos of the inserts installed. Which I did.  On 10/16 I received another email to let me know they received my photos and they were sending this forward to their production team. After not hearing anything for 5 days I again emailed the company on 10/21 to see what was up. Later that day I got another email. This time I was informed they had processed my replacement. And I should get another email with a tracking number within 3-5 days. After not hearing anything for another 5 days I emailed them on 10/26 asking whats up with my order. Later that day I got another email stating the same thing they told me 5 days prior. The response I sent them was \"Seriously? Thats what you told me a week ago\". 2 days later on 10/28 I was finally given a tracking number. So I finally received the replacement lenses last night 11/3. Before I placed my original order I contacted VR Wave asking about the new frame design for the quest 2 lenses. They informed me they did have a slimmer design that helped with the touching the nose issue. I just needed to place the order. Then send an email requesting the new design. Although there were issues with the prescription itself, the frame design was awesome. However when I received the replacements they were the old style frames. SERIOUSLY???? Thinking ok Ill just deal with it as long as they work I installed the lenses. When I put on the headset I realized the prescription was even worse than the first set. With the first set at least they got one lens right. This time both lenses were trash. As I said to them in my email, \"At this point all I know to say is WTH?. Please just tell me what I need to do to get my money back. I am happy to send both pair back at the companies expense\". I have seen a lot of people that are very happy with this company. But as far as Im concerned I DO NOT RECOMEND THIS COMPANY!!!!!!!! Please just give me my money back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter Plumber",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:43:30.000Z",
          "Titre": "These do not work for people with…",
          "Contenu": "These do not work for people with bi-focal or transition lenses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Collin Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T09:29:55.000Z",
          "Titre": "Pimax Crystal Lens",
          "Contenu": "I ordered lenses for my pimax crystal and while it was nice not using contacts with the headset on. The design of the lenses is horrible. Once I put them on, and got the headset situated on my face. I knew instantly I wasted $116 and would not be using them at all. The shell around the lens is too tall and makes the headset uncomfortable to have on for more than a minute. If they were to redesign the product to have the lenses closer to the crystal's lens. While letting the customer exchange for the new design only paying for shipping, I could get behind that. Overall the product arrived in a week but the design needs some major rework"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley Fore",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:14:42.000Z",
          "Titre": "The item took 10 days to go from your…",
          "Contenu": "The item took 10 days to go from your shipper to the USPS. The item is fine, but the shipping was atrocious."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Palmer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T14:40:40.000Z",
          "Titre": "Magnets fall out, company says to bad.",
          "Contenu": "In a couple months the magnets started falling out of the lenses. They get lost very easily. When I contacted the company the gave me no option on new magnets except to buy more lenses."
        },
        {
          "Note": 2,
          "Lieu": "BH",
          "Pseudo": "Thamer Nasser",
          "Nb_Reviews": 6,
          "Date": "2023-08-02T11:14:21.000Z",
          "Titre": "i feel i am scamed !!!",
          "Contenu": "first they delay it because i did not attach my scription report, even i have filled all the requirements and no where to attach any file.then its made in manufactured and made and sent from china and not as they clamed,they say they use and charge you for shipping with DHL/UPS/TNT/FEDEX/USPS, but it was shipped by cheap cargo or with normal post. and still after 20 days its not in there systemthey clime to Asia will take 10-30 days and its 20 days still not shippedwith all that i feel i am scammed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard mkz",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T20:28:14.000Z",
          "Titre": "VR wave takes a way too long",
          "Contenu": "I ordered from VR wave.com on June 13 still under production and I ordered same VR lenses from VR optician on June 14 and it is already on the way and delivery date set up on June 26.I'm not a difficult customer but VR wave doesn't even have my lens ready at this time at all.so my fellow VR people. go figure."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gerard Farmer",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T04:11:53.000Z",
          "Titre": "I have an issue with the left lense…",
          "Contenu": "I have an issue with the left lense falling out and submitted a request for assistance through the contact page.  VRWave has not responded and two weeks have now passed.  I'm currently using electrician tape to hold it in place."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Ashlin",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T16:46:21.000Z",
          "Titre": "I purchased their Quest halo strap",
          "Contenu": "I purchased their lenses; there's no return, which is reasonable (they're custom made) and they work fine. Beware buying anything else; their response is slow, almost designed to make you go away, or forget your issue. A had an issue with their halo headstrap; got one for my wife, she loves it. They change the design and is doesn't work for me. After exchanging an email - nothing. I guess I bought it. So beware, you press that button, you bought it.Update: a couple hours after this posted, I got a response from the company with an address where to return the product for a refund. I've upgraded my rating to 2 (I can't rate it at 2.5, and I'm not giving a 3) as they are not paying for shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Caysen Fullam",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T02:10:17.000Z",
          "Titre": "Overpricing",
          "Contenu": "Its good, and kinda decent but its very overpriced, I know lens and my perscription usually doesnt cost over 60$!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Crooks",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T18:39:50.000Z",
          "Titre": "HP Reverb G2 - design could be a lot better",
          "Contenu": "It would seem more thought has went into the design of the Quest 2 lenses than these HP Reverb G2 lenses.  The design is really not great with these lenses.  Some issues I found:The lens surrounds are made of rubber and have to be pushed on which is ok I guess.  However it's not clear in the instructions and videos how much you need to push on the lenses to get them to stay in place.  My first attempt I was pushing them in too far and they weren't staying in place and now I realize I was likely stretching the rubber too much.  My next attempt they weren't push in enough and were falling off.  My third attempt I twisted them a little while pushing them in slowly and eventually they stayed in place.Then I noticed I had some dirt on the lenses so took them off for a clean and both lenses popped out of the rubber!  So overall while these work once they are in place it is an extremely delicate design, which is very disappointing as I would like the ability to take the lenses on and off quickly to let others use the headset.Needs more work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lawrence Francis",
          "Nb_Reviews": 2,
          "Date": "2022-09-18T09:02:12.000Z",
          "Titre": "The prescription lens should come…",
          "Contenu": "The prescription lens should come colored. Extremely hard to install."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Alejandro",
          "Nb_Reviews": 3,
          "Date": "2022-05-02T09:40:52.000Z",
          "Titre": "Product quality less than suboptimal",
          "Contenu": "Product quality for reverb g2 is less than suboptimal. Lenses fall from the plastic support and from reverbg2 constantly. I had to tape them. Seem a design problem specifically for reverb g2. Lenses are ok and work ok when they don't fall. They are good orgánica lenses but not usable without manual work to adapt them."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "NINEL STRELKOVSKA",
          "Nb_Reviews": 3,
          "Date": "2022-05-02T15:29:55.000Z",
          "Titre": "The product is good",
          "Contenu": "The product is good, but the delay in delivery and communication during the process upset me a bit :( Few times I was sent the tracking number which was not valid, I asked to double check it and every time got the same. Nobody could give me the exact date of delivery. But when I finally got the lenses, I enjoyed them a lot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Annoyed",
          "Nb_Reviews": 2,
          "Date": "2021-08-18T14:52:17.000Z",
          "Titre": "Inattentive or undertrained staff.",
          "Contenu": "**Update below**Reached out through the email system to ask in advance of order if their vive lense offering fit a vive PRO EYE headset as it is not listed anywhere on the website. i was emailed back saying yes. No, they do not fit and i have wasted over $100. inattentive staff with bad info.UPDATE: Received a full refund and an apology, as well as a coupon code. which is great, but doesnt get me the originally promised product :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M Blaylock",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T15:41:11.000Z",
          "Titre": "I wish I knew Index lenses didn't have magnets",
          "Contenu": "I wish I knew that the Index lenses don't have magnets they are advertising everywhere before I bought a pair 😞.  I wanted to get lenses I could easily swap out with my gf.  I think these will just wear out the rubber coating on the index and start to fall off.  I would have gone with a brand that has a better fit and doesn't rub against my nose if I knew these didn't have the magnet feature."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Sapp",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T17:15:30.000Z",
          "Titre": "They dig into your face because they…",
          "Contenu": "They dig into your face because they stick out too far.. I can see way better though. They also got this fog that has built up over time and I cant wipe it away so IDK what that's about. I asked VR Wave via email to update me when they release the new version of their lenses, and to give me a discount on them in exchange for the ones provided. They did not agree to that. Very bitter sweet feelings about this product, mostly bitter."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Steve Oostrom",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T04:04:09.000Z",
          "Titre": "Can't Rate It Yet",
          "Contenu": "The lenses appear to be of good quality and the delivery was reasonably quick (delivery issues at my end not the fault of VR-Wave).  However, the plastic rings the lenses mount on simply do not fit on the Oculus Quest 2 lenses.  No matter the effort, the rings would not mount.  Also, it would be helpful to know which is the right and which is the left lens."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ROBERT GOLTZ",
          "Nb_Reviews": 3,
          "Date": "2021-01-16T16:09:14.000Z",
          "Titre": "To get the eyepiece holder on is almost…",
          "Contenu": "To get the eyepiece holder on is almost an impossible feat. It took three people almost a half hour to get left one on an we still have not been able to get right one on. Unless you are a engineer I would never advise purchase. Right now laying in drawer total waste of money since no one can get it on. Only reason 2 stars and not lower is actual lens seems to be fine.  Really can not be 100% sure since no one can get them on Oculus to actually use them"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Stewart",
          "Nb_Reviews": 11,
          "Date": "2021-10-17T13:04:04.000Z",
          "Titre": "Still have not received them! After…",
          "Contenu": "Still haven't received them yet after three weeks, apparently they are on a slow boat from china, which they conveniently hide by making a usps shipping label for whenever they do it the US. Personally if I had know these were being made in China, I would have never purchased from this company. I have now seen numerous videos saying that if your PD in anywhere around the narrowest settings with the Oculus Quest 2 you'll find they pinch into your nose, making for a very uncomfortable experience. I will follow up on this if they get to use that usps label that  they made when I tried to cancel my order!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FlyFpv",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T19:50:58.000Z",
          "Titre": "Left lense was made wrong. Turnaround time for remake was unacceptable.",
          "Contenu": "Left lense was made wrong making it unusable. Remake turnaround was almost twice as long as original order. Right lens frame fit too loose and kept falling out. A replacement right lens frame was not sent or addressed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Riddle",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T17:01:07.000Z",
          "Titre": "Customer Service was inadequate",
          "Contenu": "Customer Service was inadequate. did not ship the blue light test kit saying they can't ship that to the US however other reviewers had no problem getting their test kit. Lens tend to fog up during game play."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "levi foster-grundy",
          "Nb_Reviews": 10,
          "Date": "2021-05-30T06:59:24.000Z",
          "Titre": "Never received the item",
          "Contenu": "Do not go with this company. I never received my item. they said they will contact Royal Mail so I have left it for 5 days. I had no feed back. I asked them what they was doing about and it is not fair that I have to wait for a refund for my item. They then sent me an email back and told me to record my issue. How can I record my issue. When I have no item to record due to the Item never arriving at my home? To me they are just messing me about. They take your money quick enough but they do not refund you so I am now £80 down. I am just hoping PayPal or my bank. Will refund me back. If not. Then I am screwed. The reason they got two stars is that they do reply back fairly quickly. Which I cannot moan about but that is where the positivity ends sadly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben Hayes",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T00:55:55.000Z",
          "Titre": "Not comfortable at all!",
          "Contenu": "Was really excited to get these lenses since I worry my glasses will scratch the VR lenses and putting in contacts any time I want to use my headset is a waste of contacts. Sadly my excitement dwindled about 30 minutes in during the first use. Even with the glasses spacer installed on the face plate these lenses press quite hard against the brow of your eye socket and the bridge of your nose. I usually keep my IPD on position 1 but wasn't able to get my headset tight to my face and was forced to use position IPD position 2 (not a huge deal for me since my IPD is actually dead center between position 1 and 2). After 1 hour of use I took the lenses out and just used my glasses because the discomfort was unbearable. In theory this sounded like a great idea but turned out to be a waste of $80. :("
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Ameen Aburoayan",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T20:48:58.000Z",
          "Titre": "Not what i expected.",
          "Contenu": "The lenses did come in time, but they made god rays much worse and also i notice some distortions i did not see before whioe using the glasses."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Laurent",
          "Nb_Reviews": 3,
          "Date": "2021-12-05T21:11:18.000Z",
          "Titre": "Very disappointed with my Vr Lens from…",
          "Contenu": "Very disappointed with my Vr Lens from VR Wave It’s very difficult to fixe it on my reverb G2 I do not recommand it for tous headset"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan Troyner",
          "Nb_Reviews": 2,
          "Date": "2021-08-06T03:03:00.000Z",
          "Titre": "the lenses fit on the quest 2 very nice…",
          "Contenu": "the lenses fit on the quest 2 very nice ,,the kit comes with plastic pieces with small magnets in them that you put in the quest 2 headset ,, the lenses have magnets too and center themselves to the ones you install in the headset,,  the idea of the small magnets to hold the lenses in is a great idea , easy to remove and easy to put in ,, so you can pass the headset to others and just remove your lenses easily ,, just kinda drop them in and they center themselves ,, but my lenses only are clear if i look straight ahead,, if my eyes look up or down ,right to left ,,, blurry ,, in a vr headset you want to see the everything,,,, not just what is straight ahead ,but sadly with these lenses installed  the quest 2 is  useless to me,, bought a pair of carsons  clip and flip readers for 17$ and removed the attachments and dropped them in and use them now ,,I have to rattle them around a bit sometimes but they work better.. dont use the vr wave lenses at all anymore"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Robert Schmidt",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T16:39:09.000Z",
          "Titre": "VR-Wave vs VR-Optician",
          "Contenu": "I ordered the VR-Wave, AND VR Optician prescription lenses for my valve index. The first lenses I purchased was the VR WAVE lenses. The order was reasonably priced and it came VERY quickly. All of that was wonderful. At first glance I was impressed with VR-wave, but I soon really started to be bothered by the fact that I could only see very clear if I was looking straight ahead. Any time I tried to look around with my eyes (up, down, side to side), it is VERY blurry and so I thought that maybe this is how these type of lenses work. You must turn your head to look around, which was ok, I guess.  I had my doubts however, I mean, regular glasses allow you to look around without turning your head, right? SO I purchased a set of prescription lenses from VR Optician and it was a bit more expensive and took a few weeks to get here but WOW! They are like night and day as compared to the VR-wave lenses. I can see more clearly when looking straight ahead and I can see perfectly when looking around with my eyes too. I spent WAY too much money getting this right, and my only wish is that I had gone with VR-Optician first. They don't cut corners like VR-wave did. I gave VR-wave 2 stars only because the speed at which the lenses arrived from China. Otherwise, don't waste your money. I will be sharing my review of this everywhere I can so that you don't end up wasting your money! :)RobEdit: I forgot to mention, the design of the VR-wave lenses is awkward and has little bits of plastic that is very uncomfortable against your nose. I have a normal sized nose btw."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "Mehdi",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T10:24:36.000Z",
          "Titre": "there is no difference between with…",
          "Contenu": "there is no difference between with lens and without !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda Gillette",
          "Nb_Reviews": 4,
          "Date": "2021-11-08T13:53:14.000Z",
          "Titre": "I rarely make a negative review but....",
          "Contenu": "Update - they reached out to me and offered me a 50% discount. I declined as I have already ordered replacements (paid for expedited shipping for a reason and didn't want to prolong reordering any longer due to all the email back and forth). If they would have offered this initially I would have been very happy and posted a positive review, but 25% felt insulting to me. However, I did want to update the review that they tried and I will increase to 2 stars for the afterthought. I rarely make a negative review, but this one is called for. I ordered VR lenses. Clicked on the Oculus Quest 2 section. Put in all my information, scrolled back up to make sure I was on the Quest 2 and clicked \"add to cart.\" Where it went wrong is not checking that it was still on the Quest 2 after I added to cart. I should not have assumed that if I filled out the information under Quest 2 that it would change once it went to the cart. How silly of me. I was so excited when the package came. Pulled them out and noticed the shape wasn't correct. Reviewed the email and it said HP reverb. Again, silly of me not to triple check that it didn't change from my initial double check which makes this my fault which I understand and accept. I called customer service immediately. The lady said \"send an email.\" I don't want to send an email, I want to talk to someone about this. She said \"send an email, I am the only one here.\" So I asked her about returns, she said \"they are on a case by case basis but you have a product that you can't use so don't worry, they will get it figured out for you.\" She also said she would have someone call me within 24 hours to discuss but to still send the email. She even verified my phone number. No one called. I received a day and a half later that said since it was my error they could offer me a discount. Didn't even mention what the discount would be. So I asked. They responded another day later and said 25% and they would send me a code if I'm interested. No, I am not interested. I've spent 128 dollars (with shipping) and now I need to spend another 75 plus shipping? So over 200 for a 100 dollar product that I'm sure costs 25 dollars to manufacture. I would have easily agreed to a 50% discount but 25% feels insulting. So buyer beware that the website defaults to another system despite which system you are completing the form for and on top of that customer service is not knowledgeable and has wasted 3 days that I could have used to have another set of lenses being made because they insisted on email exchange instead of a phone call. I will be reordering from a different site. I would rather pay another company more than continue to deal with this one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jeff li",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T20:50:10.000Z",
          "Titre": "Very frustrating to get a right lens with VR Wave...",
          "Contenu": "There is an update for this issue. I just saw an email from VR Wave on Feb, 2nd that they did raise the question about the plus and negative sign. So actually they did a good job for find it out and emailed to me. Unfortunately, either I missed the email or the email arrived later. I just didn't see it for some reasons . Otherwise, it would save both of us a lot of resources and frustrations and we can get this resolved already. However, they had no one mentioned it to me or point it out during recent so many conversations (emails and phone calls). It could be avoid if we had more effective communication.Up to this point, I still have not received any response and solution from VR Wave. I hope we can have a better and effective communication in the future.***********************************************************************I placed the order for my lens on 2/2/2022 from VR Wave website and received it on 3/6/2022 since they shipped it from China or HongKong.But it is totally wrong prescription that I cannot see anything via the lens. After I contacted with VR Wave support by emails and I received the first email response was quite nice and asked me if I like them to make another one. But I asked to find out what's wrong with it. They told me that I put the wrong prescription data but didn't tell me how wrong and which numbers are wrong. I sent emails to ask them and never got the question answered and have no responses... I had to make several special trips to my eye doctor and eventually found out the prescription numbers I entered were all correct numbers but the only thing seems the wrong plus \"+\" sign and should be a negative \"-\" sign in front of the prescription numbers. Then I found their support phone number and called them but now they blamed me for entering the wrong data...and not willing to make a correct one or want me to pay the cost... But, honestly I don't think I put the wrong since I am a very careful guy with the numbers since I am a database expert and doing database development, administration and data architect works everyday for last 20 years. They also don't have any proven like screen shot that shows I entered the wrong numbers. I could be but I don't believe I did wrong in general case...However, like most customers, I am not am eye doctor or an optician. We could miss the significant of the meaning for the prescription numbers and those signs. But I wonder the technicians (in VR Wave Wave) should have common senses for it? Or even may raise a question if you have a doubt? That's what we do for our daily jobs. right?!Furthermore, should their website be designed more user friendly for all customers like adding a notice reminding customers for the difference between plus or negative sign? As up to date 3/24/2022 now, they still have not responded to me whether they willing to make another one pair for me or I have to pay for another $145+ for it?I just feel like: am I dealing with a real American company and doing business in USA?"
        },
        {
          "Note": 2,
          "Lieu": "KH",
          "Pseudo": "Sokunrotanak Srey",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T10:47:10.000Z",
          "Titre": "I haven't got my purchase after almost 2 months after purchase",
          "Contenu": "So here's the timeline:2022-01-17: I made my purchase2022-01-18: I got email saying VR WAVE Order is being processed2022-01-21: Your VR WAVE order is almost ready!2022-01-31: I send email to VR Wave Support to follow up the progress of my order since I haven't got a tracking number2022-02-01: I got my an email A shipment from order ##### is on the way, an email of Your VR WAVE order has been completed, and an update email from the support team with the link to the trackingOn the tracking website progress:2022-02-21 09:38Physical delivery scheduled.2022-02-21 08:20广元市, Arrival at inward office of exchange.2022-02-19 08:31广元市, Arrival at inward office of exchange.2022-02-18 15:27Departure from inward office of exchange.2022-02-18 15:11Arrival at inward office of exchange.2022-02-18 14:41Departure from inward office of exchange.2022-02-18 14:40Parcel scanned by site2022-02-18 14:31Order placed, ready for collect2022-02-08 11:51Yanwen facility - Outbound2022-01-22 22:27Processing information input2022-01-22 15:15Yanwen Pickup scan2022-02-21 09:38 is the latest update until now. I didn't get any contact regarding a delivery schedule. The status of the order is \"Pick Up\" and according to the tracking website:Pick UpItem is out for delivery or arrived at local facility, you may schedule for delivery or pickup. Please be aware of the collection deadline.General explanation:1. Your package has arrived at a local delivery point.2. Your package is out for delivery.If you ensure your package has been delivered successfully, please ignore this notice. However, if you haven't received your package, we'd advise you to contact the carrier to arrange a re-delivery or collect your item. Hint: Generally, the carrier has collection deadline, we'd advise you pickup your package at once, or it might be returned to the sender.Since the last update location is 广元市. I google it and it shows Guangyuan in China. My delivery address IS NOT in China.2022-02-28: I contact support again provide the screenshot from the tracking website and what \"PICK UP\" on the tracking website mean.2022-03-04: They responded saying the package has been picked up from the local post office and ask me to follow the tracking website. It's 2022-03-08. I haven't heard from the support team. Are they looking into it? are they checking with the delivery team? will I hear back about my purchase. Not a clue.EDIT: VR WAVE team respond to this review that they've sent me an email but I cannot reply to them below. I haven't received any email 20 min after their Trustpilot response (not in SPAM box either). Hopefully, it's just an email delivery delayed.EDIT:  VR WAVE team responded to this review and told me to check my email that I never get. I contacted them on their website LIVE CHAT on 2022-03-09. They said they're sorry and they will get back to me in the next 24-48 hours. It's 2022-03-11 today and I never get my update.EDIT: They emailed me later on 2022-03-11 and providing an invalid phone number that can be found on a tracking website through a google search. However, the information is not valid on that tracking site.EDIT: 2022-03-14 a local delivery agent contact me. He's not from the post office that VR WAVE support team tell me to contact with the incomplete phone number. I told them the phone number is INVALID and they still insist that I contact the number. I'm a local, I know the phone number is missing a digit! In case you wonder, I did call the number and get the exact response that I expected, the call doesn't even go through.The lenses work great (I added an other for that). It helps with the blurriness on my QUEST 2. If you're located at a place with good delivery, maybe it works for you. But it seems so far it hasn't been the best experience for me. My experience with VR WAVE support has been frustrating and unhelpful. Here's how VR WAVE team could do better:1. Provide enough information regarding delivery   - If it's delivered to the local post office, I'd expected to get an update on how I can picked up my product. If not that, then the information regarding how my product will be delivered to me with an expected date. The tracking site is not helpful.2. Provide a better support experience:    - Listen to the customer.    - Research and contact relevant stakeholder to solve the problem.      - Provide reliable relevant information to solve the problem.             - \"Follow the tracking website\" is NOT helpful when the customer show that it's not accurate            - \"Please contact this post office with xxxxxx\" is not helpful when the customer already mentioned that it's an invalid number"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam Kanter",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T05:56:47.000Z",
          "Titre": "Fine lenses, poor attachment. Poor service.",
          "Contenu": "The lenses are fine and packaged nicely. The problem is with the magnetic rings that are placed on the Quest 2 lenses. They do not snap into place, and cannot be put on evenly, so the lenses rock back and forth which can cause a scratch. This happened with the first pair of VR Wave lenses I had. I ordered another pair, hoping they had fixed this issue, though it remained. I wrote the company three times requesting advice and they did not respond, which is inexcusable.EDIT: VR WAVE responded to above review stating that they had not received my emails, which were sent to the correct address and were not returned. I sent a fourth one."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Dock",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T11:14:19.000Z",
          "Titre": "The service needs to be improved",
          "Contenu": "The service needs to be improved. Very slow shipping: waited almost more than one week to getting shipping notification. I ordered another pair from HonsVR after ordering lenses from VR Waver , the lenses from HonsVR arrived much earlier with prompt communications.Poor communication. Taking 4-5 days to respond my emails and no shipping information provided, how strange is the buying experience ? I will not recommend the service to other people."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Skip",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T23:19:38.000Z",
          "Titre": "I ordered these with expectations",
          "Contenu": "I ordered these with the impression my left eye is farsighted and assumed since the lenses is right there on your face I should buy them..right lens is basically plain. So received them setup and didn't see a noticable improvement..Further browsing I learned the point of focus in VR headset is actually 2 meters. It's not as reading a book at 15 inches and requires cheaters! Just because you have prescription glasses does not warrant purchase of corrective VR lenses of the several offered on the internet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Bliss",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T13:17:50.000Z",
          "Titre": "Problematic mount, Lens clarity/quality is high",
          "Contenu": "Lens clarity/quality is high, lens mount not so much.  Customer service poorly responsive. Doesn't want to stay in place Lens pops out of the rubber Mountain very easily and pressing on the rubber Mount no matter how I do it is generally unsatisfactory and likes to fall off the headset frequently. Hard to clean the lenses because they tend to pop so easily out of their rubner mount and then it's hard to get them back on without sometimes then popping out of their mount again while you're putting them on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Saelens",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T06:42:15.000Z",
          "Titre": "Could be better",
          "Contenu": "Maybe my prescription, doubtful, but I had higher expectations for the clarity and sharpness of the product in my Quest 2 system. Sorry, but not that great. Better than glasses but still not outstanding or awesome. I keep moving my googles to gain better clarity but its still okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dooderdude",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T22:10:30.000Z",
          "Titre": "Great lenses! Customer service was helpful but slow",
          "Contenu": "When I ordered my lenses I had entered my prescription wrong, about 10 minutes later I email customer support to let them know. They had me send my prescription form so they can use that as reference. Fast forward to when I got them I was disappointed to see they came in that wrong prescription. I was able to get in contact with them about a week after I got them. They were very helpful and sent me a replacement and they're great! They make VR a ton more fun and I'm glad to say goodbye to glare."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer.",
          "Nb_Reviews": 5,
          "Date": "2023-02-06T19:15:49.000Z",
          "Titre": "One of the magnets was loose and had to…",
          "Contenu": "One of the magnets was loose and had to be glued in by myself to allow the product to work.  This company needs to pay more attention to detail.  Otherwise they work as expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Baduria",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T20:35:02.000Z",
          "Titre": "The scrip lenses are excellent, but...",
          "Contenu": "The scrip lenses are excellent. I ordered the leather face thing and my order was attempted to be delivered by Amazon Logistics to the wrong state. I am still waiting for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence Frazier",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T05:48:00.000Z",
          "Titre": "The lenses don't have a right or left…",
          "Contenu": "The lenses don't have a right or left indicator, to determine which eye they go on. Maybe you should consider putting them on the lenses."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T15:42:30.000Z",
          "Titre": "Disappointed.",
          "Contenu": "Have a HP Reverb G2 v2. I can not get the lenses to fit properly around the Reverb's lenses. Also the prescription lenses keep 'popping' out of the frames."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John G John G",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T06:20:19.000Z",
          "Titre": "Lenses are fine, customer service could be better",
          "Contenu": "After some time, I guess they realized sending a new case would be a good idea.  I received them and they are working.  So good on them to finally resolve this.  Honestly, if the cases were for sale, I would have just bought one. Being asked to prove the case was broken was a little odd.  But everything is ok now.-------------------------------------------Lensess are fine.  Customer service is terrible.  I complained about the case the lenses came in having a broken zipper.  I asked if they would sell one to me or exchange mine.  They wanted me to send them a photo of the broken case which I thought was ridiculous for such a low cost item.  I sent the photo and that was the last I heard from.  Honestly the only reason I care about the case is because I share my VR with others need a place to store the lenses. It is impossible to find a case that shape.  But i guess they don't care about repeat business."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Stoddard",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T14:14:24.000Z",
          "Titre": "Won’t stay in place",
          "Contenu": "The lenses are great.  However, the clips don’t stay affixed to the meta quest pro lens covers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T19:50:36.000Z",
          "Titre": "Great product, smaller issues",
          "Contenu": "Overall these lenses get the job done, the anti-glare reduces most, but not all of the glare, it’s noticeable enough. My only complaints are the 20 days it took to finally arrive (USA) and the fact that they push on my nose and decrease my FOV slightly, you definitely feel it more with super active VR games. I’m satisfied but I wish they were more comfortable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Calvin Miller",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T05:47:22.000Z",
          "Titre": "Great product, Company can't check inbox",
          "Contenu": "I bought thse hearing good things from my friends. Two weeks later, two right lenses show up at my house.I don't have two right eyes.After three emails without replies to VR wave and a really awkward call, they finally got back to me.I didnt give one star because VR wave made amends and sent two left lenses so now I have two pairs, the the product is great, I just wish they knew how to check their email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wendy Chenoweth",
          "Nb_Reviews": 4,
          "Date": "2022-01-08T19:25:10.000Z",
          "Titre": "They are a great product but when I’m…",
          "Contenu": "They are a great product but when I’m in the middle of a game and I’m sweating they seem to come off and move around. Customer service did reach out but they wanted a Video of this happening which I don’t know how to do when I’m wearing them. So I sent picture. Then they asked for a video of me just shaking the item around but it doesn’t seem to do it if it’s not all steamed up inside. I wish it had better magnets."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Francisco",
          "Nb_Reviews": 2,
          "Date": "2021-11-30T16:35:14.000Z",
          "Titre": "Please read the entire product…",
          "Contenu": "Please read the entire product description before you order the Oculus Quest 2 carrying case. Unfortunately, I did not, so I can’t blame VR Wave. The case does not fit the halo strap. Which I find disappointing, since VR Wave sells the strap and the reason I purchased the larger case. Oh well, I’ll still use the case, but I am very disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Girard",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T05:09:03.000Z",
          "Titre": "Complete waste of money",
          "Contenu": "They were blurry no matter what I tried to do, didn't fit well in the Quest 2. Contacted customer service many times, they finally just ignored me, I assume after the return window had closed. A complete waste of money. UPDATE: After this review they contacted me and agreed to remake the lenses with a different setting. Then last week they said they couldn't make them and they would refund my purchase if I destroyed the lenses and sent verification. Upgrading to 3 stars just because they did finally make it right."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wendy Chenoweth",
          "Nb_Reviews": 4,
          "Date": "2021-12-22T03:00:12.000Z",
          "Titre": "They fall off all the time",
          "Contenu": "They are a great concept but every time I'm playing both of them will fall off and move around in there. Usually it one at a time so I have to try and keep one eye closed. I wish the magnets where stronger so they would stay in place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mauricio Padilla",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T17:22:02.000Z",
          "Titre": "I was really excited and still am about…",
          "Contenu": "I was really excited and still am about these lenses except they don't stay in place and keep popping off. They don't snap in place very good and the magnets are popping out as well. Other than that if these issues could be fixed it would be a 5 star product. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T05:04:23.000Z",
          "Titre": "Issues with my lenses for hp reverb g2",
          "Contenu": "Received my lenses for hp reverb g2. Was a little disappointed that they didn’t also have the magnetic mount that vr wave was known for having. Overall seemed like the correct prescription.Problems began when I attempted to install them in the headset. They are a hard plastic frame and when they press on nothing is holding them in place and as soon as I turn the headset they fall out. I kept trying and finally got them to kinda grip and stay in place. I’ll see how they do after using them for a while and will update with any further information.Just received a response to my support inquiry. I’ll update if I learn more."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2021-09-07T04:58:59.000Z",
          "Titre": "Lenses are great, face cover is great, just not together.",
          "Contenu": "The prescription lenses are really good. The magnet system works very well when you want to clean them, or when other people want to use the headset.The face cover is also very comfortable to use. Much better than the stock face cover, and still better than the revised oculus cover.What's slightly bizarre is they don't really work well together. The leather on the face cover is too large and hits the lenses. Further, using it I find my face hits the lenses and can knock them out of place. What might seem like an obvious solution, use the glasses spacer, doesn't work as the face cover is not compatible with them.So both are good, just not together."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elvin Meares",
          "Nb_Reviews": 2,
          "Date": "2022-04-02T02:38:18.000Z",
          "Titre": "Good product/Slow shipping",
          "Contenu": "Shipping can be very slowwwwwww….. Ordered lenses on February 20th and finally got them on March 31st. The lenses seem to be a good product. Only 3 stars because of the slow shipping time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicholas Trybull",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T05:52:11.000Z",
          "Titre": "The prescription lenses are nice, everything else is garbage",
          "Contenu": "The prescription lenses are nice, but the halo strap for the quest 2 is complete garbage.I thought it looked really good, better than the elite strap from facebook, when in reality it's cheap plastic and poor design.It barely even fits the head set and bends parts on the headset it attaches too.The back of the head part doesn't do anything and just slides up along with the strap on top not doing anything to gold it in place either. It barely holds the headset on your head, I'm not sure what kind of testing you guys did but it wasn't very good testing. I dont think I'll buy any more of your products unless it involves the lenses because you put out garbage otherwise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T12:20:24.000Z",
          "Titre": "They work well and I can see fine using…",
          "Contenu": "They work well and I can see fine using them. They are also pretty easy to install. The issue is the plastic parts hit the sides of my nose whenever I turn my head just a little bit and it hurts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Coin Corgi",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T14:46:11.000Z",
          "Titre": "This product took too long to get here",
          "Contenu": "This product would most definitely be a five star if the ordering was way easier and the it would get here way quicker but overall really good item"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Issac Jones",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T04:11:35.000Z",
          "Titre": "My vision is clearer but the glasses…",
          "Contenu": "My vision is clearer but the glasses move and fog up. There should be a exterior extension and wrap that helps keep glasses from touching your face"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ennar Ranne",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T20:10:26.000Z",
          "Titre": "The anti-fog lenses fog up when you…",
          "Contenu": "The anti-fog lenses fog up when you play intensive games. On the other hand, the lenses would be great if you don't play exercise games."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandy Woodford",
          "Nb_Reviews": 2,
          "Date": "2021-02-09T23:53:00.000Z",
          "Titre": "Good, but not great",
          "Contenu": "I chose VR Wave because I share the Rift S with my husband and daughter, and I really loved the concept of the magnetic lenses. The prescription is perfect and they are easy to put in and take out, but otherwise I was a little disappointed in the quality. These were more expensive than other VR lens options, but the magnets are so small and weak (one of them even popped out when I first took them out of the box) that the lenses shift very easily while playing and it causes uncomfortable distortions. The placement of the magnets cause the shape of the lenses to sit uncomfortably on the bridge of the nose.Overall these are a really great concept but they need some improvements. Personally I would love if the lenses had larger, stronger magnets so that they fit in more securely, and that the magnet placement took advantage of the extra space above and to the side of where the lenses for, rather than in the middle where it presses on the nose."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Rodrick",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T16:07:48.000Z",
          "Titre": "Presses against my nose",
          "Contenu": "The frames that hold the VR-Wave lenses press against my nose and are very uncomfortable.  I'm an adult male with an average size nose, I guess--nobody's ever told me I had a big nose.  But these things stick out and around the Oculus lenses (screens).  I have somewhat narrow-set eyes so I use the middle position for the screens.  If I set them to the widest position they barely touch my nose--but then the interpupillary distance is wrong and the screens are not in sharp focus.  Given those issues I'm not entirely sure my next comments are valid--but the lenses don't give me a very good view in VR.  I can only get a sharp focus in the very center of the screen; if I move my eyes up or to the sides it's not very sharp.  I suspect my complicated prescription has something to do with it, along with my astigmatism.  Customer service is outstanding.  I asked for a refund and had no problems getting my money back.  These lenses are a great idea and I hope they can fix the things that gave me problems, because I’d sure like to have them."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Franz",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T04:53:52.000Z",
          "Titre": "Product 5/5 - customer service 3/5 - proactive communication 1/5",
          "Contenu": "I ordered Glases for my Quest 2 and they are great 5/5Delivery took around 2 month. It was stuck for 1.5 month in china (March 2022). This is at a time where China was hit hard with COVID Omicron variant. So if it safes lives im happy to wait. The reason for my avg review based on the communication of customer service. 1) if a situation like this arise simply inform customers. That shipping will be delayed2) When I first ask about my order. I got an answer, they they will look into it. I never got a follow up mail.3) I followed up myself (after a automated mail ask me to review my not received product) and then Customer service offered me a refund or send a new product.👍This is actually a good thing. In the end the package arrived. I guess that also there customer support has a tight control what every emp. is allowed to say. So its probably not even on a specific stuff member. I conclusion be more proactive in your communication. I understand that there could be a worry of mass cancellations if you tell people that there deliver takes up to 2 month. But right now you make it very hard to recommend me to friends, so it will hurt in the long run."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Snethen",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T00:15:59.000Z",
          "Titre": "Utter Disappointment [Revised]",
          "Contenu": "Maybe for the right person with a generic face structure, these would be great. However for me, these lenses, to my disappointment, are unusable. They fit too thickly on the Quest 2's lenses, so they bulge out. Resting my headset on my face, these inserts dig into my nose. In addtion, my FOV is horribly altered in that not only can I see the bezel of the lenses, the edges of the lense inserts give off a very jarring fisheye effect when looking anywhere near the edge of the lenses -- a nonexistent issue when simply using my glasses. To top it all off, my vision is blurred when wearing these lesnses, depsite them being given the correct prescription in addition to my extra care to clean the lenses. One month waiting for shipping and $100 down the gutter!Update: While I still cannot recommend these lenses to anyone with a large prescription, I have to give credit where its due. VR WAVE read my concerns and actually offered a refund for my order. I have to recognize their customer service here and solely for their customer service excellence, I'll be changing my review from 1 star to 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T08:29:09.000Z",
          "Titre": "Has anyone had weak magnets",
          "Contenu": "Has anyone had weak magnets. Not exactly a strong grip at all. Worried they will fall out easily."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ed Meeks",
          "Nb_Reviews": 13,
          "Date": "2022-02-06T21:51:05.000Z",
          "Titre": "difficult to install",
          "Contenu": "difficult to install, does not go on as easy as shown in videos"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Jerlon",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T22:50:20.000Z",
          "Titre": "Excellent response to problem",
          "Contenu": "Excellent response to problem. New part was quickly sent."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "paul vlastelica",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T09:42:58.000Z",
          "Titre": "to confusing",
          "Contenu": "just make the buying more simple its to confusing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon W",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T21:56:43.000Z",
          "Titre": "Good",
          "Contenu": "It is nice not to wear glasses. I'm not sure what is but if I'm not looking straight things get blurry again. Don't know if it's a focal point issue or what. They do fog up a bit more then just wearing glasses but that is just a part of VR anyway. Fit is really good and the magnets work well. I'd still recommend them but I can't say if they are better or worse then any of the competition out there. Shipping was fast too so that was very nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K J Hissong",
          "Nb_Reviews": 4,
          "Date": "2023-10-11T13:54:26.000Z",
          "Titre": "My experience!",
          "Contenu": "Okay, I ordered for 3 systems.  Not sure of a fluke or what,  but lenses seems to have minor out of focus at the edges.  not sure if this is normal or not.  But will say way more comfortable then trying to wear standard glasses while using VR headsets.  I did try each of the three I ordered, but not for long periods of time each.  Even with this little out of focus issue, I will be ordering another set for my Q3 soon. The three were ordered with my new prescription from my eye doctor, but not what I use everyday.  So possible it is the prescription and not lenses.  I plan to try and order lenses that are previous prescription and see if any difference.  Was told by eye doctor that I had to use most current prescription even though I did not upgrade my everyday lenses to that prescription and stayed with my previous lenses.  Only minor changes, but I feel those lenses work well with vr.  Sorry, If I am not explaining this very well.  More then willing to try and answer any questions you might have on this issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Freitas",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T05:37:47.000Z",
          "Titre": "Received Meta Quest Pro lenses with…",
          "Contenu": "Received Meta Quest Pro lenses with magnet missing and a loose magnet immediately lost. Contacted VR Wave support and received message to send pictures and video showing issue did just that and then silence. No response after a week. $100 blown. Beware.2/10 Edit - They actually did end up shipping a replacement pair of lenses after about three weeks. The lack of communication had me spooked. Lenses work well."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "M. HUMBERT Julien",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T13:24:18.000Z",
          "Titre": "Support not receiving properly emails",
          "Contenu": "I had an issue with the delivery address, contacted Support by email about it. While they were nice enough to try to fix the issue, it took a very long time to be processed. Each time I sent a reply it was like they did not receive my emails. After multiple emails it went through and my order was properly received.Good overall, minus on the small hiccup from support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessie Wells",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T03:57:16.000Z",
          "Titre": "My son says they are better than…",
          "Contenu": "My son says they are better than wearing his glasses or nothing at all, but after awhile they hurt his eyes. He did say that it would hurt his eyes faster without the lenses so maybe they deserve a 5 but the prescription is slightly different than his glasses."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Peck",
          "Nb_Reviews": 8,
          "Date": "2023-04-05T15:39:43.000Z",
          "Titre": "Happy with purchase & delivery",
          "Contenu": "Can’t really comment on the clarity when using as during the time they arrived I’ve had a virus that’s affecting the sight in one of my eyes.  However the quality feels extremely good and the magnetic assembly helps to fit them brilliantly.  No regrets with my purchase, just waiting for my eyesight to return as it was."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T15:29:40.000Z",
          "Titre": "Almost perfect.",
          "Contenu": "The lenses are of excellent quality and provide a better visual experience. The mounting magnets are a little weak and sometimes the lenses shift and need to be put back in place. Otherwise excellent overall."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Toocoolforyou",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T23:51:56.000Z",
          "Titre": "Talking about the chat asking questions area",
          "Contenu": "I havent received my product yet but I am writing a review on the chat area where you ask questions. There was this one worker who was very nice and helpful. I appreciate those kind of workers very much. They explained things easily so I could understand. Thanks Harvey!!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Claudio Kellenberger",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T08:23:22.000Z",
          "Titre": "good lenses, but keep falling out, poor customer service / RECEIVED REPLACEMENT LENSES",
          "Contenu": "Ordered VR lenses for my G2. The lenses do not fit properly around the headset's internal lenses. On top of that, the prescription lenses keep falling out of the frames, often when looking up. VERY annoying. And to make matters worse, VR Wave has consistently ignored my emails in that matter - this is not how customer service should be!UPDATE 17August: after putting up this review, the team reached out and has offered to ship a new set of VR lenses. So far so good! I will update this once new lenses are received and testedUPDATE 01September: replacement lenses arrived and they are now faultless. lenses work perfectly now"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer O",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T05:01:28.000Z",
          "Titre": "Great lenses, customer service could be better",
          "Contenu": "The lenses are great.  I am giving it four stars because there was a delay in the supply chain.  The reduction isn't for the delay, it was for the lack of communication about the delay.  They should have let me know via email.  I found out about the delay when I went to their web page looking for a way to contact customer service after my lens order was very late."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T01:13:10.000Z",
          "Titre": "Lens fell out",
          "Contenu": "I was happy with the purchase, until I took out the lens to clean them. The left lens fell out of the frame onto the floor. I have no way of telling which way is the correct way to put it back into the frame. I contacted VR Wave and hope they will be able to correct this unfortunate experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Kirk",
          "Nb_Reviews": 3,
          "Date": "2023-06-12T06:14:44.000Z",
          "Titre": "I ONLY WISH THAT WHERE THE MAGNETS ARE…",
          "Contenu": "I ONLY WISH THAT WHERE THE MAGNETS ARE WERE MALE AND FEMALE SO THEY WOULD FEEL MORE SECURE. HOWEVER, I HAVEN'T HAD ANY ISSUES WITH THEM FALLING OUT. THEY WORK GREAT I REALLY LIKE THAT I DON'T HAVE TO WEAR MY GLASSES TO PLAY ANYMORE."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "AndreiThb",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T13:16:02.000Z",
          "Titre": "Updated Review 12th of June 2023",
          "Contenu": "-Updated Review-It took some time, but VR Wave finally sent me the right order. I have received my prescription lenses today for the Meta Quest 2 and they are amazing. They got the prescription right, I can see clearly in VR and the lenses themselves feel good and do not cause any discomfort.If I were to only review the lenses here, I would give them a 5★ rating, because the product is that good.But I still cannot even begin to imagine how I have received 2 wrong orders before the right one arrived, when I only ordered one product from VR Wave. I don't even know if the first 2 orders belong to some other people or not.After posting the first Review, Manager of VR Wave Joy reached out to me, to help me get my right order.In the end, they were really helpful, and I hope that my problem was just a special case, and that the customer support at VR Wave are actually helping other people with their issues.Product 5/5★Customer Support 3.5/5★"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Barb Pulver",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T03:56:56.000Z",
          "Titre": "The lenses were made to my prescription…",
          "Contenu": "The lenses were made to my prescription and it's great to be able to use the headset without glasses!!! So much more comfortable.  I would recommend."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jay W.",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T06:50:51.000Z",
          "Titre": "Takes Pressure Off Of Head",
          "Contenu": "The Wave Lenses work well with my Oculus Quest 2 headset. I now have an experience or what is like to Not wear glasses when viewing anything. This is an excellent service by Wave."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Yeh",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T07:35:11.000Z",
          "Titre": "The bases of adapters for Quest Pro need improvement",
          "Contenu": "Just received my lens adapters for Quest Pro. Spent two minutes to figure out how to install the bases. Then found the bases are loose and easy to fall out with quick movement. Well, I put some tiny double side tapes above the three clips inside the bases to fix this issue. I compared the design of bases with other venders, it seems the design of these bases don't have the enough grips on the outer area of Quest lens due to the small or short clips. The lens itself look great and been polished around the edges very well. But I did see a little glare but not 100% sure. My prescription is very high but the price asked by VR Wave is the best. Overall, it is still highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen L",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T12:15:49.000Z",
          "Titre": "They didn't work out for me",
          "Contenu": "They didn't work out for me. The lenses were great but the frame is too bulky and with the correct ipd 60 they pressed (hard) on my nose. The company was great about trying to work with me making sure they were installed right etc (Y'all really need a new video). Ultimately the did give a refund."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John St Rock",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T02:18:29.000Z",
          "Titre": "No More Glasses",
          "Contenu": "Not having to wear my glasses is such a big deal to me.  These lenses are great.  I notice that reading the words in the menu is not exactly as in focus as with my glasses, but pretty darn close.  Inside the game, it's wonderful  Thus the 4 star vs 5."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andy S",
          "Nb_Reviews": 13,
          "Date": "2022-12-09T12:21:14.000Z",
          "Titre": "The lenses clip in easily.",
          "Contenu": "The lenses clip in easily so great to switch for sharing. Came with two sets of magnetic clips so spare (or if you have two headsets?).So much better than faffing with glasses as I have done for last 18 months!Worth it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles henricy",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T22:43:01.000Z",
          "Titre": "Was everything I expected and works…",
          "Contenu": "Was everything I expected and works fine. It's a bit tricky to get them to stay of the rubber part of the Index but it seems to stay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Skullblack Skullblack",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T01:51:29.000Z",
          "Titre": "Only one thing",
          "Contenu": "It works great the only thing is that it has a lot of pressure on my nose I’ve had it for a week and I’m still not used to it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M N",
          "Nb_Reviews": 4,
          "Date": "2022-08-03T19:05:02.000Z",
          "Titre": "Bad quality. Lenses fall off and arrived with tiny dents.",
          "Contenu": "1. These lenses do work correctly as per prescription. But that is the only 'positive'. 2. They barely hold onto my HP Reverb G2. The right one stays there pretty well but the left one does not stay on and simply falls off when used while playing. No matter how many times I tried to fit it back on, it keeps falling off anyway. Those frames are soft silicone and it is simply too loose to stay on the left G2 lens.3. I ordered 'anti-glare coating' addon for these lens and when I got them I could see tiny dents on the surface of the lenses straight of out the box. Not sure if it is coating damage or lens damage but both inserts have few of these tiny dents here and there. They do not affect the way I see through the lens though, or at least I can't notice it when close to my eye, but still how come the new product has these issues? 4. VR Wave Support initially responded to my request about left insert falling off by providing a link to installation video. After few attempts I thought the insert is finally in place as I twisted it sideways but it fell off on my eye later again while playing a game. I tried to reach out for help again, even recorded a video of a problem, but no response so far.You can watch my video demonstrating the issue if you search for 'VR Wave left lens falls off' on youtubeOverall I spent almost $100 following the hype and promos from Youtubers but only got a damaged product that can't be used. I either need this solved/replaced or refunded please. I will update this review if I get any response and solution from them.UPDATE:VR Wave team contacted me and offered a replacement for a lens that was falling off. I finally received it. They didn't just send me a rim, but they included a new lens with it as well. And now fits very tight, staying in place as it should. In fact it's more secure now than the right one. Though right one does stay in place, it's more \"loose\" in a way that I don't need to apply much force to pop it off. While this new left one replacement sits there really nicely. If anything, VR Wave should only use the inserts like that for all of their lenses. I can finally use the product now hence changing the rating considering they were able to help me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Styx",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T16:54:53.000Z",
          "Titre": "Product works as expected",
          "Contenu": "Product works as expected, manufacturing and shipping took the longer end of the given timeframe"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cole W.",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T00:51:48.000Z",
          "Titre": "4 1/2",
          "Contenu": "I'm giving a four star instead of a five because once I place the order that was very easy and installed them which was easy I noticed one of the magnets was holding my lenses up because it had not been seated correctly. With a little ingenuity I fixed it myself, which I don't suggest doing, after that they are great I love them I would suggest to anybody who wears glasses to get them."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "James M",
          "Nb_Reviews": 2,
          "Date": "2022-03-09T06:36:19.000Z",
          "Titre": "Good product.",
          "Contenu": "Prescription is great, magnetism is great and product quality is solid. Only issue I have is these make the nose gap slightly smaller and can press down on my nose uncomfortably at times. Great product just wish they'd add a little padding to the inner nose side of the lenses and they'd be perfect!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Upright",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T08:27:52.000Z",
          "Titre": "The customer service is very good",
          "Contenu": "The customer service is very good. My first pair of lenses that arrived were wrong as they'd missed off the NEAR part of my prescription. As soon as I emailed them, I had a new pair sent out immediately and they are spot on. It's fantastic not having to wear glasses now when I go into VR."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adan Zapata",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T21:54:53.000Z",
          "Titre": "Great product Ok deliver time?",
          "Contenu": "I order them because my quest keep disconnecting cuz of my glasses space when I move my head so I spend $130 seeing the review from YouTube and Facebook I order them and got a email saying there in production after a week and 2 weeks later I contact the team about my tracking number and in a few days I got it so to sum it up the product is grade and the extract you get with it is helpful but time to get it is a bit long (1/22/2022-2/12-2022) but it’s worth it in my opinion there clear and helpful if you play vr or vrchat"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary  Rucker",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T10:19:13.000Z",
          "Titre": "My experience was average my order of…",
          "Contenu": "My experience was average my order of lens was wrong and it took a few emails back and forth to finally get across that the wrong set had been sent, I now have the correct ones and am very satisfied I was also satisfied with the holding case I ordered that arrived in a timely manner...I won't let a mistake stop me from ordering more products in the future...I do feel customer satisfaction is priority."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail Watts",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T06:35:07.000Z",
          "Titre": "Great Vision",
          "Contenu": "I only say four stars because the customer service is shut down on the weekends and the phone line is only open M-F for 6 hours. But after finally installing my lenses they are a game changer!! Perfect vision with no glasses! The packaging is great and the lenses come with a nice storage case. There are extra bases for the lenses as well. Very happy!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T15:15:55.000Z",
          "Titre": "Game Changer for glass wearers! (Quest 2)",
          "Contenu": "It took almost 18 days to get my order delivered. I had to keep contacting them to get updates after a week from ordering the lenses. There were no install instructions. Had to watch several youtube videos to get an idea. To install the mounts on the headset lenses were tricky to snap in. But once installed, the wave lenses are then easy to put on. These lenses are definitely a game changer. Its very comfortable to wear them with vr cover interface and feel even more immersed into VR. No issues with lens make so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Anthony",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T03:00:21.000Z",
          "Titre": "Worth it for reduced eye strain",
          "Contenu": "Ordered non prescription lenses to help with eye strain. These definitely do the trick. I’m able to play longer without feeling like my eyes are going to bleed. Also I feel the viewing angle has become bigger, which is great! The downside is how far they stick out from the original lenses. I had to use the glasses spacer that came with my face mask to get my eyeballs far enough away to be comfortable. Overall this is a great product and I do highly recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaila Smith",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T14:58:01.000Z",
          "Titre": "These lenses are fantastic",
          "Contenu": "These lenses are fantastic!  The only thing keeping me from giving 5 stars is the shipping, which isn't VR Wave's fault (except for who they chose to use for shipping. Pitney Bowes is horrendously slow.).  But, now they're here and I love them!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Shaw",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T02:59:19.000Z",
          "Titre": "Had an issue but easy path to resolution",
          "Contenu": "I had an issue with my initial order (seems like the lens rotation was incorrect) but their support was quick to fix it and ship me a replacement for that lens. It even included an extra case, lens attachments, cleaning wipes and cloth, so that was a nice surprise.Regarding fit, though, luckily I'm on slot 3 for the quest 2 lenses. If I put it on 2 I can feel the lenses resting against my nose a little."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T13:58:22.000Z",
          "Titre": "Overall Happy",
          "Contenu": "The prescription on the lenses seem pretty good.  The fit of the mag ring is just okay on my OQ2.  I used free shipping and it took 23 days from the date I ordered to the date I received here in the US.  Overall I'm happy with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mun Nguyen",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T06:44:22.000Z",
          "Titre": "From Toronto",
          "Contenu": "It is a good product. I received it 5 days after ordering. I feel comfortable using them with my Oculus Quest 2. I see everything is very clear. Although it's a bit blurry when I moved my eyes to look around, that doesn't affect the picture quality and the experience. I hope next version will fix it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ANDRE ARTYMIUK",
          "Nb_Reviews": 6,
          "Date": "2021-03-19T17:55:46.000Z",
          "Titre": "Initial Poor performance from VR WAVE rescued by Good Customer service",
          "Contenu": "VR WAVE  sent the wrong lenses. They sent Oculus Quest Lenses  when I ordered HP REVERB G2 lenses.  When contacted the Support staff claim they sent the correct lenses even though I provided a photo of the incorrect lenses I had been sent.      Once notified of the problem  a new set of G2  lenses were made.  These are great, an excellent product. If only VR Wave's Quality control had spotted the problem BEFORE the wrong lenses were despatched it would have been a 5 star review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MATT ZSCHILLE",
          "Nb_Reviews": 2,
          "Date": "2022-01-28T04:32:33.000Z",
          "Titre": "Game changer for spectacle wearers.",
          "Contenu": "Hi everyone I'm blind as a bat without glasses. I just got my VR Wave lenses in and I can play the OQ2 with my family now. Not just watching them cast it to the tv. The glasses insert/spacer that comes with the OQ2 didnt help me at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Patten",
          "Nb_Reviews": 1,
          "Date": "2021-09-12T05:53:46.000Z",
          "Titre": "Love'em",
          "Contenu": "Ordered a pair and I love them.  No more trying to adjust my glasses.  Minor gripe would be they're not as easy to swap out when playing with a friend, at least not with the facial interface I have. Of course it could just be that I'm clumsy.  The edge of the interface gets in the way when I try to quickly remove them and reattach them, end up leaving finger prints all over them.  But they are clear, they never get moved out of the sweet spot so the picture is always perfect.  They even seem to resist steaming up when I'm doing strenuous games.  For me they were a great investment."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-11-24T01:05:37.000Z",
          "Titre": "Good well made product delivered within…",
          "Contenu": "Good well made product delivered within timeframe quoted. Blue light coating is pseudoscience. If you can see blue light through the lens, it doesn't block blue light, despite what the mixed wavelength \"test\" tool shows you"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Branoski",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T19:10:28.000Z",
          "Titre": "Can’t complain",
          "Contenu": "Can’t complain. They had problem with the shipping and they compensate me for the delay. Product: it really makes a difference adding those glasses in there. Happy with the product."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "kees houbolt",
          "Nb_Reviews": 2,
          "Date": "2021-04-04T09:17:08.000Z",
          "Titre": "Finally a perfect product",
          "Contenu": "Today I received the shipment with a second replacement for my initial order.Now the lenses are perfectly shaped and ground in the plastic rings.Thank you for your efforts to deliver a good product. I am very happy with it."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Gilles",
          "Nb_Reviews": 4,
          "Date": "2021-12-08T12:44:57.000Z",
          "Titre": "Very good quality but a little detail…",
          "Contenu": "Very good quality but a little detail that is annoying: the right lens does not fit properly into the reverb g2 and drops from times to times ... otherwise, it is so much better than with my glasses."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Octavio Perezgomez Gaona",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T15:12:29.000Z",
          "Titre": "Great job VR WAVE",
          "Contenu": "Great job VR WAVE, this product give me the trust and confidence I need in my VR experience. Now my Headset optics are protected, and my eyes are also protected from blue light. Is a win to win deal for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Clayvr",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T23:17:06.000Z",
          "Titre": "Save money, keep using your own glasses.",
          "Contenu": "Great quality lenses that attach with some difficulty, but stay on for the most part. After installing them and using them for the first time, the focal quality was not much different than using my prescription lenses, however was more convenient than having to keep removing my glasses. I thought I would be blown away by the image quality and sharpness, I was not. And I still had to adjust the headset to get a consistently sharp image.For me, not worth spending the extra money to get an image that was similar to my prescription lenses. Company is very responsive and communicates well, however as I said, you're better off just continuing to use your prescription lenses unless you have $100 to throw away.These lenses are over rated for what you get."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Owen",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T05:32:24.000Z",
          "Titre": "VR wave lenses",
          "Contenu": "Ordered these to the UK. They took about 3 weeks to be delivered. They work a treat but they do put some pressure on your nose which can get sore after extended use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Crowe",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T05:33:17.000Z",
          "Titre": "very good would gave 5 but long time on delivery",
          "Contenu": "they are very nice to use alot better then wearing my glasses only thing was how long it took to get them but i love them me and my wife use them for supernatural"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darren Hopkins",
          "Nb_Reviews": 2,
          "Date": "2021-07-09T18:57:02.000Z",
          "Titre": "Great Product!",
          "Contenu": "Received my lens order very fast. Product was packed professionally, contained helpful information on installation and the lenses were a huge improvement to my VR experience!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Doshair",
          "Nb_Reviews": 2,
          "Date": "2021-12-09T18:18:22.000Z",
          "Titre": "PHENOMENAL OPTICAL POWER!!! shiiiiity little shipper",
          "Contenu": "Original ★★☆☆☆: It's been 13 days and my order has just now, possibly shipped. They've been saying for 10 days that it was \"in transit\", but USPS hadn't processed it yet. So... in other words, it wasn't in transit, it was still being processed. According to the tracking code I only just now was able to get, it might be here by the end of the week. In this time, I've ordered my Quest and been playing with it for 1.5 weeks. I ordered this and the Quest the same day, within the same hour.Edit ★★★★☆: Okay, their shipping is awful, but the product is freaking phenomenal. Guys, if you think VR is supposed to be a little blurry, get this! It's your glasses (or lack thereof) when VRing. Everything is so freaking clear now! It's really changed my VR experience. It would be a perfect score, but you pay the price for the shipper you choose."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Gonzalo Novoa",
          "Nb_Reviews": 5,
          "Date": "2021-06-05T19:34:13.000Z",
          "Titre": "Excellent system and very quick service",
          "Contenu": "The only downside to these lenses is that they're thicker than other models in the market which might be a problem if your ipd is low.If it's not (positions 2 and 3) then it's the best system you will find, especially if you share your headset with someone else. Putting the lenses in and out is no longer a problem since they're magnetic.The adapters are sturdy, good quality, they come with 2 spares in case one breaks, the lens are good quality and they come in a very nice package too. For anyone needing glasses this is a million times better, a total must-have for VR.The service was very fast, I got them in less than two weeks (Spain) and the price was also very good even with a strong prescription like mine.Very recommended. I give it 4 stars and not 5 because of the extra thickness of the adapters but if they can change that in the future it would be a 5/5 product."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "ROGARY",
          "Nb_Reviews": 2,
          "Date": "2021-12-01T10:40:25.000Z",
          "Titre": "It's great not to have to wear glasses…",
          "Contenu": "It's great not to have to wear glasses with my Oculus Quest 2. Perhaps the fog problem takes some additional seconds each time to be solved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Kanter",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T03:24:02.000Z",
          "Titre": "A few issues, but otherwise a happy customer!",
          "Contenu": "I paid for expedited shipping, 8-12 days. After 2 weeks, nada movement in tracking. It seems it was sitting in China in customs. I contacted VR Wave, they said they would clear it up. I then got a tracking notice from DHL saying delivery date was in 10 days. I was not happy, contacted VR Wave, somehow it came 2 days later! Well done VR Wave.I received nicely packaged, but I had trouble getting the magnetized rings on my Q2 headset. They did not snap on easily, and I could not get them on evenly. After considerable futzing, i think they are on OK and lenses are secure.Prescription seems good, and it is liberating to see VR without glasses, far more comfortable with a wider fireld of view. I mainly use Q2 for Eleven Table Tennis, a wonderful simulator that is a main source of exercise when i can’t get on a tennis court. I also use a BOBO fan to prevent fogging, and I had a VR Wave cover (pads) that Oculus sent me. The combination of all of this makes VR a delight."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Merc Tan",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T02:59:24.000Z",
          "Titre": "I bought a pair of Reverb G2…",
          "Contenu": "I bought a pair of Reverb G2 prescription lenses and love it. It will be perfect if it come with magnetic design like the quest 2 lenses"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Krill",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T15:36:32.000Z",
          "Titre": "TERRIFIC, but with minor installation issue...",
          "Contenu": "First off, the VR WAVE Rx Lenses are WONDERFUL! I no longer have to wear my \"Readers\", which were previously needed to get a clear and focused image, regardless of the IPD Setting. Comfort is much improved, internal reflections are gone plus, since I no longer have to clean the lenses on the \"Readers\" prior to use, my OG QUEST ONE is now grab 'n go. Huge improvement in user-ergonomics! So why the 4-Star Rating? The Installation Video depicts installation ONLY on the QUEST TWO, which is designed/built differently than the OG QUEST ONE. It took a bit of fiddling to discover there are bezels surrounding the installed lenses on the OG QUEST ONE which need to be gently pried-off BEFORE installing the magnetic bases on the VR WAVE lenses. Once removed, the rest of the installation went swimmingly. Please include this information either in the shipped package or update your Installation Video. Otherwise, a VERY HAPPY customer. Thanx and Cheers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Raulin",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T19:55:13.000Z",
          "Titre": "Magnets are Pointless",
          "Contenu": "I left a bad review about how much the magnets annoyed me for the Quest 2 lenses, but I finally, after having them for like half a year, figured out how to attach them so the lenses are unlikely to slip or fall off. You have to put them on with both parts stuck together and be careful not to push the bottom part too far.So I'm upgrading my review to 4 stars. Still, I don't see any benefit to having the magnetic attachments. I still think it would be better if they just snapped on like the Valve Index ones. As long as they stay on, you shouldn't have any reason to need to clean inside them, but if you do, the Index ones come off easily enough. So minus one star for that annoying and pointless design choice.These lenses are an absolutely essential accessory for any HMD if you need glasses though. Even though I could use the Quest 2 with glasses (never got them to fit with the Index), I would never want to go back. I buy a pair for every HMD I get, which is 2 so far, and am holding off on getting a Reverb until the lenses go on sale again, because what's the point of having better resolution if you can't see it clearly?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FatherTimeBK",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T14:25:42.000Z",
          "Titre": "The lenses work great..",
          "Contenu": "The lenses work great... probably 5 stars if the instructions on attaching were just a bit clearer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Oliver",
          "Nb_Reviews": 2,
          "Date": "2021-08-20T05:49:11.000Z",
          "Titre": "Buyer Beware, Does not fit Rift (CV1) **edited/updated**",
          "Contenu": "So, I received my lens yesterday in 6 days, very nice, and the lens are awesome, however, on the order page, my confirmed order, and even the instructional video that VR Wave keeps sending me, it says it will fit Oculus Rift.However the adapter that was sent seems to only fit Rift s and Quest 1....then why have Rift in the titles? I have contacted support to no avail, as of yet. They keep sending me links to the instructional video, which is no help.I will only change my review if and when they help me, or send a refund.The lens do look nice, and the RX was spot on. I hope they do something...so please buyer beware, if you have an older Rift (CV1) they will not fit as the cloth in the faceplate does not allow the removal of the bands around the lens in the headset. I am not going to damage or modify my expensive headset, spent 140.00 with shipping and the addon anti-glare and blue light filters. Very unhappy right now.***EDIT***they contacted me back, and informed me there was a typo on the website, and sent me a refund and coupon code, I hope to see that they will have something available in future, I appreciate that, other than that I still recommend them, the lens were of great quality, and I still would recommend them********"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dustin Mccutcheon",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T07:55:40.000Z",
          "Titre": "I wish the magnets were stronger…",
          "Contenu": "I wish the magnets were stronger sometimes when I turn my head real fast the lens pops off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stanley  McCrea",
          "Nb_Reviews": 2,
          "Date": "2021-10-03T01:32:38.000Z",
          "Titre": "products are good but the shipping cost…",
          "Contenu": "products are good but the shipping cost is  high because it is coming from China."
        },
        {
          "Note": 4,
          "Lieu": "MT",
          "Pseudo": "Tommaso Piller",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T17:22:11.000Z",
          "Titre": "Nice use Oculus without glasses."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jean-Francois Laplante",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T19:46:45.000Z",
          "Titre": "THEIR mistake was expensive for me...",
          "Contenu": "Ordered a set during Black Friday.  Got an email back for optical prescription confirmation which I've found very professional since I didn't upload a doctor's prescription.  So far so good... About 20 days later I received the Quest 2 glasses by Canada Post but they made a mistake and messed up the right eye which was confirmed by the plastic prescription card they include with the unit.  I was mad but wrote an email and got a response 2 days later saying they will correct their mistake and send another right eye.  Got a DHL shipping notification from China for it so I was pleased to see that at least they reacted rapidly.  3 days later, I get a 23$ customs bill from DHL... Now I was really mad, wrote another email suggesting I refuse the package and they ship it another way or that they reimburse the 23$ I have to pay.  Got no reply and DHL was saying that the parcel would be delayed so I ended up paying for VR-WAVE's mistake.  Didn't try the glasses on yet...!UPDATE 20211225 The customs invoice was already included in the email I sent. VR-WAVE contacted me a few days ago and offered to pay for half of their mistake which I refused.  In the meantime, the remade lense arrived and this time it was done correctly according to the submitted optical prescription.   The lense is perfect so I added 1 star.  Waiting for a return from VR-WAVE since they said that they will contact their management.UPDATE 20211227 I got a notification for a partial refund technically they refunded me a little more than I asked.  I asked for the additional customs cost of 23$CAN and I received 23$US but it was possibly a mistake!  Upgraded to 4 stars because the product is good but should have been 3.5 because of the hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robbie Stafford",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T21:16:23.000Z",
          "Titre": "Easy",
          "Contenu": "Yayssyyssys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Magidiny",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T07:35:37.000Z",
          "Titre": "I first heard about VR Wave through youtube and many other options too though i ultimately went with this one due to the Price being faorly good and due to the reviews. Everythin was made perfectly.",
          "Contenu": "I first heard about VR Wave"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Osman Chaudhary",
          "Nb_Reviews": 4,
          "Date": "2021-12-21T17:53:06.000Z",
          "Titre": "I can finally enjoy FPV"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T10:17:56.000Z",
          "Titre": "Great quality, Superb service & fast delivery",
          "Contenu": "Great quality, superb service personally reaching out to me to confirm OD & PD info before making the lenses. Half the price of other shops"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Wolfe",
          "Nb_Reviews": 6,
          "Date": "2023-11-30T05:07:59.000Z",
          "Titre": "They work, installation is finicky but they do work better than glasses..",
          "Contenu": "Review by a quality management systems auditor and quality technician. tl; dr They work, watch a YTube vid on installations and be careful. Near or far, they help and don't break the bank. Full review follows...I have the Quest 2 and cannot see far away too clearly, not bad but, I saw these recommended and for the very affordable price, I thought I'd try them. My wife cannot see close up so, we needed to get a pair for her. Both pairs work very well, just as you would expect. They clear up the view for both of us, near or far. The spacer for eye-glasses on the Quest 2 works but, this is sooo much more comfortable.There is a one star removal in my rating (I added one back too though, I'll explain in a moment) because the instructions are not terribly clear. Thankfully, you can look up installation vids online but it still took me two or three tries to get mine on. Once I got the hang of it though, I popped my wife's on with no problem. Just be careful pressing them on. No, you won't ruin your headset, unless you're a ham-handed oaf about it.  As far as clearing up non-vision-related VR blurring & trails, they don't help that. I read reviews that said they help, they don't. But, the product manufacturer never claims they do that anyway.All in all, both pairs were extremely affordable and worth every penny. They came packaged nicely and were in a protective container. The company also sent out a direct email asking about my experience and asking for a Trustpilot review, whether my experience was good or bad, so they'd know how they're doing. That's top-notch, shows they care how they are doing, and I added one star back for that. They also did *not* harass me with spam after my purchase. Just a quick \"How'd we do?\" and that was it. Great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T04:38:56.000Z",
          "Titre": "It takes time to receive your order but...",
          "Contenu": "It does take time to receive your order. I partially thought that the order was lost, but I made sure to give the appropriate number of business day according to what was given in shipping time so if you order from this company, make sure to wait the appropriate number of business days (weekends do not count). Anyway, I did get my order in a timely manner, I did not need to contact customer service at any point as everything came at the time quoted, nicely packaged and undamaged. The lenses are great and I see perfectly through them, no discomfort, a definite recommend to anyone looking for VR lenses for various VR headsets. Will order again should/when my prescription change."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Cameron Whitlock",
          "Nb_Reviews": 5,
          "Date": "2023-11-11T05:28:50.000Z",
          "Titre": "Worth every penny.",
          "Contenu": "This is my 2nd pair of perfectly crafted lenses. I added the blue light filter and the headache's have disappeared. High quality and worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Don Lowe",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T14:45:45.000Z",
          "Titre": "The Clarity",
          "Contenu": "What a difference using the VR Wave leases the clarity is Fantastic. I would definitely get a pair you would not be disappointed. Thank-You VR WAVE you made it so much better for me to see."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Ehrenreich",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T05:28:55.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Super quick shipping (arrived 7 days from ordering) absolute game changer and I don't have to worry about scratching my lenses or glasses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamieson Person",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:49:18.000Z",
          "Titre": "Should be recommended with the headset.",
          "Contenu": "If you wear glasses, this product should be about as necessary as the VR headset itself. It should actually be recommended by VR companies and I'm a little disappointed that I had to find out through an ad on IG and not advertised in the box with the headset. It's kind of funny because when your using your \"VR wave eyes\" but then you take the headset off, your reminded that you actually can't see in the real world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rory",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T04:16:57.000Z",
          "Titre": "Wow! I am stunned!",
          "Contenu": "I am an avid user of the Quest 2 for watching 3D movies. Or I should say, I am now! I have over 350 of them and I am very much looking forward to watching them with my headset. I tested the lenses on Avatar, and am truly stunned at the quality. Like night and day, going from glasses to the inserts. I tried to get some lenses from another company and they refunded my money, saying they couldn't fill due to my being slightly farsighted. VR Wave filled my order and delivered an outstanding product in 10 days. I will personally recommend them to friends of mine who wear glasses, as VR is AWESOME NOW! And I haven't even tried any games yet."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Aidan davis",
          "Nb_Reviews": 4,
          "Date": "2023-04-26T01:15:57.000Z",
          "Titre": "PSVR2 lenses",
          "Contenu": "This is the second pair of lenses I have bought from vr wave. First was for my quest 2 and now psvr2 service on both occasions was quick with no issues.Would highly recommend getting prescription lenses rather than wear glasses with the headset it makes the whole experience so much better. Also watch the fitting video on YouTube I initially fitted the lenses upside down, take it from me it makes a big difference."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Bergum",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:36:51.000Z",
          "Titre": "Fine Tuning and Clarity Increases Oculus Enjoyment",
          "Contenu": "I was putting off getting a pair of the VR Wave lenses until my next eye appointment.  Once that occurred, I immediately ordered a set. What a difference!  The clarity and crispness of my games was awesome!  I could actually see writing within games with more clarity and Walkabout Mini Golf was pristine.  Playing on my Oculus has increased in pleasure tremendously.  The blue light filter has also added to enjoyable gameplay as eye fatigue has been reduced exponentially.  I highly recommend these lenses for anyone who wants more enjoyment out of their Oculus investment!   Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Fenrir",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T10:56:05.000Z",
          "Titre": "A far Better experience",
          "Contenu": "VR lenses help propery immerse you into the virtual experience. Glasses take it away, And can sometimes be uncomfortable. Personally, I got a bit of a headache, and almost crossed eyed playing VR for half an hour or more. Thats gone now. So it must have been caused by my glasses and not the VR distorting my vision, because of the rigid and sometimes uncomfortable tight fit inside the headset, even with the  spectical adaptor fitted. Spent a lot on buying a headset and games. So worth investing in lenses, to enhance a long term investment."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Eddy Jennings`",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T20:36:30.000Z",
          "Titre": "PSVR2 Prescription Lenses",
          "Contenu": "Arrived 3wks after I ordered them. They came packaged in a sturdy zip case and I fitted easily the first time. The prescription was perfect.I use them for Driving Simulators and they truly enhance my experience. If I have to take them out so my wife can drive, they come out quickly and easily via small magnets. I would strongly recommend VR Wave. (Wear your glasses without your glasses)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian M Canada",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T19:21:28.000Z",
          "Titre": "Excellent quality lenses, amazing for high rx and astigmatism",
          "Contenu": "Excellent quality lenses!  I was really worried about ordering these online, but they were affordable enough that I could potentially lose out.  I have a very high prescription (-6.25ish), and astigmatism (-2.5ish) and almost always have to worry about the shape of my glasses lenses causing distortion.  I am extremely happy that there is no vertical or horizontal distortion in the VR wave lenses I got, with a small amount of distortion around the outer ring.  I notice it most in Elite Dangerous where there are linear interfaces in my ship that change angle right at the edge of the lens, but this is fine!  I'm used to spherical distortion when looking a few degrees away from the centre with some of my cheap eyeglasses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mingmingming",
          "Nb_Reviews": 3,
          "Date": "2023-03-04T02:07:01.000Z",
          "Titre": "I did not realize I was half blind untill I used the lens",
          "Contenu": "It was a very pleasant experience buying,receiving, and using the presciption lenses. They put the effort to confirm with me the prescription information, the waiting was shorter than I was expected it to be, the install was easy and wow the lenses work wonder. I should have got them earlier! One thing I would suggest would be put a detailed video on how install the base. I spent a whole ten minutes to figure that out. Except that minor suggestions. I am very satified with the order!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David C Gray",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T04:35:38.000Z",
          "Titre": "A GAME CHANGER for people with glasses!",
          "Contenu": "I like VR but always hated having to cram my glasses into the headset so I thought I'd give VR Wave a shot and OH MY GOD I wish I did this on day 1 of owning my Oculus! No more forehead pain from the pressure of my glasses and I can now play until the headset dies without even thinking about it! These lens are a GAME CHANGER, get them if you truly want to experience VR."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Furphy",
          "Nb_Reviews": 4,
          "Date": "2023-01-11T04:46:50.000Z",
          "Titre": "Crystal clarity without wearing my regular glasses",
          "Contenu": "The prescription lenses are easy to order. Due to the way VR works only distance prescriptions are needed. Easy transfer of eye prescription to the order form. Delivery was quick. snapping into the goggles is easy. The magnets allow me to easily remove the lenses for others to use the goggles. Crystal clarity without wearing my regular glasses with the VR headset. I can finally feel comfortable with the VR headset on. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 7,
          "Date": "2023-06-14T12:09:30.000Z",
          "Titre": "Very happy!",
          "Contenu": "Bought a pair of prescription lenses for my Pico 4, they arrived surprisingly quickly to the UK, popped them in, and have to say I'm impressed!  Excellent quality, nice and sharp, massive increase in comfort and clarity.Will be ordering from VR Wave again if (when!) I buy a new headset."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ken",
          "Nb_Reviews": 48,
          "Date": "2023-05-15T14:33:47.000Z",
          "Titre": "Very happy",
          "Contenu": "I see some comments around response time. My intial complaint was my enquiry about dispatch as i was told a few times they would be dispatched that day when they weren't. However after i guess waiting 8days from order my lenses were marked as dispatched and i was sent a Fedex tracking number by sms. The lenses left on the thursday from China and arrived with me in the UK Monday, i would say that's pretty quick. I ordered lenses for the DJI FPV V2 Headset, the lenses clip on perfectly and now allow me to see perfectly ok without my poxy glasses. Really happy is an understatement. Absolutely do recommend these people, see my other reviews i am genuine and not easily please at all!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T05:00:06.000Z",
          "Titre": "Great product",
          "Contenu": "Just received my lenses yesterday and I’m so happy!  The headset is so much more comfortable now with no more worries of breaking my glasses!  Headaches have gone away too.  What a difference!  Customer service was great.  Quickly notified me when I forgot to upload something during the ordering process and quickly got back to me upon receipt!  VR-Wave is a company I will definitely do business with in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kiska",
          "Nb_Reviews": 6,
          "Date": "2022-08-08T02:36:42.000Z",
          "Titre": "Huge eye relief",
          "Contenu": "These lenses have changed everything about VR for me. I’m sure other players who have bad astigmatisms understand, certain things in VR can be hard to focus on. It also triggers some pretty bad migraines for me. But once I was able to view things through my corrective prescription, the comfort levels in VR went up exponentially. If you need a corrective lenses prescription normally, I highly recommend these. Filling out the prescription online was pretty simple. And shipping was fast."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "kjane blog",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T20:31:17.000Z",
          "Titre": "I'd honestly say these are worth it",
          "Contenu": "I'd honestly say these are worth it. I couldn't imagine using my headset without them. Iam very happy with my purchase and my ordering experience with was top notch from start to finish.  Thank you so much for enhancing my experience without having to wear my glasses or contacts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Dugas",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T15:59:14.000Z",
          "Titre": "I have been very pleased with my…",
          "Contenu": "I have been very pleased with my lenses! I already had the glasses spacer and the Halo headbands. The only initial problem was ordering ask for Plano or Perscription. I needed one lense with a correction and one plano, that was not an available option when ordering. Called and was told to select prescription then select zero for the correction for the plano eye.  Love them. And hope not to ruin another pair of glasses by using the lenses instead."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Lee",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T20:40:25.000Z",
          "Titre": "VR Wave for my Oculus Quest",
          "Contenu": "Lenses for VR Wave for my Oculus Quest came sooner than expected and I was so pleased with the shipping and care.  The lenses were simple to install but feel secure.  The prescription was so accurate and there was an immediate difference.  Other places couldn’t do my RX and I’m glad because these are the best out there!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobbi Bernal",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T18:31:55.000Z",
          "Titre": "Share a Quest 2? Amazing Magnetic Lenses",
          "Contenu": "My partner and I share a Quest 2. The lenses are magnetic, so they come off; however, they do not slip off when in use. The lenses also come with a storage holder. The blue light reduction in my prescription VR lenses allows me to play even longer. I enjoy the clarity my VR lenses give me in the game; I can see more details. I will continuously recommend these lenses to anyone who needs glasses for distance and wears uncomfortably glasses with their VR Quest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie Fralick",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T12:36:41.000Z",
          "Titre": "Get the lenses, you won't be disappointed.",
          "Contenu": "The experience I now have with my Oculus Quest 2, now that I don't have to wear my glasses in the mask, is beyond comparison.  I truly believe this is why I've been able to get a 9 week streak with Supernatural since receiving my lenses.  Such an easy process (just ask your optometrist for your prescription) and super fast shipping. THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chip",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T19:32:29.000Z",
          "Titre": "I ordered the wrong set of lenses for my wife - OH NO!  All is good now!",
          "Contenu": "I ordered a set of lenses for my wife, who loves them by the way!  She had two prescriptions, one for computer, and the other for driving.  When I obtained her prescription; I accidentally used the computer prescription.  VR Wave support was actively involved in ensuring that the right prescription was used once I had it.  They even reassured me when I checked to make sure that the right prescription would be used.  Now, she enjoys not having to \"force\" her cat eyes glasses which are wider than most into the headset, and was pleasantly surprised at how much better she saw the images.  She thought the glasses did well, until she tried the VR wave lenses and immediately remarked to me how nice they were."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Heldt",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T19:54:23.000Z",
          "Titre": "No more glasses to get in the way",
          "Contenu": "I just installed my new lenses and I am so excited not having to wear my glasses anymore.  I have bifocals and the lower part of the screen was never clear.  Plus putting the headset on over the frames is difficult and uncomfortable to wear.  This has greatly enhanced my VR experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Leek",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T19:03:33.000Z",
          "Titre": "Impressed with VR Wave prescription lenses.",
          "Contenu": "I recently bought prescription lenses for my quest 2 through VR Wave. All of my life I have had really bad eyes with astigmatism. The glasses that I have to wear every day have progressive lenses which make it difficult when it comes to reading things in VR apps and games.I was really impressed though after receiving the lenses. VR focal length does not work quite the same as day-to-day wearing for reading and distance. But after using the lenses I can see a significant difference in clarity when it comes to reading and overall field of view. I also like the fact that the lenses are magnetized so that when I'm with friends it is quick to switch them in and out for others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sunblade",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T19:04:36.000Z",
          "Titre": "These lenses are fantastic",
          "Contenu": "These lenses are fantastic. My wife and I both got a set. Previously the headset hurt to wear because of my glasses. The experience with these custom lenses really improved my experience with Supernatural workouts. My suggestions to the manufacturer is different available frame colors.( I had to paint mine so as to not get confused with my wife's prescription.) More visible \"R\"  and \" L\" markings and available suggestions for keeping the lenses clean and smudge proof. I am extremely pleased with performance and increased experience using these lenses. Thank you. Be Well and Good Journey Richie"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guido Kleinke",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T22:50:53.000Z",
          "Titre": "Perfect lenses for my PSVR2 Headset",
          "Contenu": "I received my PSR2 prescription lenses a few days ago (04-05-2023)I am short sighted (-3.50 on both eyes) and also included the blue light filter in my order. Packaging was appropriate so the lenses were well protected during shipping.Installation was easy and the lenses were manufactured precisely to the specs of my eye prescription. Vision in PSR2 is now great and I can finally say goodbye to wearing glasses when I play the likes of GT7, RE8 and Horizon: Call of the mountain.I highly recommend lenses from VR Wave and believe they are absolutely worth the price.My only minor complaint is, that the included QR code was not linked to an PSVR2 installation guide video. Instead I was sent to a page that listed installation guides to all kind of head sets, just no PSVR2 video. But that is really only a minor complaint in an overall great experience with buying these lenses from VR Wave."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Szabolcs Hodul",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T01:30:54.000Z",
          "Titre": "Want the full experience VR could offer ? BUY IT.",
          "Contenu": "Lighting fast service, (7 days from ordering to receiving to Canada) Quality excellent. I Fly gliders IRL and in VR also, so I wear the headset for hours (3-5 hours at a time, depending on the task length.) Switching from glasses to VR WAVE is a life-changing experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Dahlquist",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T23:39:03.000Z",
          "Titre": "An excellent bang for your buck.",
          "Contenu": "The lenses were easy to install and work like a charm. The prescription is perfect and the process of ordering was very simple to complete. Would strongly recommend this if you're looking to get a set of prescription lens for a headset as long as you have a recent prescription from your optometrist."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FireflyNerd",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T06:02:31.000Z",
          "Titre": "So much better than blurry!",
          "Contenu": "Submitting the order was easy, and they were personable and friendly when they emailed me with a question about my Rx. Took them about two weeks to make my lenses and ship them to me. My eyes aren't quite bad enough that the VR experience was ruined by not wearing my glasses in the headset before I got my custom lenses, but this makes it SO much better! It's like a new virtual world. Have already recommended these to friends!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Lawson",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:38:00.000Z",
          "Titre": "Well worth the price.",
          "Contenu": "They where great but it was hard to put the outer ring on other then that awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Perrot",
          "Nb_Reviews": 8,
          "Date": "2022-11-01T02:11:34.000Z",
          "Titre": "Would buy again!",
          "Contenu": "I purchased prescription lenses for my Quest 2.  These lenses have changed my entire VR experience for the better as I had to wear my glasses while in environment before.  Wearing my glasses while wearing my headset would bend the frame of my glasses and risked scratching the Quest 2 lenses.  Ordering was simple, installation was simple, customer service was awesome!  Would order again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaiyre Rasheed",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T22:30:30.000Z",
          "Titre": "Easily worth the money for serious VR players",
          "Contenu": "Simple installation, beautiful design and a very communicative seller. Id say these are a must have for anyone who wears glasses and is serious about their VR playtime. I wont be looking back on this product. :-)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Salt",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T10:39:20.000Z",
          "Titre": "Well Worth the Money",
          "Contenu": "Arrived quicker than expected. Fitting the magnetic bases was difficult, but I managed by watching the fitting video. When I put the lenses on the bases, they seemed quite wobbly as if the magnets weren't strong enough. However, once I wore the Quest 2, it was wonderful, so much more clarity than my last lenses (not VRWave), and more viewable area. They do stick out quite a bit, and I can feel them touching my nose, but it isn't uncomfortable. This also means that there is less light leakage around the nose area! There was no slippage or movement from the lenses whilst wearing the headset. They can however be knocked off quite easily when the headset is off. Some kind of lens protection/cover would have been a nice addition. Overall, I would recomment them, they're worth the money despite the little problems (difficulty in fitting, wobbly when not being worn)."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Reynald Chouinard",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T15:17:16.000Z",
          "Titre": "Excellent services.",
          "Contenu": "Excellent services.I have made 2 separate orders of prescription lenses spaced 3 months apart. One for me then one for my wife. But in the meantime the company has changed its fixing model. So the 2 magnetic bases were not compatible. They all simply offered to redo my prescription with the new bases for free. Joy.In the end, it's lenses are of very good quality, with perfect vision. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Hershman",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T14:32:56.000Z",
          "Titre": "Buy them already!!!",
          "Contenu": "Stop reading this review and go buy them!!  I love mine.  Great quality, fast processing time, and quick shipping!!  My VR experience is 10x better, too.  It is so nice not putting in contacts just to use my VR headset.  And don't get me started on trying to use glasses with my headset!  Now go buy them and make *your* VR experience 10x better, too!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Da Vid À Kim",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T13:08:55.000Z",
          "Titre": "Wasn’t sure at first but decided to…",
          "Contenu": "Wasn’t sure at first but decided to give it a try, I used the info that were on my contact lens box (I wear them rarely, I usually wear glasses). Delivery was fast, the product works perfectly and it makes VR way more comfortable and way more fun that with glasses (meta quest 2)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T01:20:22.000Z",
          "Titre": "NOT A SCAM",
          "Contenu": "this company is legit their prescription lens work just like your glasses it will have you thinking you’re still wearing them when you have the VR headset on"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "KATHY LEFORT",
          "Nb_Reviews": 4,
          "Date": "2023-01-15T19:02:05.000Z",
          "Titre": "Game changer literally",
          "Contenu": "Game changer literally!  Works absolutely perfectly for my eyesight!  Worth every penny!  Extremely reasonable in price and so much easier to read and see inside my Oculus ♥️♥️♥️happy camper"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Brown",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T20:57:31.000Z",
          "Titre": "I cannot tell you how happy I am now…",
          "Contenu": "I cannot tell you how happy I am now that I don't have to wear my bulky glasses when I use my Oculus Quest 2! No more smudges from moving my head around or adjusting things so my glasses don't slip around too much. Sometimes, I would get frustrated and wear my contact lenses on the days when I would be heavily using the Oculus. Not anymore.It is such a relief to have some wiggle space now. The vision is super crisp and I've had no trouble with the lenses popping off or slipping. I'm very satisfied with my purchase because at first, I was hesitant about spending money and them getting the prescription wrong, receiving poor quality material, or having lengthy delivery times. But that was not the case. Awesome purchase, I definitely recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T03:27:21.000Z",
          "Titre": "Best purchase for my Quest 2",
          "Contenu": "Easily the best purchase I have made for my Quest 2. Easy to install. After using these lenses, wearing glasses with my headset is no longer acceptable for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Aymar",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T01:02:26.000Z",
          "Titre": "These lenses are everything and more than advertised",
          "Contenu": "I ordered my VR-Wave lenses and they were delivered earlier than I expected - very happy about that.Also found Technical Support to be very friendly and professional.  I contacted them with what I thought was a problem with the magnets and it turned out that they sent two sets of magnets with my lenses and as soon as I removed one set of magnets my lenses are very sturdy and do not move inside my Wave Two Headset.Overall I rate VR-Wave lenses as an excellent purchase and would recommend them to everybody that needs corrective lenses for there VR headsets"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael S.",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T13:33:27.000Z",
          "Titre": "Well worth the purchase. GAME CHANGER!",
          "Contenu": "The difference in not having to wear glasses to play VR is a game changer for me. The prescription is excellent and I was very surprised at the delivery time. I thought it would take a few weeks but received then within 10 days.Being able to see and read text in VR clearly with no glasses being pressed against my face even with spacers is so much more enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Red Queen",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T19:44:21.000Z",
          "Titre": "Great lenses for Meta Quest 2",
          "Contenu": "These lenses fit the Meta Quest 2 perfectly. The prescription matched perfectly. The install was super easy. It used to be such a hassle to put on my headset with my glasses. I constantly had to move my headset around, take it on, take it off just to get objects into focus. Now it's great to not need glasses to watch VR. The lenses came in a plain brown box but inside was a nice little holder for the lenses along with a cleaning kit and some type of blue light and filter paper to show you the blue light being filtered if you ordered your prescription with the blue light filter. Lenses even came with an extra set of magnets ( which is what holds the lenses to the headset) which is nice is you treat your stuff like a child. I don't see an adult having to replace or change out the magnets if they remove the lenses carefully when they need a cleaning. Customer service response is quick. I had a question about my order and they reached out to me in 24 hours. The only thing that might remove a star for me would be the shipping/ tracking service used. My tracking number made it appear as if my order was arriving via USPS sooner than expected but then never showed up making me believe that my order had been lost or never shipped. VR Wave responded quickly and solved my issue promptly. If you order from them, exercise patience. From the time I placed my order to the time I received it, it took a month, but it was way worth the wait!! I  highly recommend them if you use glasses and want to  experience VR without them getting in your way. It will definitely make you appreciate and enjoy VR the way it was meant to be watched. Thank you VR Wave!!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Viktor Flodin",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T11:49:18.000Z",
          "Titre": "Plano for Index with Anti-Glare and Blue Light Filter",
          "Contenu": "Got the plano ones for the index for blue light and glare purposes and it really made a huge difference in my opinion without affecting the comfort of the headset! I've been using them for about a week and a half and I'm very happy with it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aviad Noach",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T03:07:53.000Z",
          "Titre": "The lens are amazing works great!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Prentiss",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T03:40:04.000Z",
          "Titre": "10 out of 5 stars.",
          "Contenu": "1st. I put in the wrong address and I still got it on time even after they told me they couldn't change the address after it shipped 2nd. Quality out of this world hard case cleaning equipment and extra magnet rings.3rd. Extra mile. I got a certificate telling me they called my eye Dr to verify my prescription. And an awesome blue light testing card to verify the filter works. 10 stars if ot were an option. Gunnq get my wife a pair for her oculus. My vr sick Ness headaches and hurt glasses face have gone completely away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Roche",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T17:05:50.000Z",
          "Titre": "So worth the money, a real game-changer!",
          "Contenu": "I've been a daily Quest 2 users for a little over a year now.  I use it primarily for fitness games - Beat Saber, boxing and HIIT apps.  I have purchased every possible upgrade to make the experience in VR more comfortable while working out and still had issues with the mask applying uncomfortable pressure on my glasses and with the lenses steaming up and slipping during active play.  These VR Wave lenses have totally changed my experience in VR.  I can see everything in VR totally clearly without the discomfort of my glasses digging into my face and without all the slipping.  The cost was more than reasonable, they arrived so fast and shipped VERY securely.  Installing the lenses into my headset was simple and they fit very securely.  I can't recommend them any more highly, if you wear glasses and spend any time in VR these are a must have."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Slow Mill",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T13:29:42.000Z",
          "Titre": "I was a bit skeptical...",
          "Contenu": "I was a bit skeptical, bought them anyway and NOW I LOVE THEM! I honestly see so much better than with my glasses showed in my headset. Collors are better, image is super sharp and It's so much more confy. If You feel like it could go wrong because You have a stronger perscription, don't worry! I have around -9 on both of my eyes and no problemo. There is only one thing I could say is a bit minus and it's that You can feel the borders of the lenses a bit on Your nose (not painfull or anything but You can still feel them), but if You for some reason hate the touch feeling, just use glass-spacer. Oh and shipping was super fast, even faster than estimated (I live in mid EU)."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Dor Konforty",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T03:08:25.000Z",
          "Titre": "Game changing",
          "Contenu": "I have a very complex prescription and was surprised these guys could accommodate me! It is delightful to be able to play without pesky glasses in the way. I am 100% going to use their services with every new VR set I buy... honestly, gear providers should just partner with them to make this standard..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hoops",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T17:05:05.000Z",
          "Titre": "Great product …",
          "Contenu": "Easy ordering process and good communication. My prescription is outside what all other manufacturers of Quest 2 lenses can make, but VR Wave just needed a little longer to make them. The lenses are supers, are easy to fit and make using the headset much comfier and easier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary McKaig",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T17:23:52.000Z",
          "Titre": "Customer service was very responsive…",
          "Contenu": "Customer service was very responsive when I had questions.  Love the product.  My VR experience has much better clarity now. I can actually look down and see clearly when putting in Golf+."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C W",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T22:26:38.000Z",
          "Titre": "Makes the Oculus more comfortable",
          "Contenu": "Luckily I had just been to the Optometrist and had a current prescription.  I was able to easily fill everything out and send a copy.  The lens work perfectly.  Installation was simple and it is so much more comfortable than trying to wear the Oculus with my glasses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 4,
          "Date": "2023-11-11T05:10:28.000Z",
          "Titre": "Couldn’t ask for a better experience…",
          "Contenu": "Couldn’t ask for a better experience with this company. Excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya Mckown",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T19:06:17.000Z",
          "Titre": "Best investment ever",
          "Contenu": "The ordering process was very easy. Shipping was fast and my son loves them for his VR so he dont have to wear his glasses when playing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joshua king",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T13:40:43.000Z",
          "Titre": "I used to shove my glasses in my…",
          "Contenu": "I used to shove my glasses in my headset and assumed I was seeing fine. Getting lenses for my quest2 was like doing a generational video card update on my pc. The increase in immersion is exceptional. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Harman-Wegmuller",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T17:46:25.000Z",
          "Titre": "Best purchase",
          "Contenu": "Best purchase! No need to wear glasses while working out. Delivery was fast, ordering was super easy. No glare or distortion absolutely Love them!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T06:03:36.000Z",
          "Titre": "You need to try these",
          "Contenu": "These lenses are literally game changing🤯 my headaches and eye strain have decreased significantly and the clearness after getting prescription lenses is absolutely phenomenal. If your really into vr then definitely give these guys a try"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Seb",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T06:27:54.000Z",
          "Titre": "Awsome, would recommend !!!",
          "Contenu": "I did order a pair for me, I was about to ask a refund for my VR Occulus 2 since I really need glasse to play .... I was so sad. But then I saw VR Wave making those prescription lens for people like me .... THIS CHANGED MY LIFE. After 25 years of glasses with really bad vision, I can finaly enjoy something without my damn glass on my face. I would recommend this product 200% worth every dollar, plus it was a super fast shipping. My wife will order to.. Thanks again for changing my life ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel HILL",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T13:36:16.000Z",
          "Titre": "Perfect. Absolutely life changing if you love vr.",
          "Contenu": "I've have very poor vision my entire life. My prescription is a very high one and very unique and I was ecstatic when i found out VR wave could produce lenses for my prescription. It has completed changed the level of comfort when playing VR."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T01:11:09.000Z",
          "Titre": "Worth it!",
          "Contenu": "I rarely write reviews but felt VR wave lenses were worth it.  I was very pleasantly surprised at how much I love these lenses.  Prior to purchasing them, I wore mostly contacts while using my Oculus Quest 2.  I didn't like the comfort of glasses while playing, and my contacts would become dry and blurry if I played more then 20 mins.  Now that I have the new lenses, I can play as long as I want with clearer vision than I had with either glasses or contacts. I purchased them for my daughter as well and we very easily switch out our lenses.  My daughters RX is rather high with astigmatisms in both eyes and she said she sees perfect with them. Game Changer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 3,
          "Date": "2023-03-24T21:32:51.000Z",
          "Titre": "Great products and excellent customer service",
          "Contenu": "Have purchased a number of VR headset lenses from VR Wave. Product quality is excellent and customer service is fantastic. When I had an issue with a previous order they made it right. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PenelopeMidnight",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T13:59:58.000Z",
          "Titre": "I have no complaints",
          "Contenu": "I have no complaints, so glad I ordered it! dealing with putting my glasses on then the headset is so frustrating that my boyfriend recommended this, now I use these lenses more for the oculus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T03:58:22.000Z",
          "Titre": "These lenses rule!",
          "Contenu": "Let me start with telling you I have a severe astigmatism, without my glasses the world is blurry.  I use my Quest to play Supernatural and Beat Saber.  Having to squeeze my glasses into the headset has been a miserable experience.  It is uncomfortable and I still couldn’t see that well.  Enter VR Wave, these have been a Godsend!  I slap them in I can see clearly and no comfort problems.  I play more often and longer now.  This was a smart purchase and I would do it again in a heartbeat."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr P Lillico",
          "Nb_Reviews": 11,
          "Date": "2022-10-27T08:35:10.000Z",
          "Titre": "I didn’t even consider my prescription…",
          "Contenu": "I didn’t even consider my prescription when I bought the VR headset so forced to wear contacts. These lenses are great and the magnet means my wife can use the headset without any bother by simply popping the lenses off. Great lens bag too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T15:17:52.000Z",
          "Titre": "Lazy guy with less eye strain",
          "Contenu": "Now I'm the lazy guy. No I did not test to see if the blue is being blocked with the tester given, I just installed (very easy )and took a long flight in my flight simulators. I did notice I had less strain on my eyes using the plain o lenses because I do not have prescription glasses. So it's well worth the buy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Mazzera",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T23:34:33.000Z",
          "Titre": "Great Lenses for the Price!",
          "Contenu": "The experience i had ordering these was great, i did have to get a copy of my eyeglass prescription, but i live right near my eye doctor, the lenses are perfect and let me see in VR without scratching my lenses! the lenses are awesome for the price, especially with the magnetic bases they give you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steven willoughby",
          "Nb_Reviews": 2,
          "Date": "2022-08-17T03:55:26.000Z",
          "Titre": "These have honestly been game changing…",
          "Contenu": "These have honestly been game changing for me. No more headaches from my Quest squeezing my glasses. Reduces fatigue, allowing me to go longer. The blue light demo they shipped with mine was pretty neat and informative as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremiah",
          "Nb_Reviews": 6,
          "Date": "2022-12-12T11:30:46.000Z",
          "Titre": "Rx lenses from VR Wave for VR headsets are terrific!",
          "Contenu": "These are great. These are my second set of Rx lenses for the Quest 2 from VR Wave. I am an oldster who wears progressives, so, use your distance prescription. Mine recently changed, and my new Rx lenses from VR Wave were immediately a noticeable improvement. Also, shipping is much faster than they lead you to believe. Don't forget that you are legally entitled to have your IPD... some try and avoid giving that to you. Mine are different for each eye, but VR Wave was able to deal with it. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Donlan",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T13:37:10.000Z",
          "Titre": "My eyes/head don’t hurt anymore",
          "Contenu": "My eyes/head don’t hurt anymore. I used to constantly adjust the headset in order to “see better”.Now I can play longer without that “sting” in my eyes — and enjoy the overall experience even more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timmy Roeun",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T07:50:54.000Z",
          "Titre": "No more glasses!",
          "Contenu": "Oh, my god. I couldn't believe how cheap this prescription lens was and how perfect it made my VR world look. I was able to play vrchat, beat saber, and zenith with so much excitement. Best investment ever !! It took two weeks for my order to ship. I recommend 1000%"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah Wieder",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T00:26:13.000Z",
          "Titre": "Customer service exceeded expectations!",
          "Contenu": "I ordered these back in Jan of 2022 and after figuring out the right way to attach the lens holders everything seemed to be great. The Rx was done correctly and they made a world of difference. The video card went out in my headset so I had to move the lenses to the new headset and I noticed the magnets were getting rusty. I emailed the company and included photos asking how this could happen. Not only did I get an email back quickly, but they also apologized for the issue and told me a new pair was in production. I was thoroughly impressed by their customer service and their concern for customer satisfaction. The new lenses arrived and I was able to easily make the swap. I think customer service after the sale is the most telling sign of a business. This small business cares which is great. I will always be a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T03:14:53.000Z",
          "Titre": "I had ordered the VR-Wave lenses for my…",
          "Contenu": "I had ordered the VR-Wave lenses for my son because he was having difficulty using the Oculus/Meta Quest 2 with his traditional glasses. Ordering was simple, I had entered the data from my sons last eye exam as well as uploaded a photo of the test results so they could be certain that I did not make any errors inputting the numbers. This certainly put my mind at ease. Shipping was relatively quick considering it was a custom item. All together my order came out to around $120 with shipping. I feel this is fair since these are actual prescription lenses signed off by an actual optician. The quality is fantastic! I was able to install these quickly. (Just remember, magnet side goes up.) The magnets hold very well. They will not fall off accidentally, but remove easily without tools if desired. I simply leave them on all the time. I’m very happy with this purchase and I highly recommend VR-Wave lenses for anyone who wears glasses and uses VR. I was not paid to write this, I just really love VR Wave!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Heichelbech",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T04:52:41.000Z",
          "Titre": "Absolute Game Changer",
          "Contenu": "The difference in enjoyment and usability that my wife and I have experienced since purchasing Prescription Quest 2 lenses from VR Wave has been astonishing. The comfort which comes with not having to squeeze my glasses under the mask has also been a huge motivator. We're both using our VR headsets to help with fitness and removing unnecessary discomfort has really helped us be able to work those extra exercise sessions.  I was initially concerned because the order form seemed to be less refined than I suppose I expected. My wife's prescription was very easy to enter. My prescription had both a near sighted and a far sighted lense, an unusual state that the order form even asked you to confirm. Despite the oddity of that one item, the ordering process was a breeze and the lenses were shipped out quickly. Without a doubt, I would recommend this company to anyone who needs vision correction and wants to try to make their Meta Quest 2 more enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Montemayor",
          "Nb_Reviews": 2,
          "Date": "2022-08-18T19:06:47.000Z",
          "Titre": "A must have if you use glasses.",
          "Contenu": "Lenses are an absolute game changer. I normally wear chunky glasses and have a wider face so cramming all of that into the Quest was not comfortable at all. These lenses made it so much more comfortable to use and I don’t have to worry about scratching the quest’s or my glasses’ lenses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Margaret",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T19:36:48.000Z",
          "Titre": "Get them.",
          "Contenu": "When I ordered, it felt like an indulgence. But now I exercise with my headset every day and they make a huge difference in my comfort and immersion into the experience. Only regret is that I didn't order sooner."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dr Andrew Whiteley",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T08:19:56.000Z",
          "Titre": "I love the fact that I can now enjoy my…",
          "Contenu": "I love the fact that I can now enjoy my Quest Pro to the full without having to worry about fitting glasses under the case.The perfect solution for people who need glasses and want to enjoy VR.  Easy to install - just does the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny Carroll",
          "Nb_Reviews": 3,
          "Date": "2023-01-25T12:36:44.000Z",
          "Titre": "This is awesome I love that I don’t…",
          "Contenu": "This is awesome I love that I don’t have to use my glasses it was so uncomfortable and if anyone else wants to use them they come out and go back in so easy best product ever so worth it"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Mitko",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:50:42.000Z",
          "Titre": "100% recommended",
          "Contenu": "I'm very pleased with these lenses. I used to wear glasses when using the VR but I couldn't play for more than 30-45 minutes before it got uncomfortable. Now I can stay for more than an hour with no problems at all. They were easy to mount to the VR set and it doesn't feel like they're there. Would totally recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William T",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T18:50:27.000Z",
          "Titre": "Very good communication regarding…",
          "Contenu": "Very good communication regarding Prescription info. Received in a timely manner.  Installation is a little tricky, but once it's in.  Works great.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Viet Hung",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T22:28:20.000Z",
          "Titre": "Received my lenses today from VRWAVE…",
          "Contenu": "Received my lenses today from VRWAVE which it took roughly two weeks from order to receive.It took a minute or two mounting the lenses onto my HTC Pro 2 headset. And the lenses seem well crafted with quality.And Wow! What have I been missing until now I can see clearly as everything comes into focus very nicely. (I'm near sighted)For those on the fence you won't be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T15:05:22.000Z",
          "Titre": "Just received my prescription lenses…",
          "Contenu": "Just received my prescription lenses and what a difference! No more pain of my glasses twisting in the headset, fogging or causing irritation. I highly recommend them for a better VR experience. Thank you vr-wave for the great service, easy ordering and quality satisfaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron P",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T12:53:13.000Z",
          "Titre": "These lenses work great",
          "Contenu": "These lenses work great. Easy install. Things are much less of a hassle now when taking the headset on and off. Also the chance for eyelid smudging on the lenses is reduced to zero. ( left the eyeglass lens spacer in just for additional space between the new lenses and my face) Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian Jimenez",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T17:25:47.000Z",
          "Titre": "Amazing VR lens finally I’m able to use…",
          "Contenu": "Amazing VR lens finally I’m able to use it comfortably and I can see better compared to wearing glasses. It changed my experience and I heavily enjoy it"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ken Urbanski",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:06:19.000Z",
          "Titre": "The lenses made were perfect for my…",
          "Contenu": "The lenses made were perfect for my prescription. They arrived soon after I ordered. They make using my oculus so much more comfortable. Without them, it used to be a pain wearing my glasses while playing. Glasses used to push up against my face and lenses would get smudged while playing. Love these VR lenses!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Perkins",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T18:54:26.000Z",
          "Titre": "Impressive Attention to Detail in My Order.",
          "Contenu": "Ordered these on-line for my META Quest 2. The order process itself was smooth, and I paid and lodged my prescription easily. However, I had made a mistake transcribing my prescription numbers, and VR Wave contacted me to query the numbers I had submitted. I then corrected my error and the lenses arrived pretty quickly thereafter.VR-Wave's attention to detail in checking the prescription was very impressive in an age of on-line order processing where the buyer has to live with their mistakes. That attention reassured me about the rest of the production process, and I was not disappointed.Installing the lenses was easily achived and they transform the VR experience for me. I use VR in Flight Simulator and the ability to read small digits on radios in the VR cockpit and still look outside at the scenery is transformative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debora B.",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T22:19:11.000Z",
          "Titre": "Good service and quality products",
          "Contenu": "Good customer service and great products! Products are good quality materials and the items I have purchased I really like and enjoy using, as they make my VR experience more comfortable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JOHN GIBBONS",
          "Nb_Reviews": 7,
          "Date": "2023-07-05T10:12:56.000Z",
          "Titre": "5 stars: Fantastic company you can rely upon.",
          "Contenu": "Great range of products exploiting niche in the market.Excellent communication, prompt delivery and a company whose products I will continue to buy as VR develops within the shape of things to come."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "brad",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T10:08:07.000Z",
          "Titre": "Fantastic product",
          "Contenu": "Fantastic product, if you are wearing glasses with PSVR2 I recommend VR Wave lenses. It is a vast improvement."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin Gurran",
          "Nb_Reviews": 4,
          "Date": "2022-12-01T21:04:37.000Z",
          "Titre": "Faster than expected and work perfectly",
          "Contenu": "The choice of options made selecting the right set easy. The lenses were delivered a lot quicker than I expected. After watching the video the lenses were easy to install and work perfectly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Rowe",
          "Nb_Reviews": 4,
          "Date": "2022-08-12T18:13:06.000Z",
          "Titre": "I purchased these and LOVE them",
          "Contenu": "I purchased these and LOVE them! Great field of vision (no distortions). And no more trying to shove my glasses into the Quest 2. I definitely recommend them if you are thinking about it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Maggie Stopford",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T19:39:15.000Z",
          "Titre": "Highly Recommended!",
          "Contenu": "The communication was outstanding.  Issues with the shipping address were resolved quickly, easily and with excellent customer service.  The product itself is amazing - so happy not to wear glasses under the headset any longer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Jones",
          "Nb_Reviews": 15,
          "Date": "2022-12-12T22:04:52.000Z",
          "Titre": "I had a slight problem with my lenses…",
          "Contenu": "I had a slight problem with my lenses so referred them back to the company. They responded straight away sending me a replacement set. Great service and fabulous products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Cordova",
          "Nb_Reviews": 3,
          "Date": "2023-01-11T02:04:43.000Z",
          "Titre": "If you wear glasses and use VR then you have to get these lenses!!!",
          "Contenu": "My vision changed drastically so I needed new lenses. I went online and accidentally picked the wrong device. I had already submitted and paid for the lenses. I was able to contact the VR Wave team and they updated my lenses. They arrived and were the correct lenses. I was able to quickly switch out the lenses and can now see clearly again!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-08-12T18:17:28.000Z",
          "Titre": "I'm fairly blind and had too wear my…",
          "Contenu": "I'm fairly blind and had too wear my glasses with my vr, now...It's night and day, before I'll only play for 30 minutes, no I've bought extra batteries for longer life. Yeah...awesome...thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kara Nash",
          "Nb_Reviews": 4,
          "Date": "2023-01-03T18:19:41.000Z",
          "Titre": "Total game changer",
          "Contenu": "Total game changer. I didn't realize how much the VR experience was limited by my glasses. These are highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Hajash",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T18:50:08.000Z",
          "Titre": "Total GAME CHANGER",
          "Contenu": "Total GAME CHANGER!  so much better than wearing glasses with your Quest2.  These have a snap-on magnetic holder that the lenses just click on.  VERY stable and makes everything crystal clear!  I am so happy to have found VR Wave! Oh, I did pay for expedited service and got mine in just 7 days!!!"
        }
      ]
    }
  ]
}