{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "waproduction.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Zander",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T10:01:57.000Z",
          "Titre": "Plugin is bugged",
          "Contenu": "I can't use the plugin I purchased because it's bugged and still haven't recieved help from the support yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Meeks",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T19:09:13.000Z",
          "Titre": "I still haven't been able to properly…",
          "Contenu": "I still haven't been able to properly install any of the plug=ins I purchased and your support dept has been less than helpful. I will attempt again to install and activate but nothing should be this difficult or take this much time to resolve!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Meeks",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T06:54:28.000Z",
          "Titre": "Level of service",
          "Contenu": "I'm only available on Fri-Sun to handle tech issues. So far it's been 2 Fridays and 2 Mondays and I still haven't been able to solve simple issues like not being able to install new plug-ins that I purchased. See #23751 for details."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "A S",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:31:31.000Z",
          "Titre": "WORST SERVICE EVER!!!!",
          "Contenu": "I contacted the Support because of a problem with a plugin. They answer: \"Please see if any of the below articles help you. If not, you will need to reply to this email and let us know, otherwise the ticket will be closed and we will assume you have found your answer already\". And there weren't any links or articles below the text! Then I write again and tell them that yes, I still need help. And then they answer that I must send a video!! I already have a job, that's not my job! I'll throw the plugins to the TRASH and that's it!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:29:50.000Z",
          "Titre": "Difficult to use plugins and…",
          "Contenu": "Difficult to use plugins and downloading is not easy. Would be nice if there was a dedicated app to download all of your plugins."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Peter",
          "Nb_Reviews": 7,
          "Date": "2023-08-04T17:26:25.000Z",
          "Titre": "Customer service and the right to own your product is a joke to these people.",
          "Contenu": "If you use your license more than three times, it can't be used anymore without you contacting them to get access to something witch you already own.This process is not streamlined, first you must make a request to get customer services, then you get some first defense A.I. bot service that cannot help you, then after e-mailing them that the bot is useless, only then you get access to a person, and after multiple e-mails back and forth you get you license renewed."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "zer0",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T15:42:21.000Z",
          "Titre": "A F**kt Up Company",
          "Contenu": "First u give them Money, then they ask u if u would like to get News you say no and after that the Spam you anyway with Please Rate us... then unsubscribe still and still they send spam. And support is treading people like stupid...So there you got you rating.Unprofessional Company who not care about Privacy and Personal Information or Customer at all...that's my Experience after 3 days as W.A Production Customer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charles B",
          "Nb_Reviews": 7,
          "Date": "2023-08-03T19:21:55.000Z",
          "Titre": "You were probably not guilty of…",
          "Contenu": "You were probably not guilty of anything but you sold me Melda production Msoundfactory and they are throttling download speeds to an impossible rate. As you know, Msoundfactory can be a big download. My system is not slow and I could download 40 gb in a few minutes but because of throttling it took me many, many hours. That is not good enough, hence the one star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K A",
          "Nb_Reviews": 6,
          "Date": "2023-07-29T02:11:12.000Z",
          "Titre": "I would love to give 5 stars but..",
          "Contenu": "I would love to give 5 stars but... here's the scoop. I Ordered InstaCOMPOSER and they sent me InstaCHORD. Which I've already purchased, For days to reply to my emails, then one email asking for a screenshot, then no response after saying the would fix it. Well CC dispute and a hassle here we come. Don't trust this company for communication or fixing an issue."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "atir",
          "Nb_Reviews": 42,
          "Date": "2023-01-26T22:36:56.000Z",
          "Titre": "Absolute terrible customer aftercare…",
          "Contenu": "Absolute terrible customer aftercare support.They were selling a plugin of which wasn't setup properly with activation codes.Three times I had to get in touch for support and asked for my money back, which never was deliveredSo I had to go directly to PayPal to intervene and reimbursed my account. A totally of 3-hours of my time wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Murray",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T13:14:10.000Z",
          "Titre": "It's a miserable product",
          "Contenu": "It's a miserable product. Honestly, I tried to use it and make something good. I just don't get it. Nothing it generated seemed useful to me. A waste of money until it can create something that can actually be used in music."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-05-28T20:45:12.000Z",
          "Titre": "I have expressed that I cannot download…",
          "Contenu": "I have expressed that I cannot download the program I purchased. I have tried to download it from several computers with no luck I have checked for viruses and even turned off my virus checker to see if I could download the program The problem still exists."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Brantley",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T16:57:34.000Z",
          "Titre": "Plugins are okay, Company is terrible",
          "Contenu": "The plug-ins are fine, but dang if it isn’t impossible to get them to stop sending me multiple emails per day. Regardless of how many times I unsubscribe. If you want the plugins, use a disposable email."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "cjae",
          "Nb_Reviews": 4,
          "Date": "2023-07-25T06:51:02.000Z",
          "Titre": "You need to listen and address the very…",
          "Contenu": "You need to listen and address the very issues that have been presented yo you.. and stop avoid addressing the issue by sending irrelevent emails back.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:59:36.000Z",
          "Titre": "You did not solve my issue",
          "Contenu": "You did not solve my issue, you only directed me to another company to do the work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T15:53:27.000Z",
          "Titre": "Most garbage customer service",
          "Contenu": "Most garbage customer service, deathly slow and completely useless. I’ll NEVER purchase another product or free plug in for that matter after this joke of a situation"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:50:38.000Z",
          "Titre": "There website is very deceptive",
          "Contenu": "There website is very deceptive. You are pushed toward outdated plugins and must then purchase an update."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Didier Silvestrin",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T16:53:44.000Z",
          "Titre": "I bought instachords and have no solution to make it wok well. Though INSTAcomposer works well. Don't understand.",
          "Contenu": "I bought instacomposer and had no problem with this item.I'm (myson)  is satisfied. It works well.Yesterday i bougnt him INSTACHORD2 for 88 euros.I got iot on WA PRODUCT site. I got it on PLUGINBOUTIQUE site. My serial number i ok.BUT NOTHING WORKS............................INSTACHORD2 is always not on my DAW.Big problem. When i go on pluginboutique and click on \"donwload\", nothing works, it still drive me on WA product but doesn't download the good \"Zip\" to get the \"ex\" to put on my DAW the item.So I payed for nothing.............Can you help me to get instachord2 on my DAW please.Thank to the all of your Team."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T06:29:35.000Z",
          "Titre": "plugin boutique asked me to contact u…",
          "Contenu": "plugin boutique asked me to contact u guys. i have the vocal splitter plugin with serial issue to keep it short.. and need a new serial so i can use it. its one of my most used plugins. if you can help thanks. plugin boutique said u could hopefully"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "F. CORRIGAN",
          "Nb_Reviews": 4,
          "Date": "2023-07-13T13:47:09.000Z",
          "Titre": "Melody Generation Poor",
          "Contenu": "Poor sync, clumsy GUI, randomised melodies not inspiring. Wish I hadn't bought it."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "NATHAN STIBBE",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T11:27:50.000Z",
          "Titre": "You sell it as an sfx or foley sound…",
          "Contenu": "You sell it as an sfx or foley sound when it's purely music, not an sfx, not foley!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rozone",
          "Nb_Reviews": 20,
          "Date": "2023-04-20T12:32:41.000Z",
          "Titre": "Would've liked to try outlaw lite",
          "Contenu": "Would've liked to try outlaw lite, but everytime I try and check out it gets stuck on terms and conditions page."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Heiko Reiger",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T20:20:40.000Z",
          "Titre": "The plug-in does weird things",
          "Contenu": "The plug-in does weird things. Kick Shaper spreads the kick to the sides and makes it 0,3 dB louder on the left."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T16:29:59.000Z",
          "Titre": "Product I paid for is stuck in demo…",
          "Contenu": "Product I paid for is stuck in demo mode and no one from customer support reaches out"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anja",
          "Nb_Reviews": 5,
          "Date": "2023-06-15T05:43:27.000Z",
          "Titre": "Beware of this company",
          "Contenu": "Beware of this company. The company does not care about customer. No refund."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T18:12:29.000Z",
          "Titre": "Its impossible to contact you and you…",
          "Contenu": "Its impossible to contact you and you didnt solve my problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Wheeler",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T00:11:30.000Z",
          "Titre": "John from W.A. was unpleasant.",
          "Contenu": "John from W.A. customer service was impatient, i did what the outdated expansion install instructions said, and even if I'm not tech savvy you don't have to talk to me like that. this might just get deleted. product wise I'm happy, customer service wise, that guys a jerk. I have screenshots btw.. Customer service is everything to me in a company.EDIT: Look at the passive aggressive response. If you can't even apologize correctly, please do not. EDIT again, he changed his response so it doesn't look bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GRIND KHAN",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T23:57:08.000Z",
          "Titre": "this company distributes malware with…",
          "Contenu": "this company distributes malware with in there software. at least the Babylon synth does.it installs the Babylon toolbar or some crap after a installation! as they are pushing it again i felt its my duty to warn others of how this company truly is. they make only cheap crap. your not missing anything with them. repent!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Frank Schicht",
          "Nb_Reviews": 3,
          "Date": "2022-10-05T10:28:18.000Z",
          "Titre": "There is no way to install it in…",
          "Contenu": "There is no way to install it in resonable time. And then it does not work. May be you should use KI for it. Other companies can make easy installations - you dont!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dae Fox",
          "Nb_Reviews": 4,
          "Date": "2022-05-06T06:59:17.000Z",
          "Titre": "I've gotten some value out of this…",
          "Contenu": "I've gotten some value out of this company. But the app is just broken. I constantly have issues with it. Downloading samples can accidently double or triple charge you when the app isnt working properly. Downloading samples can also just freeze the app I mean. I do look forward to it actually working. But it is without a doubt. BROKEN."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-10T16:37:00.000Z",
          "Titre": "There is no workaround for installing…",
          "Contenu": "There is no workaround for installing your  best software \"Instacomposer\" in OSX under 10.15. Are you a Cupertino partner? The backwards compatibility in termos of OSs is crucial for any economic label. The ideas of a project are not enougth for economic success. I don´t like you feel me like prisioner of apple policies. Your developers have to pay more attention on digital signatures credencials.By the way, I'm a customer of Apple products but not thier puppet. This advertisement for al the musicians. It is up to you policy of transparency"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T16:18:55.000Z",
          "Titre": "nice try",
          "Contenu": "I simply wanted to demo their free version of a product that they offer. Support continually provided links to a \"paid\" versions in effort to get payment. Unfortunately, that tactic failed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-03-13T20:31:34.000Z",
          "Titre": "I recently purchased the Melda start up…",
          "Contenu": "I recently purchased the Melda start up bundle and it does not work because it can't be authenticated.  I believe this was a scam.  Please don't contact me in the future.  I will be telling all of my friends what a sham this is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AFantasticAwsomeGuy Rudy",
          "Nb_Reviews": 1,
          "Date": "2020-10-24T10:26:48.000Z",
          "Titre": "Imperfect",
          "Contenu": "I bought imperfect. Then vocal cleaner. it worked for a couple months and then it just gave me an error stating that I had to input my license again. Only to show me an error. There are no updates. No way to reset your licenses. Customer service has me running to dead ends. Im running a MacBook Pro 15 2014 with Catalina. Don't know what to do anymore. Feel like these bugs can be fixed with a simple update but Im no longer buying plug ins from W.A anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2020-06-25T17:35:19.000Z",
          "Titre": "The plug in seems like it would be…",
          "Contenu": "The plug in seems like it would be really cool. The issue that I'm having though is that there is a random White noise buzz that seems to happen about every 20 seconds and it just kills my recordings. I don't know if this is some kind of watermark so that you can't utilize the software for a long period of time or what, but it's obviously very annoying. I would likely rate this much higher if I could use the plug ins."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "LAPart.ca",
          "Nb_Reviews": 2,
          "Date": "2020-07-27T23:33:32.000Z",
          "Titre": "InstaChord - doesn't feel like it was made for 2020 but 2002",
          "Contenu": "I have purchased many softwares in 2020 and  InstaChord is by far the most complicated software to instal and to activate. Also adding the expansions was a pain.I couldn’t believe that in 2020 a company would still make us install softwares the way we did 20 years ago. It is also a complicated software to use. It isn’t user friendly and You need to do a lot of research to start using it for it to work. I bought it on sale and I regret it! Terrible!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "pissed off customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-15T23:17:03.000Z",
          "Titre": "Do not fall for the \"sales\"",
          "Contenu": "So I bought a bundle that was on sale down from £150 to £4 and it turns out I have just paid for a trial version. honestly couldn't care less about using any of these products anymore with that level of incompetence and costumer care what's the point. Use Plugin Boutique its much better value for money."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Veikka Siikanen",
          "Nb_Reviews": 18,
          "Date": "2020-12-04T19:40:44.000Z",
          "Titre": "Better stuff out there.",
          "Contenu": "I'm sorry, but after paying and trying multiple of their products, i have to say they are all terrible! Don't know who in their right mind made these amateur products. Total snake oil... Even if you would get them for free, i would recommend you to not waste your time.. Don't even install.. Waste of time, money and effort."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "S.T.M.M",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T19:35:11.000Z",
          "Titre": "Thanks for giving us a big fuuck for a gift",
          "Contenu": "I got a bass 10 for 10 sample pack 1weeks ago,just useless, just fuuuckin' sucks don't buy this packwith distortion in all drum's files,I just have no words to say. it's the most terrible packs I've ever hadp.s. Thanks for giving us a big f*** for a gift splice G.O.D"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T23:18:34.000Z",
          "Titre": "Avoid",
          "Contenu": "I avoid W.A. PRODUCTION plugins. I paid for one and regretted it instantly when I was installing it. I thought that I was installing a 1998 software. I’ve been avoiding them since."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MLJ",
          "Nb_Reviews": 1,
          "Date": "2019-06-20T14:34:16.000Z",
          "Titre": "Beware of tutorial purchases",
          "Contenu": "Purchased a tutorial that stated “own it” “watch anytime” under the impression that I would be able to download it and save to my computer like so many others. Can only watch it online it turns out. You should clearly state this before purchase as it is deceitful practice. It’s only $9 so I won’t press it further but you should be clear on this."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Henry",
          "Nb_Reviews": 11,
          "Date": "2020-07-25T12:04:59.000Z",
          "Titre": "Product I have bought is fantastic.",
          "Contenu": "Product I have bought is fantastic.However your web page sux totally.I have maybe 140 paid plugins and I have never saw such idiotic setup.You want to know, why I have bought your plugins? Plugins Botique has some problems with their web page, so when I saw your product there, I came strait to your page. And bingo - only $5. But it was a bitter deal!Another confusing setup is Softube. They are even worse because they want my password for my Ilok account! So they're worst and confused as well.Just trying to help...Kind regards"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T20:22:17.000Z",
          "Titre": "The sample preset packs are not useful…",
          "Contenu": "The sample preset packs are not useful in my productions. Always seems like the sounds in the demo are different from the sounds in the pack. If these sounds were higher quality I'd be more willing to download and buy more packs."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 6,
          "Date": "2023-06-27T18:22:42.000Z",
          "Titre": "You don't check out third party plugins"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tony Matthews",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T21:31:12.000Z",
          "Titre": "Waves Central worked until I updated…",
          "Contenu": "Waves Central worked until I updated it... I've followed your recommendations, clear cahse, eveb uninstalled and insrtalled again.... nope... it's complaning out the licence engine needing to be updated, which fails every time. I suppose I should contact support... However there is more...I added Mantra to my account, I won't download, thus I do not have it...plus... I am not sure what I can actually do with your software. Everything else seems to work on at least two computers, I am having trouble getting it to work on just one.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "C Duncan",
          "Nb_Reviews": 9,
          "Date": "2022-01-27T12:34:30.000Z",
          "Titre": "Telling a customer to update their OS…",
          "Contenu": "Telling a customer to update their OS to activate a plugin because you can't do an offline activation really is something else!I'm still waiting for the refund and won't be buying from you again!"
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "TKTKTK",
          "Nb_Reviews": 3,
          "Date": "2020-11-21T14:21:28.000Z",
          "Titre": "Misleading...",
          "Contenu": "Well... I got the sample pack FREE as a Black Friday campaign, but... the quality was still really bad and I ended up deleting the whole pack. Totally misleading with the term \"synthwave\". Most sounds had pretty much nothing to do with synthwave."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Skrillex",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T16:00:25.000Z",
          "Titre": "Never received my downloads",
          "Contenu": "Never received my downloads. Have tried several times to use provided download link and it doesn’t work. Customer service was lack luster and slow. To be fair the pack was only $6 so what do expect but probably won’t give these guys any more of my money for free."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Rex",
          "Nb_Reviews": 221,
          "Date": "2020-08-02T17:17:56.000Z",
          "Titre": "Not good",
          "Contenu": "Very misleading. They offer \"free\" downloads but you need to follow some soundcloud and instagram pages and have to fill in your email to get spammed. I don't even use soundcloud so i cannot download the files. Very poor and user unfriendly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Quint Viskup",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T18:35:55.000Z",
          "Titre": "Unfortunately I made the purchase and…",
          "Contenu": "Unfortunately I made the purchase and have been unable to install the software.I have made several attempts to contact the support team and have yet to get a response.So far my experience has not been great. I was genuinely excited about the product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-10-13T13:55:20.000Z",
          "Titre": "Not only can I not download the…",
          "Contenu": "Not only can I not download the software, you keep asking for reviews......so until you STOP asking me for a review, I will continue to give you a single star or less every time I get a request."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "adonis jesien",
          "Nb_Reviews": 2,
          "Date": "2021-03-19T02:00:48.000Z",
          "Titre": "uma estrela por obrigar o usuário a ecrever algo",
          "Contenu": "uma estrela por obrigar o usuario a ecrever (use the translator)you oblige the user to write something, I can give it 5 stars but I refuse to have the need to write something in pro only just for your vanities"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy H.",
          "Nb_Reviews": 4,
          "Date": "2022-02-19T22:39:07.000Z",
          "Titre": "Intentional lack of support for prior…",
          "Contenu": "Intentional lack of support for prior Mac versions is BS.  Before the limitation I have the same plugins that work fine, but now they wont take the authorization code."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "фдыларпдлфрук ровыжщшаипо",
          "Nb_Reviews": 4,
          "Date": "2023-01-25T16:21:55.000Z",
          "Titre": "weak software"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-03-07T03:29:27.000Z",
          "Titre": "I recently purchased a melds bundle…",
          "Contenu": "I recently purchased a melds bundle through your company that does not show up on their website.  I believe this was a scam and please take me off of your list."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T11:19:40.000Z",
          "Titre": "Waste of money",
          "Contenu": "Most packs are pretty much the same format so wasting $20-$40 is rough. If I could get a refund I would right away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T22:27:56.000Z",
          "Titre": "Your preset selection interface inside…",
          "Contenu": "Your preset selection interface inside Imperfect is horrible.  Barely responds to the mouse, cannot use up and down arrows and its a separate windows which slows down the flow."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adam Min",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T06:43:39.000Z",
          "Titre": "Posted an honest review about this…",
          "Contenu": "Posted an honest review about this company breaking the law, they have tried to make me change the review and now have reported it to trust pilot, again, avoid at all costs."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Flexi McNoodle",
          "Nb_Reviews": 7,
          "Date": "2020-07-27T08:44:11.000Z",
          "Titre": "Horrible plugins",
          "Contenu": "Horrible plugins, terrible support and they refuse to obey the law in terms of licence transfers, avoid at all costs, even when they are five dollars at PB, save your money."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Soshi Hosoi hosplug",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T02:28:48.000Z",
          "Titre": "Every time I press the button to…",
          "Contenu": "Every time I press the button to confirm order, an advertisement appears that I cannot close, forcing me to buy other products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuel Ponce",
          "Nb_Reviews": 3,
          "Date": "2020-07-19T04:03:43.000Z",
          "Titre": "Worse product to install",
          "Contenu": "I haven't been able to use the product due to so many problems with the installation... worse money spend... I'll definitely not recommend this product to anyone."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Jerone Howard",
          "Nb_Reviews": 12,
          "Date": "2020-03-24T13:43:05.000Z",
          "Titre": "I still can't find the product",
          "Contenu": "I still can't find the product!  I've searched the download page fir 2 days & don't see the \"download\" button to click on. Sorry...Jerone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Princess Madison",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T15:00:57.000Z",
          "Titre": "Unable to download my purchases",
          "Contenu": "I never was contacted back after reaching out to WA production due to not being able to download the music that I purchased."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T16:01:50.000Z",
          "Titre": "Freebies not free",
          "Contenu": "If you are offering free plugins at please make them functional. They are limited and you need to pay to unlock all the options"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T22:40:16.000Z",
          "Titre": "BEWARE of the demos…",
          "Contenu": "Demo versions of the software run perfectly on an older Mac OS (10.14)Given that the purpose of a demo is to test the plugin for quality, sound, bugs on your system. You’d assume that a working demo would lead you to think that the full, purchased version would also be compatible. Or at least, Logic would have you guess that.This is in fact, not the case. Though my assumption puts me slightly at fault, since the software compatibility is listed on the website.I (and I suspect most people) would assume that a working demo, indicates a working, compatible piece of software. Otherwise, WHAT’S THE POINT IN THE DEMO?! A COMPLETELY MISLEADING PIECE OF SOFTWARE IF IT DOESN'T ACTUALLY REPRESENT THE PERFORMANCE OF THE ACTUAL PLUGIN.This is really unacceptable. Misrepresentation of the product and clearly leads to enough confusion that there is a FAQ section on their own website about the issue. It’s presumably related to the serial number authorisation not working correctly.Again though, if the demo works, it is absolutely unacceptable for the purchased software to not also work.I WOULD RECOMMEND AVOIDING ANY COMPANY THAT MISREPRESENTS THEIR SOFTWARE WITH DEMOS THAT DON’T REPRESENT THE COMPATIBILITY OF FINAL PRODUCT."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2020-09-20T14:00:24.000Z",
          "Titre": "first time I downloaded a VST plugin…",
          "Contenu": "first time I downloaded a VST plugin (free), but simply it doesn't work. I'm pretty disappointed for my first experience...!regards,ludande"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T18:46:21.000Z",
          "Titre": "I love my girlfriend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Brooks",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T06:22:15.000Z",
          "Titre": "Paid in full received no product",
          "Contenu": "Paid in full received no product. Extremely negative dismissal of my dissatisfaction with the transaction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alarmguydan",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T03:36:05.000Z",
          "Titre": "sent me this email and I have no clue…",
          "Contenu": "sent me this email and I have no clue who you are or what I ordered... \"trust pilot\" what the hell is that?"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T14:31:57.000Z",
          "Titre": "Not satisfied",
          "Contenu": "Not satisfied. Feels like wasted my internet,time and storage.Very less variety and choice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T05:02:38.000Z",
          "Titre": "I can’t open it I down loaded an that’s…",
          "Contenu": "I can’t open it I down loaded an that’s it nothing no place product key nothing opened not happy at all!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "nk",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T14:45:57.000Z",
          "Titre": "Your free plug ins suck",
          "Contenu": "Your free plug ins suckplease make better snyth plug ins 'cause imperfect it's very good but it's sooo expensive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Murphy",
          "Nb_Reviews": 4,
          "Date": "2020-11-22T11:47:09.000Z",
          "Titre": "After making the purchase of the…couldn't login to site.",
          "Contenu": "After making the purchase of the bundle, couldn't login to the W.A. site. was never able to get my purchase. Need a refund!"
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "Jose Silver",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T19:28:31.000Z",
          "Titre": "It doesn't log into Loopademy when I…",
          "Contenu": "It doesn't log into Loopademy when I start it. Nor by the other modes of google, soundcloaud and etc. Help I want to enter."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T15:46:58.000Z",
          "Titre": "I got the download link and it does not work",
          "Contenu": "I got the download link for one free plugin and tried to download it but it’s not available to download it. You suck"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pharaoh Lawless",
          "Nb_Reviews": 2,
          "Date": "2020-01-13T14:37:46.000Z",
          "Titre": "This Product Doesn't Work In ProTools 12",
          "Contenu": "I can't get this product to work in ProTools12. There are NO instruction on how to route the midi tracks into InstaChord"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-26T17:01:06.000Z",
          "Titre": "THS PLUGIN IS NOT COMPATIBLE WITH…",
          "Contenu": "THS PLUGIN IS NOT COMPATIBLE WITH CERTAIN DAWS YOU GUYS GOTTA MAKE IT WHERE YOU CAN PLUG AND PLAY TOO MUCH TO FIGURE OUT"
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Portshopper",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T23:18:13.000Z",
          "Titre": "So bad deal",
          "Contenu": "Guys, avoid buying here, I found out that I can have the samples way cheaper. It was a super bad deal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T03:25:34.000Z",
          "Titre": "THE PLUG IN WILL NOT WORK WITH MY…",
          "Contenu": "THE PLUG IN WILL NOT WORK WITH MY SYSTEM & I HAVENT BEEN PROCESSED A REFUND."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wayne Hartman",
          "Nb_Reviews": 6,
          "Date": "2021-07-12T17:59:01.000Z",
          "Titre": "Sorry....didn't like the product",
          "Contenu": "Sorry....didn't like the product after all.... I'm sure others love it but It's not for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer 420",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T01:16:56.000Z",
          "Titre": "Stupid",
          "Contenu": "Payed for the plug in and the product hey they sent me doesn’t even work so I can’t use it . Thanks you guys !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keyo Towns",
          "Nb_Reviews": 4,
          "Date": "2019-08-11T09:23:34.000Z",
          "Titre": "Well it's a lot I want to say I'll try…",
          "Contenu": "Well it's a lot I want to say I'll try keep it short 17gb free information samples loops midi all that good stuff and not royalty free when I read the license agreement non commercial use only basically well that's to much space on my hard  drive to have something I can't make money from still thanks and the pdf and links seem to be mostly click bait gotta click on this button then enter your email to get a download that's click bait if I ever seen it lol still thanks tho I'm good tho I deleted the entire 17gb of files I need that storage space for real royalty Free!!! stuff that I can one day make money from I can use to make a profit to buy more storage space with  basically lol I'm thinking about deleting my account remove me completely from their website I'm good yall do yall I'm do me free should be free and not free with strings attached and you can't use the free musical stuff to make a profit from one day from I'm good  still thanks for the learning experience I appreciate that most of all stay blessed 👋🏽✌🏾🙏🏾🙏🏾"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randon Nelson",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T14:03:04.000Z",
          "Titre": "venom",
          "Contenu": "Haven't really found a use for venom... seemed cool on the demos but the quality is pretty questionable"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T00:05:00.000Z",
          "Titre": "Your plug in went in DEMO mode after…",
          "Contenu": "Your plug in went in DEMO mode after two days of using it and was emitting white noise at random times."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Ad Fruendum",
          "Nb_Reviews": 4,
          "Date": "2021-06-22T11:11:01.000Z",
          "Titre": "This is an unserious company",
          "Contenu": "This is an unserious company! The support is terrible and they ar selling useless plugins."
        },
        {
          "Note": 1,
          "Lieu": "VE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T22:56:19.000Z",
          "Titre": "All files were damaged this de message…",
          "Contenu": "All files were damaged this de message that I saw on my PC, I cannot open such files."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Miller",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T17:34:35.000Z",
          "Titre": "Even this is broken",
          "Contenu": "Even this is broken, can't give the review you deserved for the lack of access."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "L",
          "Nb_Reviews": 2,
          "Date": "2020-08-13T05:43:42.000Z",
          "Titre": "Intransparent pricing",
          "Contenu": "It’s never mentioned but on all prices they suddenly apply taxes in the very last step."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T14:05:57.000Z",
          "Titre": "I couldn't authorize it as l don't have…",
          "Contenu": "I couldn't authorize it as l don't have my music PC online"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-07-19T12:55:22.000Z",
          "Titre": "Terrible!",
          "Contenu": "Terrible!Installation was a headache and the instructions on PDF were wrong."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T14:59:08.000Z",
          "Titre": "company nags for rating",
          "Contenu": "company nags for rating.  nagging is annoying so i rate this 1 star"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-02T17:01:51.000Z",
          "Titre": "I couldn't unpack the zipped file and…",
          "Contenu": "I couldn't unpack the zipped file and was unable to access the samples."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 6,
          "Date": "2020-10-01T19:00:45.000Z",
          "Titre": "Still not had a link to download the…",
          "Contenu": "Still not had a link to download the plug in bought, despite emailing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-17T16:23:45.000Z",
          "Titre": "Never received what I paid for",
          "Contenu": "Never received what I paid for. Won’t purchase from this site again"
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Serafim Tsenov",
          "Nb_Reviews": 2,
          "Date": "2020-02-21T06:43:54.000Z",
          "Titre": "I didn't succeed to connect Instascale…",
          "Contenu": "I didn't succeed to connect Instascale with Cakewalk instruments"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T17:22:17.000Z",
          "Titre": "I’ve downloaded my purchase twice and…",
          "Contenu": "I’ve downloaded my purchase twice and still cannot get it to run."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T08:54:55.000Z",
          "Titre": "I Read the contact",
          "Contenu": "Read the contact. Not really royalty free."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-31T13:45:16.000Z",
          "Titre": "I emailed you guys I never received  2…",
          "Contenu": "I emailed you guys I never received  2 productsand no response"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "NUZB",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T18:07:45.000Z",
          "Titre": "My plugins are not registering",
          "Contenu": "My plugins are not registering. Idk why"
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Petri Puroaho",
          "Nb_Reviews": 2,
          "Date": "2020-03-23T04:43:57.000Z",
          "Titre": "It did not even have the files it…",
          "Contenu": "It did not even have the files it promised.What a rip-off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:46:59.000Z",
          "Titre": "Downloads were seamless however when…",
          "Contenu": "Downloads were seamless however when requesting help when I was unable to claim the free plugins with purchase I not only got no response,  I got an email implying that I was non responsive, \"We haven't heard from you for 3 days regarding your request (#24033)\""
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "PT",
          "Nb_Reviews": 5,
          "Date": "2023-07-19T23:25:00.000Z",
          "Titre": "Asked a specific question, too lazy to answer",
          "Contenu": "Asked a specific question, got the generic response to read some data, that wasnt relevant. If they would have read the question, they would have known this, but they didnt take the time. Had to contact them a second time. Not what I call support."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "KENICHIRO MORIYA",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T21:21:19.000Z",
          "Titre": "It is troublesome to set until the…",
          "Contenu": "It is troublesome to set until the sound sounds.Please provide an explanation corresponding to each standard application DAW.The reference video is just an explanation of the arrangement. Please tell me how to make a video and how to convert it to midi.Difficult for beginners. I can't use it casually.INSTACHORD2&INSTACOMPOSER for logicx"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Bob Read",
          "Nb_Reviews": 4,
          "Date": "2023-08-06T18:12:13.000Z",
          "Titre": "When I downloaded Halo 2 lite and tried…",
          "Contenu": "When I downloaded Halo 2 lite and tried to run the .zip file Windows and Avast wouldn't let me open the file. I turned both off and it still didn't work. The techs did what I asked and sent the file directly which unfortunately didn't open either. I'm only giving two stars because there should be a wrok around for a .exe file"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom J. Brace (owner, Dipso Records)",
          "Nb_Reviews": 5,
          "Date": "2023-07-30T16:16:13.000Z",
          "Titre": "Your mileage may vary, but I will not use these products",
          "Contenu": "Your convoluted and unnecessarily difficult download/install process made it a certainty that this reviewer will not use your company's products, whether they are free or paid-for (unless you drastically re-design your system). I never downloaded any of the software I wanted, and I never will... unless..."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "RJ Nieland",
          "Nb_Reviews": 3,
          "Date": "2022-08-22T15:21:38.000Z",
          "Titre": "Not quite able to install/use (yet?): Is it Me ?",
          "Contenu": "Was not quite able (yet?) to install/use the W.A. Production  \"Chords\" plugin.Using it with Logic Pro should de seamless, which is apparently not quite the case?The user-instructions seem to be OK once it runs, but the install-manual may need some work...."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ashley Ross",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T16:55:58.000Z",
          "Titre": "the samples are awesome but the sound…",
          "Contenu": "the samples are awesome but the sound quality definitely needs improvement if you guys could fix that you would be running circles around the competition!in reply to your reply on this thread what i mean is simply what i say, the actual samples are very good but compared to sample packs ive brought from fruity loops studio/producer loops, the actual audio quality is about half as good it doesent sound good when i make beats out of it it stands out as low quality sound compared to what i usually use"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CJ Gomes",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T00:08:34.000Z",
          "Titre": "There is no complete step by step guide…",
          "Contenu": "There is no complete step by step guide or video on instachord. It certainly isn't so user friendly as it brags. Good thing I payed  only 29.00 for it.  Pathetic Sell it then give good guidance on how to use it.  I doubt any one from the company even cares about this review since this product has been on the market with useless guidance for years"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clive",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T07:29:34.000Z",
          "Titre": "C/R is the worst",
          "Contenu": "I don't like challenge response copy protections they are annoying key file/serial are preferable I'm a mobile producer so i use laptops and as you know as technology advances i have to upgrade along with it which means moving software from one device to another c/r makes that process annoying."
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "BlackanDeep Ahmed Selim",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T18:02:49.000Z",
          "Titre": "Not Cool and Old",
          "Contenu": "unfortunately, the packs are not cool enough and old, i rarely use them, quality is good to be honest but we can say the stuff are old fashion. that's why i think u have put them for free because to be honest nothing free is good. PS. If i have the intention to buy something i will hesitate a lot to take the decision."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T16:10:12.000Z",
          "Titre": "Great idea but...",
          "Contenu": "...the content is far away from being versatile. Far too much content for (imho) boring genres like HipHop/Trap, EDM (this damn autotune-sh..). Also the checking process of loaded content doesn't work as expected. And if I find a very interesting content it is not included and I have to pay extra. So this thing is nearly useless for me and I changed to Splice which is under the bottom line cheaper and much more useful for me"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "X.C.",
          "Nb_Reviews": 6,
          "Date": "2021-01-04T14:45:14.000Z",
          "Titre": "Too much pop-oriented, not for me.",
          "Contenu": "After I bought their very interesting product Venom, which was a new version of a former product named Spexx from another company, I was expecting something else, as interesting as that one also for a composer of contemporary classical music, but I have been contacted only with regard to just pop music and connected genres, with offers of things that were completely useless, and addressed as a \"producer\" (??). Either I am not the right customer for you, or you do not consider that there are also contemporary classical composers who need and use good audio software. Maybe you should. We just belong to different worlds."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T21:25:32.000Z",
          "Titre": "🙄🙄😜😜😜🤐🤐🤐🤮🤮🥵🥵Not satisfied…",
          "Contenu": "🙄🙄😜😜😜🤐🤐🤐🤮🤮🥵🥵Not satisfied because of the way people download the product, really not easy all the time some thing happens and can t use the wa product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hit",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T09:20:09.000Z",
          "Titre": "It's ok.",
          "Contenu": "It's ok.. but I think if you had like a section to where we can choose a certain genre it would be nice. If you can do chords for certain types of genre that'll also help the producers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "thomas lee",
          "Nb_Reviews": 3,
          "Date": "2019-03-26T18:47:13.000Z",
          "Titre": "I actually usually like there stuff but…",
          "Contenu": "I actually usually like there stuff but this last thing I bought was a course just to recap or see if anything new was taught but don't feel it was worth the purchase but all there sound packs are pretty good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GM MB",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T01:41:47.000Z",
          "Titre": "I purchased two products here.",
          "Contenu": "I purchased two products here, and Bass House 10 for 10, one of them, was really not good tbh. Serum presets are really out-dated, and most of drum sounds are already pretty loud and distorted. The only things I could really use in my tracks were some bass loop files. Other than that, it was not really worth buying it. Future House 10 for 10 is much better than Bass House pack. It contains much more materials I can use in my projects. No bass house 10 for 10 tho. Nevertheless, thanks for providing us this service.p.s. I wasn't even able to get the pack right away due to the unknown error, so I mailed them, but needed to wait for their response for more than 2 days. Pretty inconvenient experience and thought I needed to mention this downside too."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Tim A",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T07:59:42.000Z",
          "Titre": "First of all I got a free plugin from…",
          "Contenu": "First of all I got a free plugin from you and did not make a purchase, however I frequently check out free tools that are available as sometimes there are some really good ones (some of which I still use today and some of them as so old they are not even 64bit). I got the free KSHMR Essentials Kick plugin and it's completely useless. There is nothing about it that I can benefit from and cannot do using basic tools in my DAW. It doesn't make my workflow easier/faster or the sound I'm applying it to better in any way. Very disappointing. It's like instead of giving out free candy samples you just handed out wrappers instead. This experience will effect how much I'd be willing to try any of your other paid products. You can do better.Tim"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-10-04T16:07:50.000Z",
          "Titre": "The products are ok",
          "Contenu": "The products are good, but it feels limited. Their just one bar loops, and the organization isn’t intuitive. Variety and organization would do the sample packs well."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-12-04T09:23:19.000Z",
          "Titre": "that makes several purchases now at…",
          "Contenu": "that makes several purchases now at your place. The sounds are of good quality but it's very repetitive, always the same fx, the same snare fills, the same types of sounds."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Aldo",
          "Nb_Reviews": 4,
          "Date": "2019-12-04T15:31:25.000Z",
          "Titre": "I couldn't buy what I wanted."
        },
        {
          "Note": 2,
          "Lieu": "GT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-08-19T19:05:33.000Z",
          "Titre": "Done",
          "Contenu": "I would like that they include more information that is on the pack because you get wrong information about what you get in the pack."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-27T18:52:56.000Z",
          "Titre": "They were mot as they were supposed to…",
          "Contenu": "They were mot as they were supposed to be Expected more than that"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Keith Lane",
          "Nb_Reviews": 21,
          "Date": "2020-03-24T07:30:34.000Z",
          "Titre": "Website was a frustrating mess that was…",
          "Contenu": "Website was a frustrating mess that was time consuming and confusing open the checkout stage and the download stage"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T16:27:38.000Z",
          "Titre": "Does destroy the Audio on a long…",
          "Contenu": "Does destroy the Audio on a long Sequence like a Podcast. Only applicable for short Audio samples"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Markcash",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T17:11:30.000Z",
          "Titre": "Installation christmas bundle not working",
          "Contenu": "I've asked a question about the software not installing properly and have gotten no response yet."
        },
        {
          "Note": 2,
          "Lieu": "CN",
          "Pseudo": "han jiaming",
          "Nb_Reviews": 4,
          "Date": "2019-11-16T07:13:21.000Z",
          "Titre": "it is difficult for Chinese to…",
          "Contenu": "it is difficult for Chinese to subscribe them and get free packs. some plugins are too expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grizzy Entertainment",
          "Nb_Reviews": 4,
          "Date": "2020-06-21T03:01:05.000Z",
          "Titre": "The packs that I have bought were…",
          "Contenu": "The packs that I have bought were duplicated sounds from the free packs"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T19:02:54.000Z",
          "Titre": "The packs are realy weard orgenized",
          "Contenu": "The packs are realy weard orgenized , and not what i axpect 😢"
        },
        {
          "Note": 2,
          "Lieu": "CL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T18:42:36.000Z",
          "Titre": "I expected more quality sounds",
          "Contenu": "I expected more quality sounds. The price are good tho"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "hani82",
          "Nb_Reviews": 2,
          "Date": "2020-07-19T21:36:30.000Z",
          "Titre": "I want you to support Japanese as well.",
          "Contenu": "I want you to support Japanese as well.Your website."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2020-05-05T18:34:18.000Z",
          "Titre": "Quality of the Ableton Project Files…",
          "Contenu": "Quality of the Ableton Project Files were very poor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rhoades D'Ablo",
          "Nb_Reviews": 6,
          "Date": "2021-07-17T00:44:32.000Z",
          "Titre": "Not happy with this company....nuff…",
          "Contenu": "Not happy with this company....nuff said."
        },
        {
          "Note": 2,
          "Lieu": "GT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-08-25T17:03:30.000Z",
          "Titre": "I already provide a feedback",
          "Contenu": "I already provide a feedback. Bad product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grizzy Entertainment",
          "Nb_Reviews": 4,
          "Date": "2020-05-29T04:40:37.000Z",
          "Titre": "Nothing new or exciting same old druns"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Parson",
          "Nb_Reviews": 22,
          "Date": "2018-10-26T19:38:54.000Z",
          "Titre": "No great products",
          "Contenu": "No great products , pricing to high"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Werner Wöstmann",
          "Nb_Reviews": 6,
          "Date": "2019-11-15T22:07:56.000Z",
          "Titre": "Not so good quality"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T20:19:19.000Z",
          "Titre": "Never received it"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "ds photoblog",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:59:22.000Z",
          "Titre": "Good Support, Instachords need some improvements",
          "Contenu": "Good support in the end, they need a little help with explaining issues, but in the end i got what i wanted. Instachord 2 is very nice, but look at Scaler 2, you should update the app with similar autoplay selected chords, easier ui...Update info for WA: what i mean with this-> in scaler 2 and also in klimper 2 you can just simply select and drag and drop chords to a selection field. chords 1 - 3 for example, then you can loop that selection and it is in sync with the host tempo. So you should simplify your UI like in Klimper 2 with drag and drop, now its a bit complicated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chase",
          "Nb_Reviews": 8,
          "Date": "2023-12-04T15:50:26.000Z",
          "Titre": "Something to Inspire",
          "Contenu": "I liked that they offered something for music producers to read and hopefully inspire. It’s a effort for small encouragement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "UNITY VII PRODUCTION LLc.",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T01:36:10.000Z",
          "Titre": "Not so much to speak anything negative…",
          "Contenu": "Not so much to speak anything negative about this  company but after reading the reviews, it appears that the plugin I purchased have some what the same issue, I did reach out to them about it but they were unable to help they did ask me to send over an audio on what it was doing, my issue was that the plugin would always make a sound like I received a demo version so if anyone has this problem and knows how to fix it, would probably be helpful to pass it on to them. ( this plugin is the IMPERFECT ) And also give not just these guys a chance on resolving issues with there products before sending so much negative feedback, but any company that creates plugins. After all I'm pretty sure everything y'all create as a producer doesn't sound good the first go round. ( And  WA PRODUCTION THANKS for replying back.)"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T13:21:46.000Z",
          "Titre": "- There are products with good cost…",
          "Contenu": "- There are products with good cost performance.- There are unique products.These two are highly regarded, but- Many products have a dull sound for use with acoustic instruments.- There are quite a few products with a complicated UI or unpleasant changes in sound due to parameter effects, which I consider as negative aspects."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T23:46:30.000Z",
          "Titre": "Good supplier, great product, timing issue in one application.",
          "Contenu": "The product (instachord 2) is great. Good videos explaining install etc. Support has been responsive but so far no solution as to why instachord sequencer does not run true to indicated BPM. Some situations it's fine. Still looking for resolution (hence 3 stars) and will update when either I give up or get a solution somehow.Certainly not bad, just undecided."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:41:08.000Z",
          "Titre": "sounds good",
          "Contenu": "sounds good, crashes ProTools though, not complaining as it was freeEDIT: this is in regards to KSHMR Essentials Kick"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Steev",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T20:12:10.000Z",
          "Titre": "Generally good but annoying copy protection and convoluted 3rd party downloads",
          "Contenu": "I've bought the odd plugins from W.A. Production and nabbed a few freebies. Some of them I really like, others are bread and butter and do their job just fine. Can't fault them in that regard - you get what is advertised.What I don't like is the annoying copy protection - you get a total of 3 activations. No way to free up activations on your own. That's a very short lifespan if you have more than one machine and/or semi-regularly upgrade your rig. You need to send an email asking for more activations when you've used them up. Sure, they granted me additional activations, but it's a horrid system and really needs to be revised to allow you to free up activations without being beholden to the company. It'd also reduce support overheads, which would be win-win.Trying to download Halo 2 Lite for free was a convoluted nightmare. After completing the checkout process, you get a PDF that redirects you to another site where the lite version is hidden/buried and really hard to find (which isn't just W.A. Production's fault, but they could have linked you straight to the product). It shouldn't take 10 minutes to download a freebie.So the plugins themselves are fine, but the user experience regarding downloading, authorisation etc. is not good.Edit: As to the reply, if you really care that much about your ratings, then improve the copy protection in your existing products. Until then, all the issues still exist, so I'm not going to change the rating. A pleading reply does nothing to address the frustrations that this has caused and will continue to cause. As a *paying user*, I shouldn't be the one who has to deal with the hassle of copy protection. You've got this one backwards. Also, a rating of 3/5 is hardly terrible. It means, \"OK, but could do better\". Do better, and you'll get a better review, that's how reviews work!"
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T11:33:53.000Z",
          "Titre": "I can't simply install all at once and…",
          "Contenu": "I can't simply install all at once and have to install more than 30 plugins of the \"everything bundle\" one by one and enter license codes one by one. it takes too long."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T20:12:13.000Z",
          "Titre": "Nothing special",
          "Contenu": "Nothing special. Samples are OK and usable"
        },
        {
          "Note": 3,
          "Lieu": "SI",
          "Pseudo": "Greg",
          "Nb_Reviews": 4,
          "Date": "2022-12-18T19:45:13.000Z",
          "Titre": "There is no underground stuff like…",
          "Contenu": "There is no underground stuff like techno, dub techno, underground deep house"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam Heine",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T14:31:28.000Z",
          "Titre": "Buying plugins vs Installing plugins",
          "Contenu": "Buying plugins, no problem.But installing plugins can be convoluted depending on the plugin's source/creator.  Would prefer WA figure out a way to have an installation wrapper around 3rd party plugins to streamline the installation process, similar to how plugin-alliance installations work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jake Gerstein",
          "Nb_Reviews": 3,
          "Date": "2023-02-20T21:38:26.000Z",
          "Titre": "I like KSHMR stuff",
          "Contenu": "The KSHMR stuff is cool. The Kick thing isn't really free though, it still asks you for money."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:26:13.000Z",
          "Titre": "Czech language for manuals and more…",
          "Contenu": "Czech language for manuals and more please.."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Magnus Bäcklund",
          "Nb_Reviews": 4,
          "Date": "2022-06-17T12:34:02.000Z",
          "Titre": "The site - not the plugins - they are wonderful.",
          "Contenu": "Average has nothing to do with the plugins. I love them - they are easy to use and fun to work with. Finding my downloads though was a pain. Perhaps a simple button with \"my downloads\" after you have logged in?But as I said the plugins are really great."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DAH-SHERIF",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T11:12:57.000Z",
          "Titre": "WHY 3 STARS?",
          "Contenu": "Why I gave a 3 star instead of a possible 4Star.The process of installing this product according to the instructions sent in the email, should have been a breeze, however after following all the instructions I was left going round in circles, in total I would estimate 5-6hours over 2days. What Was The PROBLEM?? I was sent WRONG Passwords, on two occasions via email.Some positives: The web chat assistant was Very Helpful in helping me resolve my issues, in the end the problem was resolved."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Stefano",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T11:34:04.000Z",
          "Titre": "I just tryied a freeware."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Mario vermeersch",
          "Nb_Reviews": 15,
          "Date": "2022-01-09T23:04:47.000Z",
          "Titre": "Don't be fooled by the price shown",
          "Contenu": "Don't be fooled by the price shown, there will be VAT added, and you will see that after you have paid how much money is gone from your bank account 😡😡😡No VAT rate is stated on your invoice and before you make a payment, even if you have previously created an account with the site from w.a. Production.I have proof that there is nowhere on my invoice a VAT RATE IS MENTIONED. on other sites you are never faced with surprises,NO i buy never more by W.A. production.I will no longer see surprises in my bank account 👍👍👍"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T11:16:29.000Z",
          "Titre": "Prepaid cards denied.",
          "Contenu": "System was fine, however pre-paid visa gift cards (Australia Post and Vanilla) were 'rejected' from the banks, despite the cards not even receiving the request. Additionally, when paid for through PayPal, GST, or some other form of tax was not accounted for, and the cost varied from the displayed one on the WAProd website, and despite paying an extra $4, the extra amount was not accounted for in the credits payback system. Free pack was amazing though (dare I say it better than the pack I paid for.)"
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "* ISSUE",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T14:48:28.000Z",
          "Titre": "Really nice price",
          "Contenu": "Really nice price, really nice quality.But REALLY low download speed, and almost download files are crashed. So I repeat download over and over again.... Even files larger than 2GB often stop connection and require start all over again.I bought a lot of packs, but I think I'll need a month to use that product.... It's a horrible experience.... Aren't I living in 2020?"
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "Oliver Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T23:45:08.000Z",
          "Titre": "Automation bug. Dodge pro fix. they do not answer.",
          "Contenu": "Hello!-I am having trouble using this plugin with automation in fl studio, the whole package of their plugin range in this category, they have the same problem and some do but close the production program.-Dodge pro, when I insert it into a mixer channel without touching it, the audio signal sounds filtered to me and I think this is due to the frequency range it marks with orange, yellow and green."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allen Walters",
          "Nb_Reviews": 6,
          "Date": "2020-04-07T15:13:54.000Z",
          "Titre": "There is room for improvement with your business practices",
          "Contenu": "The quality of the samples for this package was great, but the hoops you make people go through to get additional free samples is ridiculous.  Forcing people to follow people on Instagram and Sound Cloud is ridiculous.  This would not be a huge problem but once you ride the links to all these different sites you lose the links to get free samples. You need a better business model."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-03-18T09:53:25.000Z",
          "Titre": "I give you three star for being kind",
          "Contenu": "I give you three star for being kind , and let us using your sound. on the other hand the file is too big , and it is basically the same sequence of notes with different sounds.  I think a pdf with suggestions on how to use the midi files you provide would be enough. lastly ,  i think i could not find the guitar samples announced at the moment of download. again, very thankful for your initiative"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Dorfner",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T15:49:34.000Z",
          "Titre": "hello guys n gals",
          "Contenu": "hello guys n gals. I'd give it five stars except for your servers were clearly NOT ready for the volumes it got hit with. it was very frustrating. three stars because you clearly worked pretty damn hard to get those servers going.. and the people responsible for getting them going deserves a big fat bonus check just because of the stress alone!!Rickps. the product itself.. ten stars!! nice nice pack"
        },
        {
          "Note": 3,
          "Lieu": "LY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T14:08:37.000Z",
          "Titre": "I purchased 2 wa production plug-ins…",
          "Contenu": "I purchased 2 wa production plug-ins but the discount code that you gave me with my purchase was wrong so i contacted their website and too them 2 days to fix the discount code and finally the let me download the plug-ins, but the discount codes for the other 2 websites were right and I downloaded them instantly so thanks"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Kyle Sinclair-Imrie",
          "Nb_Reviews": 10,
          "Date": "2020-07-21T13:43:48.000Z",
          "Titre": "Customer support?",
          "Contenu": "Customer support takes so long to reply. Bought Babylon, tells me i need an internet connection to authorize, but i have an internet connection otherwise i wouldnt be able to even view my license key. I wouldnt buy from them again. Terrible customer service.Edit: After talking to Roman via Facebook, managed to resolve the issue which was due to my internet provider (Virgin Media) blocking access to the site at the time. So thank you Roman. Taken from 1 star to 3"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Dean Pesek II",
          "Nb_Reviews": 1,
          "Date": "2020-01-20T02:01:47.000Z",
          "Titre": "The sound packs are like 6/10 for…",
          "Contenu": "The sound packs are like 6/10 for advanced producers. You'll get some nice samples here or there, drum packs etc.However some of the samples (sax pack) don't feel right for my timing or sway.If you're just wanting to start off making music. This would be a nice site because of the help and structure guiding. Especially with FL Studio. I saw templates? So massive plus for beginners.Up to you. Always digging."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Reason",
          "Nb_Reviews": 2,
          "Date": "2020-03-20T13:47:00.000Z",
          "Titre": "The Design of WA Productions Homepage iss bad",
          "Contenu": "The Design of WA Productions Homepage looks  not clear, the Products are several times listed  and you couldn‘t find audio demos of the VST Plugins or Soundlibarys, what‘s a bit shame for a Company of many real good Plugins! Also, were i can find manuals for my WA Production gear?I like Babylon, a real musthave for a decent Price and really impressed by the quality of Sphere Comp, wich is the best RMS Comp at the marke.Nice Production Stuff but really limited hompage"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T23:25:57.000Z",
          "Titre": "I used the link in my email to purchase…MidiQ",
          "Contenu": "I used the link in my email to purchase MidiQ. Only after paying and logging out did I realize there was a Black Friday discount code on the  home page. As the price for MidiQ was already nominal, it didn't bug me too much but if my purchase had been larger...Also, MidiQ only uses major/minor chords. Only found this out after purchasing. Makes it too limiting and will not use. Please make this clear somewhere in the product description. But the MidiQ concept has potential."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "X.C.",
          "Nb_Reviews": 6,
          "Date": "2021-03-26T21:37:21.000Z",
          "Titre": "Helper can only increase (not decrease) transients.",
          "Contenu": "It's a real pity that Transients Helper can increase the transient level, but not decrease it, which would really be much more useful. The name \"Transient Shaper\" is misleading. It should be \"Transient Magnifier\". So, it works, but only on one side."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Adkins",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T13:43:21.000Z",
          "Titre": "I like the instachord I have but I can…",
          "Contenu": "I like the instachord I have but I can only run it on one computer and that is a problem for me cause I have a laptop that I take every place I go and one that stays at home in the studio. if I am at a motel were the internet is slow I can not do work on my laptop and transfer it to my studio computer so when I came back to the studio and I add instachord on the laptop and then I do not work on the desk top which is a problem  for me and it is making me not want to invest in anything else they have my other programs let me do it on 2 computers so I may be looking at other things"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-11-15T05:54:34.000Z",
          "Titre": "I like your ideas about plugins and…",
          "Contenu": "I like your ideas about plugins and sound samples . I am waiting for some oneshot samples (bass .synth . Orchestral.)   For using in every samplers. Honestly I think you can improve sound samples and make them more clear I think it is good a review on your  drums  sounds specially kik drumsBest regards❤"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-03-14T17:38:26.000Z",
          "Titre": "Site super slow",
          "Contenu": "Site super slow, diden't react at all, didn't show anything in my account until next day and I even had to register a new account because the system wouldn't let me use my old one.Might have been a server peek time problem but still...Customer service on the other hand very good."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Arseniy",
          "Nb_Reviews": 5,
          "Date": "2020-03-17T09:20:12.000Z",
          "Titre": "I don't know",
          "Contenu": "I don't know. It doesn't feel like top quality. But maybe just me. I mostly look for drum one shots. And also I only downloaded free packs. I'd say maybe often samples have like too much ambience. Like too dense with background noise. But again it might be great for someone else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T20:28:50.000Z",
          "Titre": "I never got my plugin and yall took my…",
          "Contenu": "I never got my plugin and yall took my money.Edit: They contacted me a few days after I posted this and gave me my plug-in! If not for this incident it would've been a 5/5 however I would feel bad not letting people know this experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2019-07-15T15:21:58.000Z",
          "Titre": "It took 2 days to receive a working…",
          "Contenu": "It took 2 days to receive a working download after attempting to contact customer support multiple times. Ordered on Sunday morning and didn't get download until mid day of Tuesday... And yes I do realize a lot of companies are off on the weekends which is why I said 2 days"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T15:50:38.000Z",
          "Titre": "Its ok but a hassle",
          "Contenu": "It's ok I am quite happy with all the samples and presets I bought. But I feel like there is a lot of stuff that didn't need to be there the amount of pdf files with links to random promotions and all the construction kits which I could see being kind of cool for beginners and for learning but I just didn't see the value in them. I mean if it was free I wouldn't care but I did pay for these samples. Anyone reading this you should still definitely buy these samples they are great but just be prepared to spend a while downloading them and organizing them to get what you want in your library."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Pad Di",
          "Nb_Reviews": 2,
          "Date": "2022-02-06T16:17:34.000Z",
          "Titre": "My labtop died and now i need to buy it again",
          "Contenu": "My labtop died and now i need to buy it again because of that stupid authorization. look at xfer serum it costs like 200€ and you can download/use/authorize it infinite times. come on guys :/"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T06:58:35.000Z",
          "Titre": "Decent products packaged up horribly",
          "Contenu": "Every pack came in a zip file with a ton of junk (shortcuts to websites, random promo crap). I bought two bundles and it took me about half an hour to go through and unzip them and delete all the nonsense so that I just had a single folder for each pack with the samples in. Samples themselves are fine once you filter everything else out.They also offer free sample packs to change bad reviews so take what you read here with a pinch of salt:\"Since there is nothing wrong with the product itself, I was wondering if you may be willing to update your review? If so, I'd be happy to provide you with a free sample pack of your choice\""
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Geoffroy Cochin",
          "Nb_Reviews": 2,
          "Date": "2020-06-22T18:46:09.000Z",
          "Titre": "Great packs, but ImPerfect crashes.",
          "Contenu": "I recently bought the ImPerfect Synthzsizer, but even though I installed correctly, the plug in crashes whenever I try to load a preset.Other than that, the plug in is great and the free pack with it is a welcome gift."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kidsonic Music",
          "Nb_Reviews": 3,
          "Date": "2020-03-30T13:21:19.000Z",
          "Titre": "Great sounds but could have more genres including more underground styles",
          "Contenu": "I love the fact that It's meant to help producers, however, I feel like the company's more geared towards EDM and the mainstream genres, missing vital genres like Drum & Bass and even Deep Dubstep/140"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derek Boyd",
          "Nb_Reviews": 2,
          "Date": "2020-11-30T21:39:20.000Z",
          "Titre": "it was difficult for me to figure how…",
          "Contenu": "it was difficult for me to figure how to use . different kits worked in other ways. ex some sound will be used in massive library but I could not see how to do it.it was free so I will use what I can"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Hannah",
          "Nb_Reviews": 4,
          "Date": "2020-08-16T21:40:17.000Z",
          "Titre": "I love WA Productuons prices and…",
          "Contenu": "I love WA Productuons prices and innovative and clever plugins, (which I own several) however, you really need to open you sound pack sample to modern sounds and styles, especially when there are so many talented upcoming producers, one being myself, who's very talented at sound design and experiment. Hire a few and open yourself up to modern sound ie: soul, funk, deep gospel, blues, jazz, neo soul, and carribean sound sets. Hope this helps, will watch this space!Resp. Thanks for your reply, I hope in the future that you be open to broaden your horizons, and elevate your sound sets with the aforementioned genres. There is plenty room for growth and profit, being rooted in edm is only slice of the producer communities pie."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Hans Hofkens",
          "Nb_Reviews": 2,
          "Date": "2019-12-02T21:22:04.000Z",
          "Titre": "I have no issue with my purchase (good…",
          "Contenu": "I have no issue with my purchase (good value for money). My issue is the confusing web design that took me 2 days to figure out that the downloads were subcategories of the main purchase (Titan Serum Bundle)."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Dysfunco",
          "Nb_Reviews": 1,
          "Date": "2020-02-06T12:20:37.000Z",
          "Titre": "Good overall package",
          "Contenu": "Purchased Absolute Vocal Bundle when it was heavily discounted.Some of the included plugins will perhaps not be of that much use to me, personally, but it's obviously alot of \"bang for the buck\" as a whole.Outlaw was especially interesting to me and it seems pretty promising so far.The only more concrete downside, overall, is that some of the plugins isn't as easy to operate in Cubase as most plugins usually are. Going through the presets is pretty slow as I'm not able to click up and toggle through the whole list at once. But overall, I think the purchase was worth it as this price and I'm looking forward to implement and experiment with several of the plugins in my future projects./Alex"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-17T02:04:02.000Z",
          "Titre": "I like KSHMR essentials kick but I…",
          "Contenu": "I like KSHMR essentials kick but I don’t like the full version or see a point really. Insta chord and Instascale was confusing to me it would have been better if it worked more like captain chords."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Fixsi",
          "Nb_Reviews": 2,
          "Date": "2020-08-19T05:48:22.000Z",
          "Titre": "Structural problems",
          "Contenu": "The naming of the folders and their structure is not really well structured. Impacts and risers are mixed up in the FX folder. No BPM specified in the sample name, either. The sound quality is good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T15:35:15.000Z",
          "Titre": "The free samples and other things are…",
          "Contenu": "The free samples and other things are appreciated but I was a bit disappointed by the lack of reggae and other similar styles and how limited the samples are."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mahn Davis",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T19:29:41.000Z",
          "Titre": "To much spam & Trust Pilot is…",
          "Contenu": "To much spam & Trust Pilot is untrustworthy.I got one freebie from them and now they spam me - desperate or what ?Also, Trust Pilot cannot be trusted at all (though this is not based on my experience with W.A.). They give high ratings to known scam sites like Ninetribe, NineFit, ToysCentral. It's clear that many comments on TP are made up (you just have read some, pick a massively overpriced item and check the comments), and I have witnessed negative comments that were later deleted, which gives a very biased, completely unreliable, and untrustworthy service. It's a totally unreliable platform, so anyone using it is either aware that it's flakey and doesn't care about misleading people, or are so inept they don't realise TP cannot be trusted. My take away is if you use TP then I can't rate or recommend you - but you prob don't care, and this comment will prob get deleted.(edited because there's no option for me to respond to replies)"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Nasos Theocharis",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T15:59:55.000Z",
          "Titre": "About vst and sample packs",
          "Contenu": "I like the offers on new vsts for a period of time, but when it comes to sample packs I'd love to see more genre styles an single shot samples, and less construction kits"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2019-11-16T02:20:28.000Z",
          "Titre": "BPB Collection",
          "Contenu": "Downloaded the BPB collection of samples.  Really liked the Special Sax Loops which I plan to use.  The rest of the collection was disappointing, but could find some use later."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T12:26:32.000Z",
          "Titre": "Not enough free VST plugins."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Jacques Martin",
          "Nb_Reviews": 3,
          "Date": "2021-06-02T18:04:55.000Z",
          "Titre": "Could be better documented ...",
          "Contenu": "I am quite sure the software is ok, but it is not well documented. After some research on third-parties tutorials, I managed to make it work."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Daniel Fidelman",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T06:08:35.000Z",
          "Titre": "VPN in Russia",
          "Contenu": "Everything is not bad, but in Russia your site works only through vpn, which reduces my rating. Please correct this. Everything else is good. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Yigal Iskhakov",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T17:07:59.000Z",
          "Titre": "not bad",
          "Contenu": "Honestly the costumer service is amazing but i was not satisfied with the presets the description said one thing nut i got another"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Benni Krueger",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T22:25:35.000Z",
          "Titre": "products are targeted at home users and…",
          "Contenu": "products are targeted at home users and teenagers on fruity loops, these products do not cater to a professional target audience."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Admash",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T19:56:00.000Z",
          "Titre": "I give you three",
          "Contenu": "I give you three, because I think they could give something much better, but equal to a gift, they do not ask for more"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 18,
          "Date": "2021-04-25T17:14:25.000Z",
          "Titre": "I wanted Babylon to have an…",
          "Contenu": "I wanted Babylon to have an arpeggiator.However, I do not regret it because the price and purchaser benefits were abundant."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Hug",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T17:36:53.000Z",
          "Titre": "Title?",
          "Contenu": "Seems a bit suspicious that one of the samples in one of their packs has \"Vengeance Essential Dubstep\" in the metadata..."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Loris Scomazzon",
          "Nb_Reviews": 2,
          "Date": "2018-10-22T20:01:16.000Z",
          "Titre": "The Files are Broken",
          "Contenu": "The downloaded files were broken and could only be repaired with great difficulty, so I needed two days to download all the files."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-06T21:13:30.000Z",
          "Titre": "I couldn't download the vocal cleaner…",
          "Contenu": "I couldn't download the vocal cleaner it was a problem with the dll file. Still attempting to reinstall"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-06-14T15:08:28.000Z",
          "Titre": "unclear download and install",
          "Contenu": "unclear download and install, compatibility revealed after purchase - time and money wasted.Reponse to reply:I don't think it is good service to expect customers to go through your help center for a simple download. Your UI needs an intuative upgrade.I also don't agree that it is CLEARLY described. It should appear as warning before purchase instead of small print to avoid confusion - because there clearly is a LOT of confusion. Secondly, the demo works fine on older updates, which leads me to believe that it is your security system that is not compatible, which I think is a poor priority as a customer. I understand that you are a for-profit company as you mention in other reviews - however you won't get any profit at all if your customers go to better services for their plugins.I also think that you should spend more time listening to your many complaints as I am sensing a passive aggressive tone throughout your replies here.If you ask for reviews, then you'll get honest reviews and your service has a lot of room for improvement. I ended up buying another plugin, which took me 20 seconds to purchase, download and install.Mutant delay looked great - shame I never got to try it - I recommend to all other customers that you instead opt to purchase Dynamic Delay from Initial Audio.second reply:So they ended up giving me a workaround for my computer, which worked. Still not a great experience, but atleast I got the plugin. Changed my rating from 2 to 3."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-06-22T20:36:46.000Z",
          "Titre": "hello there good",
          "Contenu": "to expensive for just some regular loops, but the quality isn't to bad."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "MarkSA",
          "Nb_Reviews": 4,
          "Date": "2020-01-02T06:29:54.000Z",
          "Titre": "Samples seem to be good",
          "Contenu": "Samples seem to be good. But I wish the files themselves were not corrupted."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Tim Schumacher - No Surrender",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T20:33:06.000Z",
          "Titre": "The product was easy to get an install…",
          "Contenu": "The product was easy to get an install but not what I was expecting"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "stukern",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T09:19:54.000Z",
          "Titre": "InstaScale",
          "Contenu": "VST2 -> Black List in CubaseConfuse licensing info in the manual"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Harshil",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T01:52:38.000Z",
          "Titre": "Plugins are good but im unable to use…",
          "Contenu": "Plugins are good but im unable to use vst3 plugins"
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "HEO VIVI",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T15:42:04.000Z",
          "Titre": "I want more professional stuff and pro…",
          "Contenu": "I want more professional stuff and pro working composers lecture"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-07T19:19:50.000Z",
          "Titre": "Wait oh just a lesson…",
          "Contenu": "Ok when I buy the actual plugin might double back might not."
        },
        {
          "Note": 3,
          "Lieu": "SZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T04:46:02.000Z",
          "Titre": "I purchased a product only to get it 5…",
          "Contenu": "I purchased a product only to get it 5 days later"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chiah Huff",
          "Nb_Reviews": 1,
          "Date": "2019-02-28T23:34:51.000Z",
          "Titre": "Can't seem to unsubscribe and I cannot…",
          "Contenu": "Can't seem to unsubscribe and I cannot afford the cost."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Martyn Wilson",
          "Nb_Reviews": 4,
          "Date": "2019-08-28T21:57:53.000Z",
          "Titre": "Good experience but more development needed quick.",
          "Contenu": "My rating is for the W.A. Production subscription plan I subscribed to.  The easiest way for me to rate this is to make a list of pros/cons and features I would have liked because there are lots of very good qualities to this product but also many average and poor.  So here goes:ProsProbably the most important feature is the quality of the samples both in terms of useable content and audio purity.Reasonable subscription rates starting from about £10 a month.A reasonable amount of free downloadable sample packs that just because they are free it doesn't mean they are of any lower quality.ConsIt is still very early days for W. A. Production's subscription plans so only a limited amount of their total sample catalogue is available as part of the subscription plan without having to pay further.No facility to view and preview samples from a particular product.  In the past we have all spent reasonable amounts of money buying sample CDs only to find that either very little is new or useable content, so a good preview is very important.Very little content outside of the EDM genre.ConclusionsThere are a number of competitors coming into this subscription service scheme, like Loopmasters and Splice to name but two so I think W. A. Productions will have to work very quick in order to not get swept away by these as these others offer previews of individual samples from products and the ability to purchase individual samples so you don't have to buy a whole sample pack just to get a couple of desired samples.With more development I think this could be a very good site, but they must be quick so as not to get left behind which would be a shame."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T16:28:31.000Z",
          "Titre": "Decent",
          "Contenu": "Presets and samples are good, other things not so much."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T09:49:29.000Z",
          "Titre": "Can make better packs like artists and…",
          "Contenu": "Can make better packs like artists and and templates"
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T15:26:00.000Z",
          "Titre": "Still doesn't really work very well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Murphy",
          "Nb_Reviews": 4,
          "Date": "2020-12-01T23:02:23.000Z",
          "Titre": "aFTER A FEW TRYS",
          "Contenu": "aFTER A FEW TRYS, NOW EVERYTHING IS GOOD."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T20:29:51.000Z",
          "Titre": "Not enough items in the package"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T16:11:17.000Z",
          "Titre": "Decent products",
          "Contenu": "Decent products. Great prices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Micah",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T23:18:29.000Z",
          "Titre": "Cheap stuff with some Premium Sound buried in the haystack",
          "Contenu": "Website design: confusingProducts: Ideas are innovative and unique and stay up to date which is good but lacking enough presets.Value: Cheap products which can be good or bad if you're looking for premium quality in all their products. Kind of like Waves products. hit and missPros: Alot of good quality freebie sounds, serum patches, and the free Combear plugin (very nice plugin). Also its nice to have a company stay up to date and actually try to release new content even if its not the best. For example Omnisphere takes for ever to update new stuff and things like Trillian become outdated and imo Omnisphere is as well. Not to say WAproductions is replacing any premium suites like this but I would say WAP is EDM/Future Bass focused which is a good thing.Cons: Its easy to drop money on premium content you know that doesnt go on sale and will deliver quality sound like Serum/Omnisphere are quality purchases. These plugins are hit and miss and for regularly priced $60 plugins totally not worth it. Now for a sale of $5 probably is but until you learn more about the tool your using enough to make a Pro Upgrade Choice. I recently just reached out to them of a semi issue on my order and they didn't do anything to resolve the issue but just made sure I was aware of their policy. When a customer reaches out to a company they are not looking for policy they are looking for a reason to like the product. I see WAP is active in keeping replies to reviews which shows promise is customer satisfaction but falls short in my opinion of hitting their target market: hobbyists! So this is why they are 3 stars to me. Try their products. Their Demos are crippled making them very frustrating to try out but it might give you an idea if you like it or not. This BF I bought a ton of their plugins and have yet to find anything as useful as Combbear. Pumper 2 looks promising but wasn't on sale unfortunately. I'm rooting for this company. We need more competition and innovation and collaboration in this industry. But for as much Customer Feedback this company tries to please I'm not sure they are actually listening to their clientele. I think most businesses fall into this trap though not realizing investment is a two way street."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "prismatic brain",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T15:23:25.000Z",
          "Titre": "You get what you pay for."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Madala Nilla",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T16:43:13.000Z",
          "Titre": "Freshe keep it growing"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Guna sekar",
          "Nb_Reviews": 3,
          "Date": "2022-03-31T15:19:07.000Z",
          "Titre": "price is cheap,"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Psill",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T12:33:34.000Z",
          "Titre": "Good",
          "Contenu": "Good songs and vibes"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "RomAnd",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T22:40:51.000Z",
          "Titre": "I liked the site"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rick Hoyrup",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T03:50:01.000Z",
          "Titre": "Great deal!",
          "Contenu": "Great deal on what promise to be pretty cool plug-ins. Almost all are meant for vocals primarily which is great.  Looking  forward to running then through the paces in the next few weeks"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Airontina Music",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T02:27:45.000Z",
          "Titre": "My Review of W. A. Production Blog",
          "Contenu": "W. A. Production is one of my daily blogs I read EVERY day. I find the articles very educational. As a retiree making music to hopefully earn som extra income, I thoroughly enjoy learning and the articels I have read over the years have been very easy to understand and apply in my music making efforts.  So thank you very much and keep up the great work."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ken Davis",
          "Nb_Reviews": 5,
          "Date": "2023-11-27T00:41:43.000Z",
          "Titre": "Good products, good price.",
          "Contenu": "Good products, good prices. Free Lifetime updates as per Image Line would be better, but $10 is OK. I can't find a manual for the new version to explain the new features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "\"Skinny\" Greg Gilman",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T12:46:11.000Z",
          "Titre": "Easy",
          "Contenu": "EasyJosh of course is super pleasant and patient.  Only lost 1 star because of how long it took, and because it took a couple tries.  But outside of that, everything got resolved and all is well with the world!It's still excellent service!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T01:05:39.000Z",
          "Titre": "Overall a great experience",
          "Contenu": "The web portal is great but the software needs work, downloads just disappear until the app is restarted and it hangs often with java errors. I do find the aftercare after a purchase extremely nice with great communication. They give you a place to hang out and talk as well as enjoy some freebies, which is enjoyable.The products are good and deliver, what has been promised and sometimes even more than usual, the combined packages are well thought through. I will buy there again!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Mehdi boutejdar",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T01:48:42.000Z",
          "Titre": "good website"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Polo",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T06:47:39.000Z",
          "Titre": "I was looking for fresh inspiration",
          "Contenu": "I was looking for fresh inspiration for a project, and practically found it immediately after purchasing my products. I'm particularly fond of MIDIs and one-shots, and the ones I purchased went a long way in helping me. Only criticism I have is for all the presets for VSTs and DAWs that I don't use, so it's not a total bang for my buck. But it's definitely not a waste, either."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Phillips",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T23:29:41.000Z",
          "Titre": "Thanks for the Free W495!",
          "Contenu": "I'm a little fuzzy on how smoothly it worked. It's been a few days. But, as I recall, the process went pretty smoothly and intuitively. I have an account. So I signed in first which worked fine as my billing info was filled in automatically. I thank I did has some problem entering the authorization key. I think I had to type it in because I wasn't able to copy and paste it from the document showing it."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Valan the Unbelievable",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:50:14.000Z",
          "Titre": "InstaComposer2 released!!",
          "Contenu": "I could buy InstaComposer2, upgrade version, with discount price for its release sales event. This release values more than the price!Reason why I deduct one star out of 5 is to find download link was not user friendly. Other than that, all is more than expectation."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Sid Francis Tepperwein",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T07:36:56.000Z",
          "Titre": "Much recommended",
          "Contenu": "I have most of W.A.s plugins , I think they are much underrated. They have a clean GUI, sound great, are always useful and don´t rob your wallet. The only point that keeps them from getting 5 stars from me: when I have to re-download something  I am ALWAYS searching quite a while for the download files of my purchased plugins. The serial number is immediately found but somehow the downloads are not where I expect them..."
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "littleBiceps",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T19:20:18.000Z",
          "Titre": "Easy peasy",
          "Contenu": "The resources are easy to find and theres a ton of valuable content.My pain point was downloading the free packages that you have on the site: its super difficult to achieve and took me like 20 minutes playing around with the user interface to find out how to download a free resource from the third party websites."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ltdsmith",
          "Nb_Reviews": 4,
          "Date": "2023-08-28T20:31:08.000Z",
          "Titre": "I got a lot for a very low price",
          "Contenu": "The site and the buying experience is great and prices are mega deals. You get a lot for your money. My only constructive feedback is the quality of the packs themselves leave a little room for improvement. This is based on the few I got, they have so many more I might've just picked some lower level ones. They were on sale & cheap. I got so many sounds, midi presets, and templates for the price.  No matter what DAW you prefer they have it covered also."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Michele",
          "Nb_Reviews": 4,
          "Date": "2022-12-15T01:09:37.000Z",
          "Titre": "I love this company",
          "Contenu": "I love this company, their plugins are amazing and i own at least 15 of it.However, i had to reset my serial codes since they allow a maximum of 3 installations before they expire.Customer service is fast and efficient in providing you new ones, but i would appreciate if i could simply deauthorize the old machines by myself rather than write them an email every time.A plugin manager is needed!"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Chris",
          "Nb_Reviews": 10,
          "Date": "2023-03-22T05:59:47.000Z",
          "Titre": "Good quality products and promising follow-up...",
          "Contenu": "Good quality of products and some nice extras following the sign-up. Though most of these extras are indifferent samples, there are a couple of nice documents and plug-ins to check. Hopefully, more of those are on the way..."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Brake",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T13:25:38.000Z",
          "Titre": "Good plugins",
          "Contenu": "Good quality plugins with fair prices, since I have almost all of them I would love to handle them in one App like other plugin providers."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Ohcirej_Producer",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T00:02:44.000Z",
          "Titre": "The place looks neat",
          "Contenu": "The place looks neat, along with the good quality sample packs and plugins. Few adjustments and expect improvement in the near future... btw what a great place for producers :)"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "HIBIKI",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T11:01:35.000Z",
          "Titre": "Nice VST",
          "Contenu": "Enormous type of sounds included in Babylon.Plus it's easy to feel the difference between the waveshapes.However, the categorize of instruments are pretty complicated."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Williams",
          "Nb_Reviews": 9,
          "Date": "2022-12-11T10:04:30.000Z",
          "Titre": "Not bad, not bad at all.",
          "Contenu": "Initially gave this a pretty scathing review. I WAS WRONGAfter taking some time in the application it’s basically a chord generator (with a wealth of chords and sequences) which are easy to use. Just drag it to your DAW and edit as you see fit. Chord pro+notes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:17:58.000Z",
          "Titre": "Good so far !",
          "Contenu": "Your products seem awesome. Wish I had more time to use them but so far so good. Downloading process was a bit cumbersome but it wasn't too complicated."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Willi Veider",
          "Nb_Reviews": 5,
          "Date": "2023-07-23T09:48:43.000Z",
          "Titre": "It would have been 5 stars, ...",
          "Contenu": "It would have been 5 stars, if I had received an answer to my question, if there is an online tutorial how to use InstaComposer 2."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:10:39.000Z",
          "Titre": "Great installation and registration",
          "Contenu": "Great installation and registration. Especially when considering the sales wasthrough a third party."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jean-Paul Bataille",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T04:17:16.000Z",
          "Titre": "So far, great customer service",
          "Contenu": "Had an instability problem on a Mac with Minipol (my first Karanyi experience, BTW a simple, clever and consequently useful product), so I posted a request, and received the next day an efficient answer from Matthew.Nice work."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "HAGEDEBI",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T09:55:53.000Z",
          "Titre": "I am using instacomposer and sample pack.",
          "Contenu": "I am using instacomposer and sample pack.Regarding the sample pack, there are many basic ones and they are easy to use, but I would like something a little more sharp.I wish you all the best in your future endeavors.Thank You Very Match!!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Xenon",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T14:07:28.000Z",
          "Titre": "the quality of sounds has much improved…",
          "Contenu": "the quality of sounds has much improved since the last time I bought a sound bank. Drums and FX are nearly all catered to what I need. If there was room to add some tonal effects and atmospheric sounds and perhaps some arpeggios, that would be ideal. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John Vere",
          "Nb_Reviews": 3,
          "Date": "2023-01-02T18:20:10.000Z",
          "Titre": "The Com Bear Compressor Easy to…",
          "Contenu": "The Com Bear Compressor Easy to download and install. I have included it in a You Tube I just released where I feature a dozen or so free compressors I tested. The ComBear was one of the best. It passed all my tests with flying colours. John -Cactus Music"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Music Artist",
          "Nb_Reviews": 14,
          "Date": "2023-11-11T23:14:04.000Z",
          "Titre": "Great plugin supplier :)!",
          "Contenu": "Great plugin supplier. Spotify artist Arnold Wittman"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jeffrey van Beek",
          "Nb_Reviews": 6,
          "Date": "2022-11-29T13:44:41.000Z",
          "Titre": "Clear about what they are doing",
          "Contenu": "Clear about what they are doing, Great sounding Plugins and Templates."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Roberto del Pino",
          "Nb_Reviews": 6,
          "Date": "2023-04-13T22:00:40.000Z",
          "Titre": "Great company. We need more docu",
          "Contenu": "Great company. Great plugin. I just need more documentation on how to use it at high level"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T21:58:02.000Z",
          "Titre": "a lot of sounds in these sales packs…",
          "Contenu": "a lot of sounds in these sales packs for low pricehav only listened to small amount but pretty greatso far. good value"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Paras Dubey",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T19:56:38.000Z",
          "Titre": "Great",
          "Contenu": "perfect and high-quality sounds, all you need to do is drag and drop and make good music."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wretchedd cesspool",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T23:27:50.000Z",
          "Titre": "Much appreciation and respect for…",
          "Contenu": "Much appreciation and respect for providing knowledge, plugins and just an overall environment to aid producers through the musical journey.  Thank you much WAP!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T16:20:33.000Z",
          "Titre": "Offers great deals",
          "Contenu": "Offers great deals - but you have to read the manuals that go with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Griffin",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T16:35:32.000Z",
          "Titre": "Happy customer",
          "Contenu": "I’m new to u and ur product but was very pleased with what I purchased it made my music more."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shubham",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T12:08:11.000Z",
          "Titre": "Technology is neutral but it all…",
          "Contenu": "Technology is neutral but it all depends on the way we use it"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T16:14:08.000Z",
          "Titre": "Amazing place to visit for people who…",
          "Contenu": "Amazing place to visit for people who are addicted to music"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "deadlycopter",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T07:43:11.000Z",
          "Titre": "All the WA packs sound great",
          "Contenu": "All the WA packs sound great, have loads of amazing samples and are really worth getting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "birdsongzz",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T18:29:35.000Z",
          "Titre": "Really Nice Vsts and Samples...",
          "Contenu": "Really Nice Vsts and Samples...Samples are Hard to Download at times, However.Shalom,birdsongz"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Andreas L.",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T22:55:55.000Z",
          "Titre": "Cryostasis - first impressions",
          "Contenu": "Cryostasis is a - to my knowledge - unique and interesting tool for audio processing.The installation and activation procedure via United Plugins seems a little bit complicated and time consuming, could be somewhat easier to my opinion. Nevertheless, overall a big thankyou!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Parson",
          "Nb_Reviews": 22,
          "Date": "2023-04-01T16:51:34.000Z",
          "Titre": "Support is responsive and helpful",
          "Contenu": "Easy use of products Support is responsive and helpful ."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Norman",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T00:06:40.000Z",
          "Titre": "Review",
          "Contenu": "use has been satisfactory up to a point . Sometimes the use of the product is not very clear. but in general it has given good results. Me gustaría que fuera traducido del español para una mejor experiencia.Likewise, I would like the manual to be translated."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter Vigrass",
          "Nb_Reviews": 8,
          "Date": "2022-10-09T18:47:42.000Z",
          "Titre": "I bought instachord daw plug in",
          "Contenu": "I bought instachord daw plug in. Good service, just can't find anything practical to use it for.I bought this because I have hit a brick wall with using chords. Just thought it might of give me some inspiration for something new, but it hasn't.I'm not saying it's a bad Pugin, in fact very good for someone new to music production.I found the plug in a bit fiddly at first, you need to set the keys to match or if your naturally used to playing chords like me you will end up pressing the wrong chord key.Overall good value for the money."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Maahiya Pritam",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T17:15:22.000Z",
          "Titre": "Your all plugins are very nice",
          "Contenu": "Your all plugins are very nice. Still i use your free plugins. But i want buy your plugins bundle oneday."
        },
        {
          "Note": 4,
          "Lieu": "DM",
          "Pseudo": "J-Peltier",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T17:35:39.000Z",
          "Titre": "767 Dominica..",
          "Contenu": "767 Dominica... So FAR So Good... Just Keep Up The Good Work... Am Always Looking To Try New Stuffs From W.A."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "alan doherty",
          "Nb_Reviews": 11,
          "Date": "2023-06-11T20:07:25.000Z",
          "Titre": "Give some real good deals that are…W.A. Production plugins",
          "Contenu": "Give some real good deals that are affordable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Burley",
          "Nb_Reviews": 2,
          "Date": "2022-12-18T19:39:39.000Z",
          "Titre": "Great products and they are good for…",
          "Contenu": "Great products and they are good for giving you that extra that you need!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glenn Stoughton",
          "Nb_Reviews": 3,
          "Date": "2022-09-08T18:33:30.000Z",
          "Titre": "Happy customer",
          "Contenu": "Now have several products and am happy with a couple of exceptions. 1) With bundles it looks like only one carries a serial, so the other is unavailable (for instance in the account list, and 2) One of the vocal plugs wouldn't load with a message stating I had exceeded my 3x install limit?!  Would like to be able to address that without a second purchase.  Otherwise I really appreciate your work and plugs.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Abiyyu Razin",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T16:29:39.000Z",
          "Titre": "This website is very helpful for me"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Madman J",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T16:43:01.000Z",
          "Titre": "Nice tool the instachord 2!"
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Positive Design Group",
          "Nb_Reviews": 2,
          "Date": "2022-07-25T07:09:04.000Z",
          "Titre": "Mainly a good company",
          "Contenu": "All in all, it is a good company with competitive products. Though functionality of some of them needs improvement (Outlaw Lite, for example), the interface is quite appealing. Free sample packs are also a good addition to other stuff. E-mails were coming even after managing subscription in the profile (\"unsubscribe\" button didn't work for the first time). This is a minor drawback. The rest is fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "L. Norton",
          "Nb_Reviews": 5,
          "Date": "2022-09-08T18:46:07.000Z",
          "Titre": "I had trouble getting license key for Instachord 2",
          "Contenu": "I had trouble getting the license key for Instachord 2.after the purchase, download and install had gone smoothly. After several emails with the tireless Josh of WAP, we finally got there. But it should have been simpler."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Eduardo Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T05:58:11.000Z",
          "Titre": "Fast downloads",
          "Contenu": "Fast downloads. Very well explained download and activation process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "elie",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T06:44:55.000Z",
          "Titre": "Eh i switched to distrokid but they…",
          "Contenu": "Eh i switched to distrokid but they were helpful"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T15:37:11.000Z",
          "Titre": "good value for money",
          "Contenu": "great offers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 10,
          "Date": "2022-06-21T23:49:36.000Z",
          "Titre": "It had some really good fx sounds",
          "Contenu": "It had some really good fx sounds. But, you can do better, by eliminating duplicate sounds. But, you're definitely heading in the right direction 👍. But overall, I like what you're doing, keep up the great work. And create a pack like that, but much bigger so I can purchase"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Rich Cooke",
          "Nb_Reviews": 8,
          "Date": "2023-04-08T16:07:18.000Z",
          "Titre": "Good and affordable products!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T02:03:34.000Z",
          "Titre": "GOOD... But could be GREAT",
          "Contenu": "I think the Sound packs are very good, but lack tremendously in certain genres such as R&B, Neo Soul and Soul. For EDM, Dubstep, Techno, House and music in those genres, W.A. is great.BTW...the Plug-ins are incredible also. An extra star for that."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JackyB",
          "Nb_Reviews": 4,
          "Date": "2022-05-18T01:44:35.000Z",
          "Titre": "I obtained some freebies from the WA…",
          "Contenu": "I obtained some freebies from the WA site. I'd give 5 stars, but the delivery mechanism required following people on Soundcloud & Insta via an external provider's site, and was super clunky to do, instead of being a straightforward download, so I've knocked a star off for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Electric Mule",
          "Nb_Reviews": 11,
          "Date": "2022-03-29T23:54:48.000Z",
          "Titre": "W.A.Production has great software and samples",
          "Contenu": "I have a number of W.A.Production software programs and samples. I use them all and give W.A. a thumbs up. The ONLY reason I don't give 5 stars is because that rating is superlative and too easily thrown around. I also can't or won't use some aspects of the programs and loops but basically think they are good. Keep up the good work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Malinovsky",
          "Nb_Reviews": 7,
          "Date": "2022-05-20T15:39:46.000Z",
          "Titre": "Your plugins are a good value",
          "Contenu": "Your plugins are a good value. They work well, but I don't feel they offer the same quality as say Plug In Alliance plugs. They do not fit my genre always (acoustic music), and that is fine. Im glad you are in the game and your products continue to be available to to improve."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 5,
          "Date": "2022-03-12T11:56:45.000Z",
          "Titre": "Can't go wrong with W.A. Productions",
          "Contenu": "W.A. Productions is a solid company that produce both industry level plugins and quality samples at competitive prices and that's without any of the great discounts that they regularly provide. The only thing that is lacking is a diversified marketplace. Including more non-generative (Mixer, channel, layouts, envelops) Presets, Templates, and Tools for instance."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "rod anderson",
          "Nb_Reviews": 8,
          "Date": "2023-09-16T17:46:26.000Z",
          "Titre": "A Quality product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Laune Weitz",
          "Nb_Reviews": 9,
          "Date": "2022-02-15T23:52:50.000Z",
          "Titre": "Great stuff! However...",
          "Contenu": "The templates and or FLP's could be made for FL Studio stock plugins only, with a guided video or PDF to explain where things are and how to use it properly.I think this way, buyers like myself, can have that option as well.Yet, I am a very happy customer for what I have purchased for now. Excellent communication from customer service as well."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "GUBER and DL  4631 commands GRAFFITI",
          "Nb_Reviews": 5,
          "Date": "2022-02-27T09:37:38.000Z",
          "Titre": "Good promotions and discounts",
          "Contenu": "Good promotions and discounts, but I don’t like the fact that licenses are given for a certain number of registrations, I’m talking about software: ImPerfect, very often the computer breaks down after a year, you have to reinstall wines 3-4 times, but your support was at a high level - they helped, Soft : ImPerfect but I understand that this is not infinite, reset licenses manually, I like your store, but next time I will think before buying software here, as it is, that is, it is designed for a certain number of registrations"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Redzuan",
          "Nb_Reviews": 2,
          "Date": "2021-11-28T13:44:37.000Z",
          "Titre": "System Requirements",
          "Contenu": "I wish the system requirements for the Mac were displayed a bit more prominently. I was still running Macos Mojave (10.14) and was rather perplexed that while the demo could run, i couldn't activate the license saying that i didn't have an Internet connection. Could've just stopped the user who installed it in anything less than Catalina (10.15) from proceeding further. Anyway, I eventually upgraded to Catalina and do enjoy InstaComposer immensely!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MICHAEL STOREY",
          "Nb_Reviews": 14,
          "Date": "2021-10-08T14:59:41.000Z",
          "Titre": "Instacomposer plugin. Solid results",
          "Contenu": "Instacomposer pluginThe only reason fo only four stars is the documentation (instructions) are somewhat minimal. The product itself is proving to be  musically useful. No problems with installation etc.To be able to use on all channels in Logic Pro direct would be better.I have roughed out about six songs since having the plugin.Michael."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-22T00:27:36.000Z",
          "Titre": "Good enough with minor inconsistent bugs",
          "Contenu": "Well, so far, downloading the We Love FL Bundle was easy enough, although if there's any suggestion I can give to improve, it's that the \"recent purchases\" tab was at one point active and I couldn't pull it back, or at least it felt I wasn't given a choice to, causing a bit of a claustrophobic screen and impeding viewing some things. Just a small nitpick, could just be a bug because it worked another time and it was just once. Just thought I'd point it out."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rhys",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T19:44:31.000Z",
          "Titre": "Worth the purchase.",
          "Contenu": "I enjoyed the masterclass video series on FM8. It was engaging and covered all the curriculum I had anticipated. I was expecting a couple additional add-ons regarding specific genres, however that is merely my humble opinion and could be developed into an advanced masterclass at a reduced rate in the future perhaps.Very enjoyable content indeed though."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "djeros",
          "Nb_Reviews": 2,
          "Date": "2021-05-30T09:48:10.000Z",
          "Titre": "Very good sound quality, lots of variety, maybe lack of more raw sounds",
          "Contenu": "Hello everyone,I recently bought a few WA products. in relation to my use of sounds, of course, and only talking about what I've already listened to which is not the all thing, I'd have prefered having more raw sounds, samples so. The loops can be interesting for a type of music, and they are very good loops with lots of variety.But at the end, it's with no doubt a very good product, for sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T17:27:53.000Z",
          "Titre": "Great plug in",
          "Contenu": "Great plug in. Simple to use, great sound and great price. But the site is not Good. It is clearly built for trendy, flashy, be a rockstar look. Rather then professional mixing/Audio. Harder to get information about the actual plug in, detailed specs, manual etc. again loved the plug in but the site was useless."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "selmo alves",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T18:11:29.000Z",
          "Titre": "Great Products for a great price. Some suggestions!",
          "Contenu": "Really like your products. Cheap and easy to use. Wish the GUI was a bit more user friendly. For example the Preset Browser isn't particularly easy to access. Maybe some fresh skins for the GUI's wouldnt hurt too. Lastly i would ask for a setting where hovering over a knob or button brings up some text (maybe at the bottom) explaining its use."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Eric Roux",
          "Nb_Reviews": 3,
          "Date": "2020-12-02T06:41:34.000Z",
          "Titre": "Very good but could improve a bit",
          "Contenu": "The prices are very good in period of black Friday but the thing is that when buying bundles it would be nice if you could propose a SINGLE download link instead of having to click some links in a popup list wich is CLOSING ITSELF upon EACH download and you have to reopen. when the bundel is containing 23 packs of sound it is rather annoying... thanks"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Marjo",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T10:08:53.000Z",
          "Titre": "Good service",
          "Contenu": "Great service from Josh, they will help you straight away. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Easy breazy customer",
          "Nb_Reviews": 4,
          "Date": "2021-08-10T20:33:06.000Z",
          "Titre": "I use FL Studios and I thought their products don't work well together, I was wrong",
          "Contenu": "I use FL Studios. I purchased some sample packs from WA productions after getting some cool free samples or something and I can't even use anything contained in the sample packs... Update - since this post W A Productions reached out to me and really went the extra mile! Make sure nothing was wrong with the files I received, explaining the different contents of each package and what I could and couldn't do with them. It was very refreshing to get that kind of 1:1 expirerence from a company. Will definitely buy more packages in the future."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pisces",
          "Nb_Reviews": 5,
          "Date": "2022-02-28T09:26:32.000Z",
          "Titre": "Great products & freebies",
          "Contenu": "Great products, lots of freebies, because i run dual 32bit and 64bit workstations, its shame they don't support 32bit plugins anymore, so I use the software less and less these days. But the sample packs are really great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aemyth Jensen",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T12:43:58.000Z",
          "Titre": "What I love:",
          "Contenu": "What I love:the plugins are great unique easy to use and they add value to your collection of plugins.The samples are great quality and very good selectionMany bundles include a lot different things including plugins, samples, presets for several synths, etc.What I can't stand:The example or demonstration audio that they show for each of their products, many times have this very annoying, obnoxious, and loud deep man voice saying \"WHAT ABOUT MAKING YOUR SOUND BETTER\" at the beginning. It somewhat deters me from their products even though they are excellent products.If they were to remove that from everywhere in their site I'd give them 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Roger L",
          "Nb_Reviews": 10,
          "Date": "2021-11-15T13:28:58.000Z",
          "Titre": "Instacomposer is Great",
          "Contenu": "This is an excellent generator which can output 5 tracks on separate midi channels, but it lacks an inbuilt synth. Therefore it is more complex to use on a DAW such as Ableton Live, which combines midi channels when routing midi from one track to another. The only options are to purchase and install a plugin to manage midi routing such as Blue Cat's Patchwork, or to drag and drop the midi clips generated onto the individual tracks on the DAW.It could also do with a comprehensive written manual althughthere are some good viseos on You Tube.Having said this I will reiteate it generates some really good midi output."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Still And Silent Music",
          "Nb_Reviews": 2,
          "Date": "2021-07-02T14:20:56.000Z",
          "Titre": "the sounds are very good and versatile.",
          "Contenu": "the sounds are very good and versatile.A small suggestion from me would be that the sounds are a bit louder and above all that they have about the same volume. Greetings and keep it up🤘🏼🎸🎹🎼👍🏼👌🏼"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Frank Trives",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T08:06:06.000Z",
          "Titre": "very good",
          "Contenu": "Hello First of all, Thank you for the plugin, it is very easy to use but without trying to judge the work that has been invested in it, I think it could improve the interface, for example: being able to change skin color and modify buttons. for everything else is very good, greetings."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Guy Bartle",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T17:20:05.000Z",
          "Titre": "Easy shopping experience",
          "Contenu": "Easy shopping experience. Slightly confusing website design."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Young",
          "Nb_Reviews": 8,
          "Date": "2022-06-04T21:53:15.000Z",
          "Titre": "A wide array of sounds available",
          "Contenu": "A wide array of sounds available - from presets to samples to plugins, for all electronic genres (or more?) and plenty of good sales/giveaways every month. Not all of their stuff is what I'm interested in using, as it mostly caters to a \"festival\" vibe, but with enough digging you'll find there's a little something for everyone. Sometimes the giveaways are great and other times they are boring and just take up space. But can't complain about free, right? Their own plugins are hit or miss: some are not amazing, whereas others are so great you don't know how you did anything before them - depends on your needs I guess. Navigating the shop is confusing sometimes, but overall pretty organized. (I mainly just go for sales, anyway.) Overall, a solid good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Rast",
          "Nb_Reviews": 3,
          "Date": "2021-03-04T10:16:05.000Z",
          "Titre": "I would like to give you fellas five…",
          "Contenu": "I would like to give you fellas five stars but I can't bring myself to do it because your downloading process is very confusing. I'm also purchasing plugins from other manufacturers and it seems like there's no standard way to do these downloads. But don't get me wrong, you guys have some really great virtual instruments and FX and I have no plans to give up on playing and writing good music. Hopefully, I'll be caught up with the install routine in a few weeks. In the meantime I'll be trying to figure out how to make these programs work. But you guys are excellent at your craft!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-06-09T14:33:40.000Z",
          "Titre": "I have tried your free products. And Thanks For That !",
          "Contenu": "I have tried your free products and its awesome. And I can't tell you about all. Producing is hobby not my job .And I don't have any money so far to buy your packs. But I want to. Visiting your site was really grateful to me. Thanks !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teguh Inarsoyo",
          "Nb_Reviews": 3,
          "Date": "2021-03-29T21:05:56.000Z",
          "Titre": "Transient Helper",
          "Contenu": "I just recently tried the transient helper on one of my audio projects and it worked and helped as expected. The presets are real good to start for tweaking (I used parallels). I may give 5 start rating once I used it on several track or maybe mix"
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "pogxcraft",
          "Nb_Reviews": 2,
          "Date": "2021-04-05T14:19:40.000Z",
          "Titre": "i'm a new music producer and need some…",
          "Contenu": "i'm a new music producer and need some of sample to do further work on new song or study. i think this web is great value on that. Because i got many files and a little mess,i still need to sort out large amount of file in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T22:41:32.000Z",
          "Titre": "W.A. Production is great",
          "Contenu": "The only thing that I had a problem with is the site could be a little easier to get the freebies to download... Give me my hassle free freebies and I guarantee you I will buy more stuff... Great site... Great sounds..."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Maurice",
          "Nb_Reviews": 15,
          "Date": "2021-05-22T11:02:00.000Z",
          "Titre": "Great budget plugins.",
          "Contenu": "Great budget plugins.Does the same as a lot of more expensive plugins.Because of the amount of offers it’s sometimes a bit confusing. Hope they will also keep track of plugin fixes and updates instead of only releasing new ones."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Eccle ziasta",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T17:26:46.000Z",
          "Titre": "I❤️ it guys, u are one of the best in terms of plugins, i wasted money on some plugins from some popular companies.. I'm so impressed by yo plugins ❤️❤️💪👊🔥"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Ruud de Vries",
          "Nb_Reviews": 2,
          "Date": "2022-07-10T14:22:40.000Z",
          "Titre": "Thanks for the free stuff",
          "Contenu": "Thanks for the free stuff, but asking for a review of a product that I just purchased, makes no sense. Didn't get a chance to experience it!"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Pilip",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T16:13:28.000Z",
          "Titre": "Outlaw Lite",
          "Contenu": "I downloaded Outlaw Lite and I'm pleasantly surprised that they are giving this out for free. Nice free vocal rider alternative, and no more hours of gain automation."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Conchetumare",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T23:31:00.000Z",
          "Titre": "I like it a lot but i would like it…",
          "Contenu": "I like it a lot but i would like it more if any sample has more details (key, bpm and scale), could help a lot to finding those samples you need specifically for the track you are working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NEPENTHES _FUSCA",
          "Nb_Reviews": 3,
          "Date": "2022-05-30T16:43:25.000Z",
          "Titre": "Very Good the only things for the free…",
          "Contenu": "Very Good the only things for the free stuff is that it could be improved by fixing some links and a little less Pumpyoursound but very good for free stuff"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ViPeoples",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T12:45:36.000Z",
          "Titre": "yin & yang",
          "Contenu": "Pros: very good source for samples, quantity of product, quality of samplesCons: sometimes there are a lot of unusable samples, sample packs are VERY genre specific."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer, Johnny Rock",
          "Nb_Reviews": 2,
          "Date": "2021-07-16T23:17:44.000Z",
          "Titre": "Ok here we go,,,,,,,,   Pleasantly Surprised Over All",
          "Contenu": "Ok here we go,,, l really liked the sound of the vocal splitter however l noticed a high end static at the end of the vocal track that l ran the plugin on. l did push it abit to see how well it worked and l will be careful of the mix and drive levels to avoid that in the future. Next, the vocal limiter, this plugin sounded distorted no matter what level l set it at. l havent tried the comb bear yet but l will soon....l can't complain as they were free plugins and the vocal splitter will get plenty of use from me...  Best regards, Johnny Rock                                                                       Minneapolis Metal Church                                                                        Sound Engineer/Producer......"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T15:43:24.000Z",
          "Titre": "Useful Plugins",
          "Contenu": "Useful Plugins, Great Discounts. Nice and functional website."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "MrKin",
          "Nb_Reviews": 7,
          "Date": "2022-01-01T22:21:18.000Z",
          "Titre": "Excellent",
          "Contenu": "Great files, good download servers, quality could be better (always), good tools (midi , chords, and scale), very happy, i have almost all the VSTThanks a lot!KRegardsMariano"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Seryljo van Ierlant",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T15:02:28.000Z",
          "Titre": "Recommendation",
          "Contenu": "Ive been helped very good with my questions and deliveries. My problem was solved quickly and speedy. W.a. Production I can recommend as a professional company with great service"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Name.",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T18:33:49.000Z",
          "Titre": "Ease of download and Naming",
          "Contenu": "Sample quality is good but ease of downloading the pack is sub par. Also, samples could use some better/more descriptive names. Overall, I'm satisfied to be honest haha."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Kunde",
          "Nb_Reviews": 3,
          "Date": "2021-10-10T08:51:48.000Z",
          "Titre": "Great product (InstaComposer)",
          "Contenu": "Great product (InstaComposer), although with some limitations androom for improvements e.g. usage in Ableton and Authorisation in older MacOSXes. Very good and helpful support."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T20:55:08.000Z",
          "Titre": "Great!",
          "Contenu": "I like the products Fundamental Bass and Puncher2 Lite because i was able to set different settings for (for example) my BassBut optical wish a better design with more intensive colors"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Ingraham",
          "Nb_Reviews": 13,
          "Date": "2021-05-13T01:42:54.000Z",
          "Titre": "I purchased InstaChords from WA…",
          "Contenu": "I purchased InstaChords from WA Production.  The plug in works great and performs just as advertised.  The interface is intuitive and easy to learn and the instructional videos answered almost all the questions I had about the plug in.My only comment would be about WA Production's web site.  I found it a bit difficult to navigate and there are a several side tab like pop ups that require a mouse click to hide so you can properly see the information you are really trying to view.  There is a ton of content on the site which is great, I just wish it was perhaps a bit better organized and easier to navigate with fewer pop up menus that multiple layers deep.That's a minor complaint however and over all I'm really pleased with my purchase.  Instascale is definetly on my wish list."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlie Y",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T10:42:13.000Z",
          "Titre": "A good company is when an issue goes…",
          "Contenu": "A good company is when an issue goes wrong, and how they respond. Purchased instacomposer2  and obviously something glitched no license details, so emailed support with screenshot and as yet no response, emailed again, still nothing, a tad frustrating.Update: They have contacted me apologised and now all fixed, can't ask for more."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Norihito Sugiura",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:17:13.000Z",
          "Titre": "InstaComporser & Bundle",
          "Contenu": "i purchased instacomporser & bundle for mistake instacomporser2, but contens are great.And instacomporser2 have discount price for instacomporse user is very thankful.finally i purchased instacomporser2 and instachord2.Many free contents include in the site and W.A.production support up the user is feel me kind."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris Bangs",
          "Nb_Reviews": 56,
          "Date": "2023-12-19T23:20:26.000Z",
          "Titre": "I have 3 WA PLUG-INS",
          "Contenu": "I have 3 WA PLUG-INS KICKSHAPER and 2 KSHMR plugins. Well priced easy to use and seem to be dependable so far all updated to MACOS Sonoma no problems"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "the SMCN",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:26:44.000Z",
          "Titre": "Great product, uncomplicated transaction",
          "Contenu": "Just bought ImPerfect, which is a fabulous sounding, CPU-friendly synth I can absolutely recommend! The transaction was fast and easy unlike many others I experienced throughout this Black Friday sale."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:34:59.000Z",
          "Titre": "WAProduction is the best!",
          "Contenu": "WAProduction offers a lot of high quality freebies when you start your music production journey. And from time to time they have very good sales when you can buy high quality samples, plugins, presets and templates at affordable prices. They are first in my thoughts when I’m thinking about samples and presets. Also what I love about WA Plugins is that you don’t have to install some plugin manager or license management tool and every plugin has a lot of presets to play with. Thanks WA Production! I’ve learned a lot from FLP Templates and from video courses! But wait, there’s more: Their YouTube and Facebook is full of awesome tips and tricks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Hughes",
          "Nb_Reviews": 16,
          "Date": "2023-12-19T22:35:22.000Z",
          "Titre": "couldn't ask for more",
          "Contenu": "Well priced, item as described and prompt delivery couldn't ask for more"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Dazdownunder",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T16:03:53.000Z",
          "Titre": "Great Product",
          "Contenu": "Easy to integrate into system and works well with APP it was made for, thanks."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Whitelight",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T17:48:34.000Z",
          "Titre": "Upgrading existing products is a joy…",
          "Contenu": "Upgrading existing products is working great and I like that I get some additional Sounds or resources nearly everytime I buy something at W.A. Production!Keep the good work!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T13:33:45.000Z",
          "Titre": "My favourite website...!",
          "Contenu": "I recently purchased a treasure trove of sounds, plugins, and DAW templates, and I'm blown away by the quality! The extensive collection is meticulously curated, and the ability to preview before buying is fantastic. The mastering and promotion services provided are top-notch, and the free packs are a delightful bonus. A must-have for anyone serious about music production!"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Jouko Hahkio",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T11:12:33.000Z",
          "Titre": "Snappy service",
          "Contenu": "I think the process was straightforward enough, and easy to go through. I got the plugin into production in a jiffy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T06:34:43.000Z",
          "Titre": "Great Service",
          "Contenu": "Site was easy to navigate and purchase the plugin. I tried out the free version of Outlaw, and it is amazing! Keeping all tracks at decent levels. So, I bought the full version of Outlaw."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neuro DJ",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T00:14:44.000Z",
          "Titre": "All Around Great Experience",
          "Contenu": "Super quick sale process, access sent instantly, great deals, good communication, not too many emails, and of course - great loops!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Malinovsky",
          "Nb_Reviews": 7,
          "Date": "2023-12-17T01:19:49.000Z",
          "Titre": "WA Productions Scream VST",
          "Contenu": "Love what your vsts do. The Scream is great for my voice. I already have a gravelly voice and this plug just lets me enhance that more in audio. I think your stuff is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neuro DJ",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T17:31:16.000Z",
          "Titre": "Awesome deals and really easy to…",
          "Contenu": "Awesome deals and really easy to navigate website. Quick delivery of digital assets, smooth process the entire way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay McClure",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:59:44.000Z",
          "Titre": "W.A. Productions is the Real Deal",
          "Contenu": "W.A. Productions provides stellar plug-ins at cost effective prices. I am looking forward to purchasing more plug-ins in the near future and beyond."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Björn  Hernborg",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T09:15:06.000Z",
          "Titre": "Great to be able to get a lite version…",
          "Contenu": "Great to be able to get a lite version of a plugin to try before buying the regular one. //B"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Roadkill",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T16:09:40.000Z",
          "Titre": "Its an OK plugin that can help with sparking creativity",
          "Contenu": "It’s an OK plugin.  it produces some good starting points but still needs to take quite a bit of work to make what is produced into something workable.The plug-in itself might take a few tries to wrap your head around it.   The user interface is well laid out but you will need to read the quick guide a few times to get comfortable with it and to understand what it’s doing.  What is offers is great to spark the idea.  In my workflow I use instacomposer to rough out some idea of melody rhythm pad bead etc. then dog drop them into my DAW as editing inside the plug-in is just too finicky. In the DAW I have better control and can play around with the sounds and notes.  If it doesn’t flesh out then I jump back into instaccomposer and try a different combo.   It’s not the most elegant or efficient but it works and we are in this to make music."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Marco Casarin",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:47:04.000Z",
          "Titre": "I bought a very useful course at a low…",
          "Contenu": "I bought a very useful course at a low price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Fuller",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T20:25:52.000Z",
          "Titre": "Easy peasy",
          "Contenu": "Easy peasy, lemon squeezy."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T13:22:56.000Z",
          "Titre": "They offer good plugins with a very…",
          "Contenu": "They offer good plugins with a very good prices. This is important to us, producers with less money. Also, their plugins make our job fast and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William H.",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T03:43:17.000Z",
          "Titre": "I just made my first two purchases with…",
          "Contenu": "I just made my first two purchases with instacomposer and loop engine. If these two products alone are any indication of what this company can do moving forward I think they are gonna change the game with the A.I. music revolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bsfreely",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T21:08:30.000Z",
          "Titre": "Puncher 2 Lite",
          "Contenu": "New to DAWs, using LMMS. Tried Puncher 2 Lite yesterday in place of an exciter plugin for a synth trumpet. It's relatively simple with 3 knobs plus gain. I like that \"transients\" has its own separate knob. Having the gain in the plugin means I don't have to tweak the volume elsewhere. It's a keeper!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "b burnette",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T16:25:34.000Z",
          "Titre": "Great prices on most and a ton of options",
          "Contenu": "Great prices on most items I am interested in, plus a lot of bundles that get pointed out to me that contain packs I am looking for to get an even better deal. Have not used them too much yet as I just started really getting into hobby production, but all transactions have been fast and smooth without any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald DiCicco",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T11:01:13.000Z",
          "Titre": "Preset Preivews",
          "Contenu": "The previews of the sound packs used in a demo are probably the most important feature. What better way to sort through and find what you're looking for as well as stumble upon what you didn't know you wanted until you heard it used in a track."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:22:43.000Z",
          "Titre": "I had a problem with my account and it…",
          "Contenu": "I had a problem with my account and it was taken care quickly."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Yung Lux",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T22:47:02.000Z",
          "Titre": "Decent sounds",
          "Contenu": "The sounds are decently standard, but I just bought a future bass vocal pack and it's amazing.Also love how organized the pack was as it came with seperate harmonies giving me full control over how I wanted them to sound."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T12:14:31.000Z",
          "Titre": "InstaComposer 2",
          "Contenu": "I bought InstaComposer 2, my first purchase from WA Production. It's a great plugin which complements other songwriting tools and inspires new ideas. The purchase process was straightforward and seamless. At first I couldn't figure out how to download the plugin, expecting an emailed link. However once I realised it was from my WA account all was well. I would certainly buy other products from WA Production."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime Martinez",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T00:36:46.000Z",
          "Titre": "I had an outstanding experience with…",
          "Contenu": "I had an outstanding experience with Brandon customer service. Not only did they help me with a fast and courteous help with my download , but they also offered a great discount code and free loops to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Fuller",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T00:10:55.000Z",
          "Titre": "Easy peasy lemon squeezy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Rowley",
          "Nb_Reviews": 9,
          "Date": "2023-09-11T14:38:19.000Z",
          "Titre": "Really good free samples to use",
          "Contenu": "Looking for a few free samples for own use. They had some really good cinematic ones and other string section. Have literally searched for a lot of plugins which have been average but these really stand out more."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Chinnian",
          "Nb_Reviews": 11,
          "Date": "2023-07-24T19:03:55.000Z",
          "Titre": "Outstanding Customer Service ensuring great value for money",
          "Contenu": "Very easy to email W. A. Production and get a prompt response explaining everything clearly and dealing with any issues or concerns. I am very impressed with their customer service and it reassures me that the hard earned money I am spending with them, and third party plugin manufacturers, is being spent wisely and that they will look after me and my account. Highly recommended and will continue to use regularly 👍🏾"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "TwoFace",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T20:32:22.000Z",
          "Titre": "Always quality products for great price."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dave Newby",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T03:42:51.000Z",
          "Titre": "Instacomposer 2  - the perfect creative spark",
          "Contenu": "Instacomposer 2 gives me just the right amount of creative help to light the spark of an idea, and then offers me a really intuitive interface and easy process to quickly develop and customise that idea and drag it straight into my DAW. That's all I need ... perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christobeth Music Christobeth",
          "Nb_Reviews": 4,
          "Date": "2023-09-04T16:42:38.000Z",
          "Titre": "Excellent Communication",
          "Contenu": "The communication from W A Production is amazing. They took the time to ensure that the product is working properly. I have a few of their products and I am amazed with the quality and use in my productions.They go above and beyond with additional resources.They are truly amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathew Somers",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T11:13:56.000Z",
          "Titre": "I’m surprised how much I liked its choices",
          "Contenu": "I’m still feeling this product out, but within an hour of installing the demo, I was impressed enough by the chord/melody and inversion choices, that I wanted to see everything it had to offer and I bought the full product.  It might not be life-changing, but that’s the first time I’ve ever done that, so… It’s a great deal for the price, but that’s not to say I would’ve bought it if it cost much more.  I don’t think it’ll change the way I compose, but I do expect I’ll find a few more happy surprises as I use the product that’ll make the cost a good value."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "RJ",
          "Nb_Reviews": 17,
          "Date": "2023-11-11T17:38:59.000Z",
          "Titre": "efficient for great price",
          "Contenu": "Always easy to get a product at a very nice price and get some loyalty points to decrease cost for next good one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "asdf",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T21:27:25.000Z",
          "Titre": "OH MY AUDITORY GOODNESS",
          "Contenu": "OH MY AUDITORY GOODNESS! I'm really grooving on all the goodies I've gotten with W.A. Productions! I have a lot of toys to play with now in my various DAWs! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Creativo",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T17:18:13.000Z",
          "Titre": "Creativity first. The song is the focus!",
          "Contenu": "Your products help me to immediately transfer my creativity in results where I could start right away in a professional manner. Even if I later on record some tracks individual new  with  my  own Instruments or friends your products allowing me to work fast on my ideas without technical overkill."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:15:45.000Z",
          "Titre": "I find the products are exactly what I…",
          "Contenu": "I find the products are exactly what I require and good value for money. The website is easy to navigate which makes the experience a whole easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Fox",
          "Nb_Reviews": 20,
          "Date": "2023-11-04T19:31:09.000Z",
          "Titre": "Excellent Quality",
          "Contenu": "WA Productions is one of my go-to resources. Their quality and professionalism should be emulated by all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mancalledclay",
          "Nb_Reviews": 10,
          "Date": "2023-09-24T20:42:20.000Z",
          "Titre": "trouble-free purchases.",
          "Contenu": "i never have problems with my purchases at WA Production. Installation and authorization are always glitch-free...and for the most part all their plugins are well-worth their asking-price. satisfied customer for some years now...thanks for making nice products with a reliable system of delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohammed Sinclair",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:07:13.000Z",
          "Titre": "Great service and customer support",
          "Contenu": "Great service and customer support, always happy to deal with you."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Magnus",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T18:35:49.000Z",
          "Titre": "Wonderful software :)",
          "Contenu": "Wonderful software :)I bought the InstaChord 2 and InstaComposer 2 bundles.My only issues are about the expansions, the installation is horrible, move files manually and the instructions are misleading, patterns will be missed if not done right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Kohlgraf",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T11:04:27.000Z",
          "Titre": "I love doing business with W.A",
          "Contenu": "I love doing business with W.A. Productions due to the quality of their products and the excellent customer service they provide. Everything is a breeze, nice, easy, efficient and quick. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Mars Luhu",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T10:13:38.000Z",
          "Titre": "It's make me musical by using it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob W",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T06:51:32.000Z",
          "Titre": "One Stop Music Shop",
          "Contenu": "The support that is available for rising issues is awesome!! WA has lots of great products with great prices and loads of free bees. From Plugins to samples, W.A. Production has it all. Check it out for yourself. You will be happy you did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HouseMonkey",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T04:16:18.000Z",
          "Titre": "Reasonably priced products",
          "Contenu": "Reasonably priced products, quick and easy downloads, freebies, I guess it could be better if they wrote the music for me, but I digress...."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Vadim Stepanski",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T17:01:12.000Z",
          "Titre": "Useful Plugins",
          "Contenu": "Useful quality Plugins. Thk you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris anthony y",
          "Nb_Reviews": 35,
          "Date": "2023-09-17T20:49:20.000Z",
          "Titre": "Finally found the 808 I was looking…",
          "Contenu": "Finally found the 808 I was looking for!! It was used to add the additional \"ambience\" to a piece I was writing for background music to a short documnetary on caving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JonsiEnt.",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T02:23:40.000Z",
          "Titre": "Got a great hookup on some huge sounds…",
          "Contenu": "Got a great hookup on some huge sounds through these guys. Now I always keep an eye for their promos. W.A. Production will definitely be popping up in my tracks, Thanks W.A. Production!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Unnamed",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:02:49.000Z",
          "Titre": "Solid website, but nothing to write home about",
          "Contenu": "went here for freebies, was not disappointed as the site is very generous with that stuff. that is all."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Da Flex",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T18:40:20.000Z",
          "Titre": "Halo 2",
          "Contenu": "Halo 2That freebee is very useful, but is was hard to get, because your instructions (product key vs. voucher code) are misleading."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:37:41.000Z",
          "Titre": "really glad everŷthing is fine"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Alex Gardi",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T21:44:05.000Z",
          "Titre": "Thinking outside the box",
          "Contenu": "Truly unique plugins that noone has thought above before. Friend of the musicians with realistic prices."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Stefan",
          "Nb_Reviews": 4,
          "Date": "2023-11-20T13:27:44.000Z",
          "Titre": "Lovable virtual gear",
          "Contenu": "Lovable virtual gear, good prices ! Love your work !Kind regards,A.K.A. Zohm"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jedidiah Girio JEDO",
          "Nb_Reviews": 3,
          "Date": "2023-08-20T14:41:16.000Z",
          "Titre": "Great customer service! Very friendly and very helpful.",
          "Contenu": "I had a question about the function a recently purchased item that I could not get clarified in the recommended tutorials and they got bavk to me aptly and with friendly helpful explanations. I will definitely be coming back with my business."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Chinnian",
          "Nb_Reviews": 11,
          "Date": "2023-07-22T22:46:07.000Z",
          "Titre": "Brilliant music production software…",
          "Contenu": "Brilliant music production software company. Innovative mixing and mastering plugins that are great value for money. Highly recommended and will always buy their plugins. Keep up the fab work 👍🏾"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T12:58:29.000Z",
          "Titre": "I'm very happy with the samples/presets…",
          "Contenu": "I'm very happy with the samples/presets I bought, the youtube tutorial videos are always very helpful, the price/performance ratio is also good."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Pascal",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T18:56:14.000Z",
          "Titre": "Great shop",
          "Contenu": "Great shop. Has lots of good offers, easy to navigate, never had any problems with this shop."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Philcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:21:30.000Z",
          "Titre": "Insta composer",
          "Contenu": "What can I say, it’s a great company and I felt that I got a good few bonuses that I was not expecting along with the great software that I purchased, very happily indeed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T18:04:14.000Z",
          "Titre": "I like instant pay & delivery",
          "Contenu": "I like instant pay, instant delivery, good communication connections, easy to find what I want, great products so far."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr X",
          "Nb_Reviews": 15,
          "Date": "2023-08-04T12:42:03.000Z",
          "Titre": "I can always rely on great sounds and controllability",
          "Contenu": "I can always rely on great sounds, stable products with oodles of control to tweak your sound.Bags of expandability too."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Comm.V Sparks & Sound",
          "Nb_Reviews": 5,
          "Date": "2023-11-11T17:34:29.000Z",
          "Titre": "Great plugin",
          "Contenu": "Great plugin, willing to help when I had a question. So no complains and 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Tamasongs",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T13:24:02.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, fast and quality results.Prices within everyone's reach with quality results.For what it costs, I don't think you can ask for much more."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T00:02:58.000Z",
          "Titre": "Because the samples",
          "Contenu": "Because the samples, as well as the construction kits, are extremely professional, it has always seemed like a great platform to me."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Darren Wright",
          "Nb_Reviews": 6,
          "Date": "2023-10-11T12:01:43.000Z",
          "Titre": "Real easy website to browse,find &…",
          "Contenu": "Real easy website to browse,find & purchase samples,plugins,tutorials etc."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T21:28:15.000Z",
          "Titre": "Awesome",
          "Contenu": "excellent product very pleased with help if needed will do more business with this company in the future"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:06:44.000Z",
          "Titre": "Because it really great an any…",
          "Contenu": "Because it really great an any situation,5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:08:27.000Z",
          "Titre": "Great Quality…",
          "Contenu": "Great product with big quality for making music, also great communication service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary Appleby",
          "Nb_Reviews": 19,
          "Date": "2023-11-03T15:30:50.000Z",
          "Titre": "Great value for money.",
          "Contenu": "Great value for money and even the free plugins are excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T02:50:03.000Z",
          "Titre": "Professional Plugins",
          "Contenu": "Great Products - Great Service - Great Sound!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T17:00:08.000Z",
          "Titre": "Top notch company",
          "Contenu": "Top notch company. I have a lot of their products!!! Very useful and professional standards"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Tamhias",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T10:52:19.000Z",
          "Titre": "it's simple …",
          "Contenu": "it's as simple as the plugin do what it is asked to and it is doing it with nice sounding simple processing .That's all !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T04:19:12.000Z",
          "Titre": "It was nice of you to provide a freebie…",
          "Contenu": "It was nice of you to provide a freebie for those who have next-to-no money in their PayPal accounts."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "YudiD",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T23:31:33.000Z",
          "Titre": "Best Reverb KSHRM"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Bruce Essar",
          "Nb_Reviews": 23,
          "Date": "2023-08-04T07:08:05.000Z",
          "Titre": "I expect nothing more from WAP than…",
          "Contenu": "I expect nothing more from WAP than they delivered = top quality!Great products at great prices, thanks guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dari",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T22:11:31.000Z",
          "Titre": "Really good my favorite sample loops…",
          "Contenu": "Really good my favorite sample loops internet site, the quality is insane!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Miles",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:36:11.000Z",
          "Titre": "Loop Engine 2 is insanely good :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Owens",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T17:54:55.000Z",
          "Titre": "Plug-ins are great and monthly bonuses…",
          "Contenu": "Plug-ins are great and monthly bonuses on purchases rock"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Moczik Ágoston",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:48:54.000Z",
          "Titre": "good",
          "Contenu": "i love this webside. good prices i love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NIMFO LVSPL",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T07:26:14.000Z",
          "Titre": "Very easy to browse and find exactly…",
          "Contenu": "Very easy to browse and find exactly what I want, professional samples, A+++!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "luis perez",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T01:02:34.000Z",
          "Titre": "No sweat ,no brainer..Never had any problem with tiny…",
          "Contenu": "Never had any problem with tiny libraries or bad sound and check out is a breeze. Thank you 👍😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:01:30.000Z",
          "Titre": "loved love and thanks for the pack"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T12:16:47.000Z",
          "Titre": "really high quality of your products…",
          "Contenu": "really high quality of your products and, above all, their usefulness"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T11:32:21.000Z",
          "Titre": "Sonically excellent",
          "Contenu": "Sonically excellent combination of samples. Easy to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pearl Hill",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:46:06.000Z",
          "Titre": "I follow WA Production for a few years…",
          "Contenu": "I follow WA Production for a few years now, great company!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Uwe",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T19:30:28.000Z",
          "Titre": "Trivox: Nice tool",
          "Contenu": "I bought Trivox and it is a nice and very useful tool to enrich your voice and it's worth its price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T16:04:09.000Z",
          "Titre": "Happy with the products I purchased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Ward",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T16:22:43.000Z",
          "Titre": "Great online support help",
          "Contenu": "Great online support help, responds quickly to any support needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucifer Sweet",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T23:17:08.000Z",
          "Titre": "Great response easy to use website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T13:22:41.000Z",
          "Titre": "You get what you pay for and more",
          "Contenu": "You get what you pay for and more. Always a help in my music production. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "ranny",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:20:15.000Z",
          "Titre": "great discount with melda quality"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "don1",
          "Nb_Reviews": 66,
          "Date": "2023-11-01T22:27:07.000Z",
          "Titre": "Excellent purchase",
          "Contenu": "Excellent purchase, easy to use, an absolute joy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn Oakley",
          "Nb_Reviews": 7,
          "Date": "2023-09-20T00:39:52.000Z",
          "Titre": "Offer a great product",
          "Contenu": "Offer a great product, easy to navigate, a happy customer."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "zyastine",
          "Nb_Reviews": 6,
          "Date": "2023-10-07T15:38:56.000Z",
          "Titre": "They were vegenerous supportry sincere in dealing with…",
          "Contenu": "They were very sincere in dealing with bugs in the product. It's a good company."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T06:00:17.000Z",
          "Titre": "The price is reasonable and the…",
          "Contenu": "The price is reasonable and the information is organized, so it is easy to buy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T00:20:24.000Z",
          "Titre": "Very happy with my purchases."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "malbob",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T22:07:53.000Z",
          "Titre": "Kick Drum",
          "Contenu": "Solid bottom end"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Tiago Ribeiro",
          "Nb_Reviews": 4,
          "Date": "2023-11-04T17:23:55.000Z",
          "Titre": "One of the most amazing brands for…",
          "Contenu": "One of the most amazing brands for plugins"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Fredy Vilcapaza",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T11:22:41.000Z",
          "Titre": "I am satisfied with the products and…",
          "Contenu": "I am satisfied with the products and whenever I need help from you guys."
        }
      ]
    }
  ]
}