{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "webshare.io",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Aliu Sadala",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:27:16.000Z",
          "Titre": "Bad i bought 500 proxies they are All…",
          "Contenu": "Bad i bought 500 proxies they are All Dead I want to use it work because I am a SEO agents I need proxies to generate traffic to clients websites al bad proxies please give me good proxies give me what I paid for"
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Elhabib Hatimo",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:55:39.000Z",
          "Titre": "SCAMMERS",
          "Contenu": "I just paid for proxy from this website, still didn't use it even once, and my account got suspended for no reasonI can't have access to my account and I can't refoud my moneyStay out please"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andrew hioson",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:37:55.000Z",
          "Titre": "Bad proxy！Refund！！！！！",
          "Contenu": "I paid 50 dollars and then this site suspended my service, their agents are so trashy.To even ask for a review of my identity is unconscionable, there was no mandatory review of identity at the time of payment. Garbage website, garbage service!Suspend the account first then tell you that you engage in restricted behavior, no refunds at all after that, and if clicking on a shopping site is restricted behavior, then you guys don't want to be agents. I purchased 200 proxies and they won't let me click on shopping sites?First you suspend my account, then you ask me to verify, why didn't you prompt me when I paid you? Fraudulent site, and I need to explain my behavior? Your agent has an extremely high fraud score of 90% and is not working at all, not fixing the problem and asking me to explain my behavior, are you living in a dream world?"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "J. B.",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T10:14:31.000Z",
          "Titre": "Webshare's Google Proxies: High Price, No Performance",
          "Contenu": "I've been using Webshare for a few months. Their standard proxies perform decently.However, I recently tried their Google Proxies, which are marketed as guaranteed to work with Google Search. These proxies cost ten times more than their regular plans.Unfortunately, since purchasing, I've faced numerous issues. I consistently received blocks from Google. It's been days, and the support team has yet to offer a solution or even a meaningful response.Considering that Oxylabs acquired Webshare last year, this experience paints both companies in an unprofessional light.I'd advise against relying on their Google Proxies, despite the claims that they work seamlessly. In my experience, they simply don't.Update as of September 21st: They have now been in touch with me, and a long email exchange has ensued. They have subsequently offered to credit my money back.Update October 3th:Proxy replacement was activated. However, they only replace proxies every four hours. This wasn’t what I anticipated when I purchased proxies guaranteed to work with Google.Webshare continues to bombard me with numerous emails and refuses to honor my request to stop contacting me.I’ll continue using them for regular proxies. But for Google proxies, this product is not viable."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Nazar",
          "Nb_Reviews": 3,
          "Date": "2023-02-12T12:58:02.000Z",
          "Titre": "Blocking all proxies",
          "Contenu": "I bought a proxy from them for one month.After using it for one week, the proxy was blocked by webshare and they required me to report the proxy usage for each site. This is very annoying. Why do I have to spend time explaining why I use proxies? If you don't want to sell them, don't sell them right away and demand an explanation. They refuse to return the money and refuse to resume using the proxy and compensation for unused days. DO NOT RECOMMEND! VERY PROBLEMATIC PROXY PROVIDER!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paco",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T04:49:15.000Z",
          "Titre": "Paid for the most expensive proxy…",
          "Contenu": "Paid for the most expensive proxy option all the bells and whistles. Service SUCKED. Constantly dropped out.They make it SO HARD to unsubscribe from your plan and hide it in the weeds. They also will NOT HONOR the money you paid for the month you have left if you cancel your subscription. Meaning you can buy a month and then when you want to cancel the sub so you don't get charged next month they IMMEDIATELY cancel the subscription you PAID FOR.Deceptive slimy practices avoid this company. I hope the people who work at this company are proud to accept the money and work for such a scam."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Eduard Kozachenko",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T13:13:58.000Z",
          "Titre": "Very Sneaky service",
          "Contenu": "1. Most Proxies are not residential (not as claimed in there \"ISP Residential plan\")2. 80% of proxies are in blacklists, so it is impossible to work with.3. Be careful, they will not refund you money if you use more then 1gb traffic. So my 3k USD year plan stuck there forever.Overall - very greedy and unreliable proxy service, with sneaky refund policy, which does not take into account that in order to check the performance of 100 proxies, in any case, you use more than 1 Gb."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "ig/fb=maazaliOneThreeThreeNine",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T18:57:05.000Z",
          "Titre": "Extremely Poor Customer",
          "Contenu": "The customer Dont even know that which domain are open and which are blocked. When I tell to find these website domain if they are opened on your Proxy The customer tell me buy proxy and check it yourself if it work or notExtremely Poor Customer"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Patrick Nielsen",
          "Nb_Reviews": 14,
          "Date": "2023-07-15T00:15:59.000Z",
          "Titre": "Bought the same stuff 2 times because…",
          "Contenu": "Bought the same stuff 2 times because it said billing information wasnt right, and it did it again 2nd time. I got charged both times. Refund me please, i dont want to have anything with your services again."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Waqas Wakeel",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T21:30:45.000Z",
          "Titre": "Fruad ALL Proxies are Bann in Google & NO Reply from support",
          "Contenu": "Hi,I have recently bought 250 Proxies and on the First check, All proxies are banned in Google and have Very very low speeds. I emailed them within 10 Minutes of purchase. But there are no responses. After 24 hours i checked again all 250 Proxies are not working. It's not connecting. Send almost 2 Emails but there are no responses from their side. They refunded my amount and refreshed proxy list multiple times but all ips are banned in Google. DON'T BUY PROXIES FROM THEM. THEY ARE SCAMMERS."
        },
        {
          "Note": 1,
          "Lieu": "PS",
          "Pseudo": "majdimadgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T03:22:03.000Z",
          "Titre": "It's not good",
          "Contenu": "It's not good and your treatment is bad too because i sent you many emails and you didn't solve my problem and my account is suspended too"
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Jistin",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T17:18:33.000Z",
          "Titre": "Wrost Proxy ever",
          "Contenu": "I did good review about thir proxys...but they provide wrost service.After one day of purchase thir proxy they hold my account and tell me to upload bank statement and driver license i upload it one day ago but they did not respond yet....very very wrost service"
        },
        {
          "Note": 1,
          "Lieu": "SK",
          "Pseudo": "Priv",
          "Nb_Reviews": 12,
          "Date": "2021-11-20T11:24:36.000Z",
          "Titre": "Bad experience, Not reliable, Very bad service",
          "Contenu": "After 3-4 complaints to the support about their bad service quality (always problems with proxies) they blocked our account. Better hands off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eng.WilliamAhmed",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T23:54:16.000Z",
          "Titre": "facebook",
          "Contenu": "Your service is very bad, you make users develop their accounts and as a result you block their accounts, as long as you don't want them to slap you with your verses, why do you declare that you are the best??"
        },
        {
          "Note": 1,
          "Lieu": "BY",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T22:52:26.000Z",
          "Titre": "Proxies are good but you cannot use them",
          "Contenu": "I admit proxies are good. However, there is no way you can use them for long. I was suspended for no reason (logging in often to openai) after a month of using their proxies. You sell plans for 100s of proxies for what? For personal anonymous browsing of internet or watching videos? Why you need so much proxies for that. If you do literally anything that requires a lot of proxies, they will suspend your account. And after i was suspended, they keep charging me money. Got charged $35 twice before i noticed. Sure there was no refund or anything, my message about that was ignored (got automated message saying i will have a reply in 1-2 days, but its been a week and there was no response).Edit: they said they have contacted me but got no reply. It was the opposite. I contacted them, my email was \"Please cancel my subsription and refund me. I was suspended, how on earth it is possible that you still charge me money, even twice\"They indeed replied, their response was: Thank you for contacting us, we will reply you in 1-2 days. (That was 10 days ago). And thats it.As of them contacting me, they sent me a email asked what i use proxies for. I answered i use them to login to openai. Then they asked to upload my documents. The verification link they sent was not working, i asked to resend it it was the same. That doesnt matter anyway, i dont want to upload any documents to them and explain my proxy use since i was not doing anything illegal using their proxy. And no i dont want to email you again to wait 1-2 days for no reply, you !have my email and account! just refund me these 2 charges and thats itSo to sum it up: you can use their proxies they are good, just keep in mind that when they will suspend you (which would probably happen) close your subsription asap, otherwise they will keep charging  you money and will not refund anything."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Alex K",
          "Nb_Reviews": 36,
          "Date": "2022-05-02T17:18:05.000Z",
          "Titre": "The most horrible company",
          "Contenu": "1. Geo Location doesn't meet the requested country.2. IPs are blocked by some services3. I can't remove my credit card4. When I updated the plan to the free one I lost my IPS that I've already paid for."
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Vaisvila",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T17:22:22.000Z",
          "Titre": "Does not suitable for SEO tools!",
          "Contenu": "I was using webshare.io for some time with GSA SER. One day they contacted me asking for the purposes I am using their service.I clearly answered - for GSA. The answer - thanks, everything is OK. Two weeks later I extended my subscription for another month and a couple of days later proxies stopped working.No email message, nothing - on their dashboard - account suspended. After contacting support I got an answer that one of their proxies I used was blacklisted in spam databases, so they banned my account without any refund.Webshare sent me a link to complain - it seems one of their IP was reported by someone for spam.But it is the nature of any automated SEO tool.Let's look at what offers webshare.io exactly: - webshare . io/l/gsa-proxy-server- webshare . io/l/rankerx-proxy-server(remove spaces around . )They asked me to provide government ID verification to \"maybe\" unban the account.But I don't share my government issued documents left and right to unknown companies/individuals over the internet.So in conclusion webshare.io will ban your account and keep your money for a single IP report to any spam database.About the service in general:Almost all freshly bought IPs already are blacklisted and banned, the success ratio of SEO tools is very low due to this.EDIT: webshare.io - remove the links I have mentioned in my review above misleading people about what your service is suitable for GSA and RankerX; add a warning on your website that your service is FORBIDDEN to use with SEO tools."
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "fbagmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T23:26:23.000Z",
          "Titre": "Technical support is very late in…",
          "Contenu": "Technical support is very late in responding, within two or three days, until it responds, and this is very bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elena Pavlova",
          "Nb_Reviews": 4,
          "Date": "2021-11-17T20:21:33.000Z",
          "Titre": "Do Not Trust",
          "Contenu": "Do Not Trust1- I received 100 dead proxy2- Credit card information stored with full details on their website"
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T16:20:37.000Z",
          "Titre": "DNS does not correspond with IP and…",
          "Contenu": "DNS does not correspond with IP and also u need to be town specific. This advice will make you millions."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "MD. Rakibul Islam",
          "Nb_Reviews": 38,
          "Date": "2022-04-15T20:59:09.000Z",
          "Titre": "Cheap and IP Leak",
          "Contenu": "Service not bad. cheap and IP leak. so low price IP can be leak 100 proxy 2.5$ and also worst is Bandwidth Limit. If you sell proxy no limitation on Bandwidth."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:29:50.000Z",
          "Titre": "The proxy I used wasn’t good quality…",
          "Contenu": "The proxy I used wasn’t good quality and banded all my social media accountsSo I’m not happy at all"
        },
        {
          "Note": 1,
          "Lieu": "NP",
          "Pseudo": "sabin",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T18:38:55.000Z",
          "Titre": "I can't use my proxy",
          "Contenu": "I can't use my proxy. It needs verification I sended the details still not problem solved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T12:22:16.000Z",
          "Titre": "they ask for my ID and my Bank Card…",
          "Contenu": "they ask for my ID and my Bank Card photo for a order that cost 40$ ! how is the crazy client it will give all that for proxy order ?"
        },
        {
          "Note": 1,
          "Lieu": "PS",
          "Pseudo": "Alaa Elfar",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T04:16:17.000Z",
          "Titre": "why block my account just register in… I dont why block my account ??????",
          "Contenu": "why block my account just register in one week why i have free use ip or proxies any where and any time .but thank you all"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "SoolKing",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T21:56:57.000Z",
          "Titre": "I can't cancel the subscription",
          "Contenu": "I can't cancel the subscription to a free proxy from a $1."
        },
        {
          "Note": 1,
          "Lieu": "MD",
          "Pseudo": "dasdada",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T17:04:49.000Z",
          "Titre": "No help",
          "Contenu": "I didn't got any help or replacement."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T12:44:11.000Z",
          "Titre": "So shi.t dont use for loading purposes i…",
          "Contenu": "So shi.t dont use for loading purposes i lost $3700 in it."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Pedro Santos",
          "Nb_Reviews": 7,
          "Date": "2020-12-20T20:31:37.000Z",
          "Titre": "Unsolicited charges after 5 months.",
          "Contenu": "I used the service from April until July, and it worked great! Once I stop needing the service I changed to a free plan and never login again, until now.Yesterday I got charged on my credit card without having requested anything. Sent a support request and will not change my review until I have a satisfying answer about why this happened."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Dd",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T07:58:57.000Z",
          "Titre": "The worst service in the universe",
          "Contenu": "The worst service in the universe. Do you have a question? You laughed at them as soon as you paid and looked for them. You're not interesting to anyone - just your money. And that's it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Rodgers",
          "Nb_Reviews": 3,
          "Date": "2021-09-20T09:27:28.000Z",
          "Titre": "We hate them.",
          "Contenu": "We hate them They suspended our business accounts and left our data vulnerable, even we paid from our pockets. We'll never use such  cheap services anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "hhhhhMMM",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T08:06:51.000Z",
          "Titre": "I WAS WRONGLY CHARGED",
          "Contenu": "I WAS WRONGLY CHARGED 2 TIMES, YOUR PROXIES DIDN'T WORK FROM THE BEGINNING, I CANCELED IT ON THE SAME DAY HOWEVER WAS OVERCHARGED 2 TIMES MORE - FOR NOTHING"
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Md. Musharrof Hossain",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T06:40:36.000Z",
          "Titre": "Totally third class service"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Amina Malik",
          "Nb_Reviews": 4,
          "Date": "2020-06-13T16:56:10.000Z",
          "Titre": "For me proxy is very slow again and…",
          "Contenu": "For me proxy is very slow again and again Connection Time Out message, No phone Number available to Contact, even i have Private proxy."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Sukhi",
          "Nb_Reviews": 2,
          "Date": "2021-06-18T08:13:52.000Z",
          "Titre": "Ip problems",
          "Contenu": "Ip problems  ,  colombia, argnintna proxy not available     2nd f**king site  ip limited same id daily not change"
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "vlayerzerogmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T10:01:43.000Z",
          "Titre": "Proxy location"
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Justas",
          "Nb_Reviews": 5,
          "Date": "2023-09-20T13:34:45.000Z",
          "Titre": "Good stuff",
          "Contenu": "Great customer support. Great proxies.Edit: As of 2023, the proxies are no longer great."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "getgauravygmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T13:26:09.000Z",
          "Titre": "No feedback and problem redressal…",
          "Contenu": "No feedback and problem redressal mechanism in place, each time I mail an issue its never sorted out, their has to be a chat for problem solving or atleast the mails should be addressed quickly"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Requimda",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T14:05:34.000Z",
          "Titre": "Proxies got banned after 1-2 days of…",
          "Contenu": "Proxies got banned after 1-2 days of usage"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gerry",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T14:10:38.000Z",
          "Titre": "Not the greatest company",
          "Contenu": "Not the greatest company. Proxies burned on many of the important sites, when you pay and realize this they have a very limited cancelation policy. Then when you cancel after a month they charge you again anyways and only offer a \"site credit\". If the proxies weren't good in first place and I canceled what good is a site credit? As others have mentioned look for an alternative."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "byoe",
          "Nb_Reviews": 5,
          "Date": "2020-05-23T03:57:42.000Z",
          "Titre": "when i bought my proxy plan it was…",
          "Contenu": "when i bought my proxy plan it was really good, then when all of the new packages came out webshare isnt what it should be any more, i had the legacy plan and forgot to renew, only one day after i tried to renew and they just didnt want to get me my plan back so now i have the 5k ips legacy plan,and then they added more packages that are way expensive than what it was, and now they are just disabling the most simplest features for me to change to their new plans, like changing the proxy username and more. webshare isnt what it was before, thinking of just canceling my proxy plan and buy off another website. very sad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Schaufus",
          "Nb_Reviews": 5,
          "Date": "2022-01-17T22:24:41.000Z",
          "Titre": "28 out of 100 good proxies when checked."
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "zoubir.zed",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T10:37:43.000Z",
          "Titre": "All proxy not fresh",
          "Contenu": "All proxy not fresh bad proxy"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Userj",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T05:56:43.000Z",
          "Titre": "No customer Service",
          "Contenu": "No customer Service. But proxies are good."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "solrsnik",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T04:44:12.000Z",
          "Titre": "Didn`t  work with epicgames.com"
        },
        {
          "Note": 2,
          "Lieu": "VN",
          "Pseudo": "ghoost",
          "Nb_Reviews": 2,
          "Date": "2021-07-16T07:39:50.000Z",
          "Titre": "support is not good"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Lucas",
          "Nb_Reviews": 5,
          "Date": "2023-11-16T08:42:50.000Z",
          "Titre": "Great Value with questionable reliability",
          "Contenu": "Webshare offers proxies at a pretty fair price point. They even offer 10 with very limited bandwidth for free! For my use case I got pretty low requirements which they fulfill for just 3$/Month.The dashboard is nice and provides a great overview. The api provide full control over your proxies.The proxies generally work as expected. However I started experiencing early on minor annoyances. It started with multiple hour long api outages. One of my proxies where automatically replaced, however my app couldn’t update it, since the api was down. These outages happened on a regular basis (Once every 1-2 months)They also seemingly made a breaking api change, which required the request url path to end with / for some reason.Worst of all was the recent proxy issues. Proxies randomly stopped working, but wasn’t replaced as usual. The support answered once per day, but couldn’t provide me what I paid for, while this issue was ongoing. This cost me a lot of time, annoyed my users and decreased my revenue. It took 1 month to solve that issue. They are lucky that I was that patient, since any other customer would switch to another service. Reasons for staying with webshare remain the price, since competitors are at least 2x that expensive. And webshare provided me for  about half a year everything I needed mostly flawlessly."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T13:04:20.000Z",
          "Titre": "I used the webshare proxy and it was…",
          "Contenu": "I used the webshare proxy and it was excellent and my account was disabled for an unknown reason I want my account I need it and I bought a $31.26 planFor a month and it didn't last for two days and then the account got suspendedI hope to get a response and open the account as soon as possible"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nikolaos Vasilios Merianos",
          "Nb_Reviews": 4,
          "Date": "2022-07-21T05:33:13.000Z",
          "Titre": "All of the used proxies was catch by target site WAF",
          "Contenu": "All of the used proxies was catch by the target site WAF.I tried to access a target website using random IPs from the 100 ips I had in disposal and for all the target website returned a captcha.Even if I was interested to use a captcha solver, the cost should was extremely high because the target website will always ask for captcha solution, and we are talking about a website that has more than 150000 pages needed to be crawled.Other than that, the two star, is only because of the assistance. When I asked to cancel my subscription as was need it the proxies IPs only for a few days, they responded very fast.-------I updated my review, not because the IPs worked, but because the support team did amazing work for me in order to solve my problem.The time they spend looking to solve my issue, was far beyond the amount I spend for the IPs.Really appreciate their own support, but at the end the product wasn't mature enough for what I need it."
        },
        {
          "Note": 3,
          "Lieu": "MU",
          "Pseudo": "Ikhlas Deen Muhammed",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T16:49:08.000Z",
          "Titre": "They can do better by reducing the…",
          "Contenu": "They can do better by reducing the price a little, 250 proxies with IP rotate, its little pricey. The proxies don't auto change they should consider make the proxies changes every weeks cuz I gotta wait over a month to get it changed. Kind of frustrating but overall good perfomance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Crying J",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T14:58:05.000Z",
          "Titre": "Customer service and price is ok but…",
          "Contenu": "Customer service and price is ok but webshare are banned on a lot of websites unfortunately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "18001800",
          "Nb_Reviews": 1,
          "Date": "2020-05-24T21:00:59.000Z",
          "Titre": "Proxy prices",
          "Contenu": "I like how cheap it is overall but buying additional proxies to widen our pool is very expensive"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Hopstimop",
          "Nb_Reviews": 9,
          "Date": "2021-06-10T06:22:03.000Z",
          "Titre": "Not for me at the moment.",
          "Contenu": "I used this service and the proxies are okay, but everything else is not okay.You have a very limited choice of countries and you can choose only from a handful countries predetermined by the service provider.You can not change proxies on the fly. If you use your proxy changing feature which you have a limited number of, you will simply given a random proxy in a random country.Cancelling the service's auto renewal payment will terminate your subscription immediately. I paid the monthly price today and tried to change a proxy. After half an hour trying I gave up and decided to cancel the service, because I found a service cheaper somewhere else that matches my needs better, but of course I wanted to use the proxies until the end of the subscription and use the new service from next month.I looked in their help center, how to cancel the subscription. The only way is to switch to free plan, which will be done immediately, so I lost my proxies and my money.The dashboard is also complicated and unclear. If you want to change anything that is allegedly  included in your subscription, you will automatically pay and start a new subscription.UPDATE: I was contacted by the support and they were very nice and helpful and offered to reinstate my account, but I declined politely.Therefore I changed my rating from 2 to 3. They are apparently trying to make it right. If they make the system more flexible and more userfriendly, then I might even come back."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vessity",
          "Nb_Reviews": 1,
          "Date": "2021-03-11T16:07:37.000Z",
          "Titre": "Proxies stop working after 1 minute on certain programs",
          "Contenu": "Depending on the program the proxies start working after 1 minute"
        },
        {
          "Note": 3,
          "Lieu": "MA",
          "Pseudo": "khaliyou059",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T17:11:45.000Z",
          "Titre": "I order us proxies but i find other …",
          "Contenu": "I order us proxies but i find other  proxy for another country"
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "carol",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T02:29:06.000Z",
          "Titre": "Long time reply and proxy not good…",
          "Contenu": "Long time reply and proxy not good sometime"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Gustavo Silva",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:49:29.000Z",
          "Titre": "good",
          "Contenu": "very good, the best website I have found to date, unfortunately only 10 free proxies are available, and the payment options are extremely limited, making it impossible for me to buy more proxies"
        },
        {
          "Note": 4,
          "Lieu": "YE",
          "Pseudo": "Saleh",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T20:14:02.000Z",
          "Titre": "The site is very very excellent in…",
          "Contenu": "The site is very very excellent in terms of value for the price. I wish this site continued success because it is indeed a distinguished site. The reason for evaluating this site is 4 stars because there are some proxy banned from some sites. For information, I am subscribed to a package of $2.99. Perhaps if I upgrade my subscription to a higher package, these problems will not occur."
        },
        {
          "Note": 4,
          "Lieu": "PS",
          "Pseudo": "sameh",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T17:07:59.000Z",
          "Titre": "great proxies fast and clear",
          "Contenu": "support helpful and had experiencies to do well with customers.platform clear and had good access to data and mange ur work.proxies mixed with alot of countries and fast.sheap subscribe ."
        },
        {
          "Note": 4,
          "Lieu": "GE",
          "Pseudo": "cumrocket",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T10:02:07.000Z",
          "Titre": "Good service",
          "Contenu": "Terrible service they block ur account after u pay for subscription after a weekEdit: there was a misunderstanding. The issue has been resolved."
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "NorisMedia",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:59:36.000Z",
          "Titre": "I would like to give them full five…",
          "Contenu": "I would like to give them full five starts but they have one problem thats response time they take a day to reply so just imagine you have a big problem... but there ok.. you can trust them but they should work on the response time or else.. there losing on that.. am soon trying out there residential proxies but they should add in more countries why are they leaving out africans at least have like 2 and also they luck alot of other countries"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mojtaba haghgoo",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T08:18:18.000Z",
          "Titre": "Hello",
          "Contenu": "HelloThere are 2 problems and it is very good for you to solve them1- You do not have the wallet and recharge option directly on the site2- It is better to add payments such as Perfect Money, Web Money and PayerIt would be really great if you could add these two"
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T14:28:11.000Z",
          "Titre": "I have already changed the country 2…",
          "Contenu": "I have already changed the country 2 times and the proxies do not fit. Now I have Israel, I also had Ukrina. It would be nice if the support service helped with a proxy for a specific site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fornite",
          "Nb_Reviews": 2,
          "Date": "2021-12-25T02:02:16.000Z",
          "Titre": "its good",
          "Contenu": "its good, but sometimes the proxies expires, they do change them tho so Ig its fine"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "That one lady",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T10:25:11.810Z",
          "Titre": "Pretty good.",
          "Contenu": "Only had proxies go down a small handful of times in a year."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Make me sad",
          "Nb_Reviews": 1,
          "Date": "2020-12-17T01:41:17.000Z",
          "Titre": "The proxies are OK",
          "Contenu": "The proxies are OK, but it still consumed all my credits after I stopped my subscription(in my memory), lacking email notifications.------------------------------------They have returned my credits after a little of communication.That's good, but I feel sad for my lost time.Anyway, I'm a long-term user of their service and I'll continue it. You can trust them."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Zxonline",
          "Nb_Reviews": 1,
          "Date": "2020-08-16T13:56:42.000Z",
          "Titre": "So disappointed",
          "Contenu": "Update: change from 1 star to 4. After send them my problem. They handle it quickly although on the weekend. Great support.The free proxy is good. But after upgrade. All my proxy was gone and replace with new proxy. While  I upgrade it to keep them work"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Fernanda Costa",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T15:08:20.000Z",
          "Titre": "Service was offline for 5h",
          "Contenu": "I changed my review from 1 to 4.There was a DDOS attack to their servers resulting in a close to 5 hours with no connection on any proxy.I won't give a 5 star because there is imo lack of customer support.I know the service is cheap, and a 24/7 support its not reasonable.But I stayed at the computer for hours refreshing the login page waiting to know when will i be able to work without any communication from the support.Also, there is a huge lack of available dedicated proxies in most countries. Most are in USA France and Netherlands.Hope they continue to get better, i really like their service."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "PascalH",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T14:38:45.000Z",
          "Titre": "Excellent value for money!",
          "Contenu": "The ability to not refresh some proxies not even once a month is kinda restricting. I get it, for the given price the service is excellent but I’d like at most one free refresh each month. Otherwise, as already stated the service is splendid!"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Ayat Rashad",
          "Nb_Reviews": 4,
          "Date": "2021-04-05T12:33:29.000Z",
          "Titre": "When it works it works very well",
          "Contenu": "Not working with some websites, but when it works it works very well. When I had some problems, I was surprised by the level of customer service. Overall, the best affordable proxy option I tried."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "figgyx2008",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T18:43:24.000Z",
          "Titre": "great service so far but now after a…",
          "Contenu": "great service so far but now after a week or so i keep getting a message that someone else signed in amd i have to reconnect. still a good value though"
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Владимир Аксёнов",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T19:19:32.000Z",
          "Titre": "Not all settings are clear yet."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T14:59:36.000Z",
          "Titre": "The good service"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "ArnabDas",
          "Nb_Reviews": 3,
          "Date": "2020-09-15T16:20:46.000Z",
          "Titre": "Proxies are good...",
          "Contenu": "Proxies are really good but banned on some site ... But still working with most of sites so it's good for that cheap price"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "karunagarathinamscientist",
          "Nb_Reviews": 2,
          "Date": "2021-01-05T06:38:11.000Z",
          "Titre": "Nice speed",
          "Contenu": "Nice speed but limited bandwidth.If you provide bandwidth unlimited at low price all proxy users used your service"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T05:48:55.000Z",
          "Titre": "The service provided face a problem and…",
          "Contenu": "The service provided face a problem and the communication afterwards was correct. It is ok to receive good feedbacks."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Rajat verma",
          "Nb_Reviews": 5,
          "Date": "2022-02-01T13:12:31.000Z",
          "Titre": "Cheapest ND high drop ratio of requests",
          "Contenu": "Cheapest butHigher failure ratio but they claim 99% uptime and they dont even accept that proxies was down."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T13:21:17.000Z",
          "Titre": "Sometimes",
          "Contenu": "Sometimes, some of the IPs got mark as Bot very easily, but a part of that, everything is perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wake",
          "Nb_Reviews": 2,
          "Date": "2021-09-29T10:56:17.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, good proxies, had some annoying issues with payments though."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "krstce",
          "Nb_Reviews": 1,
          "Date": "2020-07-02T22:37:17.000Z",
          "Titre": "Webshare would be wonderful if you…",
          "Contenu": "Webshare would be wonderful if you solve DDOS attacks asap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NaseemAkhtar0123456@gmail.com",
          "Nb_Reviews": 1,
          "Date": "2020-04-26T14:36:15.000Z",
          "Titre": "Good",
          "Contenu": "Its really amazing and cheap. thanks"
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "heng leak",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T00:07:14.000Z",
          "Titre": "the best",
          "Contenu": "the best proxy"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Re",
          "Nb_Reviews": 1,
          "Date": "2020-08-29T06:30:53.000Z",
          "Titre": "Good service and best price"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "leimar",
          "Nb_Reviews": 1,
          "Date": "2020-11-08T13:30:03.000Z",
          "Titre": "good",
          "Contenu": "good support"
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "omar Madane",
          "Nb_Reviews": 2,
          "Date": "2020-04-05T18:54:08.000Z",
          "Titre": "good support"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Bestami Coşkuner",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:23:50.000Z",
          "Titre": "Everything was working perfectly with…",
          "Contenu": "Everything was working perfectly with automation. Also for the customer support they have an AI bot and if it not enough to fix your problem customer Support team always there with fast response."
        },
        {
          "Note": 5,
          "Lieu": "GE",
          "Pseudo": "pavel “Entermen” swisht",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:18:36.000Z",
          "Titre": "Dirt cheap proxies",
          "Contenu": "Dirt cheap proxies, value for moneyI was looking for cheap, not banned for my case proxies for a while, when I stumbled upon this one, I decided to give it try, first day, works well, support it relatively fast, recommend for checking-out."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "İdiots",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T22:46:11.000Z",
          "Titre": "Great and easy to use user-interface",
          "Contenu": "Great and easy to use user-interface, no payment required to start with 10 proxy <3"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "hostingmaster",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:39:28.000Z",
          "Titre": "Webshare.io has the best anonymous proxies",
          "Contenu": "We have been using Datacenter Premium Proxies from Webshare.io for 3 years. I can confidently say that these are the best proxies and the best service for the money we pay. Yes, the support team does not answer questions instantly, but all problems are always resolved within 24 hours on business days."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Konstantinos",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:19:16.000Z",
          "Titre": "VFM Solution for the price and performance.",
          "Contenu": "I use package of 100 proxies and 1000GB for a web scraping service that i offer and working like a charm! 0% connection fails & a lot of countries to select proxies for. Recommended!! ( Price for these specs above is 5.85$ ) Keep up the good work!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gisel Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:26:30.000Z",
          "Titre": "Trusted",
          "Contenu": "It is completely trusted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T20:31:49.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, had issue where account was suspended due to someone hacking my system and misusing the service. Got the issue taken care of and was compensated for the time lost due to suspension. Excellent company!"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Thu Nga Tăng",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:49:46.000Z",
          "Titre": "We had some misunderstandings before",
          "Contenu": "We had some misunderstandings before, which may have been caused by my information being leaked. I have received a refund after appealing. Although there are twists and turns, I will continue to use it!"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Lin Mark",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T03:22:17.000Z",
          "Titre": "We use your ip to operate and manage…",
          "Contenu": "We use your ip to operate and manage our Amazon store and operate other product accounts, and we look forward to deep business-to-business cooperation with you. I have a lot of users, please contact my email directly, we are willing to pay for this.I hope we can have a mutually satisfactory cooperation result.My sincere thanks!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Muhammad Waqas",
          "Nb_Reviews": 8,
          "Date": "2023-11-29T19:37:57.000Z",
          "Titre": "Appreciate",
          "Contenu": "It's an honor to be a client of webshare , they are very helpful and responsive.."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T02:07:51.000Z",
          "Titre": "If it fits your needs - its the best.",
          "Contenu": "Good:Proxies are very stable.Price is the best on the market.Nice UI.Bad:Some functions seems not implemented:a) upgrade plan = close existing and star new one.b) not possible to have several plans under one account.No datacenter proxies for some countries.Edited: updated to 5* for excellent support"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Seo in Bahawalpur",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T08:36:48.000Z",
          "Titre": "Webshare.io is a best platform to get…",
          "Contenu": "Webshare.io is a best platform to get free 10 proxies. The proxies are realy high quality and working. Most Recommended..."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Abdel",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T20:35:57.000Z",
          "Titre": "Best choice",
          "Contenu": "I've had the pleasure of using Webshare's proxy services, and I must say, they have exceeded my expectations. The speed of their proxies is impressive, allowing me to navigate online seamlessly. What caught my attention is their wide range of proxy options, catering to various needs. And the best part? The pricing is incredibly competitive, making it a fantastic value for the quality they offer. Their customer support is also worth mentioning – always responsive and helpful. If you're searching for top-notch proxies, Webshare is the way to go.\""
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ernest",
          "Nb_Reviews": 6,
          "Date": "2023-09-06T19:47:49.000Z",
          "Titre": "Best proxy service out there",
          "Contenu": "I recently went to look for other proxy providers in case webshare goes away, knock on wood, so I have an option as a backup. Well it appears to me that this service has the best prices by a longshot. Their API works great, great documentation. Their information panel is great. Their customization options are great. My company makes 10 million+ requests per month through webshare.io and I rarely have issues. I was even emailed by support to let me know one of their partners went bankrupt, to warn me a large amount of proxies will be replaced. I truly cannot rate this service highly enough. Oh and their support is great too. Not much else to say. 10/10, no other service really compares to be honest."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "TRBil",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T18:25:37.000Z",
          "Titre": "Thank You Webshare!",
          "Contenu": "The user interface is quite comprehensive and detailed. Moreover; The support team is very helpful in solving any problems you may encounter. I thank them."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T19:17:56.000Z",
          "Titre": "Just excellent",
          "Contenu": "Here is what you get:- Intuitive, nice looking webpage, available in white/dark mode- Stats overwiew like bandwidth, error and activity- 10 free proxies with 1gb bandwidthYou need more proxies or bandwidth?Webshare offers you different options with unbeatable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Goss",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T21:58:06.000Z",
          "Titre": "The rotating proxy is great",
          "Contenu": "The rotating proxy is great.  It is cheaper than anyone else I looked at and it super easy to get up and running."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "vidi namel",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T12:53:47.000Z",
          "Titre": "Sincerely the best proxy provider I have tried",
          "Contenu": "Excellent service and great prices, proxies are stable and support helps you with everything instantly. They give you a lot of freedom in choosing subnets and countries and several other features as well. Most people here that left bad reviews seem to not know how proxies work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YouDeserveThis",
          "Nb_Reviews": 12,
          "Date": "2023-05-26T06:31:38.000Z",
          "Titre": "Hands down the BEST PRICE ANYWHERE on…",
          "Contenu": "Hands down the BEST PRICE ANYWHERE on the internet. I hate paying by bandwidth, but this has been extremely economical compared to other companies. Apparently the proxy business has turned into a nightmare since 2010 - but I'm thankful companies like Webshare Proxy are around to keep things going the right way. Shame on you other companies - and thank you Webshare <3"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Black",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T17:11:05.000Z",
          "Titre": "Bought 20+ static residential proxies",
          "Contenu": "Bought 20+ static residential proxies, every single one of them had a 90+ fraud score on scamalytics and ipqualityscore. No live support. I want a refund. What's the point of buying residential proxies if they have a 90+ fraud score? Useless!Invoice ID: 459820Update: They offered me a refund. Point still stands that the residential proxies are all blacklisted and with very high fraud scores."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sajid",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T15:32:07.000Z",
          "Titre": "Best proxy provider out there",
          "Contenu": "Best proxy provider out there! Proxies are really cheap, but their performance is Top-level. Amazing auto-replace feature"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Previa Cita",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T13:14:36.000Z",
          "Titre": "Excellent customer service.",
          "Contenu": "Updating my review to give 5 stars. The Webshare team has been in constant contact with me to resolve the issues and proxy performance is very good now.---Attentive support. Amazing performance for a couple of years, then target website got super paranoid and now some requests are blocked. Some IPs must be on a blacklist."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Amro F",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T18:02:00.000Z",
          "Titre": "Great service and good prices. Best proxy provider in my opinion.",
          "Contenu": "Trustable. Very reliable proxies. Fair prices. Clean and simple yet effective interface, with flexible pricing plans that you can change at a whim and pay or be refunded whatever difference automatically."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "J-P",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T02:02:06.000Z",
          "Titre": "Good quality / price ratio",
          "Contenu": "Good quality / price ratio. Many exit-nodes. Ultimate subscription plan flexibility - really, quite every configuration of proxy num/location is configurable. Support knows the product and replies pretty fast. Nice UI. No problems so far (about 1 month and 1TB transfer in)."
        },
        {
          "Note": 5,
          "Lieu": "KW",
          "Pseudo": "Ibrahim",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T18:30:25.000Z",
          "Titre": "Hello webshare team,",
          "Contenu": "Hello webshare team,Really you are doing great and amazing job with your proxies.Just have one concern, kindly try to add payment via PayPal this is very important to open more payment options not only credit card.!Regards,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Krivitskiy",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T16:03:11.000Z",
          "Titre": "Great Price. Great Service. Great Support. recommend",
          "Contenu": "Very pleased from this service. period.Not only from the prices and straight forward but support. They simply care about service ( contacted them as a programmer multiple times, they always strive to assist. bought also the yearly package ( which is ending soon and I will renew of course ) I use rotating proxy mostly for nasdaq market realtime and ecommerce"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Kurumi",
          "Nb_Reviews": 2,
          "Date": "2022-08-31T18:22:38.000Z",
          "Titre": "webshare.io review",
          "Contenu": "Website Speed rating 4/10 - Too Slow and The site always getting error I mean it appear \"This site can’t be reached\" I hope they will improving the speed websiteProxy is fine everything is working might buying tons of proxy from webshare.io 100% worth it to buy 10/10I hope they're adding PayPal payment since I don't have Credit Card so I ask my dad permission to buy proxy from webshare.io don't worry I don't use my dad balance I transferred him a money to buy me the Proxy"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Ikhsan Barko",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:58:48.000Z",
          "Titre": "Webshare always the best",
          "Contenu": "Webshare always the best! I'm not NPC btw ( REAL PERSON )"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Qamar Sohail",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T06:23:55.000Z",
          "Titre": "Clean and reliable proxies",
          "Contenu": "Hi, I am using Webshare proxies from almost 6 months. Proxies are working great, not slow, not blacklisted. Support is super great. Keep working hard guys, thanks for all your support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin P.",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T18:51:06.000Z",
          "Titre": "Wish every company was like this company",
          "Contenu": "I started using webshare and had problems the first day. Turns out it was my fault. The customer service rep explained everything I did wrong and after following what they said I should do. Everything was running perfect again. I wish every company was like this company."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Abdul Wadood",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T02:36:11.000Z",
          "Titre": "It's been more than 1 month I have…",
          "Contenu": "It's been more than 1 month I have tried proxies of Webshare and I am quite happy with its proxies. I am using them in SEO tools for my working. Proxies' response is quite good. Sometimes proxies give errors on connecting but around 95% times they are working. I am quite happy with their performance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Just A Little IT Guy",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T19:46:47.000Z",
          "Titre": "ALL PROXIES ARE DOWN! (oh wait...)",
          "Contenu": "Wahoo!  Thanks Webshare.io Support!  Was able to stop panicking and identify the exact issue."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "HAPPY customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T23:19:49.000Z",
          "Titre": "INCREDIBLE CUSTOMER SUPPORT!!!!",
          "Contenu": "INCREDIBLE CUSTOMER SUPPORT!!!!We have been using Webshare Residential Proxies for approx 3 months. The service is fast, reliable and easy to use. We recently upgraded to a larger package with more ports as our business and Neds have grown thanks to the proxies working as intended. However, the customer support?!?! AMAZING.We had a few issues navigating the process of authentication as we changed from IP whitelisting to API however Webshare admins have been INCREDIBLE!!!!We are just amazed at how they always answer quickly and with detail that we have never received from other providers. We began with a small package and regardless of the amount of money we spent each month, Customer Support has continuously engaged us quickly and efficiently. We cant say enough great things about them. After using several other well known providers of high quality rotating residential proxies, we have happily found a proxy company we will stay Loyal too. THANK YOU WEBSHARE.IO!!!!!  :D"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Empress Media",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T10:58:17.000Z",
          "Titre": "Webshare.io is a fantastic web proxy service",
          "Contenu": "Webshare.io is a fantastic web proxy service that provides users with an easy, reliable, and secure way to browse the internet. With their fast servers, robust security features, and excellent customer support, they are an excellent choice for anyone looking for a high-quality web proxy service."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "MEENA SHERKHANE",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T04:46:23.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Excellent customer service! Whenever I needed something they were there for me. Response was very satisfactory. The team represents among the highest levels of customer service I have experienced. Information was accurate, responses to queries were turned around very fast. Thank you guys."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Macrolab",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T17:19:45.000Z",
          "Titre": "Give 5 stars to this service",
          "Contenu": "Give 5 stars to this service. Would be nice to see bitcoin payment methods implemented as VISA/MC do not work in my country anymore! :("
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "perta",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T20:29:00.000Z",
          "Titre": "Best proxies service for it price",
          "Contenu": "Best proxies service for it price. I wish this company keep it as it is. I have two accounta with webshario one for business purposes and another for personal simple tasks which is free."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "xiS CUPCAKE",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T21:53:58.000Z",
          "Titre": "Customer service was really helpful",
          "Contenu": "Customer service was really helpful, this in my opinion is the best proxy provider out there. If you’re looking to start your proxy journey I recommend."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paula",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T15:42:20.000Z",
          "Titre": "value",
          "Contenu": "i have had nothing but a good experience using webshare, i recommend this site to all that need to use proxies, great service always.Definitely value all round :)"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T19:24:29.000Z",
          "Titre": "I purchased 25 Private IPs in late June…",
          "Contenu": "I purchased 25 Private IPs in late June 2023 and they are working great so far. Satisfied with their service and support is also amazing!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Murat",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T20:03:40.963Z",
          "Titre": "Reliable service",
          "Contenu": "I forget the cancel my subscription ( no more needed, it was a great service tho) and sent them a mail. Two or three minutes later i got an mail that says that they are processing the refund. Great company with a great customer services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T07:54:43.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I had an issue with some of the proxies I was using. I reached out to their Support team, and the team member that help me out did an excellent job. My issues was resolved quickly, and the team member went above and beyond!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Aleksander",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T14:07:55.000Z",
          "Titre": "One of the best proxy suppliers on the market",
          "Contenu": "The quality of private proxy is quite good. Proxies are updated and taken care of without the need for contact support, which is on point for me. The UI to manage proxy is intuitive and easy to understand. The price is high, but it's worth it. I tried a lot of proxy suppliers, but this one is on top of my list."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T18:05:54.000Z",
          "Titre": "This WebShare☺️ proxy site is really a…",
          "Contenu": "This WebShare☺️ proxy site is really a trusted site. I have purchased many proxies and its work properly. The main thing is you get many proxies with different country ip like socks5, http in cheap price😀. Those are fast and secure. I just loved it💗💗💗💗"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Manuel Jesús Martín Mena",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T16:00:24.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service! All works nice, and support is extremely good!Best proxy provider ever!!"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Tom Nguyen",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T09:01:33.000Z",
          "Titre": "The most affordable service with the…",
          "Contenu": "The most affordable service with the highest quality. I have worked with several proxy providers before, but, Webshare is the best. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Bobdaddi Daddy",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:00:04.000Z",
          "Titre": "This as to be the best proxy app in the…",
          "Contenu": "This as to be the best proxy app in the world ...thier customer service and the proxy itself is top-notch....they didn't pay me for this review I just feel like they deserve the hype."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tony",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T18:03:01.000Z",
          "Titre": "had a problem",
          "Contenu": "great costumer service hit me in my email and answered here asap they fixed my problem and im running smooth costumer service was great great company 5 stars all day!!"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Abdullah Omor Tribid",
          "Nb_Reviews": 4,
          "Date": "2023-02-03T07:51:08.000Z",
          "Titre": "Such an helpful site",
          "Contenu": "I'm using their proxies from 2022's September month. I'm satisfied with their service.They sell proxies at very cheap prices. Their proxies are very good in my opinion because, at the price they sell them, it's great. It's worth a try you should give a shoot."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Webshareproxys",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T14:08:37.000Z",
          "Titre": "We using your ip to operate and…",
          "Contenu": "We using your ip to operate and manage... thank you webshare."
        },
        {
          "Note": 5,
          "Lieu": "BT",
          "Pseudo": "IT",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T01:46:14.000Z",
          "Titre": "Webshare proxy is great.",
          "Contenu": "Great platform for proxy for users. They give instant feedback to user without delay. I personally recommend to use this proxy."
        },
        {
          "Note": 5,
          "Lieu": "ME",
          "Pseudo": "Denis Chernykh",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T20:36:21.000Z",
          "Titre": "Great service",
          "Contenu": "Completely satisfied with this service. Most of all I liked the speed of support response and a large selection."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Marius du Preez",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T01:41:46.000Z",
          "Titre": "By far the best proxies have used…",
          "Contenu": "By far the best proxies have used sofar, have used for years and always keep coming back for projects that need proxies"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Omar Omeiri",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T11:00:56.000Z",
          "Titre": "Very user-friendly for developers and…",
          "Contenu": "Very user-friendly for developers and low latency. And what makes it so great is the all the features for the unbelievable price. Thanks for making my project possible."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T17:25:38.000Z",
          "Titre": "The initial response time was late",
          "Contenu": "The initial response time was late, other than that it's 5* experience.live chat will be awesome if added."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ashok Bollepalli",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:07:47.000Z",
          "Titre": "Quality Of Proxies",
          "Contenu": "If you require proxies from specific geographic locations, Webshare provides an extensive network covering numerous countries and cities, ideal for location-specific tasks such as ad verification or localized testing"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "proxystar",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T22:05:12.000Z",
          "Titre": "Honest & transparent company",
          "Contenu": "Honest & transparent company. Support is awesome. Residential proxies are suitable for authenticated Instagram endpoint(with login cookies). Proxy speed is fast with large IP pool across multiple countries."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "phuquanghn",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T17:47:46.000Z",
          "Titre": "You guys work quite carefully and…",
          "Contenu": "You guys work quite carefully and surely. I can see through the steps to verify my account's identity. Hopefully webshare.io will try to develop moreThank"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Artem",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T16:56:55.505Z",
          "Titre": "Truly great service for a reasonable…",
          "Contenu": "Truly great service for a reasonable price. By far better than other ones and I've spent around 2 days looking for the best service."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Wowbattery Store",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T12:47:16.000Z",
          "Titre": "I love you guys!!!",
          "Contenu": "I love you guys, I wish you growth and development and the most reliable proxies!"
        },
        {
          "Note": 5,
          "Lieu": "AL",
          "Pseudo": "Narelle",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T18:44:26.000Z",
          "Titre": "@Alina Is the best assistant ever.",
          "Contenu": "@Alina Is the best assistant ever.She really helped me and make my webshare experience were easy. Rate Alina 10/10"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "aymaneshami",
          "Nb_Reviews": 2,
          "Date": "2022-09-10T00:08:15.000Z",
          "Titre": "I had a minor problem that was my…",
          "Contenu": "I had a minor problem that was my mistake,  but the technical team was very fast and helpful. I would definitely recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Rowan",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T19:37:24.000Z",
          "Titre": "Great performance and flexibility",
          "Contenu": "Great performance and flexibility, support is always ready to help. Good prices."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "marko simonovic",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T22:32:38.000Z",
          "Titre": "not that you are good but you are the…",
          "Contenu": "not that you are good but you are the best I am very satisfied with your services and more than that on a scale of 1 to 10 my rating is 100000000000000000"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Shood",
          "Nb_Reviews": 7,
          "Date": "2023-01-23T19:35:55.000Z",
          "Titre": "Great experience from a great provider",
          "Contenu": "it's been a year of using webshare proxies. Stable, fast connection and cheap prices plus a lot of suitable plans.100% worth to buy"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Сергей Соловьёв",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T05:08:28.000Z",
          "Titre": "Review",
          "Contenu": "I am satisfied with the work of the service, all questions are answered quickly, problems are solved, as a rule, in favor of the user. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T02:09:04.000Z",
          "Titre": "Excellent in service",
          "Contenu": "Excellent in service! I have an issue with my subscription and CSR resolved quickly! Very satisfaction and highly recommend to all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "StarrBabyy",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T03:43:24.000Z",
          "Titre": "By far the best proxy website I have…",
          "Contenu": "By far the best proxy website I have visited.. easy to find, and purchase reliable proxies. Also, have you seen the price ? Amazing !"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Towfiq I",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T10:19:52.000Z",
          "Titre": "Best Proxy service providers",
          "Contenu": "Hands down one of the most affordable and proficient proxy service providers. Love their service."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Rana awais",
          "Nb_Reviews": 2,
          "Date": "2022-05-29T00:17:44.000Z",
          "Titre": "this is great website and they have great work",
          "Contenu": "this is great website and they have very latest feature , i appreciated to webshare.io and his team good luck ."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "shabygmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T21:09:31.000Z",
          "Titre": "Reposive,problem solver",
          "Contenu": "Reponsive,problem solver,and very friendly.will always buy proxies from them"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Stefan Matei",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T07:51:54.000Z",
          "Titre": "reliable service",
          "Contenu": "Good price for a reliable service. Easy to use interface. The support answers quickly to questions."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Dmitry Voronenkov",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T17:20:31.000Z",
          "Titre": "All is great",
          "Contenu": "All is great, really. Price is great, availability and performance are great, logs are also great. No remarks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cameron",
          "Nb_Reviews": 66,
          "Date": "2023-05-27T14:43:01.000Z",
          "Titre": "Really good company must use this…",
          "Contenu": "Really good company must use this company I like there support and people In that company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tenti",
          "Nb_Reviews": 2,
          "Date": "2022-06-19T17:55:03.000Z",
          "Titre": "Fast and great proxies",
          "Contenu": "The proxies work well, the support is very good and they respond quickly to questions I have. I highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T21:33:32.000Z",
          "Titre": "I like Webshare Proxy",
          "Contenu": "I like Webshare Proxy. It has good price, very fast support and the lowest prices that I've seen. I recommend it"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T17:54:54.000Z",
          "Titre": "Service gives 10 free working Ipv4…",
          "Contenu": "Service gives 10 free working Ipv4 proxy-servers. It is good for evaluation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jerm lafty",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T01:59:32.000Z",
          "Titre": "Was able to get the answer to how to rotate proxies and implement them into a script.",
          "Contenu": "Was able to get the answer to what I was looking for from automated / instant responses!"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "lion hart",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T21:05:51.000Z",
          "Titre": "Its support is able to solve all problems",
          "Contenu": "In fact, this site is very good and I recommend dealing with itIts support is able to solve all problems"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Suresh Kumar",
          "Nb_Reviews": 2,
          "Date": "2022-04-28T09:48:23.853Z",
          "Titre": "Absolute Pleasure in using their simple…",
          "Contenu": "Absolute Pleasure in using their simple to use Services. Great job guys!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "valued customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-01T09:58:17.000Z",
          "Titre": "This time I'm not happy with ur service…",
          "Contenu": "This time I'm not happy with ur service bcz Proxies blocked also i got many issues.I got good service in march."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "ontime workers",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T14:54:04.000Z",
          "Titre": "Best proxy provider",
          "Contenu": "Superb experience nice and easy setup. And support team are very friendly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mr ait",
          "Nb_Reviews": 9,
          "Date": "2023-03-14T05:07:10.000Z",
          "Titre": "Webshare also offers a big pool of IPs and provides updated and well-maintained proxies",
          "Contenu": "I like using webshare , simply because it's easy to use and affordable and efficient, my main usage is for digital marketing campaigns and works like a charm, I did reach out to support a couple of times and the reply was fast and they were able to help the prices are reasonable for me."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Foo Lam",
          "Nb_Reviews": 4,
          "Date": "2023-05-14T15:33:17.000Z",
          "Titre": "genuinely speaking very affordable and…",
          "Contenu": "genuinely speaking very affordable and great proxies to work with."
        },
        {
          "Note": 5,
          "Lieu": "PS",
          "Pseudo": "omarabusherifgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T02:53:31.000Z",
          "Titre": "Excellent product I highly recommend it…",
          "Contenu": "Excellent product I highly recommend it to all guys"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "L.R",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T18:55:28.000Z",
          "Titre": "My experience is being great with the…",
          "Contenu": "My experience is being great with the site.Thank You!!"
        },
        {
          "Note": 5,
          "Lieu": "PS",
          "Pseudo": "nouraldin owda",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T12:30:34.000Z",
          "Titre": "Wonderful and reasonably priced",
          "Contenu": "Wonderful and reasonably pricedVery good support service"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "happy user",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T11:29:08.000Z",
          "Titre": "Cheap and quality service",
          "Contenu": "Cheap and quality service. Can't expect more, just fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Andrea Collivadino",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T12:08:52.000Z",
          "Titre": "Gets the job done",
          "Contenu": "Nothing to complain about! Got exactly what I was expecting"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "BPS Electronics",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T16:54:50.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Fast proxies. Good price. I recommend"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Jo Chacko",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:51:32.000Z",
          "Titre": "SCAMMMM :(((((((",
          "Contenu": "Scamm dont pay money for this site please"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ramez B.",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T11:43:21.000Z",
          "Titre": "The support is very cooperative",
          "Contenu": "The support is very cooperative, and the service I liked.. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Kaswick",
          "Nb_Reviews": 3,
          "Date": "2022-02-01T16:05:38.000Z",
          "Titre": "This is one of the best website & their…",
          "Contenu": "This is one of the best website & their customer service is outstanding."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "theuniversaltntgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T22:13:13.000Z",
          "Titre": "Highly recommend",
          "Contenu": "No complaints whatsoever, and at a good price."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Muhammad Asif",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T11:56:29.000Z",
          "Titre": "Best and cheapest proxy",
          "Contenu": "Very good and cheapest proxy server and performance is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "asfdaf afsfafa",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T06:32:21.000Z",
          "Titre": "Good website",
          "Contenu": "Very quick response time and also good customer service."
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "DaveHell",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T13:52:43.000Z",
          "Titre": "The service is fastest,most stable and…",
          "Contenu": "The service is fastest,most stable and best prices I've met of my proxy jobs over 3 years .I'm glad at last to find this .Thanks the staff !!!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "MUHAMMAD GHULAM JILANI",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T18:24:56.000Z",
          "Titre": "User friendly so I highly recommend WEBSHARE.IO"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T07:48:48.000Z",
          "Titre": "Very good and for a good price",
          "Contenu": "Very good and for a good price. Recommended from Colombia. 🤙🏾"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Jaya",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T20:01:42.000Z",
          "Titre": "Great proxy service",
          "Contenu": "Great proxy, cheap and great! support team very helpful help solve my problem thank you"
        }
      ]
    }
  ]
}