{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "webtradein.com",
      "Review": [
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grace Patel",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T22:39:37.000Z",
          "Titre": "They offered $20 more for my friend’s…",
          "Contenu": "They offered $20 more for my friend’s device. They told me this is because the value of the phone depreciates over time. It would be great if they can offer more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chase",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:15:10.000Z",
          "Titre": "Smooth transaction and wish they can…",
          "Contenu": "Smooth transaction and wish they can pay more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T21:26:39.000Z",
          "Titre": "Good but I wish they can reimburse the…",
          "Contenu": "Good but I wish they can reimburse the PayPal fee"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reese",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T18:45:32.000Z",
          "Titre": "Informative updates throughout the…",
          "Contenu": "Informative updates throughout the process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Villanueva",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T20:32:28.000Z",
          "Titre": "Super and easy to work with!",
          "Contenu": "Super and easy company to work with! Traded in my old iPhone 13 Pro. Received the best offer here. I definitely recommend Web Tade-In LLC to anyone looking to get rid of an old device. I will definitely be coming back to sell my future devices here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Allen Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:19:48.000Z",
          "Titre": "Everything couldn’t have gone smoother",
          "Contenu": "Everything couldn’t have gone smoother. Quick response times on emails and payment happened within minutes of them inspecting the phone. They have a good eye looking over the phones so as long as you’re truthful, you won’t have any surprises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Dayhoff",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:46:33.000Z",
          "Titre": "Smooth and prompt transaction",
          "Contenu": "Very happy with the transaction"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer Kruse",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:53:32.000Z",
          "Titre": "Super quick turn around",
          "Contenu": "Super quick turn around. I sent my phone off on a Wednesday, they received it late Saturday, I had my offer on Monday."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Koa",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:58:21.000Z",
          "Titre": "Quick reliable service",
          "Contenu": "Quick reliable service. Price was great and customer service was very professional. I would highly recommend them over the others. 10 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Les B.",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T20:07:06.000Z",
          "Titre": "Very Fast Service!",
          "Contenu": "Very Fast Service!!  Honest and sends photos to verify everything. Will always use them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah Schwartz",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T03:20:46.000Z",
          "Titre": "Free shipping and insurance",
          "Contenu": "My experience with Web Trade-In could not have been easier. Got an instant quote, they offer free shipping and deducted $5 for the shipping insurance. Got paid via PayPal. Btw, their offer is 30% higher than AT&T trade in"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayle White",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T02:32:31.000Z",
          "Titre": "The process was smooth and easy",
          "Contenu": "The process was smooth and easy. Always quick to respond!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:35:07.000Z",
          "Titre": "We used to sell used phones on eBay",
          "Contenu": "We used to sell used phones on eBay, but we ran into a very bad experience when the eBay buyer tried to claim the phone was not as described. So our friend recommend web trade-in to us and the selling process is extremely simple"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Park",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T20:16:38.000Z",
          "Titre": "Absolutely perfect experience from…",
          "Contenu": "Absolutely perfect experience from start to finish. This service is much better than Craiglists, offerup and other trade-in programs. Package was insured so I did not have to worry about losing anything. I highly recommend Web Trade-In!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan E.Doran",
          "Nb_Reviews": 3,
          "Date": "2023-05-02T19:07:28.000Z",
          "Titre": "Best Place to Trade In Your Phone!",
          "Contenu": "Web Trade In gave me the most money for my old phone! It was so quick and easy! Customer service was exceptional and I had my money deposited in my account within a week! Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucas F",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T22:20:26.000Z",
          "Titre": "It’s my first time leaving a review",
          "Contenu": "It’s my first time leaving a review. This is an excellent way to recycle old techs. Have turned in a iPhone and 2 iPads, they provided fair pricing, simple shipping and followed by quick payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T17:12:29.000Z",
          "Titre": "I don't generally leave reviews but…",
          "Contenu": "I don't generally leave reviews but they really deserve one.I checked a bunch of sites before making a decision. This one is the best because they have shipping insurance and much higher offer compared to my wireless carrier - Verizon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cohen",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T18:16:00.000Z",
          "Titre": "I prefer to trade in and purchase the…",
          "Contenu": "I prefer to trade in and purchase the phone without the installment plan with my service provider because it’s complex and involves with hidden fees. This is now my go to place to sell my phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weigh L",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T18:16:03.000Z",
          "Titre": "They were swift in paying out",
          "Contenu": "They were swift in paying out. I didn’t describe the condition of my phone accurately but they were very patient. I will continue to sell my used tech to them because of the ease of the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachael",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T21:09:31.000Z",
          "Titre": "It was really simple to get an instant…",
          "Contenu": "It was really simple to get an instant offer. All I had to do is print the label at the post office, I received shipping updates and payment turnaround was like 2 days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T18:02:03.000Z",
          "Titre": "I got a quote online that was higher…",
          "Contenu": "I got a quote online that was higher than any other company, which was awesome given my phone was broken front and back, and still managed to get over $110."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T17:44:05.000Z",
          "Titre": "Web Trade was fast",
          "Contenu": "Web Trade was fast, very quick and easy. I will do business with them always. They are reliable and honest. I truly am appreciative of such a company. Thank you so much!DS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine Cordero",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T23:17:47.000Z",
          "Titre": "This was the best experience I’ve ever…",
          "Contenu": "This was the best experience I’ve ever had trading in a phone. I received my payment promptly, and I would recommend web trading to anyone looking to sell their electronic devices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T00:47:54.000Z",
          "Titre": "The app generated a QR code that I can…",
          "Contenu": "The app generated a QR code that I can take to the retail associate at the post office to print the label. This is extremely convenient and they paid on the same day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Carole",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T17:05:38.000Z",
          "Titre": "We decided to give it a try",
          "Contenu": "We decided to give it a try. Sent in 3 extremely old phones, 1 of them has hardware issue. They paid for the shipping and the service exceed our expectations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gino",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T17:54:55.000Z",
          "Titre": "No one is buying our Italian phone…",
          "Contenu": "No one is buying our Italian phone since it doesn’t work in the states, so I was searching for a buyer and found this business, very simple process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T00:30:36.000Z",
          "Titre": "The vendor was able to process the…",
          "Contenu": "The vendor was able to process the purchase of my iPhone X. They got back to me with a notification of receipt and validation of the offer the same day they received the phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Albeck",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T22:17:11.000Z",
          "Titre": "The service provided was excellent and…",
          "Contenu": "The service provided was excellent and a very simple process.  I got a great price for my previous 2 devices and the entire process was less than 5 business days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean C",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T21:49:03.000Z",
          "Titre": "I lost my phone when I sold on eBay…",
          "Contenu": "I lost my phone when I sold on eBay many years ago. I don't feel like meeting with random people on Craiglists or OfferUp either. Thanks to Web Trade-In for making this selling process so simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T15:55:12.000Z",
          "Titre": "I was dubious about selling my super…",
          "Contenu": "I was dubious about selling my super old iPhone 7, but I gave it a try and was totally impressed. Hopefully someone can reuse my phone to reduce E-waste"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Conor",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T16:33:05.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service. Received a good amount of money for the used electronics that we had left in the drawer. It’s easy that we can print the label and schedule a free pick up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosanna",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T03:00:24.000Z",
          "Titre": "They were quick to acknowledge receipt…",
          "Contenu": "They were quick to acknowledge receipt of my device, quick to check it & zelle the funds. From start to finish approximately 4 days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrs.M",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T16:30:19.000Z",
          "Titre": "I was a little apprehensive",
          "Contenu": "I was a little apprehensive! I researched before sending my phone off. It went through and I got my payment! Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kmaster",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T17:22:50.000Z",
          "Titre": "Selling my cellphone first time to get…",
          "Contenu": "Selling my cellphone first time to get some extra money. The process is a lot easier than i have expected! Excellent experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steve boltyansky",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T17:51:55.000Z",
          "Titre": "flowless quick transaction",
          "Contenu": "flowless quick transaction. Great customer service .  Will gladly deal with them again if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T20:11:27.000Z",
          "Titre": "Was really surprised at how simple it…",
          "Contenu": "Was really surprised at how simple it was to get money for a phone that was damaged and was just sitting around in the drawer. A++ for the free shipping and insurance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank G",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T00:15:58.000Z",
          "Titre": "5 star service",
          "Contenu": "5 star service! I was pretty conservative on the device condition and was happily surprised to find out I would be receiving a payment in excess of my initial offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy Lee",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T13:26:35.000Z",
          "Titre": "Love this service",
          "Contenu": "Love this service！They offered $900 compared to the $605 offer from T-mobile. Great deal! They also covered the shipping cost and an option to add insurance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bella",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T17:03:45.000Z",
          "Titre": "My first time selling a used laptop",
          "Contenu": "My first time selling a used laptop. The experience was easy. I opt to print the shipping label at the post office. They emailed when they receive the laptop ad sent the payout on the same day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. C. Thomas",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T00:20:21.000Z",
          "Titre": "Lightnight quick payment via Zelle!",
          "Contenu": "Received email notifying item was received; half hour later, received payment via Zelle. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T20:01:49.000Z",
          "Titre": "The steps on the website is simple and…",
          "Contenu": "The steps on the website is simple and clear. I ended up with $80 more what my wireless carrier offered. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ella",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T22:26:51.000Z",
          "Titre": "Web trade in paid me for my galaxy…",
          "Contenu": "Web trade in paid me for my galaxy note. They were swift in this process. I will continue to sell my used tech to them because of ease of service. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T03:37:17.000Z",
          "Titre": "Fast processing, no low balling offer!",
          "Contenu": "They were fast with processing after receiving my item, they also did not try to low ball me on my item."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T16:37:15.000Z",
          "Titre": "My trade in experience worked out…",
          "Contenu": "My trade in experience worked out great. The team was easy to work with and very informative. Thank you and will use this company again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yunke Gao",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T02:43:59.000Z",
          "Titre": "i trade in my old iPhone with great offer",
          "Contenu": "I was tried trade in my old iphone 10 to apple store, but apple only offers a very small amount of trade in value. However webtradein.com provides me a way greater offer for my old iphone 10 than apple store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T01:01:01.000Z",
          "Titre": "Find a new owner for my used phone and laptop",
          "Contenu": "Hi, I am Emma. This is first time recycling my used phone and laptop, hope you guys can refurbish the phone and find them a new owner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Rekstad",
          "Nb_Reviews": 5,
          "Date": "2023-04-04T00:26:53.000Z",
          "Titre": "Excellent prompt service and a fast…",
          "Contenu": "Excellent prompt service and a fast turnaround.  I will use them again!  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T18:39:25.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Easy to work withFriendly Responds in a timely manner Overall a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel T",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T14:46:08.000Z",
          "Titre": "We compared a few similar sites",
          "Contenu": "We compared a few similar sites, this is the one offers the best price for used and broken phones"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T15:42:13.000Z",
          "Titre": "Everything they said is accurate",
          "Contenu": "Everything they said is accurate! They said the payment can take up to 48 hours but I got my money within 12 hours!! Awesome company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T22:26:33.000Z",
          "Titre": "Tried selling my phone on eBay but…",
          "Contenu": "Tried selling my phone on eBay but didn’t work, so we turned this website, the price is fair and process is easy. I didn’t have to pay for the eBay and shipping fees"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T14:04:06.000Z",
          "Titre": "I was able to track my package…",
          "Contenu": "I was able to track my package throughout the shipment process. I also added insurance :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T20:27:57.000Z",
          "Titre": "They honored the offer",
          "Contenu": "They honored the offer. Smooth process. I received the money earlier than I was expecting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mav",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T21:49:15.000Z",
          "Titre": "This is a good way to get cash for…",
          "Contenu": "This is a good way to get cash for trade in instead of receiving complicated statement credits from the wireless carrier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T22:23:06.000Z",
          "Titre": "They emailed me when they received my…",
          "Contenu": "They emailed me when they received my device. Once they made sure my device was good the sent me the money with no hiccups. Very Professional!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ms.Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T18:20:23.000Z",
          "Titre": "We had an excellent experience",
          "Contenu": "We had an excellent experience, no complication, just an easy process to cash out the old device to upgrade to the newer ones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaymz",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T02:47:13.000Z",
          "Titre": "I bought a MacBook and I couldn’t get…",
          "Contenu": "I bought a MacBook and I couldn’t get used to it, so this is my first time selling online. I have to say I am very satisfied, it was really simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo C.",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T17:12:53.000Z",
          "Titre": "Safe and easy to use",
          "Contenu": "Safe and easy to use. No issues. Fair offer and good way to quickly get rid of unwanted electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pricilla",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T23:46:03.000Z",
          "Titre": "Received an iPhone (as a gift) that is…",
          "Contenu": "Received an iPhone (as a gift) that is not compatible with my T-Mobile sim, so I had to sell it. Fair price and quick turnaround"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seller",
          "Nb_Reviews": 6,
          "Date": "2023-04-10T22:49:27.000Z",
          "Titre": "Good to sell",
          "Contenu": "This company is very good,on which I sold my old device.awesome experience.And thank you so much ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T04:28:06.000Z",
          "Titre": "The price is not bad",
          "Contenu": "The price is not bad, fair evaluation and quick process. Will def use them again. Mailed in the phone on oct 27 and received the check on nov 5"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Heather",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T21:59:51.000Z",
          "Titre": "Traded in my broken iPad for a gift…",
          "Contenu": "Traded in my broken iPad for a gift card, hopefully they can fix it and find a new owner for it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Rice",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T15:17:55.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service, prompt turnaround. Best place to sell broken phones"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRANDON",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T21:06:09.000Z",
          "Titre": "A-1 service",
          "Contenu": "A-1 service, reliable, fast return on cash, accurate pricing when you negotiate with them and the highest payout out on the market!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T16:28:44.000Z",
          "Titre": "Easy to Use",
          "Contenu": "Well, I just like the insurance option and the process was very simple and customer service was very responsive to the questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiff",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T05:42:24.000Z",
          "Titre": "Super happy with the service",
          "Contenu": "Super happy with the service. Received the PayPal payment in a few days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ally",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T19:23:18.000Z",
          "Titre": "Prompt and constant communication",
          "Contenu": "Prompt and constant communication. 5 day process including shipping time and the weekend. Great experience and will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catrina S",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T15:59:27.000Z",
          "Titre": "Everything was very good",
          "Contenu": "Everything was very good! I recommend. Customer satisfaction at the highest level"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hailey",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T15:29:47.000Z",
          "Titre": "Great price for a cracked iPhone 13 pro…",
          "Contenu": "Great price for a cracked iPhone 13 pro max. The transaction was handled transparently and quickly. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T18:26:08.000Z",
          "Titre": "This is great way to sell old tech that…",
          "Contenu": "This is great way to sell old tech that no one is interested in buying"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lianwei yang",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T03:53:00.000Z",
          "Titre": "I compared a few buyback websites",
          "Contenu": "I compared a few buyback websites, this one looks best to me. I sold it for more and the process was so simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T21:08:33.000Z",
          "Titre": "Sold my at&t phones before moving to…",
          "Contenu": "Sold my at&t phones before moving to Vancouver. The process was really EZ"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Preston",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T02:38:44.000Z",
          "Titre": "T-Mobile only offers bill credit and a…",
          "Contenu": "T-Mobile only offers bill credit and a lower value, WebTradeIn.com offers cash for a high price as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathon",
          "Nb_Reviews": 2,
          "Date": "2022-09-04T03:07:11.000Z",
          "Titre": "Fair offer",
          "Contenu": "Seamless and rapid process. Fair offer for my iPhone and Galaxy Note"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:28:02.000Z",
          "Titre": "No issue shipping my phone and received…",
          "Contenu": "No issue shipping my phone and received the payment quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Israel M",
          "Nb_Reviews": 2,
          "Date": "2022-09-03T19:06:41.000Z",
          "Titre": "Fast and efficient trade in program",
          "Contenu": "Fast and efficient trade in program. Wish I don’t need to print out the label."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T20:02:14.000Z",
          "Titre": "It’s convenient that I could just drop…",
          "Contenu": "It’s convenient that I could just drop off the package at the USPS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amelia H",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T16:06:30.000Z",
          "Titre": "First time leaving a review for a small…",
          "Contenu": "First time leaving a review for a small business! I love the easy process..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T23:42:45.000Z",
          "Titre": "They sent me the check on the same day…",
          "Contenu": "They sent me the check on the same day they received my phone - very quick service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T15:47:04.000Z",
          "Titre": "Better than Craigslists and Offerup",
          "Contenu": "Better than Craigslists and Offerup. Very simple process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phoebe",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T21:04:22.000Z",
          "Titre": "These guys made the selling process of…",
          "Contenu": "These guys made the selling process of used device a breeze and no gimmicks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T00:03:29.000Z",
          "Titre": "Higher offer than AT&T and quick…",
          "Contenu": "Higher offer than AT&T and quick turnaround"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geroge",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T20:36:43.000Z",
          "Titre": "Sent in a total of 5 used iphone 11",
          "Contenu": "Sent in a total of 5 used iphone 11, received the payment the next day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T00:06:41.000Z",
          "Titre": "Payment was very competitive and…",
          "Contenu": "Payment was very competitive and immediate. The whole process was very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T21:17:08.000Z",
          "Titre": "I didn’t know about the iCloud lock and…",
          "Contenu": "I didn’t know about the iCloud lock and they walk me the steps to have it removed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clara",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T23:35:43.000Z",
          "Titre": "Easy way to make a little extra money…",
          "Contenu": "Easy way to make a little extra money to help pay off my new iPhone 13. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry W",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T14:35:19.000Z",
          "Titre": "Cracked the screen and it cost 100 to…",
          "Contenu": "Cracked the screen and it cost 100 to repair , so I rather sell it and buy a new one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diamante Elliott",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T21:44:17.000Z",
          "Titre": "The whole process was very easy…",
          "Contenu": "The whole process was very easy definitely will recommend. Communication was great 👍🏾"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zack Yu",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T23:42:36.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service , they will call you to ensure a smooth transaction"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T19:56:14.000Z",
          "Titre": "It’s awesome that USPS can print the…",
          "Contenu": "It’s awesome that USPS can print the label for me. Good price as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T01:37:03.000Z",
          "Titre": "Very honest phone purchaser",
          "Contenu": "Very honest phone purchaser - great deal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T22:24:57.000Z",
          "Titre": "The sales team were easy to work with…",
          "Contenu": "The sales team were easy to work with and very supportive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T04:32:18.000Z",
          "Titre": "They buy broken phones",
          "Contenu": "They buy broken phones, excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T20:57:50.000Z",
          "Titre": "The manager called to make sure I…",
          "Contenu": "The manager called to make sure I received the payment, excellent experience"
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "عبد الغفور",
          "Nb_Reviews": 4,
          "Date": "2023-10-22T23:03:24.000Z",
          "Titre": "Very beautiful and wonderful sites"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T03:58:12.000Z",
          "Titre": "Sold iPhone XR",
          "Contenu": "Sold iPhone XR. Great service and quick turnaround."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T05:33:42.000Z",
          "Titre": "Honest and fast",
          "Contenu": "Honest and fast. Better price than Verizon. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T20:05:46.000Z",
          "Titre": "Honest with the value of products that…",
          "Contenu": "Honest with the value of products that you send in. Gracias"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eloise",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T18:14:05.000Z",
          "Titre": "Awesome communication and service",
          "Contenu": "Awesome communication and service. Timely payment and updates. Very happy!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "angel",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T16:11:30.000Z",
          "Titre": "I was an international student",
          "Contenu": "I was an international student. So I had to sell my iPhone 12 after graduation. Web Trade-In made the selling process so easy. The shipping is free and insured."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy N",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T02:50:28.000Z",
          "Titre": "Great",
          "Contenu": "Great, accurate pricing and very smoooth transaction !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T23:44:56.000Z",
          "Titre": "I am a very happy customer",
          "Contenu": "I am a very happy customer. Very simple way to sell"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer jesse",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:52:32.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience, the customer service called to ensure everything went well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T20:51:28.000Z",
          "Titre": "Reliable and convenient to deal with"
        }
      ]
    }
  ]
}