{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "worldwidestereo.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:36:07.000Z",
          "Titre": "Don't buy from here",
          "Contenu": "Over sold product they didn't have. I got a refund but that did not help me. It screwed me because now I can't find the headphones I bought. In stock. ANYWHEREUpdate / response. They didn't tell me anything. I had to call and ask why my order is taking so long. That's why I wasn't able to secure another pair. The \"prompt\" refund, wasn't prompt at all. It took me calling for it be addressed. Which I gave more than a couple of weeks to be considerate. All other retailers were either already sold out of the given product. Or in the few weeks I let pass by before contacting them. The rest had sold. If they were more prompt and a better business. They would have did exactly what they said but weeks earlier. So I could have perhaps maybe found the product i was looking for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phil O.",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T20:47:53.000Z",
          "Titre": "Online Buyers Beware",
          "Contenu": "Absolutely non-responsive customer service.  I emailed, left a voicemail message, and even talked to an actual person.  They never responded to help with a wrong order placed online (admittedly my fault).  I’ll keep the product and never buy from them again.  Lesson learned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David LeComte",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T16:46:09.000Z",
          "Titre": "Pricing",
          "Contenu": "I went back to  your web site to check some specs on the  DH190 I bought on Sunday and noticed the price dropped 51.00.probably won't recommend and or buy from this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian and Lisa",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T17:38:43.000Z",
          "Titre": "Online Ordering Bad Experience",
          "Contenu": "Around 9/15 I ordered a PAIR of speakers which was said to be in stock!  Monday the 18th ONE speaker arrived!  After online chat which they said other speaker had to shipped from their other warehouse.  I figured OK another day probably.  Until I received updated email with tracking.. Shipping from California??!!  Your home base is in the state I live PA.  You mean to tell me you have no warehouse in our big state??  I drove up to your store last year from Langhorne, PA and purchase a Cambridge receiver & Denon turn table. It's TEN days later and I'm still waiting for 2nd speaker of pair.  Online ordering not trustworthy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Gross",
          "Nb_Reviews": 3,
          "Date": "2022-08-22T21:07:11.000Z",
          "Titre": "Customer service was a BIG miss",
          "Contenu": "This time was a big miss. I've ordered from WWS numerous times and have spent thousands of dollars and had no issues.  I called customer service this time to check on a freight order status and the person who answered was absolutely horrible, rude and condescending.  The products and website are great, but the only time I had to call customer service was an awful experience; so much so that I will likely not buy from this store any longer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 3,
          "Date": "2022-10-04T15:39:51.000Z",
          "Titre": "Speakers & Amp...",
          "Contenu": "I ordered a pair of speakers and an amplifier; If I had just ordered the speakers this review would be five stars as they were received in a timely manner.Unfortunately I had to cancel the amplifier order as it still had not shipped after a full week and no ship date was being given.I am also still waiting for them to apply the refund for the amplifier to my credit card and it was returned a week ago per the FedEx proof of delivery.I really had high hopes...bummer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gina G",
          "Nb_Reviews": 7,
          "Date": "2023-01-18T03:02:50.000Z",
          "Titre": "I never received my turntable",
          "Contenu": "I never received this. It was a gift for my boyfriend, so it's extremely disappointing. First the problem appeared to be with UPS because they didn't notify me that they were here to deliver. I notified WWS and told them about the problem and that I needed them to call UPS and report the problem. The man said he would get back to me but never did. I won't be ordering again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EMILY PERRY",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T02:20:54.000Z",
          "Titre": "Doesn’t connect all units",
          "Contenu": "It said it was compatible and easy to set up.  Me and my son, who is tech savvy, spent hours trying to get it set up and synced and failed.  The sound bar is connected to the tv so that works but there is no “surround sound” since the others don’t connect.  This was a huge expense and super unsatisfactory."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hector",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T22:35:21.000Z",
          "Titre": "I order a receiver it was send by UPS…",
          "Contenu": "I order a receiver it was send by UPS and UPS loss the package , now I need to wait for UPS to do a investigation, now World Wide Stereo has my money and I don’t have my equipment. I call them but I guess they prefer for me to cancel order and buy when I get my refund somewhere else !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RONALD SPIVEY",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T03:10:01.000Z",
          "Titre": "One of my Klipsh RP 8000 F II Spekers…is damaged on outer upper corner",
          "Contenu": "One of my Klipsh RP 8000 F II Spekers was damaged on the upper corner, instead of being a sharp corner it is partially collapsed like someone dropped it on the point or hit hard somehow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RORY ANDERSON",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T18:25:58.000Z",
          "Titre": "Ordered TV two weeks ago",
          "Contenu": "Ordered TV two weeks ago. Cannot get tracking information. It was subbed to another freight company nobody calls me and I have not been able to get any delivery times. Better off to buy from the home store if you can."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EVELINO CORTES",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T00:24:02.000Z",
          "Titre": "I am not satisfied with my purchase the…",
          "Contenu": "I am not satisfied with my purchase the sound quality is very low and distorted please send me information on how I can return the product.  Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T21:08:10.000Z",
          "Titre": "I was told twice that my product had…",
          "Contenu": "I was told twice that my product had shipped and it had not. I ordered from this retailer because of the quick shipping, but the item was delayed for nearly a week then shipped to me from Amazon instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leonard Lewandowski",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T23:04:19.000Z",
          "Titre": "I based my other review on the courtesy…",
          "Contenu": "I based my other review on the courtesy shown to get an answer to my question!  As of yet I haven’t gotten an answer!  That sucks!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TODD L",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T23:02:12.000Z",
          "Titre": "Got my Sonos sub woofer with no…",
          "Contenu": "Got my Sonos sub woofer with no problems can’t wait to get my wall speakers next thanks guys"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MIKE BUTTERFIELD",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T15:28:51.000Z",
          "Titre": "It’s April 23rd was charged April 10th…",
          "Contenu": "It’s April 23rd was charged April 10th and I still haven’t received my turntable as of yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KENNETH KOUOT",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T22:50:39.000Z",
          "Titre": "Early celebration?",
          "Contenu": "I mean... you're asking for a review while my shipment is late :D Not a great time to ask"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SCOTT KINSEL",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T22:48:49.000Z",
          "Titre": "Two weeks or more to deliver a $7000…",
          "Contenu": "Two weeks or more to deliver a $7000 item? Weak."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T22:19:09.000Z",
          "Titre": "Poor communication.  Left me hanging, never responded.",
          "Contenu": "Reached out for pre purchase support.  Received a prompt reply the next day and although my answer could have been provided immediately the reply from Ryan requested additional irrelevant information.  I provided the irrelevant information and never received a response again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MINDY",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T20:07:10.000Z",
          "Titre": "The Sony is great! Customer Service, not so much.",
          "Contenu": "The product is great, the customer service is lacking. I ended up ordering the same Sony stereo from Walmart for $70 less. Still waiting for my refund from this place. Never did receive the stereo. Per your reply,I’ve requested a refund, therefore refused the delivery that was over a week late. The product is now on its way back to your warehouse."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JIM JOHNSON",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T00:38:31.000Z",
          "Titre": "Ordered from this company and product…",
          "Contenu": "Ordered from this company and product was scheduled to ship on the 31st. FedEx tracking label created but product was never given to FedEx. I called four times through-out the week speaking to different people. Each time I was told the shipping department needs to investigate this. Eight days later still no response and replacement product has not shipped. Very poor customer service in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Williams",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T18:42:19.000Z",
          "Titre": "Terrible service",
          "Contenu": "Terrible service. I got a great price only to have the TV damaged in transit (which happens). I then had to chase them down to see if I could get a replacement shipped and after 4-5 days of mixed messaging from random folks, they told me they were out of stock with no more coming in any time soon. I then had to chase a refund. Ironically a week or so later and after a great manufacturer promotion ending, they miraculously got stock! Never shopping with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHRIS",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T17:14:38.000Z",
          "Titre": "Horrible Shipping",
          "Contenu": "The only reason that I'm giving one star is based upon shipping.  Everything else was great.  My first speaker arrived in a HEAVILY damaged box.  There was no damage to the speaker itself, but I still haven't run the speaker because the other speaker is being shipped from another vendor which won't arrive fro another week.  I'm hoping there is no internal damage to the speakers..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Strosser",
          "Nb_Reviews": 2,
          "Date": "2020-07-11T14:43:20.000Z",
          "Titre": "Ordered Samsung TV (7/9)",
          "Contenu": "Ordered Samsung TV (7/9), requested expedited shipment for Saturday (7/11) delivery. FedEx tracking delivery Wednesday (7/15) @ 8pm.  I could have purchased locally (Best Buy or Walmart) , same price.  Chose WWS, past service & committed delivery.  Called store Saturday, but closed.  Very, very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRANDON",
          "Nb_Reviews": 2,
          "Date": "2021-09-06T19:51:11.000Z",
          "Titre": "I got sent 2 TVs back to back both…",
          "Contenu": "I got sent 2 TVs back to back both arrived broken spent over 3k with them my money has been tied up for 2 weeks with still no tv because the model I want is the LG G1 horrible shipping experience I would not recommend WWS to friends and family at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ERIC GUZMAN",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T17:03:16.000Z",
          "Titre": "Questionable ethics and customer service.",
          "Contenu": "Their customer support was by far the worst. Dealt with a very condescending lady J. Due to a lost package where I had filed a claim with UPS, she had responded with her own opinions stating “this claim is fraud because the tracking says it was delivered” very rude as if I were wasting her time. Carriers make mistakes just as we all do but to jump to conclusions and harshly accuse someone of “fraud” is a serious issue to customers. When I spoke with UPS they stated the claim was submitted for payment on March 31. Could it be the retailer is trying to keep the payment while giving me the “we can’t do nothing for you” response? I question their ethics. Now I am out $2,600 and still no product. Least they could do is re-ship."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Lennarz",
          "Nb_Reviews": 1,
          "Date": "2018-07-16T17:40:17.000Z",
          "Titre": "The old run-around",
          "Contenu": "I purchased a $2,000 Samsung Frame TV from Amazon and the Seller was World Wide Stereo.  Just hung the TV on the wall, etc, etc, and a quarter of the screen is black.  Called World Wide and they gave me the old run-around:  call Samsung.  Samsung, meanwhile, tells me to file a claim with the Seller saying the equipment must have been damaged by World Wide.  Meanwhile, I have a new TV that doesn't function."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "BON PADILLA",
          "Nb_Reviews": 1,
          "Date": "2018-02-13T21:38:26.000Z",
          "Titre": "Bad service.",
          "Contenu": "Made a purchase and was then contected about no shiping to my location. Not only a few days later where I could had purchased the item from another seller, the I had to wait to get my refund transaction throught the bank.  If you are not going to offer shipping FIX YOUR WEBSITE. So you dont tell me about shipping and call me later telling me that the order had to be cancelled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed customer",
          "Nb_Reviews": 1,
          "Date": "2017-06-30T01:45:04.000Z",
          "Titre": "Wrong item sold and shipped",
          "Contenu": "Was sold the wrong model (item on website was not updated or reflected model discontinued).  Customer service took a couple of days to figure out that the vendor discontinued model and was actually shipping the updated model (new model doesn't have the same features as the old model \"basically the old model is better\"). Very disappointed that the company was not tracking the update with the product they were selling."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SEAN LEE",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T23:36:53.000Z",
          "Titre": "Would not honor a price match & car speaker fitment guide is wrong",
          "Contenu": "I wanted to purchase an additional item along with two sets of car stereo speakers I did purchase. I provided proof of competitor price via email. Two days later they explained they would not match. The purchase I did complete came two days late and even though I used their fitment guide for the speakers to match my car they will not work. I either have to go through the hassle of returning them or find someone to buy them from me. I checked two other locations that sell the same speakers and both gave the correct answer that they will not work. Should have bought the right items elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "THOMAS CHAPMAN",
          "Nb_Reviews": 1,
          "Date": "2017-09-14T22:15:37.000Z",
          "Titre": "My Issue is not with any of the …",
          "Contenu": "My Issue is not with any of the advisors. Infact I did not talk to any of them. I ordered a Yamaha CD player on Wed before Labor Day. When the order release it showed a delivery date of  the following Wed after Labor Day.It in fact wasn't delivered until the following Friday. .I also order equipment from a competitor on the same day. It shipped and was received 2 days later the Friday before Labor Day. I will be using your competitor in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "unhappy santa",
          "Nb_Reviews": 2,
          "Date": "2015-12-07T15:37:06.000Z",
          "Titre": "Horrible",
          "Contenu": "I ordered a speaker and received it with the box completely damaged. Wasn't home to refuse shipment so I'm stuck with it.\rLooks like it has been sitting in 6 inches of water. Tried to call the company to ask for an exchange. Figured I would give them the benefit to make up the issue, could have been FedEx fault. No one answers the phone. Left messages, no reply, emailed, no reply."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-06-08T06:32:16.814Z",
          "Titre": "Suspicious Behavior from WWS",
          "Contenu": "I placed an order for some speakers. I was asked to call provide my debit card information over the phone, which was highly suspicious.  They subsequently raised my issues about my bank, which I did not have any problem with other retailers. My sense is that they treated me as a fraudster. I am not sure what they did with my debit card information, which got me really worried."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RYAN",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T19:06:52.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed. I purchased these wall mounts and paid for next day delivery but the items finally arrived 5 days after the original date. I needed these mounts for a store opening and was unable to have all my speakers mounted and ready for the best possible store opening experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CLARK REDMON",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T15:56:13.000Z",
          "Titre": "I ordered two speaker stands and it was…",
          "Contenu": "I ordered two speaker stands and it was obvious that they had been repackaged when I opened the first stand I noticed the small Allen wrench needed for assembly was missing along with one of the bottom footing screws for the base.  So I didn’t think much about it so I opened the second box thinking I would be able to use the assembly tool.  When I opened the second box the item had the same issue so now I have to go find an Allen wrench that fits theses screws for assembly….  It may seem small but the reason I order online is because my time is valuable to me now I have to spend time on something that should have been included.  I will no longer use this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GENE",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T19:04:55.000Z",
          "Titre": "What service?",
          "Contenu": "Product arrived damaged, I called and was instructed to email with photo of damaged product. I have not heard any response yet, I’m not sure why phone agent could not start RMA process and get this exchanged"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damon Stewart",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T16:03:08.000Z",
          "Titre": "Sent 1/2 my order and unresponsive",
          "Contenu": "I ordered a pair of Klipsch speakers which were supposedly in stock.  Worldwide stereo sent me one speaker and over two weeks later the second speaker has not yet arrived and the tracking is not updating for it. I emailed them several days ago regarding the problem and did not receive a response. This was my first time doing business with them and will absolutely be my last. Buy your equipment somewhere else where if they say it is in stock you will get your items in a timely manner.  Regarding storm storm delays I have since ordered things from Ohio, Texas, and Florida, and all of those items have arrived yet I’m still waiting for my original order with worldwide stereo."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Williams for my son Mitchell Williams",
          "Nb_Reviews": 1,
          "Date": "2013-11-26T03:17:21.000Z",
          "Titre": "Headphones broke/quit working after one week!!!",
          "Contenu": "Was impressed when headphones first received.  Then wire caught on something and the headphones quit working, which the incident was hardly a tug.  Very disappointed.  Not happy since we paid $15 for them, and really glad we didn't pay the full price of $50!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leopoldo lopez",
          "Nb_Reviews": 2,
          "Date": "2020-05-07T00:47:48.000Z",
          "Titre": "buy on line home theater system…",
          "Contenu": "hi  I buy on line home theater system on( world wide stereo )   they said the brand and model is on stock and promise delivery on 24 to 48 hrs. Delivery and to date is the 5th day and they put a lot of excuses for the delivery the true is they don't have this ARCAM brand on stock the major problem is they don't wants refund the payment to pay pal I cancel the purchased 3 times and they said yes but they don't do it  so people be carful we this place the don't have the items on stock and play we your money and refuse to give the money back we don't recommend this place to no body they have terrible customer service no educated  no skills we works we people ..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ALBERT MOORE",
          "Nb_Reviews": 1,
          "Date": "2018-01-14T16:40:19.000Z",
          "Titre": "I was double billed for my purchase",
          "Contenu": "I was double billed for my purchase.  It took a number of phone calls to both you and my bank to get one of the charges dropped.When I opened the box with the turntable, I noticed the needle wasn't attached to the tone arm cartridge.  It was loose inside the box without the needle protection cover in place.During the phone conversations with the individuals at your company, I (we, my wife made a few of the calls) informed them of the problem with the needle not being secured in the packaging.  We requested a replacement needle and have yet to receive one.This is my last purchase from your company and probably my last interaction with you.  I doubt I will see a replacement needle delivered to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven  Francis",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T20:18:29.000Z",
          "Titre": "You cancel my order without any reason…",
          "Contenu": "You cancel my order without any reason and then says the billing address did not match to credit card. I use this credit card for a long time and not any problem until I buy with them ......"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARCO VARGAS",
          "Nb_Reviews": 1,
          "Date": "2019-05-28T21:26:31.000Z",
          "Titre": "Initial conversation with…",
          "Contenu": "Initial conversation with representative was great and placed an order for two day shipping and then called to inquire why it was actually 3 day delivery and representative wasn’t as customer oriented."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JEFFREY GIVENS",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T19:48:09.000Z",
          "Titre": "The optic cable I ordered was not new",
          "Contenu": "The optic cable I ordered was not new. It had no protection sleeves on it and it was just thrown in box all loose. When I pay for something new, I expect it to be new, not used or refurbished."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "HAROLD MOREAU",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T19:30:30.000Z",
          "Titre": "It seems like Domeone is using my mail…",
          "Contenu": "It seems like Domeone is using my mail to use a robbed credit card.So my experience of recieving dosens of invoices each day is a little bit annoying to be frank"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRIAN",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T22:24:01.000Z",
          "Titre": "Delivery running very, very late...",
          "Contenu": "Delivery running very late.  They use FedEx which has really gone downhill recently (in my opinion).  I still haven’t received the item - it was supposed to be here a few days ago."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Fitzgerald",
          "Nb_Reviews": 2,
          "Date": "2019-07-17T12:13:54.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Purchase was easy. However a cable is missing.  Sent 2 emails a week ago and both never answered! I'll never purchase again. I spent several thousand dollars with them. Never again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Preston Barnes",
          "Nb_Reviews": 5,
          "Date": "2022-02-22T01:54:16.000Z",
          "Titre": "Great shopping  experience",
          "Contenu": "Great shopping  experience.  Everything that I was interested  in,was there online. In the future,this will be my \"go to\" store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William John",
          "Nb_Reviews": 3,
          "Date": "2020-12-19T18:41:07.000Z",
          "Titre": "Not a good place to buy product.",
          "Contenu": "Not a good place to buy product.Order black-friday on-sale speakers from them (Price is the same price from amazon, BestBuy as well)Got the order confirmation successfully.However, one day after, they directly cancel my order saying:  \"Payment Issue\".Called them, they said need to contact your bank and suggest using \"PayPal\" to checkout.Also, my bank states that no any issue to auth they the amount.Customer service just won't help me anything, just ask me replace again.It's really disappointing me that trying to help small business company, so I don't try to buy from amazon.They don't have any customer service and do whatever they want.I would not recommend anyone to buy product from them.Especially, you are trying to buy an expensive speakers.Don't think they will take care you.Buy from well-known store instead of WorldWideStereo."
        },
        {
          "Note": 1,
          "Lieu": "MV",
          "Pseudo": "Ahmed Nazeeh",
          "Nb_Reviews": 4,
          "Date": "2021-01-26T19:41:28.000Z",
          "Titre": "My order got cancelled without any…",
          "Contenu": "My order got cancelled without any valid reason. Totally unacceptable. Was recommended by Rakuten. dONT WASTE YOUR TIME HERE. Buy from Amazon instead"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ZACHERY YBARRA",
          "Nb_Reviews": 1,
          "Date": "2019-01-04T19:39:23.000Z",
          "Titre": "My record player arrived with the dust…",
          "Contenu": "My record player arrived with the dust cover nearly split in half. It might have helped to package the item in something over than the manufacturer provided box."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "TERRELL WRIGHT",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T19:20:45.000Z",
          "Titre": "Disappointment",
          "Contenu": "I had high expectations for this company my first and only order was lost currently working on a solution but yet to be offering a replacement or refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2014-08-31T12:05:23.000Z",
          "Titre": "Do not believe it!",
          "Contenu": "If it's to good to be true it is, they offered an unbelievable deal on a great product and then sold and shipped a different item.  Very shady and unclear website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 7,
          "Date": "2021-01-15T18:46:20.000Z",
          "Titre": "World Wide Stereo Coupon Avoidance Scammers",
          "Contenu": "Changed their item condition fraudulently on EBay in order to avoid giving a 20% coupon during a \"factory certified refurbished\" sale. Their listing said \"certified refurbished\", as did the detailed description. The coupon link was active on the listing. I went back to the listing 4 hours later. The item condition had now changed to \"seller refurbished\". Even though the detailed description still says \"certified factory refurbished\". By them changing the front page item condition from \"certified refurbished\" to \"seller refurbished\" it made the 20% off coupon invalid, They did this to avoid giving customers the coupon on the eligible items. And I guarantee they will change it back after the coupon expires. Fraud. And when contacted they blame it on EBay. BUSTED! SCAMMERS! Filed a report with EBay. Although they won't do anything about it. Too big a seller to do anything. Shame."
        },
        {
          "Note": 1,
          "Lieu": "AW",
          "Pseudo": "VISHAL MOONILAL",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T19:11:12.000Z",
          "Titre": "The product never delivered and I now…",
          "Contenu": "The product never delivered and I now have to Waite for investigation to complete . The customer always have to suffer . Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ADITHYA",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T00:17:31.000Z",
          "Titre": "Order showing as delivered but they…",
          "Contenu": "Order showing as delivered but they haven’t delivered to my address. It’s been almost more than a week, Please help me out on this issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GREG MACKLIN",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T00:01:03.000Z",
          "Titre": "I never heard from no one"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PAUL ROBINSON",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T21:54:02.000Z",
          "Titre": "I received 2 units that came in open…",
          "Contenu": "I received 2 units that came in open and damaged boxes.  I appreciate they were discounted by 50% but they should not have been sold as new units."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Almeida",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T22:16:31.000Z",
          "Titre": "Rip off",
          "Contenu": "I have e bought a JBL charger 4 and they sent me an used item; it was supposed to be white color and I got all dirty, yellowish color."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T20:32:58.000Z",
          "Titre": "Customer service terrible",
          "Contenu": "I recently ordered a Bose smart speaker from here. The speaker arrived in in excellent condition however there was a problem with the speaker. I called to speak with the service and tech team. I was told that due to me not having the box which is required to maintain through out the stores warranty period, I had to pay a 15%restock fee and also pay for shipping. I asked how is this and I was told that an email went out shortly after I ordered the product that I needed to keep the box. I looked at all emails from WWS and not a word spoken about eh box.  Also I was told the the manufacturer tracked the product and box. I called Bose directly and they questioned as to why the box was required. Bose said it doesn’t matter what box the product is in when the repair shop receives it in as long as the they receive the product. Bose also charged no shipping or fees to fix their product. Bose definitely stand behind their product!  I was planning on purchasing more Bose speakers from here but due to this last interaction I will be taking my business directly from Bose!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JULIE HOGAN",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T00:44:07.000Z",
          "Titre": "Nice speaker...shipping not so much! 🙄",
          "Contenu": "Nice speaker as Polk Audio always is! Problem is that you guys didn’t double pack the box which was received in terrible condition."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xin Zheng",
          "Nb_Reviews": 1,
          "Date": "2015-11-07T04:27:07.189Z",
          "Titre": "They cancel my order for no reason",
          "Contenu": "They cancel my order coz I don't want to make change on second time, and I forced to make change my order on first time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Gebhardt",
          "Nb_Reviews": 3,
          "Date": "2020-09-02T22:58:36.000Z",
          "Titre": "The wrong item cams and no one is…",
          "Contenu": "The wrong item cams and no one is replying to me. Can someone please call me at 520-483-1310?  Thx"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blake Zou",
          "Nb_Reviews": 1,
          "Date": "2014-06-21T18:21:33.000Z",
          "Titre": "Item was defective",
          "Contenu": "Bluetooth don't work, volume is too low. The bottom adjust volume don't work. Totally unsatisfied"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Les Staley",
          "Nb_Reviews": 1,
          "Date": "2016-12-14T23:03:35.000Z",
          "Titre": "A stereo subwoofer needs a grill cover to look right!",
          "Contenu": "A few weeks ago I purchase a home subwoofer as a gift.  When I opened the box (to make sure it was not damaged),  it had no cover for the speaker (yes it is supposed to have one and I pulled it completely out of the box to make sure it wasn't in there).  I called on four different days,  each time I was told they would call me back later that day after they contacted the Manufacturer.  The return phones calls never came.  On the 4th phone call (calls were at least two days apart each time)  a guy I spoke with once again said he would get a hold or the Manufacturer and see if he could get one.  He said if not,  I could simply return it.  The answer I expected as a customer was,  I'll get one sent out to you immediately and you'll have it in a few days.  The guy's I spoke with were always kind and never rude but the phone calls back never happened.  It has been over a week now with no grill cover and no phone call back.  This is a Christmas gift and it was a good deal.  Unfortunately the only other one I considered was no longer on sale (Black Friday pricing).  Now I'm stuck with either spending a lot more money on a similar item since the sales are off or give a gift missing parts that does not look right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Hill",
          "Nb_Reviews": 2,
          "Date": "2019-09-29T22:17:50.000Z",
          "Titre": "ear phones were not what i expect tried…",
          "Contenu": "ear phones were not what i expect tried them 3 times not to my satisfaction wast of money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PATRICIA DENIS",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T14:20:38.000Z",
          "Titre": "Did not order",
          "Contenu": "Did not order - email hacked & your firm accepted a charge not authorized"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evermore",
          "Nb_Reviews": 1,
          "Date": "2015-08-14T12:15:33.345Z",
          "Titre": "Speaker sounded worse than an old Ford AM radio!",
          "Contenu": "Have emailed them on how to return but no reply yet.  Have a phone no. now so will try that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARK SPREITZER",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T18:14:09.000Z",
          "Titre": "Item arrived damaged",
          "Contenu": "Item arrived damaged. Reported to customer service.Waiting on next steps."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PAVEL EPSHTEIN",
          "Nb_Reviews": 2,
          "Date": "2019-09-08T04:22:27.000Z",
          "Titre": "Will never buy from them again because of their horrible customer service",
          "Contenu": "Bought from them Dynaudio Xeo2 speakers with the hub to connect speakers to computer. Didn’t realize I also need another remote for everything to work, as the one which comes with he speakers does not work with the hub. Well, I needed this new remote ASAP, so I overnighted it. It arrived damaged. I contacted them, they told me to start the return process and only then they will overnight the replacement; even though the damage was NOT my fault, and I provided video to prove it. Well, it’s been few days since I sent the broken one, but have yet to hear from them. Haven’t received any emails with the new overnight tracking yet. So I’ve had the new speakers for about 2 weeks now, but still can’t use them yet because of that stupid remote. If you can, avoid these guys. If you have to deal with them, then, like in my case, you don’t have a choice.P.S. Turns out the remote I had received initially was not the way you’re supposed to receive it from the manufacturer. It was just a naked remote without batteries - not even in its box! I asked them how could this have ever happen, don’t they see what they put in a box to be shipped to a customer?! Their answer was “we don’t know”.P.P.S. Eventually I received my remote, although going through their unprofessional representative on the phone only added to my unpleasant experience with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OSCAR MALPICA",
          "Nb_Reviews": 1,
          "Date": "2019-02-20T00:13:20.000Z",
          "Titre": "I'm not happy",
          "Contenu": "I'm not happy, My package didn't arrive and they don't want to help me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lil Tigga",
          "Nb_Reviews": 11,
          "Date": "2021-09-17T19:27:28.000Z",
          "Titre": "I’m still waiting on my headphones",
          "Contenu": "I’m still waiting on my headphones. I have yet to receive them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LAWRENCE COVEL",
          "Nb_Reviews": 2,
          "Date": "2020-03-27T09:02:15.000Z",
          "Titre": "The node 2i sucked",
          "Contenu": "The node 2i sucked. Doesn't work as advertised. Unfortunately"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WILSON MOJICA",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T19:51:36.000Z",
          "Titre": "4 days past arrive date",
          "Contenu": "Took 4 days past arrive date. Still haven't received product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JUSTIN LUFFMAN",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T19:48:33.000Z",
          "Titre": "Speaker was damaged and they handed me…",
          "Contenu": "Speaker was damaged and they handed me off to manufacturer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William John",
          "Nb_Reviews": 3,
          "Date": "2021-09-14T13:17:03.000Z",
          "Titre": "They cancelled order frequently.",
          "Contenu": "They cancelled order frequently.Not reliable store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J D DETREMPE",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T23:53:30.000Z",
          "Titre": "I have been given no information…",
          "Contenu": "I have been given no information regarding my shipment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jammer",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T19:39:50.000Z",
          "Titre": "Got a used scratched speaker instead of…",
          "Contenu": "Got a used scratched speaker instead of a new one!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ariel Zhao",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T20:20:52.000Z",
          "Titre": "My order have been cancelled by World…",
          "Contenu": "My order have been cancelled by World Wide Stereo."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ELLEN ROSENBERG",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T16:17:45.000Z",
          "Titre": "Having trouble returning the purchase"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Parker",
          "Nb_Reviews": 1,
          "Date": "2017-01-25T14:21:09.550Z",
          "Titre": "Filing a Better Biz Bureau complaint next.",
          "Contenu": "On December 29, I ordered (by phone) the Reflect Mini BT Bluetooth Sports In-Ear Headphones.I was told that it would be $50.10.  I specifically told the guy I wanted these cordless Bluetooth headphones as I use them in my business & I have to be able to walk around while on the phone.He shipped me the wired JBL Reflect Mini In-Ear Headphones with In-Line Mic instead - which I can't use.After I received them I looked online - trying to make sense of what they'd done & found this ad which I screen-captured - which I can't seem to post here.I found, an ad for the \"wired\" headphones they \"erroneously\" sent & they were on sale for only $39.55.  So even though I didn't want these, if I had wanted them - they were hosing me on the price at $50.10.Nonetheless, they sent me the wrong ones so I called & the guy (who after much discussion and weasel-ly attempts to the contrary) said he'd give me a Return Authorization for a full refund & email me a label.  I also did a screen-shot of it & the Label's tracking info which I couldn't copy here.I sent the product back promptly - on 1/5/17.By the way, I went over to my local FedEx location and spoke with a guy there who I always deal with.  He told me that FedEx picked up the package at the post office where I dropped it and delivered it to another post office in PA.  They have no way to track it beyond their drop-off.  I believe I've done everything I could have in this case to comply with World Wide Stereo's RMA requirements can't get back my money from these people.  They conveniently keep saying they haven't received my returned product back yet.  Since they sent the label to me, how is that my fault?Next stop, Better Business Bureau, Social Media, then Amazon.Steve Parker"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LUIS MONTANO",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T20:13:58.000Z",
          "Titre": "New in box!??..... not really sure.",
          "Contenu": "Received item with three parts missing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mariusz Stark",
          "Nb_Reviews": 3,
          "Date": "2019-12-25T20:56:47.000Z",
          "Titre": "Great service and communication",
          "Contenu": "Great service and communication."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MICHAEL VOREL-WALKER",
          "Nb_Reviews": 1,
          "Date": "2018-12-10T19:40:20.000Z",
          "Titre": "I still don't have my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LESLIE CLARK",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T19:04:20.000Z",
          "Titre": "Never received my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SHENIQUE BETHEA",
          "Nb_Reviews": 1,
          "Date": "2019-12-26T19:17:39.000Z",
          "Titre": "Never received package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHRISTIAN COLE",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T21:43:16.000Z",
          "Titre": "Never got delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ERNEST BATTLE",
          "Nb_Reviews": 1,
          "Date": "2018-01-23T05:37:29.000Z",
          "Titre": "Not reliable service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NARESH KONDURU",
          "Nb_Reviews": 1,
          "Date": "2018-12-05T19:19:07.000Z",
          "Titre": "Planning to return"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAMES STEWART",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T20:43:41.000Z",
          "Titre": "Good experience at first....",
          "Contenu": "In this review I want to give credit where credit is due, so I'll start outright by saying my initial experience with World Wide Stereo was quite good! During my process of shopping around for the home theater solution that was right for me, I spoke with lots of different sales people from lots of different stores and online retailers. I have to say, my conversations with worldwide stereo during this process were among the most enjoyable and helpful.I would even say that I was impressed with how quickly they shipped my home theater system to me. All said and done I think I got it in like three days.However, once I got the theater system set up, that's when I first experienced my first issue. Now, just so you know, the system I bought is legitimately a plug and play system--you really have to try to mess it up. Well, what happened was one of the rear surround speakers was defective. It never worked correctly from the get-go. The other identical rear speaker works beautifully. So I contacted worldwide stereo to get the problem taken care of. When I told them about the defective speaker, the first question I got asked was if I kept the box that it was shipped in. I quickly answered no. I never save packaging for items that I purchase, with the exception of Apple products because of their high resell value and because there's often things in the packaging that I might use later, like extra cords or chargers.Anyway, when I said that I did not have the original box, the customer service representative told me that they would have to charge me 15% for a restocking fee. I thought that was very unusual, as I do a lot of online shopping, including all kinds of purchases have electronics and speakers, etc. The representative went on to say that it's industry standard practice. I reminded the representative that were talking about a defective product. It's not that I didn't like the color or some thing--the product I paid for didn't work out of the box. The representative stated that that did not matter and provided me a link to the part of the website that explained returns and exchanges. I ended up reading the entire webpage, end it seems to indicate the defective items are handled differently than simple returns or exchanges. I still don't think their website makes it clear enough that when they sell defective products to customers that the customer is responsible to pay fees if they don't have all the original packaging. This is an absurd customer service practice. I quickly went to several of their competitor websites to review their return policy and found nothing like it. So much for an industry standard.That all took place on a Saturday, and then I got a call from them on Monday. The lady that called and spoke to me basically treated me like I was out of my mind for thinking that they should take care of everything in regards to getting a working product sent out to me. She was argumentative, and frequently cut me off while I was speaking. At one point I asked myself, am I a customer here that spent hundreds of dollars? She's treating me like I'm trying to rip them off, when in fact it was them that sold me a product that didn't work. I'm simply just asking for the product I paid for, and not be charged fees for a box. Are you kidding?I will not be spending another dollar at World Wide stereo. I will purchase directly through the manufacturer, or from another third-party."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WAYNE SIMPSON",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:11:55.000Z",
          "Titre": "The Onkyo DX-C390 arrived quickly",
          "Contenu": "The Onkyo DX-C390 arrived quickly, but there was an Amazon return label on top of the unit when I opened the box. I installed the unit anyway only to find out that the unit would not recognize any CD I tried to play. No wonder it was an Amazon return! I did get a return label without any hassle, but I am very disappointed in WWS's quality control."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lorna Dunbar",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:00:20.000Z",
          "Titre": "Coupon codes did not work",
          "Contenu": "Coupon codes did not workI ordered from you because I found great online coupon codes that were verified.  None of them worked.  I used the chat to find out that nothing, including the first time order coupon would work because the item was on sale.  I am completely irritated by that.  I have never dealt with a company that has a first time order discount that does not work.  It is unlikely I will order from your company again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOSEPH MICHAUD",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T15:09:15.000Z",
          "Titre": "No warning on lack of customer support for Sennheiser",
          "Contenu": "No customer support for Sennheiser. You guys should really tell folks prior to purchase who provides customer support and who does not. No ability to contact ANYONE at Sennheiser. I dropped $2,000 + on soundbar with a subwoofer and the Sub will not link to the Bar. That part isn't your problem I realize but I would think you'd want customers happy with the products they purchase through your company. Not again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Narinder Bhalla",
          "Nb_Reviews": 5,
          "Date": "2023-02-28T01:18:43.000Z",
          "Titre": "I think I received a recycled product",
          "Contenu": "I think I received a recycled product. I unfortunately did not recognize that until I had placed a static cleaning arm on the deck of the turntable, which is a stick on. The inside box in which the turntable was packed had the sealing tape cut, which should have been my first hint. The rest which raises the tonearm was all lose and I had to tighten it. There was a piece of felt glued onto the underside of the tonearm where it rests on the mechanism which raises it. This is not how it ships from the manufacturer,  I checked with them. Had I not attached the static cleaning arm, I would have returned the turntable. Very disappointed. I will neither order nor recommend this outfit to anyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CLIFFORD NYSTROM",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T00:15:15.000Z",
          "Titre": "I did not get speaker cables with my…",
          "Contenu": "I did not get speaker cables with my set so I had to use my old ones. Please send cables."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S.A.",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T16:52:49.000Z",
          "Titre": "Business seems unappreciated.",
          "Contenu": "Have spent thousands here in the last 8 months or so. I inquired about a pair of approx $3,000 headphones. I ended up ordering them online since the sales rep stopped responding to me over email. Granted, his away message said he was out until Tuesday, but it is now Thursday afternoon. This is a trend. Overall, I often order technology online because I don't feel that they prioritize or go out of their way to earn my business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NANCY COLLIER",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T23:09:54.000Z",
          "Titre": "Very poor packaging",
          "Contenu": "The headphones arrived and the box they are in was all beat up. It's been crushed and torn. These headphones are a birthday gift and it looks like they came from the leftover shelf at a discount store. I'm very disappointed and trying to figure out how to make them look like a new gift, which they are.Too much money spent for this frustration."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BRYAN MOORE",
          "Nb_Reviews": 4,
          "Date": "2020-03-09T19:52:31.000Z",
          "Titre": "The good and the bad",
          "Contenu": "The good: they’re good for rock or contemporary Christian music.The bad: doesn’t stay charged as advertised, only 8-10 hours and that’s on medium volume.The base chargers do not hold the cord in them and it takes 5 minutes to get the charger cord to stay in them.Not as loud as I thought they would beNot enough bass for Reggae music.I’m going to return them"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GEORGE C",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T20:41:07.000Z",
          "Titre": "Significant shipping delays",
          "Contenu": "My order qualified for complimentary 2-day shipping, which is nice.  However, the order took about two weeks to arrive with no updates from USPS except that the package will be delivered late.  It was not urgent for me to get the delivery in 2 days, but the shipping information should have been much more accurate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DEREK SIMPKINS",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T04:56:02.000Z",
          "Titre": "I called and was put on hold to be…",
          "Contenu": "I called and was put on hold to be transferred to an expert but my call was put back in the que and went someone picked up the phone they hung up on me! And I'm very unhappy about my call because I have been having a problem with my speakers since I received them!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DAVID KOCH",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T21:09:04.000Z",
          "Titre": "I purchased a receiver with speakers…",
          "Contenu": "I purchased a receiver with speakers that were supposedly a good match as a package deal.I turn up the stereo to about 75 (which is pretty loud...) and the speakers start to crackle and pop.  I expected the speakers to be able to handle all the power that the receiver could deliver.This is NOT what I would call a good match of speakers to receiver.This would be more a mediocre pairing to poor pairing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2019-07-12T19:25:28.000Z",
          "Titre": "Wrong speaker sent. Long exchange process.",
          "Contenu": "Sending the wrong speaker first off, was a really bad start. Then having me ship back the speakers with ground shipping, which will take at least  week. Now I’m having to wait until the return(because of their mistake) is accepted and another 1-2 days on top of that till it’s shipped, plus whatever time it takes to actually get here. It’s been a week since I first ordered the speakers and will probably have to wait another week before it gets here. So, I’d say it’s not the best customer service, so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2021-02-22T00:55:34.000Z",
          "Titre": "I was not impressed with the last…",
          "Contenu": "I was not impressed with the last transaction.  It's still setting out there and I'am not sure what to do. I was dealing with Patrick @ x422 but he was not avail Monday (pres) day.  The person who took my call was so so.  Needs some help with customers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANTHONY",
          "Nb_Reviews": 1,
          "Date": "2019-01-14T19:24:31.000Z",
          "Titre": "Poorly Identified Item",
          "Contenu": "The parts I ordered from you are incorrectly shown on your website. The verbiage difference is so slight (Sonos One vs. Sonos Play One), that I couldn’t tell from the description alone, so I went by the picture, which was/is wrong. Disappointed that your website is wrong, which caused confusion."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Nicola Saraceno",
          "Nb_Reviews": 1,
          "Date": "2013-12-23T10:56:53.000Z",
          "Titre": "Good assortment, deals - service below amz",
          "Contenu": "Bought a home theater attracted by a good deal (15% cheaper than amazon).\rNeeded to cancel the order just few minutes after paying but they didn't allow me.\rshipment arrived in 4 different dates, lateat of which 15 days after order, and had to stay home to collect.\rnext time I'll stick to amazon prime no matter the saving..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TRAVIS SCHUH",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T19:36:44.000Z",
          "Titre": "I received the product and turned it on…",
          "Contenu": "I received the product and turned it on and it didn't work. I reached out for a replacement and they didn't have one for me. Told me to reach out directly to the manufacturer. Overall experience was poor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "oopoily",
          "Nb_Reviews": 1,
          "Date": "2016-08-31T21:28:50.000Z",
          "Titre": "I got my headphones, although the control button is glitchy.",
          "Contenu": "The headphones right out of the box worked okay, but I noticed the control button did not work right. Now, if my shirt barely touches the button my headphones make an awfully loud clicking noise. I wish I didn't throw away the box before using them..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Osmar jr Perez",
          "Nb_Reviews": 1,
          "Date": "2015-08-12T03:39:47.598Z",
          "Titre": "read my review",
          "Contenu": "My speaker sounds great but when it comes to how long it lasts I feel lied to. They said it would last five hours on a Bluetooth connection but only lasts about two. And when I use the auxiliary input it only lasts three hours when they said ten ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "STEVEN LUCAS",
          "Nb_Reviews": 2,
          "Date": "2021-03-14T15:19:51.000Z",
          "Titre": "I received a USED unit",
          "Contenu": "I received a USED unit! Fortunately, aside from some scratches and broken packing material, it seems to be working properly. Unfortunately, we will not be using World Wide Stereo for any future purchases."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T22:36:51.000Z",
          "Titre": "Terrible customer support",
          "Contenu": "The TV arrived as expected, but I did not receive the extended warranty I purchased. Customer service is terrible. No answer to my query via email and no live person on telephone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DENNIS LYNN",
          "Nb_Reviews": 2,
          "Date": "2021-03-11T20:05:31.000Z",
          "Titre": "The boxes items came in was damaged",
          "Contenu": "The boxes items came in was damaged. Some pieces were damaged. Was not worth sending back. Just fixed what I could. Customer service was not helpful. Limiting my purchases in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RICH S.",
          "Nb_Reviews": 1,
          "Date": "2016-11-04T18:40:32.000Z",
          "Titre": "Took too long to get here",
          "Contenu": "Took too long to get here - there was a mixup and when we caught it they just resent it without upgrading the shipping to next day or even 2nd day. That means we waited twice as long as we should have!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KHALID JAVED",
          "Nb_Reviews": 2,
          "Date": "2017-06-12T17:27:34.000Z",
          "Titre": "My set is not working properly.",
          "Contenu": "My set is not working properly.Left side sound is so weak and no bass.Right side is working perfect.I need to return this.How to process for return.I like this set look and color is so good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JAIME STACKPOLE",
          "Nb_Reviews": 1,
          "Date": "2018-11-30T19:31:24.000Z",
          "Titre": "Good products, bad shipping",
          "Contenu": "The website works fine, and I haven’t spoken to anyone in customer service because I don’t know what they’ll do to correct the issue; but, I was fairly unsatisfied with how the product arrived. They do not ship the Bose wireless headphones in a box, they opt to use cheaper envelopes. I’m sure it’s fine for some items, but when I pay $200 for some wireless Bose headphones and get a package that is not in good condition because of the packaging, I am nothing less than disappointed. The box for the headphones was essentially bent in half (not quite in half but clearly bent), the headphones and case but scratched a bit. The headphones are great, but the charging case not. I probably wouldn’t order from them again just because I expect to have my product arrive looking new."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda Rossow",
          "Nb_Reviews": 2,
          "Date": "2014-06-20T11:58:23.000Z",
          "Titre": "I have not received the product & received no response to my inquiry for status!",
          "Contenu": "I have not received the item I ordered and paid for.  Further, I have not received a response to my inquiry for status on delivery. I will no longer purchase over the internet!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Margalynne Armstrong",
          "Nb_Reviews": 11,
          "Date": "2023-01-03T00:38:45.000Z",
          "Titre": "Late shipment",
          "Contenu": "Arrived after Christmas despite representations it would arrive earlier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JIANQIANG WANG",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T19:25:39.000Z",
          "Titre": "Poor packaging and color stain",
          "Contenu": "slow shipping, poor packaging, and the product has minor color stain (the stylus of the turntable that I received got some red color stain on it)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MICHAEL DANAHER",
          "Nb_Reviews": 3,
          "Date": "2019-12-25T20:40:15.000Z",
          "Titre": "The products seem good so far",
          "Contenu": "The products seem good so far, but customer service is not good.  Called in for help and was told I'd receive a call the next day.  Still waiting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2014-05-13T22:09:34.000Z",
          "Titre": "Good, BUT",
          "Contenu": "WWStereo uses UPS, who destroyed the piece of equipment on delivery. WWS were initially very helpful, and immediately offered a replacement, organized the return etc.. However, the replacement was out of stock, so a new one had to be ordered from the manufacturer. I was told it \"should be in by xth of the month\" (around one week later). A further week after xth of the month, I rang WWS customer service and asked what was going on, I was told \"it might even be in the warehouse now\" and, contradictorily, \"we'll call you when the replacement's ready for delivery\". Almost a week later, still no news, I get the feeling that I'm being spun a line and that delivery could be age away. But, I was offered the refund, and declined, that said, based on the \"it should be in by xth of the month\", but will give it another week or so, then chase down that refund I think."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RONNIE SUPELANA",
          "Nb_Reviews": 2,
          "Date": "2019-05-21T16:29:52.000Z",
          "Titre": "I ordered a Yamaha Aventage RX-A880 and…",
          "Contenu": "I ordered a Yamaha Aventage RX-A880 and received  it yesterday. My daughter received it. When I got home I saw the AVR on it original packaging that was dirty and slightly damaged. I immediately open it to check on the AVR, I was disappointed to see that one of the wifi antenna was damage. I replaced it with my router antenna which look the same then test if the AVR work. Luckily it does. I want to complain about it but I read about other customers bad experienced with your customer service. Your company courier, in this case Fedex, is not good.  I saw it on my security camera that the Fedex delivery guy just drop it on the front door without care before knocking on the door. I hope that you take an extra care on any fragile order by placing it on a box not just ship it as it is. I have ordered online several time with other vendors, e.g. B&H, they place all orders on a B&H box and they really put extra care on their delivery. I don't recommend this online vendor specially when ordering fragile items."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chuck Krause",
          "Nb_Reviews": 6,
          "Date": "2016-10-22T14:57:34.000Z",
          "Titre": "Wrong color",
          "Contenu": "The web site shows a white Heos battery pack but says Black. I ordered a black one and got a white one. Not satisfactory."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MING LEI",
          "Nb_Reviews": 1,
          "Date": "2018-12-31T20:30:44.000Z",
          "Titre": "I bought one PXC 480 headphone on World Wide Stereo",
          "Contenu": "I bought one PXC 480 headphone on December 3rd. It actually had the trouble engaging the various stages of the NoiseGard active noise cancellation feature. To be precise, the multi-function switch cannot be set to “IT”. That is to say, I cannot leave the switch in the position of \"IT\", and I have to keep it with my finger all the time when I am on the phone. I do not think that it is normal and there's nothing wrong with this headphone. As so far, the problem have not been solved. At least, I have not received any reply even though I have returned it to them.  At the same time, When I feedback the problem to the seller, I have no idea why they can not deal with this immediately. And they told me they were willing to re-ship a new one until they received the headphone I returned. Why they cannot deal with the problem while they receive the feedback of problem from customer? So, the problem of item from seller have to be borne by customer and make customer have to wait for more time? The seller cannot deal with the problem immediately? One month passed, I did not get any reply. At the same time, it also delayed my use due to their distrust of their customers, I think."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MATTHEW MARSHALL",
          "Nb_Reviews": 1,
          "Date": "2016-12-09T17:34:03.000Z",
          "Titre": "Good price, fast delivery, bad service",
          "Contenu": "I saw an ad for some v400 speakers on sale for Black Friday. I've never heard of Korus before, but the speakers sounded perfect for my mother who was getting tired of dealing with WiFi and BT connection problems with her Bose and then Sonos. The Korus speakers have SKAA signals which sounded to be much more user friendly. At the sale price that they were,I couldn't pass it up. I ordered 4 speakers that came in pretty quickly and they sounded so good that I order 4 more. The initial salesman said that the micro-USB dongles were not included and if I called Korus directly, then they would send me some at no cost. I tried calling and emails and couldn't get a response from Korus and then called World Wide back to see if they could help. The next salesman told me that he would call Korus and get back to me. I didn't hear back for a few days and called again. They said they are still trying and give them a little longer. I never heard back from them. Don't tell me something just to get a sale that was never going to happen. I finally got in touch with Korus and they couldn't believe that World Wide was telling their customers that they would send out those dongles at no cost. Anyway, the speakers sound great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CORBETT ARDIS",
          "Nb_Reviews": 2,
          "Date": "2020-08-18T20:37:12.000Z",
          "Titre": "Processing and delivery six. Product is great",
          "Contenu": "Ordered on Saturday delivered next day for $91 didn’t receive the unit until Wednesday!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SRIKANTH PARATALA",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T22:55:45.000Z",
          "Titre": "I’m unhappy for long waiting time for…",
          "Contenu": "I’m unhappy for long waiting time for the delivery of the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kal",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T19:15:19.000Z",
          "Titre": "Damaged speaker",
          "Contenu": "Speaker arrived damaged and had to be returned"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick G",
          "Nb_Reviews": 3,
          "Date": "2017-11-23T20:06:03.000Z",
          "Titre": "I ordered 11/16 and it’s still not here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "VS",
          "Nb_Reviews": 2,
          "Date": "2020-12-24T16:42:31.000Z",
          "Titre": "Order Cancelled Without Explanation",
          "Contenu": "I had an order cancelled by WWS for apparently no reason. As I read through the Trustpilot reviews, I see multiple people experiencing the same problem with WWS. I'm now one of many. The similarities:* Placed an order for a not-inexpensive item ($900).* Order is cancelled the next day, for no apparent reason.* I logged into my bank, and the transaction shows as having been fully processed -- i.e., it's not in a \"pending\" state, but is in with other fully executed transactions.* Called WWS Customer Service (CS), who said that she can't see (in her system) why the bank cancelled the transaction, but that it's in a pending state at the bank, and will \"drop off shortly\" -- and that I need to contact my bank to find out what happened. - I informed her that the transaction was not in a pending state, but rather has been fully processed, and so won't be \"dropping off\" without further action. - She replied that WWS will process a reversal on the transaction, and I will see a credit. Okay, fine -- but that means the bank didn't reject it, right? - She tells me (again) that I need to contact my bank to find out what happened. - She states that the purchase cannot be reinstated, I will have to go in and place a new order, and recommends that I use Amazon or PayPal to make the payment next time. (That's not a problem, but I want to understand WHAT HAPPENED. I'm an engineer; we need to do a root-cause analysis before trying the same experiment again.)* So I called the bank, who confirmed that the transaction has been fully processed, \"the vendor has the money from this transaction,\" and that there is no issue from the bank's end. (Minor note: two weeks earlier, I'd tried this same transaction at WWS and the bank DID reject that purchase, because it was a \"new vendor that I'd never done business with before.\" They put in an approval for this vendor, and a couple of weeks later I went back and processed the order I'm speaking about here.)* I called WWS CS back, and was told that \"credit card orders can be rejected for any number of reasons -- address problems and phone number problems are two very common reasons for orders being rejected.\" I have neither of those -- the address is correct, same address for billing and shipping, phone number is correct, all the planets are aligned. - I told him that there was no problem with the order at the bank's end, and that the bank says that the vendor has the money for this transaction. - He then acknowledges that it was WWS who cancelled the order, not the bank (this is the first time that WWS actually acknowledged that THEY cancelled the order -- which means that my call to the bank was a waste of my time, and the bank's time). He assured me that a reversal on the credit card transaction will be done \"immediately.\" (I'll be checking on that...) - I asked why WWS cancelled the order, and was told that they have the prerogative to cancel any order they want, but that I can place a new order and use Amazon or PayPal to check out. - I don't disagree that the vendor can cancel any order it wants, but I also want to know on what basis was my order cancelled. I'm told that, for my protection, they can't tell me that. (And again, I can't disagree with the \"for your protection\"; they have no idea whether the person they're talking to really is the credit card owner. So, no issue there.) - I informed him that an order being cancelled for no apparent reason does not build confidence that a second order will be processed correctly, and that I will need to go to another vendor. He replied that he understood my reason for wanting to go elsewhere; I think he might have even preferred that outcome for some reason.The people I talked with -- the operator and two CS people -- were all very nice. I did feel that I got a bit of a run-around by first telling me that I need to contact my bank to find out what happened, and then later being told that it really was WWS who cancelled the order.What really troubles me here -- and the reason I decided to post this review (and in this level of detail) -- is that the experiences of several other reviewers on here were nearly identical to mine: WWS blames the bank or credit card, but these are credit cards that have been used for years and are working fine elsewhere. WWS gives no explanation for the mysterious cancellations. WWS recommends placing a new order and using Amazon or PayPal.In a way, I feel I am lucky, as I also see there are numerous cases of late deliveries on products (although the shippers are also running late these days as a result of COVID) as well as delivered products that are somehow damaged or discolored. This is a gift, so I obviously want it to be in \"giftable condition\" when it arrives. I placed a new order directly from the manufacturer, rather than from WWS.I'll update this review as I get more information...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:49:29.000Z",
          "Titre": "Panasonic UB-90001K",
          "Contenu": "Item shipped quickly. My concern is that the Panasonic UB-90001K is heavy (17 lbs) and was shipped in the manufacture's box. The item arrived in good shape but the tape on one side of the box had split. Given the weight of the player, it wouldn't take much more for it to fall out of the box. Heavy and valuable items should be double-boxed to survive the rigors of a UPS journey."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SANDRA MCMAHON",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:47:48.000Z",
          "Titre": "No response to phone and inadequate response to email.",
          "Contenu": "Both my husband and I called several times and never got a call back. The tv we got was broken though the box was fine. Took several pictures. Their solution was for us to junk it or they could pick it up then we would have to wait until they got it back and they will send us a new one and close the invoice. What if the next tv is broke as well?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CHRISTOPHER AUSURA",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T21:24:46.000Z",
          "Titre": "Product was exactly as ordered",
          "Contenu": "Product was exactly as ordered.  Would have given 5 stars, but the stylus was packed into a box that was about 20x the size of the stylus box with zero packing material to keep it from getting beat during shipping.  Fortunately, I received it without apparent damage thanks to the Ortofon packaging being sturdy but for a $110 piece of electronics I’d assume some care would be taken to ensure it wasn’t damaged during shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arron Huang",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T19:39:53.000Z",
          "Titre": "Do not order here if you’re from Hawaii",
          "Contenu": "Do not order here if you’re from Hawaii… Order shipped within two days. I price matched from Amazon and got about $300 off, which was a great deal. Anyways, I don’t know if it’s just my location but there was something wrong with my shipment after it got to the first destination. There was some sort of “hazardous material irregularity” coming from UPS. This has not happened before when ordering ANYTHING from any website whatsoever. I’m not sure if it’s the way they packaged it, but you should avoid this website if you’re from Hawaii and are thinking of ordering a sound bar from this website. Also, I did not receive an update email from them regarding the incident and I had to call/chat with them to see what was going on. The only thing they could do was refund to my original payment method."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KEVIN BLACK",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T23:25:04.000Z",
          "Titre": "When product arrived it didn't work",
          "Contenu": "When product arrived it didn't work. Return response was quick and easy. They returned money and I can order another one if I want to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "COLLIN BROWN",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T21:13:15.000Z",
          "Titre": "AVR received did not operate properly",
          "Contenu": "AVR received did not operate properly. Some channels bad so having to return the unit"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WILLIAM BAIRD",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T02:19:40.000Z",
          "Titre": "Not a great experience",
          "Contenu": "I was happy with the short amount of time it took to get the product to me.  However, WWS was unable to help me sync my new Sonos Five speaker with the rest of my system.  I had to call Sonos for help with that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STEVEN FUKANAGA",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T21:34:53.000Z",
          "Titre": "Disappointed with Shipping",
          "Contenu": "The product order is fine... but a little disappointed with shipping... I paid for 2nd Day Air... and still received product 6 days later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EHT",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T20:39:41.000Z",
          "Titre": "you need to disclose your shipping policies UPFRONT",
          "Contenu": "Was not aware that a signature was required for my delivery from you, so fed ex would not leave it at my residence and I had to drive 45 minutes out of my way to the fed ex hub to pick up the receiver. Either that or deal with a annoyed customer for not showing up with their receiver. Will probably not buy from you again as a result."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAWN",
          "Nb_Reviews": 1,
          "Date": "2020-07-31T21:08:03.000Z",
          "Titre": "I placed my order on a Thursday night…",
          "Contenu": "I placed my order on a Thursday night and paid for next day shipping. Product didn't arrive until Monday. Called them and they would give me the money I paid for next day because they said it was next day. Any other company when I ask for next day it would have been there at least by Sat. Won't buy from this company again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TOM AMBROSE",
          "Nb_Reviews": 3,
          "Date": "2019-07-06T02:38:54.000Z",
          "Titre": "I wish I had known it was a demo unit",
          "Contenu": "I bought the product and it was a good price with the coupon code. It shipped quickly and arrived sooner than expected. The product was a demo. It had a sicker on the back indicating that.  It looked to be in excellent condition, but when ordering, there was no indication of it being a demo. Also , the power cord was very short...like 18 inches or less. I’m still not sure if the product normally ships this way or if it was the result of it being a demo."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TRENT WAGLER",
          "Nb_Reviews": 2,
          "Date": "2018-12-20T15:09:43.000Z",
          "Titre": "Sonos/record player bundle Instructions",
          "Contenu": "Hey guys, the bundle you sold was exactly what I was looking for: Sonos Play5 with a record player that has a built-in preamp. However, I would request that brief instructions that talk about how to setup your line-in gain on Sonos would be helpful. This might be something to follow up with Sonos about, but it took more internet sleuthing than I’m used to to figure out how to finally get sound out of the record player. Thanks!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ROBERT ROSS",
          "Nb_Reviews": 2,
          "Date": "2019-01-22T03:22:39.000Z",
          "Titre": "Great price but no delivery service communication",
          "Contenu": "Great price, very fast delivery but no communication regarding the specifics of the delivery which meant i missed the fist delivery attempt by FED EX. Also, one of the speakers was delivered in a significantly damaged container. There does not appear to be any issue with the speaker but I hesitate to have something shipped from WWStereo in the future as i believe the damaged shipper for the speaker may have come directly from your warehouse."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BOBBY JOHNSON",
          "Nb_Reviews": 1,
          "Date": "2019-02-07T16:10:54.000Z",
          "Titre": "I order JBL headphones Order…",
          "Contenu": "I order JBL headphones Order Conf-WWSA81E83D07. I was impressed with the ease of the purchase and the delivery time was excellent. That being said the headphones aren’t working properly. I contacted WWS and they referred me to JBL customer services. Which is turning out to be a dead end. I wasn’t looking for a refund, I wanted operational help or a replacement. I spent $76.21. I’m starting to get the feeling that this is a loss and a lesson learned."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DP_NJ",
          "Nb_Reviews": 11,
          "Date": "2021-01-14T19:10:05.000Z",
          "Titre": "I felt that the response from Ira was not what I expected.",
          "Contenu": "I felt that the response from the \"Manager\" Ira was a bit unprofessional and could have been handled with more compassion and eagerness to help a loyal customer. At the end of the conversation, I agreed to the low-balled discount only because I did not want to continue the back and forth. To think this is a \"manager\" of WWS is quite concerning, as I never had any other representative talk to me like this in the past. Even in his emails, there were a lot of grammatical errors and misspellings, which trigger a lot of doubt for future purchases."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K Campbell",
          "Nb_Reviews": 1,
          "Date": "2018-09-26T12:14:28.000Z",
          "Titre": "I was disappointed that it didn’t…",
          "Contenu": "I was disappointed that it didn’t specify ALL of the “extras” that are needed to make the radio work correctly. You made it seem like you just switch it out and it would be good to go-not even close. You need to buy things for the steering wheel controls, antennas, RES, satellite radio, etc. Maybe everyone else knows this except me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AROON MANKAD",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T19:10:52.000Z",
          "Titre": "Customer Service is excellent prior to sales but not so great once purchase is completed.",
          "Contenu": "Customer Service is excellent.  If an article is purchased from the store then the store should provide the services for the set up. Overal great service but when requested to help in setting up the tone are of the recently purchased turn table, I was asked to pay 75 dollars to set up the turn table."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID ZAPATA",
          "Nb_Reviews": 1,
          "Date": "2018-08-28T23:53:18.000Z",
          "Titre": "Well,my order was sent in 2 parts by 2…",
          "Contenu": "Well,my order was sent in 2 parts by 2 different carriers. The turntable was sent FedEx and arrived just fine,was left at my apartment complex office (as all my online perches are)The second part ,my serio receiver was sent UPS and was left at my front doorstep where it could of easily been stolen, I didn't get home until 9:30 that night,luckily it was still there..This was a package deal order(turntable/receiver combo) why did they send this by 2 different carriers??? 😠"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alberto Lorenzo",
          "Nb_Reviews": 3,
          "Date": "2015-01-02T15:26:42.000Z",
          "Titre": "Not received item missed Christmas",
          "Contenu": "Not at all happy with World Wide Stereo or their shipping company Ship by Air ordered item on 12/18 and on 12/31 still do not have the item.\r 1-2-15 Update I received the speakers today and they had left me a message on 12/29 so good job by the shipper by World Wide should have told me it would not make it before christmas. Also the price was higher than at Quill.com"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2017-01-08T21:26:42.888Z",
          "Titre": "Very slow shipping",
          "Contenu": "I placed my order on December 30 and is not scheduled for delivery until January 9, I do understand that there was a holiday within that time period, however I do think that 5 business days for delivery from Philadelphia to Cleveland is totally unacceptable. I would think twice about ordering anything from World Wide Stereo in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JANET WASKOW",
          "Nb_Reviews": 1,
          "Date": "2018-12-12T13:53:03.000Z",
          "Titre": "No order information AT ALL.",
          "Contenu": "I shopped with you through ebates to get my credit.  My sale has not been credited to ebates and I cannot get the credit as I never received my order number.  I never received a confirmation or shipping information from you.  There was not a receipt in the box or any information.  I am a little concerned as if for any reason I need to return or exchange these - you have given me no receipt.  This is a gift for my husband.  SO for the above reasons, I am not sure I would shop with you again.  This is the first confirmation I have receieved from you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JONATHAN LUPO",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T01:14:35.000Z",
          "Titre": "Product hasn't arrived yet.",
          "Contenu": "Now, the tracking info removed the delivery date! It was supposed to be delivered today. Yesterday it said it was going to be delivered yesterday. Now, proposed delivery date has been removed!! What’s up?>> Product hasn't arrived yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RONALD BOIRE",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T20:10:11.000Z",
          "Titre": "The access door to the receiver I…",
          "Contenu": "The access door to the receiver I purchased is broken it won't close. The audio installer I hired to hook up my surround sound system try to fix it but was afraid he was gonna do more damage. I am otherwise happy with the sound and all the bells and whistles."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2014-08-31T18:04:35.000Z",
          "Titre": "Great price, complicated set up",
          "Contenu": "We have been looking for a sound bar for a while and couldn't pass up this great deal, $100 for a $400 sound bar.  We ordered it online and it came in a reasonable amount of time.  It has been really complicated hooking it up, it needed a special connector that we bought for $12, and we still can't figure out how to set it to use with our TV remote.  We already called once for help and their customer service was very helpful.  I guess you get what you pay for and hopefully we'll eventually figure out how to set it up right!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANGIE AVILA",
          "Nb_Reviews": 1,
          "Date": "2018-08-16T19:25:45.000Z",
          "Titre": "I like the products I received but....",
          "Contenu": "I like the products I received but I'm unhappy that I received a silver turntable instead of a black one.  I decided not to switch it because I don't want to go through the whole return process. The silver isn't so bad, it's growing on me.  You should probably tell your shipping and receiving department to double check the order before sending.  It clearly says black in parenthesis. As for the receiver, I'm happy with it and I really like the blue tooth.  My speakers are pretty awesome as well, very loud and clear.  All in all I'm happy with my new products. Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LEE SCOTT",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T19:51:05.000Z",
          "Titre": "good price slow shipping.",
          "Contenu": "Cartridge was a great price. Shipping was very slow. Shipping from Pennsylvania to South Carolina took 1 week. I received another item I ordered from California in less time. Would have expected it within 3-4 days being on the east coast and shipping with FedEx."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bikeshipper",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T14:09:17.000Z",
          "Titre": "They shipped my expensive turntable…",
          "Contenu": "They shipped my expensive turntable like it was a box of used diapers..No packing materials and then when I called to voice my concerns they were rude."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Cummings Harold",
          "Nb_Reviews": 11,
          "Date": "2021-01-17T18:39:45.000Z",
          "Titre": "Speedy help and remarkable viability",
          "Contenu": "Speedy help and remarkable viability! I've been truly amped up for the projects I saw a couple of days prior. However I have a ton of issues now, or probably I am completely happy with their administrations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer reed",
          "Nb_Reviews": 1,
          "Date": "2014-10-12T13:27:23.000Z",
          "Titre": "bluetooth speaker",
          "Contenu": "Dealing with trust point was very easy, although my gripe is with the sound quality of the speaker. Sound quality was nothing compared to what the advertisement said, also the Bluetooth was not even compatible with my android device (nexus x)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cyndi from Cali",
          "Nb_Reviews": 1,
          "Date": "2014-08-26T23:58:31.000Z",
          "Titre": "Difficulty Ordering",
          "Contenu": "I am a frequent online shopper but I had trouble figuring out how to place my order. It kept bringing me to other products I wasn't looking to buy. After the third try, I finally got what I wanted. Great product though! Awesome price too!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MRA",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T21:51:08.000Z",
          "Titre": "Never had an issue with these guys but now...damaged goods",
          "Contenu": "Never had an issue with these guys, always delivered on time, no fuss-no muss. However on the last item I ordered, the Rega Neo PSU, the packaging was...meh... at best. It basically consisted of 2 bags of air And the item in a MUCH larger box. Needles to say the Neo PSU was jostled in every which direction and did sustain some damage to the front lower left hand corner of the face. I had to unscrew the face off and attempt to bend the corner back into a somewhat straight position, didn’t have much luck. The back side of the unit also sustained similar damage.I did not return it as it’s functional albeit damaged and needed a phono stage ASAP. I hope that future orders will come securely packed as they always have..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SM",
          "Nb_Reviews": 1,
          "Date": "2017-11-02T17:45:28.000Z",
          "Titre": "Would be 5 stars but the item was …",
          "Contenu": "Would be 5 stars but the item was shipped fedex who shipped it from north wales (about 3-5 miles from my house) to Maryland then West Virginia, then Allentown. Seems like a weird route and took almost 5 days to reach me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TANESHA MOSLEY",
          "Nb_Reviews": 1,
          "Date": "2017-12-28T20:52:15.000Z",
          "Titre": "I was expecting wireless headphones",
          "Contenu": "I was expecting wireless headphones. But I received headphones with wires. This may have been an oversight on my part but I specifically requested wireless, bluetooth headphones when I was looking through the website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HAWAH BROWN",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T23:29:36.000Z",
          "Titre": "It is okay!",
          "Contenu": "Was not compatible with my iPhone had to pay $40 to ship it back plus $60 to upgrade to one that was compatible. The description did not say that it wasn't compatible. Wasn't as loud as I hoped but it has to do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T14:02:02.000Z",
          "Titre": "Little to no discount with no…",
          "Contenu": "Little to no discount with no flexibility of payment method. Shipping time was less than expected and the item arrived in mint condition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TRAVIS",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T22:22:48.000Z",
          "Titre": "Arrived Broken, Thrown Through Hoops",
          "Contenu": "When I received my speakers, most of the boxes were damaged but only one speaker was damaged. However when I contacted WWS about this, they required me to take photos that I couldn't possibly take, including how the speaker was originally packaged when it was delivered -- I took the speakers out of the box and noticed damage, so obviously I cannot obtain a photo of how something arrived when I've taken it out of the box to inspect it. It felt like WWS was trying to pressure me into accepting a 75$ refund, which for 350$ speakers seems unacceptable and of course I am going to try and send the photos and exchange my speaker for one that doesn't have a gaping puncture on the side. But otherwise my experience was great! Fair prices, quick shipping, and customer service responded in 24 hours."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-07-25T14:16:20.000Z",
          "Titre": "Just because the item took forever to…",
          "Contenu": "Just because the item took forever to deliver to my house .....and then when I finally got them I thought it would’ve been a pair of speakers in the box they sent me one speaker....1 speaker"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANTHONY CONGELOSI",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T21:54:12.000Z",
          "Titre": "Ordering process was great",
          "Contenu": "Ordering process was great. As of this date I have not received my order. It is somewhere in the US postal system with no delivery date, might want to consider not using the USPS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BRoberts",
          "Nb_Reviews": 1,
          "Date": "2014-09-27T03:37:22.000Z",
          "Titre": "Bradsdeals.com does it again.",
          "Contenu": "I saw the deal on Bradsdeals.com and then searched the item and was very happy with the price and ordered it right away, my daughter loves the item and my son is mad I did not get him one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID WOODWARD",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T19:07:45.000Z",
          "Titre": "I paid $83 for overnight shipping and…",
          "Contenu": "I paid $83 for overnight shipping and it took 4 days for me to receive it. I gave this feedback on your website and received no response. Pretty disappointed to be ignored."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NEGRON",
          "Nb_Reviews": 2,
          "Date": "2019-12-07T20:48:14.000Z",
          "Titre": "Box came damaged and it was missing the…",
          "Contenu": "Box came damaged and it was missing the missing brackets . Customer service wanted me to return entire package then wait a few days for a new package/soundbar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANANYA RAY",
          "Nb_Reviews": 1,
          "Date": "2019-12-03T16:43:03.000Z",
          "Titre": "I got the item",
          "Contenu": "I got the item. But i did not get any email with order confirmation and shipping details when i placed the order. It may be a problem if I wish to return item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JEFF",
          "Nb_Reviews": 1,
          "Date": "2016-07-21T13:34:41.000Z",
          "Titre": "Delivery",
          "Contenu": "The speaker was left outside of my house. There was a rain storm and the box was completely soaked through. Luckily the speaker was wrapped in plastic, which saved it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GARY FORREST",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T19:13:46.000Z",
          "Titre": "I would have been a lot happier if…",
          "Contenu": "I would have been a lot happier if everything needed was suggested or told you will also need these things. Other than that it was a good experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2014-11-13T12:31:33.000Z",
          "Titre": "Good product, fast shipping, Masterpass Checkout not working",
          "Contenu": "I like the product and the shipping was lightning fast.  However Masterpass Checkout was not working only at this site, so it wasn't a Masterpass issue itself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T16:09:28.000Z",
          "Titre": "Okay",
          "Contenu": "Some boxes from my order were obviously preopened, or factory recertified, but everything works so far. Also, some items were not shipped in a shipping box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-11-01T18:35:41.000Z",
          "Titre": "Sent 2 pairs instead of 1.",
          "Contenu": "They sent me 2 pairs of speakers instead of 1. The cost and aggravation of sending them back I decided even though I didn't need. Them to keep them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy Jeter",
          "Nb_Reviews": 1,
          "Date": "2014-11-14T14:09:59.000Z",
          "Titre": "good service, but the items was not as great as I expected.",
          "Contenu": "ordered ear buds for my teenagers, 2 in fact, they were not as good as advertisement lead me to believe, still using them but disappointed in product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Li",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T22:40:26.000Z",
          "Titre": "Ordering it alone is too much work",
          "Contenu": "Ordering it alone is too much work. They always cancel the orders. Also noticed feedback whenever I increase the volume."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 2,
          "Date": "2018-06-12T23:25:52.000Z",
          "Titre": "4/5 items shipped from my order",
          "Contenu": "4/5 items shipped from my order, areceiver and speaker system.  I was expecting all items at once and then realized that a tower speaker was not delivered. I called support, they told me that the item was shipping from another warehouse on the west cost and will delivered on the 15th. I relayed that I spoke to the person handling my order the day before items shipped and he told me that all items were in stock in the local warehouse and the expected ship date. I asked cs why I did not get any information on the missing item from the shipment. They could not provide me with an answer. I was surprised that WWS does have a notification system in place for this type of a situation. Employees that answer the phones are not rude, but are not pleasant, they give the impression that they do not want to answer the phone and help customers. I did received my missing speaker yesterday. This was not a good experience for me and WWS. I hope this helps your company's progress."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JONATHAN LAWSON",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T20:31:09.000Z",
          "Titre": "Parts need to be specified",
          "Contenu": "Still needed an additional part that they didn’t mention after I called and told them my vehicle, vehicle type, and vehicle trim."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fooled Me Once",
          "Nb_Reviews": 1,
          "Date": "2014-08-26T20:01:49.000Z",
          "Titre": "Bait and Switch- Updated- Energy is owned by Klipsch",
          "Contenu": "Link was for a Klipsch 2.1 sound bar. Order was placed, paid with Paypal, received no order update showing items had been ordered, only Paypal receipt. The item that arrived 4 days later was an Energy 2.1 Sound bar.\rWent to website once order was received and looked up order number on packing list, and according to their records the item that was ordered was an Energy sound bar. No recourse on my part.  Oh well....lesson learned\r ****Update****\rSince posting this review, I was contacted by a Emily C. from wwstereo and she has explained the advertising link I used to access their site was setup by a third party. She also explained the reason for confusion is that Energy is a subsidiary of Klipsch. She offered for a representative to contact me from Klipsch if I had any concerns about the quality of the product I received. I refused the offer as I am satisfied with the quality of the product I received, I just felt like it was not as advertised, again by a third party. So I am updating my rating solely because wwstereo cared enough to contact me promptly to address any concerns. I will consider ordering from them in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANDRE BELLAMY",
          "Nb_Reviews": 1,
          "Date": "2019-06-25T23:44:44.000Z",
          "Titre": "Shipping speed was good but the…",
          "Contenu": "Shipping speed was good but the condition of the box that the product came in was in very poor condition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ADAM LUKE",
          "Nb_Reviews": 1,
          "Date": "2019-09-09T19:51:02.000Z",
          "Titre": "Shipping Woes",
          "Contenu": "Products were great, but the shipping experience was a bit of a nightmare.  The order consisted of three items, two of which shipped from Pennsylvania, arrived via FedEx Freight earlier without any issues.  The third item shipped from California.  A delay with FedEx picking up the package resulted in the delivery date being moved from Thursday to Friday before Labor Day.  The delivery address is a Call Center for my company and handles FedEx Freight and Express shipments all day.  Since the package shipped as Home Delivery, it didn't get delivered with our daily Freight or Express runs.  The driver made a false claim that he made an unsuccessful delivery attempt at 5:20.  I called FedEx and made arrangments for another attempt on Tuesday after Labor Day via FedEx Freight.  Despite this, the package was delivered on Saturday and left unsecured at the drop-off location.  I appreciate that World Wide Stereo is not responsible for FedEx's lack of professionalism and failure to follow instructions.  However, the choice to ship my item as Home Delivery resulted in the package not arriving along with the regular deliveries that Friday.  Communication and consideration would have gone a long way to mitigate the hassle I had to go through just to receive my item.Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LaineyCustomer",
          "Nb_Reviews": 3,
          "Date": "2015-12-14T17:31:28.000Z",
          "Titre": "The earbuds",
          "Contenu": "The earbuds were not like what was pictured on news 12 for New York.  Am somewhat disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JOVICA OPACIC",
          "Nb_Reviews": 1,
          "Date": "2016-11-22T19:28:49.000Z",
          "Titre": "An OK online shopping experience",
          "Contenu": "Placed an order for a 65\" 4k tv. I received a confirmation email which stated that i would get my tracking number shortly. The tracking number that was provided was incorrect based on the destination of that package. I ended up making three attempts to get the updated tracking information. When the television arrived, i was going to do my inspection. The driver told me that my inspection instructions were incorrect, and that i just needed to sign the paperwork. I disagreed, so he made a phone call to his manager. Seems like there is miscommunication between the shipping company and World Wide Stereo.  Third issue was that the tv was damaged at the corner. That was very disappointing. I did notify the customer service of World Wide Stereo. This time around they were very helpful with my issue. The communication was clear, and the issue was resolved.  I did receive a new tv the following week without any issues. The driver did not know that he had to pick up the damaged tv until he called his supervisor. World Wide Stereo really did try to fix the issue, and worked with me so that i would be satisfied with my purchase. Few things kept me from writing a better rating. Maybe my experience with World wide Stereo might be better next time IF i decide to buy more items for my entertainment room."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Doucette",
          "Nb_Reviews": 1,
          "Date": "2014-12-15T16:49:47.000Z",
          "Titre": "Sorry",
          "Contenu": "The earbuds were stolen from my front door before I could even listen to them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George J. Sliney",
          "Nb_Reviews": 2,
          "Date": "2014-12-16T14:56:11.000Z",
          "Titre": "Experience OK",
          "Contenu": "Experience was OK as you met your stated policies, but no wow factor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jag",
          "Nb_Reviews": 1,
          "Date": "2019-07-20T18:47:30.000Z",
          "Titre": "Good Service",
          "Contenu": "Good Service, but did not follow-up on applying 5% of first buy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JON PRICE",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T19:43:49.000Z",
          "Titre": "scratch/chip",
          "Contenu": "After unpacking I noticed a chip/scratch on the mount"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CESAR OLAVARRIA",
          "Nb_Reviews": 1,
          "Date": "2019-07-20T02:07:40.000Z",
          "Titre": "the items took along time to receive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SABIN RUSSELL",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:55:22.000Z",
          "Titre": "Delivery was prompt for cross country",
          "Contenu": "Delivery was prompt for cross country. Might have been wise to require a signature to avoid porch pirates, but wasn't a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert Godown",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T16:34:03.000Z",
          "Titre": "Where's the Owners Manual…",
          "Contenu": "Although it seemed that everything a non-refurbished versus (brand new) unit would include, was contained in the shipping box, I realized the 326-page Owner's Manual was not. I guess when you receive a big discount, you might expect that, but it would have been nice if that was mentioned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William W",
          "Nb_Reviews": 6,
          "Date": "2023-11-25T17:13:42.000Z",
          "Titre": "The shopping was easy on your site",
          "Contenu": "The shopping was easy on your site, I was just disappointed that you do not offer all of the Marantz home theater amps. I purchased a pre-processor but now I have to use a different company to order my amp. I wish I could have gotten everything from you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHON PLATE",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T21:15:49.000Z",
          "Titre": "All n all experience was good",
          "Contenu": "All n all experience was good. I love the klipsch rc64 and it showed up in perfect condition.   I did however see the same speaker on sale for 1300 something a couple days later I should have waited.. thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J I",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:38:54.000Z",
          "Titre": "Good advice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Buck Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T03:29:16.000Z",
          "Titre": "I spoke with Mark",
          "Contenu": "I spoke with Mark. Ordering my product was fast and simple. I wasn’t planning on making a purchase and I just had some questions. But mark was able to make a sale. Great work mark. Three days later UPS attempted to deliver my product. I did not receive my product because UPS arrived when no one was home and a signature was required. Now I must wait another three days to get my package. Not happy, but I do understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Humberto Bravo",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T04:03:07.000Z",
          "Titre": "Really easy transaction",
          "Contenu": "Really easy transaction, their customer service representative was very helpful willing to assist"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fredtt",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T18:30:14.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, dvd player arrived as stated. The only problem, wish it would have shipped in another carton as the original carton was damaged, but the dvd player was not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KENNETH SCHOLL",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T06:40:17.000Z",
          "Titre": "denon xvrx6700h factory reconditioned",
          "Contenu": "The reciever is great, vthe remote has much more cosmetic damage than i expected.  This was a factory reconditioned unit.  I have reached out to denon about buying a new remote."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHAD SUTTLES",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T21:23:42.000Z",
          "Titre": "Great product,great sound just not my style.",
          "Contenu": "The customer service was great! Very fast delivery, product was as expected. I will be shopping with WWS I'm the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ckrate",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:30:09.000Z",
          "Titre": "Arrived in a timely fashion",
          "Contenu": "Arrived in a timely fashion - ordered Sunday arrived Tuesday . You actually had the cable I needed. Free shipping was nice too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Summers",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:24:40.000Z",
          "Titre": "The order was very easy as I did it all…",
          "Contenu": "The order was very easy as I did it all on line."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MIKE BUTTERFIELD",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T21:35:24.000Z",
          "Titre": "Well I haven’t received my turntable…",
          "Contenu": "Well I haven’t received my turntable yet so I can’t comment on how well you’ve done"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Meador",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T21:41:43.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, good price for the product and the Sonos Beam is great. I did get a Phishing email from”DHL” right before you sent me the real delivery email. I contacted DHL and gave them the information they needed. Thanks for have a good website with lots of information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DARRIN CAMPBELL",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T22:50:04.000Z",
          "Titre": "Service and knowledge was excellent",
          "Contenu": "Service and knowledge was excellent, just my speaker box's had holes in them, and possibly been opened before, I know it's not you guys it's the shipping company, I haven't even opened them yet just been to busy working, other than that all was good 👍😊."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Spence",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T14:19:50.000Z",
          "Titre": "Did not ship when it was supposed to",
          "Contenu": "Did not ship when it was supposed to, it was a day late. When paying extra for faster shipping it is expected to be shipped on time. Fortunately it wasn't a major issue so I will not ding them too badly. Everything else was as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Slutter",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T22:03:00.000Z",
          "Titre": "Chris from car installation made a full…",
          "Contenu": "Chris from car installation made a full speaker and sub quote for me. He was informative and knowledgeable about what he was talking about. I decided to just do the head unit and front camera. The whole system was a little out of my price range."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Schulz",
          "Nb_Reviews": 2,
          "Date": "2022-02-21T22:44:34.000Z",
          "Titre": "I found the amplifier I was looking for…",
          "Contenu": "I found the amplifier I was looking for at a good price refurbished from a company that gave a guarantee and free shipping. So far it’s working great and I’m very pleased with it the only thing I don’t like is they didn’t give a manual with it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOSHUA BOUCHARD",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T19:11:32.000Z",
          "Titre": "Generally pleased with my experience",
          "Contenu": "Generally pleased with my experience. The only issue was on the carrier's side: packages came in from both UPS and Fedex and therefore didn't come on the same day/time and Fedex was delayed by several days while never giving a specific delivery time and requiring a signature. It meant that I spent a whole day at home waiting for a package that ended up being delayed at the last possible moment. However, once everyone got to me, it was in perfect condition, well-packaged, and functional.I'll very likely use WWS again, in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rana",
          "Nb_Reviews": 2,
          "Date": "2021-02-01T21:34:05.000Z",
          "Titre": "product great!",
          "Contenu": "product great!your service excellent!packaging for transit - oopsunit showed up in very bright white SONY box on the front step all day for all to see.By luck I had passed by during lunch hour and nabbed it my self.You shipped fedex - that's what you get.....fedex around here leaves a little to be desired.next time use UPS!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GARY",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T18:28:05.000Z",
          "Titre": "Easy groovin",
          "Contenu": "Quick Shipping, easy interface and website design, product overview videos for just about every product I looked at (was honestly impressed with that), and it shipped and delivered fairly quick too.I honestly have to say that there wasn't a whole lot that was exceptional about my experience, but I can't help but know that in the future, this is the only store that I plan on buying audio gear from.Thanks a bunch, guys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TONIYA BLACK",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T16:02:26.000Z",
          "Titre": "Got here very quickly",
          "Contenu": "Got here very quickly. My boyfriend loves it. Only issue is that it would not work when we got it. We saw a review on Amazon where someone had to open the subwoofer to reconnect a wire that came loose. My boyfriend got up at 6am to go to lowes to get a T15 torx bit to open it up and once it was reconnected, it worked perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BRANDON FARFARAS",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T01:24:57.000Z",
          "Titre": "Everything was fine but the…",
          "Contenu": "Everything was fine but the interconnect selection to go with my UB9000 and Azur 851N network streamer. I am brand agnostic and believe most of audio quest is snake oil pricing when  Actual science is used to determine their claims. Just wish you had other quality but reasonable priced interconnects."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KEITH",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T19:25:40.000Z",
          "Titre": "The detail for the products was very…",
          "Contenu": "The detail for the products was very good. I was worried about the compatibility of the TV and sound bar. The offering of a TV with a recommended sound bar was helpful. The cost for the pair had a steep discount. Not sure if it was a deal, but I felt good about it. This was better than a Best Buy experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LAUREN",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T13:04:31.000Z",
          "Titre": "Check out was easy and pricing was on…",
          "Contenu": "Check out was easy and pricing was on point! We only have about half of it set up and WOW is it nice! Shipping was fast, but the boxes arrived damaged. The box with the sub definitely got wet...at this time does not seem to be any damage to the sub. There were also metal pieces sticking out of the other boxes....which was weird because I don't know where they cake from. One of the taller speakers had some minor surface damage from one of the metal pieces....but these are probably issues to take up with fedex"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Michelson",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T14:23:01.000Z",
          "Titre": "competitive prices & good customer support",
          "Contenu": "My first purchase was supposed to come with a 5% discount at checkout. It wasn't applying so I opened up the customer support tab and asked my question. They confirmed my cart qualified for the discount, but were not able to fix it viz internet chat. They gave me their customer support number to call to resolve the issue. Although it was a slower, tedious process, it all worked out eventually. Almost not worth the 5% savings, but overall, no serious complaints. The customer support was very nice, and what saved my review from being a 3 star review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CNY-Vinyl",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T19:32:48.000Z",
          "Titre": "Technics SL-1500 / Orotofon \"Red\"",
          "Contenu": "Turntable was sent out quickly and arrived undamaged.   Still needed to perform cartridge alignment.  Typically in brick-and-mortar store, this would typically be done for the customer.  I do have some qualms on the Turntable operation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. J.",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T03:18:09.000Z",
          "Titre": "Product was as advertised and delivered…",
          "Contenu": "Product was as advertised and delivered quickly. The box, which was not packaged inside another box, was left on my doorstep. The bottom had fallen out of it and foam packaging etc. Was falling out of the bottom. I took pictures. I'm not sure if this was a delivery issue or an original packing issue or other. I do think it should have been placed in another box for better shipping. Item seemed ok and seems to be working fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JohnM",
          "Nb_Reviews": 2,
          "Date": "2021-02-16T20:40:54.000Z",
          "Titre": "Marantz CD6007 purchase experience",
          "Contenu": "I purchased a Marantz CD6007 from you and the unit arrived late due to snow storms across the US.  But that is not why I have given you a \"4 Star\" review.  My reason for this score was due to the fact that you changed the price of the unit on me after I had asked to be notified when additional units were again back in stock.  That said, Crutchfield, who I typically purchase my stereo equipment from also raised their price by $100 as well.  Nonetheless, by me stating that I wanted to buy this unit from you at $499 I feel as though you should have honored that price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN MCKENZIE",
          "Nb_Reviews": 1,
          "Date": "2017-08-04T18:20:38.000Z",
          "Titre": "Great product and anybody who want's …",
          "Contenu": "Great product and anybody who want's remarkable sound quality, along with Volume it is the perfect choice. The ordering process and customer service was very good. The only drawback was, I wasn't informed that there would need to be somebody home to sign for the delivered merchandise. FedEx stood up with the dilemma and I was able to have it delivered  to Walgreens. I was then able pick it up after normal hours so it all worked out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Audioholic",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T06:21:12.000Z",
          "Titre": "Timely shipping, poor protective packaging",
          "Contenu": "Item arrived in a timely manner and was in good shape.  Protective packaging inside the box could have been much better.  Some limited bubble wrap on top of the product with nothing underneath or around the sides.  No real protection for a pretty expensive 4K BluRay player."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PATRICK CUNNINGHAM",
          "Nb_Reviews": 1,
          "Date": "2016-12-16T07:09:24.000Z",
          "Titre": "Nice website, well packed item, slow delivery.",
          "Contenu": "Everything was great--delivery was too long. I live in Nashville and my Tivoli radio was shipped about 250 miles southwest of here. Then rerouted via USPS to come that many miles back again. Sad that it was on a truck that passed my house ( approx 1 mile!) 3 days prior to delivery. Bad logistics.Otherwise all is good. Lovin my Tivoli and got it for best price on the net!Thanks guys just get better shipping options.Patrick"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2016-08-09T14:50:59.607Z",
          "Titre": "Great support for delivery problem",
          "Contenu": "When my order failed to show up I contacted Worldwide by email. Worldwide quickly discovered my order was returned to the warehouse by the shipper. In response, they shipped a replacement the same day and upgraded the delivery option at no cost. In spite of the delivery problem, I feel confident in doing business with Worldwide again based on the excellent support I received."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tcassette",
          "Nb_Reviews": 3,
          "Date": "2015-04-26T19:25:58.000Z",
          "Titre": "Great price and service, but...",
          "Contenu": "It would be less surprising if the website noted that the customer's credit card information will be verified by a phone call.  While I appreciate the caution with all of the fraudulent activities going on, I have never before had to talk to my credit card issuer and a WWS representative just to verify my information.  Other than that, this was a painless purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer Eddie R",
          "Nb_Reviews": 1,
          "Date": "2014-08-28T16:24:09.000Z",
          "Titre": "Quick Shipping",
          "Contenu": "great experience the only hiccup I had was the website it gave me an error message the first time I ordered ( no confirmation) but I did recieve an email shortly after that was the confirmation. also whoever they ship through wasn't very careful with my package as it had tears on the side of the box luckily the box was well insulated to handle all the bumps it must have taken."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DANIEL DOXTATOR",
          "Nb_Reviews": 2,
          "Date": "2019-08-20T12:20:43.000Z",
          "Titre": "A lot of neat stuff",
          "Contenu": "I like it you have Affirm makes the purchase easier I have a hard time moving around on your site it seems confusing but I endured it because you have products that I like and want I hope before Christmas I’ll get a different TV I like your selection That you have the latest products and technology"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DANIEL DOMANICO",
          "Nb_Reviews": 1,
          "Date": "2013-09-06T17:02:53.000Z",
          "Titre": "Great, nothing bad to say!",
          "Contenu": "The only reason I didn't given this a 5-star rating is because I haven't owned it for a long time yet, so I can't speak for it's long term durability. But other than that, great speaker with great sound. Perfect for trips to the beach or lake or even at home. The range is good for my uses (about 50 feet or so, it could be farther, I'm not that good with distances). Great speaker overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne G.",
          "Nb_Reviews": 1,
          "Date": "2014-03-12T17:30:24.000Z",
          "Titre": "They get it right!",
          "Contenu": "World wide stereo was the only vendor I could find online with a particular set of speaker stands. I was put on the notification list to get notified when they were available, but I never did get any notification. However, after checking the website periodically, I found them, ordered them, and they were shipped to me very quickly. I will use World Wide Stereo again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JACOB STANSFIELD",
          "Nb_Reviews": 1,
          "Date": "2019-05-28T07:19:56.000Z",
          "Titre": "This is my first major turntable…",
          "Contenu": "This is my first major turntable upgrade and World Wide Stereo offered many options to choose from. Most importantly their selection covered a wide price range. I’m comfortable knowing that I can start with an entry-mid level turntable and again upgrade my hi-to in the future. I’ll certainly be looking to World Wide Stereo for other system options and upgrades such as my speakers and amplifiers. All of their products include detailed descriptions detailing exactly what the consumer will be getting.Top marks for these guys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ncalos",
          "Nb_Reviews": 1,
          "Date": "2015-04-07T15:40:28.000Z",
          "Titre": "Discovered this Company",
          "Contenu": "Introduced to this company through a special buy program.  Links were easy to follow, ordering was a cinch...had a couple of hiccups with the application of sale code.  Other than that, purchase, delivery was non-eventful.  Tested items and worked with no problem.  I'm no electronics techie but they seemed to work with no problem.  Items would be used for future gifts. Browsed websites products and items looked worthy of further shopping scrutiny."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2014-04-21T22:32:36.000Z",
          "Titre": "Seems to care about customers",
          "Contenu": "I ordered a center channel but it was back ordered. There were so many orders the item was backordered. Even though I didn't get it in the time frame I thought I was going to get it, I did eventually get the item. the only thing I wish worldwide stereo would have done would be to give a discount or better shipping because of the delay.\rother than that the communication on the issue was great and I received the item later in perfect condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Chan",
          "Nb_Reviews": 1,
          "Date": "2014-11-12T14:46:16.000Z",
          "Titre": "Excellant service...so-so product",
          "Contenu": "Saw a set of Polk earbuds on sale...WAY below what my friend paid and what I've seen them advertised elsewhere for.  Order went smoothly and delivered when promised, but the sound quality on these are VERY disappointing.  I was expecting something at least in the ballpark with my Bose...these are not even close.  Live and learn I guess-"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GARY",
          "Nb_Reviews": 1,
          "Date": "2016-05-25T17:33:29.000Z",
          "Titre": "WWS did what they said and timely",
          "Contenu": "Smooth transaction from start to finish.  Only reservation was that I was told that my 65\" TV would be shipped on a secure pallet well protected.  When in fact the TV arrived without protection no pallet in just the standard shipping box..  With the TV traveling cross country by truck I am thankful there was no damage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LMO",
          "Nb_Reviews": 4,
          "Date": "2018-12-17T19:25:34.000Z",
          "Titre": "Really good first experience",
          "Contenu": "Service was great!  I didn't realize though that the cover didn't come with the Pro-Ject Vinyl washer and had to be purchased separately - would have been nice for that to have been clearer, I ended up having to order twice which is annoying (I can't remember if I paid for shipping twice also, but if so, that would have been worse too - would be great if it were more clearly integrated that you need to purchase the cover separately.  Otherwise, service on the site was great and the package arrived well!  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TRAFALGAR",
          "Nb_Reviews": 4,
          "Date": "2019-07-19T12:01:09.000Z",
          "Titre": "Expert Staff-Top Quality Products",
          "Contenu": "I could have purchased same product on Amazon for same price, but prefer to support local Brick&Mortar when I can.  Product arrived quickly and as expected. I also have the comfort of knowing if I have any issues with this product, WWS has a  very knowledgeable and helpful crew."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Pullmain",
          "Nb_Reviews": 2,
          "Date": "2019-12-02T23:09:59.000Z",
          "Titre": "your company was good fast delivery",
          "Contenu": "your company was good fast delivery.  would have been 5 star but found the item $50 cheaper after it was delivered.  I will be shopping around in the future as I have found on other items your prices are higher.   This is a xmas present so the package hasn't been opened."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOE NAVARRO",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T20:31:22.000Z",
          "Titre": "Ordering was super simple and had no…",
          "Contenu": "Ordering was super simple and had no issues. A little upset that shipping was inaccurate was supposed to be two business days. I have one that will arrive in on the correct date but the other one is delayed by two days which idk why if the product was in stock"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AMANDA SALYERS",
          "Nb_Reviews": 1,
          "Date": "2017-12-07T13:40:27.000Z",
          "Titre": "Easy ordering but rethink packaging",
          "Contenu": "Easy ordering, quick shipping, great customer service. I took a star off though because my item was shipped in the product box instead of a shipping box or some sort of wrap. Had I not picked it up from the post office due to a delivery miscommunication, my wife would have seen her Christmas gift sitting on the front porch with pictures all over it of the item. More importantly, any Scrooge stealing packages, which is very common these days, would have had an easy target seeing a sound bar box just sitting on the porch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lowtone",
          "Nb_Reviews": 1,
          "Date": "2017-02-17T13:00:45.000Z",
          "Titre": "new turntable",
          "Contenu": "The selling price and service from WWS was great. I called ahead to confirm the estimated delivery date since I knew I might be out of town later in the week. The only thing preventing me from rating this at 5 stars is that once I tracked the delivery, I found out that a signature was required. I had to quickly run home from work B4 FedEx showed up. If I had known this at the time of the order, I could have made other arrangements. The Project Carbon Debut turntable is a great product I am very happy with it so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dancer",
          "Nb_Reviews": 1,
          "Date": "2016-12-01T20:18:33.000Z",
          "Titre": "Good Customer service",
          "Contenu": "Product is as described. Delivery took longer and I had to call to find out what the hold up was. They did help get it delivered after a few phone calls. Price was within range of other companies and they are authorized dealers which makes a difference should you need Warrenty on your products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2021-11-11T01:50:38.000Z",
          "Titre": "Ordered a Sonos speaker says Center…Ordered a Sonos speaker says Center channel has damage and it’s been a few days and I haven’t gotten any response from them?!!",
          "Contenu": "Ordered a Sonos speaker says Center channel has damage and it’s been a few days and I haven’t gotten any response from them. Update World wide has sent return shipping label and my return in now being processed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David B.",
          "Nb_Reviews": 1,
          "Date": "2014-10-24T02:24:26.000Z",
          "Titre": "Product was exactly as described in description.",
          "Contenu": "Although I have bought these as a Christmas gift I have not had a chance to utilize the item to see if they hold up to the description and quality listed in the listing. But with the reviews that I have read about this item and it's quality I'm sure I will have no problems with this item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keet",
          "Nb_Reviews": 1,
          "Date": "2014-11-12T11:03:06.000Z",
          "Titre": "These headphones serve their purpose",
          "Contenu": "I bought these headphones after watching the \"Ways to save\"segment on my local news.  Ive6 used several headphones in the past that would fall out my ears so for the price and brand recognition I thought they were a good deal.  As for the sound quality, I guess it's good.  I feel like I've had cheaper pairs that sound just as good but nonetheless, they serve their purpose and I'm satisfied.  Let me add, I have not tried using all the earpieces as recommended and once I do that could change my opinion on the sound"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Momma Mia",
          "Nb_Reviews": 1,
          "Date": "2014-11-12T12:54:36.000Z",
          "Titre": "Small glitch with one of the orders but once called handled perfectly",
          "Contenu": "Shipping was fast, product received in excellent condition and the one tiny glitch in the ordering system and automatic email notification was cleared up with just one quick phone call where the Associate was kind and thorough.  No issues thereafter and product received very timely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN PRICE",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T20:43:49.000Z",
          "Titre": "The package arrived on time",
          "Contenu": "The package arrived on time, but the receiver could not switch input.  Called Yamaha and they gave me a list of authorized dealers and took it to one on the list and he was able to solve problem.  Other than that, I am satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Very Satisfied",
          "Nb_Reviews": 1,
          "Date": "2015-01-03T20:01:31.000Z",
          "Titre": "Great Service!",
          "Contenu": "Did some last-minute Christmas shopping with World-Wide (via ShopRunner). Somehow, I put the wrong delivery address and didn't realize it until a day or two later.\rI called customer service, but it was after hours. Tried again the next day and Ira, one of their associates, was very helpful.  He contacted FedEx and basically took care of everything. Followed up with me later that afternoon and also the next day. Needless to say, the gift arrived to the right address and, most importantly, it was still delivered ON-TIME. Great service, great experience!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edna",
          "Nb_Reviews": 3,
          "Date": "2021-05-13T02:51:31.000Z",
          "Titre": "I am having difficulty getting my music…",
          "Contenu": "I am having difficulty getting my music app to play on Sonos. I pay for Amazon music, have for a couple years, and will have to call Amazon customer service to see if it will work on this system. The sound is wonderful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trish D",
          "Nb_Reviews": 1,
          "Date": "2018-04-09T12:43:45.000Z",
          "Titre": "Good customer service after speaker arrived damaged.",
          "Contenu": "The package arrived with little packing around the speakers.  One speaker box was damaged and that speaker didn't work correctly.  WWS did arrange for the return of the damaged speaker and sent a replacement speaker at no cost, and this speaker worked fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris K.",
          "Nb_Reviews": 1,
          "Date": "2014-12-11T10:45:51.000Z",
          "Titre": "Very Good Experience",
          "Contenu": "Purchased an expensive home theater speaker system.  It was the best price I could find anywhere.  Shipping was prompt but one component didn't arrive with the rest.  Their customer service was easily reachable and very responsive.  The subwoofer arrived one day later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "patti",
          "Nb_Reviews": 1,
          "Date": "2015-02-16T14:43:33.000Z",
          "Titre": "great",
          "Contenu": "the product took awhile for me to figure out as the instructions, like most have more varieties for different languages than English .. as though English is being faded out ... after taking over a week to figure out the product is working good, overall good for the price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANITA PENDLETON-271",
          "Nb_Reviews": 1,
          "Date": "2019-04-04T21:57:58.000Z",
          "Titre": "Thought shipments said 2-3 days",
          "Contenu": "Thought shipments said 2-3 days. Ordered on 3-28 and got final packages on 4-3-19. Was not expecting order to be divided into 3 separate packages. Uneasy about that because more likely to be damaged/lost and then have hassle of getting replacements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff S",
          "Nb_Reviews": 2,
          "Date": "2020-11-06T22:16:24.000Z",
          "Titre": "My experience with my stereo purchase....",
          "Contenu": "I ordered a stereo system that I believe was very fairly priced. However, I would have liked to have had all of my speakers and components delivered at the same time by the same freight service, FedEx. I had to wait on several items to be delivered. UPS severely damaged a speaker that had to be replaced and I haven't received it yet, but it is on the way. I was disappointed that I wasn't able to listen to my favorite CDs on my birthday, as this system was a birthday gift to myself. I would suggest to World Wide Stereo to NEVER ship via UPS to anyone. Every item I have ever had delivered by UPS had been damaged. I will personally never use UPS to ship anything for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KIM",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T20:08:33.000Z",
          "Titre": "The out the on/off is not adequately…",
          "Contenu": "The out the on/off is not adequately described on the insert of \" how to\" a picture just doesn't do it. My headset is randomly turning off even after an adequate charge. Like the fit just wish it was easier to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROB",
          "Nb_Reviews": 1,
          "Date": "2016-05-31T12:39:19.000Z",
          "Titre": "Very nice experience",
          "Contenu": "I bought definitive technology sub woofer, bookshelf and center speakers.  All deliveries were on time, as expected.  The speakers were in good shape when delivered.  I haven't been able to hook them up because my house is not ready yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MATT charbs",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T17:41:03.000Z",
          "Titre": "Everything is great the klipsch sound…",
          "Contenu": "Everything is great the klipsch sound bar and subs are great , although I am super disappointed in the surrounding sound speakers , very weak, very quite just about useless unless I place them about a foot from my ears"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 6,
          "Date": "2022-06-06T23:17:41.000Z",
          "Titre": "So far so good other than one speaker…",
          "Contenu": "So far so good other than one speaker had been opened and although the speaker does seem fine, the owners manual and internal packaging very dirty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHAEL MUSGROVE",
          "Nb_Reviews": 1,
          "Date": "2017-03-13T14:50:15.000Z",
          "Titre": "Good price, slow shipping",
          "Contenu": "The item arrived in good shape and was a good price, but it took quite a while to arrive. Even when I received the request to leave this feedback, the email states: \"This email is sent automatically, therefore it is possible you have received this before your package or service. If this is the case, you are of course welcomed to wait until you have received your package or service before writing your review.\"If it were my company I'd focus on shipping. People are getting used to 2 day, free shipping. Or at least keep the customer more updated to the process of their shipment. If it's going to take some time, even relatively, explain why."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2014-12-18T10:21:05.000Z",
          "Titre": "Klipsch sound bar",
          "Contenu": "Quick service, only possible problem was that the box of speakers came in the original inside a larger box. Original box was damaged but it does not appear that the speakers were, will see how they work after Christmas though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VINCENT BAILEY",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T16:35:00.000Z",
          "Titre": "I am very satisfied with my purchase of…",
          "Contenu": "I am very satisfied with my purchase of the AfterShokz headset. It allows me to listen to my music and talk shows and still hear what is going on around me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JIM BURDICK",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T16:00:17.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices, good selection of products.  I did not know when my product was coming and did not receive a tracking number to let me know it was on the way, but it did come timely.  My wife loves it thus far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ALAN JOHNSON",
          "Nb_Reviews": 2,
          "Date": "2020-05-12T14:20:10.000Z",
          "Titre": "A gift for my wife",
          "Contenu": "It was a gift for my wife and she is out of town so I don't know how it is working for her. The charging case got here after she left so we will see. My experience with your company was a good one"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B  Gastin",
          "Nb_Reviews": 1,
          "Date": "2014-03-22T00:40:57.000Z",
          "Titre": "Excellent shopping experie",
          "Contenu": "This was my first visit to your site after seeing a number of daily deals posted on other sites for electronics gear. \r I purchased 2 DB headphones that were on sale.  Use of the website was quick and delivery was prompt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "peejaye",
          "Nb_Reviews": 2,
          "Date": "2019-06-14T02:24:48.000Z",
          "Titre": "Everything was delivered on time but…",
          "Contenu": "Everything was delivered on time! but there was some denting to the box because of the cheap FedEx bag that it was delivered and I was suggest packaging it better for delivery it is a pricey item thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "New Denon Owner",
          "Nb_Reviews": 1,
          "Date": "2019-04-02T15:41:46.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping, in fact a little too fast. I tried to cancel my order 20 mins after placing it, and was unsuccessful. But their CS rep was quick to respond and update me. Can't fault them for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHANDRA BENDER",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T10:36:51.000Z",
          "Titre": "Great Record Player",
          "Contenu": "I Love my new Purple Record Player. It has great sound to be so small. It's great for It's size. Will refer friends to buy your record player."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cory",
          "Nb_Reviews": 1,
          "Date": "2014-04-16T06:27:45.000Z",
          "Titre": "Completely Satisfied",
          "Contenu": "Was very pleased with my order. Easy order process and very quick delivery. Headphones were exactly what was described and packaged well. Thank You Much\r                                    Cory"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2014-11-13T19:36:39.000Z",
          "Titre": "good product would buy from again.",
          "Contenu": "Wws was easy checkout easy webpage. I would buy from again if the price on things I looked at were good deals like my headphones.  Shipping took a while but besides that a overall good site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MIKE RUIZ",
          "Nb_Reviews": 2,
          "Date": "2021-02-17T19:02:02.000Z",
          "Titre": "Pretty much everything was great",
          "Contenu": "Pretty much everything was great.  I did get my soundbar in white instead of the ordered black, but thankfully I actually like the white so it's not an issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VALERIE MILLER",
          "Nb_Reviews": 1,
          "Date": "2021-02-12T19:08:03.000Z",
          "Titre": "I Love my Klipsch Soundbar",
          "Contenu": "I love my Klipsch soundbar. The sound is super fantastic. The only thing that I can't figure out is how to stop the Klipsch remote from controlling the TV."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daryl P",
          "Nb_Reviews": 4,
          "Date": "2013-11-19T21:50:25.000Z",
          "Titre": "An awesome deal",
          "Contenu": "I bought these for my son who thought I would spend $200 for beats. Wasn't happening. So when I saw these advertised online I thought why not and thank goodness he loves em'."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "richard",
          "Nb_Reviews": 3,
          "Date": "2022-03-11T15:37:44.000Z",
          "Titre": "Informed seller",
          "Contenu": "The review you did on Sonos was very helpful, which led me to purchase from you.  Prices were very competitive and delivery was fast"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "1 customer",
          "Nb_Reviews": 1,
          "Date": "2016-08-17T00:16:39.809Z",
          "Titre": "Security",
          "Contenu": "The company was perfect an extra security protection made the purchase a little more  complicated but it's for the consumers own good so it was a  perfect  place to buy from"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID HOWELL",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T19:23:03.000Z",
          "Titre": "The purchase experience went very well",
          "Contenu": "The purchase experience went very well.  Easy to order and prompt delivery.  The order was shipped in the manufacturer’s packaging which arrived pretty beat up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason K",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T00:41:53.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy. Shipment took an interesting route, PA to MD back to PA to OH to MN and the to the West Coast. It got here and everything was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Rees",
          "Nb_Reviews": 1,
          "Date": "2014-12-30T22:19:25.000Z",
          "Titre": "Bulky item arrived fast with free shipping.",
          "Contenu": "Would have given 5 stars, but did not receive a confirmation email on my order until I asked for one.  Their response was very quick, as was the free delivery of the item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GLENN WONG",
          "Nb_Reviews": 3,
          "Date": "2019-12-30T17:20:23.000Z",
          "Titre": "Bought this as a gift for my nephew",
          "Contenu": "Bought this as a gift for my nephew.  I've got this ear bud myself and like it.  It only has 5 hour charge/use time.  Stays in the ear when out running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HARIJA YALAMANCHI",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T16:03:08.000Z",
          "Titre": "The prices and service was great",
          "Contenu": "The prices and service was great. One of our packages was delayed than original estimate but I assume that was on FedEx rather than world wide stereo"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DR NIVEDITA NIVEDITA",
          "Nb_Reviews": 1,
          "Date": "2017-01-27T14:56:49.000Z",
          "Titre": "Prompt delivery but the Yamaha box was torn.",
          "Contenu": "The item was delivered as promised. However, the Yamaha box containing the sound bar was damaged and torn at places. Per chance, the sound bar wasn't damaged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trak",
          "Nb_Reviews": 2,
          "Date": "2014-11-25T06:21:25.000Z",
          "Titre": "Great in the ear headphones",
          "Contenu": "So I bought a pair of Polk in the ear headphones.  This thing was great after trying out few ear pieces that come with the earphones.  Love it no complaints here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2014-06-01T19:02:36.000Z",
          "Titre": "Great audio gear..here!!",
          "Contenu": "These earbuds are just as advertised..sound great and a great price. I would recommend to  anybody. The service was great also. They arrived very quickly. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Beck",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T14:55:07.000Z",
          "Titre": "Great pricing, easy to use.",
          "Contenu": "Overall Experience is 4 stars. Would be 5 stars if received update on shipping. No shipping notification given and was delivered when not home due to no notice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GARRY TAYLOR",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T19:13:22.000Z",
          "Titre": "140 watts per channel  I thought  it…",
          "Contenu": "140 watts per channel  I thought  it would  have more of a punch I got a panasonic  100 watts has more punch but needed to update cause I a 4 k tu"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JULIO ARAMBULA",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T19:13:45.000Z",
          "Titre": "Where's the speaker wire?",
          "Contenu": "I bought a receiver and speaker package deal, but you didn't provide speaker wire. I had to go out and spend an additional $20 for speaker wire."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Hutman",
          "Nb_Reviews": 13,
          "Date": "2021-02-11T15:38:25.000Z",
          "Titre": "World Wide Stereo I helping me hook up…",
          "Contenu": "World Wide Stereo I helping me hook up a DAC to my system. They have great customer/Tech support staff. Really treat their customers well."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Ignat Kaverov",
          "Nb_Reviews": 3,
          "Date": "2020-09-28T23:35:19.000Z",
          "Titre": "I liked ordering on...",
          "Contenu": "I liked ordering on World Wide Stereo. It is a quality product, at nice prices. The delivery was fast, so I have nothing to complain about))"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROCKY ROYBAL",
          "Nb_Reviews": 1,
          "Date": "2020-03-14T03:35:39.000Z",
          "Titre": "First time with this company",
          "Contenu": "First time with this company.  Got the products with in 10 days. Not sure yet about the product have not had a chance to install it.  But soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CLIFFORD KONNERTH",
          "Nb_Reviews": 1,
          "Date": "2019-03-18T23:54:44.000Z",
          "Titre": "Good quality for a decent price",
          "Contenu": "Package stereo system was received within time promised. Easy set up and sounds great. Woulda given 5 stars if 50’ of speaker had been included ☺️"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RANDY CURREN",
          "Nb_Reviews": 2,
          "Date": "2019-10-04T19:05:48.000Z",
          "Titre": "Everything was delivered in great…",
          "Contenu": "Everything was delivered in great condition and sounds excellent, only thing was a little disappointed that speaker wire was not included."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Miriello",
          "Nb_Reviews": 2,
          "Date": "2021-01-05T23:13:01.000Z",
          "Titre": "Love Worldwide Stereo",
          "Contenu": "Love Worldwide Stereo.  Great company. Ira on live chat is greatly helpful and knowledgeable.  Excellent customer service skills"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kendrick Raydell Hardwell Sr",
          "Nb_Reviews": 3,
          "Date": "2019-06-10T22:38:32.000Z",
          "Titre": "Requested two day shipping for a wall…",
          "Contenu": "Requested two day shipping for a wall mount. It took about 4. Other than that everything was great. My Tv arrived sooner than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T11:57:49.000Z",
          "Titre": "Good for more that one usage",
          "Contenu": "I ordered the Sennheiser SoundProtex Plus Hearing Protection Earplugs with 3 Acoustic Filters because I was looking for some ear plugs that I could wear to a concert and also wear on my motorcycle. These were the only ones that came with more than one filter. The weather turned cold before I could get out on the bike, but I have a concert coming up and will be wearing them then."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheree Blakemore",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T23:57:48.000Z",
          "Titre": "Extraordinary!",
          "Contenu": "I wondered if the insulated food warmer that I ordered would arrive in time before our Christmas party. I called and spoke to Jennifer, who was so nice. She told me it would arrive within 3 days, much earlier than I expected. Great quality products! Excellent service!🤗"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:10:25.000Z",
          "Titre": "Shipping was fast and safe",
          "Contenu": "Shipping was fast and safely packaged.  Item was priced competitively.  The turntable is beautiful and exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T06:10:38.000Z",
          "Titre": "Speed of service and shipping + quality…",
          "Contenu": "Speed of service and shipping + quality of product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alonzo Castro",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T09:46:45.000Z",
          "Titre": "The whole process was hassle free",
          "Contenu": "The whole process was hassle free, I got the confirmation email as soon as It went out, I got the tracking number to feel at ease, the packaging was great, no damages to my product. Overall the process was peaceful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonard Kwiatkowski",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T01:09:13.000Z",
          "Titre": "Order handled on time and delivered as…",
          "Contenu": "Order handled on time and delivered as advertised. Hooked up moments ago and all is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth McRae",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:24:30.000Z",
          "Titre": "Fantastic",
          "Contenu": "We love our new Sonos speaker and subwoofer.  We received it very quickly.  We couldn’t be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soumya Banerji",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T22:05:59.000Z",
          "Titre": "Good shopping experience…",
          "Contenu": "Great range of audio equipment and knowledgeable staff. Items were delivered promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Norris",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T05:24:27.000Z",
          "Titre": "The best service of any company very…",
          "Contenu": "The best service of any company very quick delivery an good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer F",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T21:06:52.000Z",
          "Titre": "I could not have asked for a better…",
          "Contenu": "I could not have asked for a better transaction. The item shipped the same day I made the purchase. Exactly what I ordered and arrived on time. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TODD REYNOLDS",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T00:15:44.000Z",
          "Titre": "Customer service was great!!!",
          "Contenu": "Customer service was great, prices were great and delivery was fast and free. I would definitely recommend this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:38:47.000Z",
          "Titre": "I contacted World Wide Stereo to ask…",
          "Contenu": "I contacted World Wide Stereo to ask them their opinion on a receiver and amp I have. They told me it would sound amazing! I really appreciate their comment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Dichtl",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:18:55.000Z",
          "Titre": "I needed to replace my old Bose…",
          "Contenu": "I needed to replace my old Bose Acoustic Wave CD player that was on the way out.Since I have many CDs, I wasn't interested in just a streaming unit. Ira recommended the Onkyo 6 CD changer with a pair of Kanto YU6 speakers. They came today and I had it up and running in about 15 minutes.Everything sounds great and Ira's service was beyond excellent.Thank you so much for everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keifer Bell",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T05:26:50.000Z",
          "Titre": "Speedy shipping.",
          "Contenu": "Items came well packaged and within just a few days. No issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PATRICK",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:52:19.000Z",
          "Titre": "Everything went as well as expected",
          "Contenu": "Everything went as well as expected. I would definitely not hesitate to purchase from World Wide Stereo again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David LeComte",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T22:35:02.000Z",
          "Titre": "Everything was fine applied the…",
          "Contenu": "Everything was fine applied the discount that I didn't get before because of a price drop which I really appreciate it would do business again with your company thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don C",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:04:05.000Z",
          "Titre": "Great transaction",
          "Contenu": "A fair price, good communication, fast shipping, and product in perfect condition. What more can anyone ask for in a seller?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRANCY ROWE",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T03:32:19.000Z",
          "Titre": "Shipping was super fast- ordered on a…",
          "Contenu": "Shipping was super fast- ordered on a Friday and received my shipment on Monday!!! Selection is amazing- definitely be back to shop!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Branam",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T19:51:00.000Z",
          "Titre": "Great price for JBl Headphone's",
          "Contenu": "Great price for JBl Headphone's Fast shipping Very satisfied with the headphone's"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:05:08.000Z",
          "Titre": "Great price and fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Hess",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T21:14:06.000Z",
          "Titre": "Salesman spent almost a 1/2 hr on phone…",
          "Contenu": "Salesman spent almost a 1/2 hr on phone when I was looking and explained everything to me and never pushed me to less or more expensive receivers. Just explain the benefits of them all I believe his name was Collin and then I decided to make my purchase on a Tuesday. It was shipped immediately and I received it Wednesday. Excellent service. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CRM",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T18:56:50.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I recently purchased a set of relatively expensive speakers.  WWS delivered the speakers VERY quickly.  I actually had an issue with one of the speakers and Jennifer provided me with excellent customer service to resolve the issue, also very quickly.  Would absolutely buy from them again!  Thanks for the help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard R.",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T00:10:21.000Z",
          "Titre": "Definitely recommend World Wide Stereo",
          "Contenu": "World Wide Stereo is an authorized retailer for a specific speaker manufacturer I was searching to purchase online. Was offered a variety of options to choose from. All the products they sell are of higher quality and value. Great customer service and vary Fast Delivery!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Hermann",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T19:17:22.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Ross & Jeff did an outstanding job removing and installing the new stereo system in my truck. Ross brought to my attention that the break lights were not operating correctly and correctly the problem due to all of the old stereo wires. They went above & beyond in their profession. I highly recommend them and will be doing future business with them.  Thanks Joe & Linda"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Carpenter",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T19:07:58.000Z",
          "Titre": "Great Service. Great Products. Great Prices",
          "Contenu": "This company carries great products at great prices and ships very fast. I spoke to somebody at the company via chat regarding an order and also about some advice on some of their other speakers and headphones. They were very knowledgeable and helpful. I placed an order for some Klipsch speakers with them and accidentally ordered the wrong finish. I was able to send them back for replacement without any problems. This is a customer service-oriented business. So glad I found this company and I plan to place all of my future orders for stereo related gear through them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:07:09.000Z",
          "Titre": "Great experience overall",
          "Contenu": "The website was easy to navigate.  I immediately found the item I was looking for.  Very prompt shipment of the item, which I appreciate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Chapman",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:39:04.000Z",
          "Titre": "Great product selection",
          "Contenu": "Great product selection. Order was processed and shipped quickly. Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Pittman",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:32:45.000Z",
          "Titre": "Good Info & User friendly",
          "Contenu": "Website was easy to navigate and the company gave great information so we could make a good decision on our purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIKE JORGENSEN",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T02:37:27.000Z",
          "Titre": "Great customer service and great products",
          "Contenu": "I've done business with you guys several times and it's always been really good customer service is great products are great. I am still having issues with FedEx but that isn't your guys's fault. Overall I think you guys treat people very respectfully and seem to care"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Ian Goldberg",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T10:17:40.000Z",
          "Titre": "Unbelievably Fast Service",
          "Contenu": "I wanted an item (Audio-Technica Sound Burger) that was out of stock, and extremely hard to find at any other store, so I put the item on the convenient World Wide Stereo wait list. Sure enough, a few weeks later I received both an SMS and e-mail stating that the Sound Burger was in stock, so I ordered one.UNREAL: I placed an on-line order for the Sound Burger - with non-expedited free delivery - at 1:00 pm on July 31, 2023. I was shocked when the item arrived at my home at 10:30 am the following day -  less than 24 hours from when I placed the order!My purchase earned American Airlines AAdvantage miles, to boot... and I love the Sound Burger."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MR JASON SMITH",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T03:10:35.000Z",
          "Titre": "Very happy with purchase",
          "Contenu": "Planar 3 50th Anniv. Edition shipped and arrived promptly. It was well-packaged for shipping, and hence undamaged.Would definitely shop with World Wide Stereo again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Pittman",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T22:29:40.000Z",
          "Titre": "Best Home Theater Business",
          "Contenu": "I have only been able to enjoy World Wide Stereo through their online business but it is in a class of its own. Thoughtful information on endless products, at all price points, unbiased advice from helpful employees both through chat or email. I wish I lived in the area to visit the stores in person!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KARL HENCKEL",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T18:33:46.000Z",
          "Titre": "My experience with World Wide Stereo…",
          "Contenu": "My experience with World Wide Stereo has been very positive, they are most knowledgeable, professional and very pleasant to deal with. Ira the gentleman I've been dealing with is top notch. I'm glad I chose this company to get our stereo from and would highly recommend them to anyone and look forward to doing business with you in the future. Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bevier - SoundOrg — Rega",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:24:25.000Z",
          "Titre": "Confession — I've been a supplier to…",
          "Contenu": "Confession — I've been a supplier to World Wide Stereo for many years and know their staff and leadership team well.But, as an avid consumer who loves recreating music in my home, I'll speak from a different position now.Learning how to choose and blend the hundreds of brands offered in today's marketplace with the goal of achieving musicality, dependability and ease of use takes years of experience and a focused commitment to excellence.It is RARE to find a group of people who not only share the same desire to exceed their customers' expectations, but to delight them by opening a window onto the world of music they might be unaware of.Music is our single universal language of human expression that changes and evolves every single day.  This language enriches our soul, allows us to time travel back to moments of intense personal meaning, and give us the gift of solitude in a world that seems crazy by most measures.A well designed and installed HiFi system powerfully connects you with the artistry and passion of musicians the world over that have dedicated their lives to expression using sound as their medium.The people at World Wide Stereo have dedicated their lives to enriching the places you live, work and play in, and are exceptional at their craft.I urge you to let them show you how they can help you too.My finest - JBevier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felix Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:55:23.000Z",
          "Titre": "Fast and easy purchase",
          "Contenu": "Fast and easy purchase.  Excellent boxing and wrapping. Received my product in a timely matter and with very good care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen S",
          "Nb_Reviews": 3,
          "Date": "2023-07-26T23:31:47.000Z",
          "Titre": "Excellent Customer Service!",
          "Contenu": "There are certain things that I don't like purchasing online in efforts to avoid the return process should the item need to be returned. I purchased some speakers that didn't work for my needs. The customer service rep I spoke with was great and the return process was very easy. As a result, I purchased a different set of speakers that should work like a charm. I highly recommend World Wide Stereo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Belenko",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T22:05:14.000Z",
          "Titre": "Unexpected Medical EMERGENCY",
          "Contenu": "I must say that Ira was an angel. I never met a more understanding person in all of my 71years.He was so helpful in guiding me through the process of getting the best results for my purchase of a sound system. Unfortunately I had to cancel do to a medical emergency. I called Ira and he canceled the order no questions asked.He is truly a great and understanding genuine person. I am so glad and thankful that I had the opportunity to met him.If more people were like him the world would be a better place. All I can say is thank you.lt was a pleasure working with you.G-D BLESS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Gorelick",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:48:41.000Z",
          "Titre": "Fast, cheap, and easy",
          "Contenu": "Easily found what i wanted. Easy to order. Delivered one day early. No better price out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HANS C",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T22:58:51.000Z",
          "Titre": "I was treated as a priority and my issue was resolved!",
          "Contenu": "I would like to recognize Mr. Segall for his close attention and prompt action and responses regarding an issue I had with my order of an A&K SE180. I truly appreciate his courteous manner, his professionalism and above all, that he seemed to treat my case as a top priority and did get the A&K unit to me in only a few days, despite obstacles."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T16:49:30.000Z",
          "Titre": "Excellent phone assistance",
          "Contenu": "We needed a new receiver and ordered it from World Wide Stereo. When we tried to install it we had trouble hooking up our various components. We called for assistance, and a very patient person walked us through the issues. This was our first purchase from them, but I am now a dedicated customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SYLVAIN PALMER",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T00:36:33.000Z",
          "Titre": "Very easy purchase with excellent…",
          "Contenu": "Very easy purchase with excellent advise from Brian.Would choose two day shipping next time because it took 8 days to get to the west coast.  Maybe wise to upgrade your free shipping option.  Would definitely purchase from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID SHETTERLY",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T00:44:38.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. I bought a refurbished Denon AVR-X4700. The amp arrived early, was packaged good, looks great, all the accessories were in the box. The only issue was with finding the manual. Contacted customer service and received the web address for manual. I would highly recommend World Wide Stereo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:13:32.000Z",
          "Titre": "Great sound, great shipping",
          "Contenu": "It arrived lightning fast, full days faster than I anticipated. It was packaged well, and the turntable is sleek, simple, and the sound is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STUART DAVIS",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T22:53:41.000Z",
          "Titre": "I needed a 4K receiver for my garage…",
          "Contenu": "I needed a 4K receiver for my garage TV.  Did a search and found this company.  Reviews were great.  My experience was just easy.  Product delivered on time.  Fresh factory box.  Exceeded expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DS",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T00:08:15.000Z",
          "Titre": "Fast shipping & delivery!",
          "Contenu": "From ordering to shipping and delivery, very easy and fast processing, even during the holidays."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris K",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T03:05:54.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy, and straightforward.  My speakers arrived slightly earlier than advertised, which is always a great thing!  I'm pleased with the packaging and overall customer service.  Would not hesitate to do business again with World Wide Stereo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:04:46.000Z",
          "Titre": "Looking for a component",
          "Contenu": "Looking for a component for my turntable, I decided to check in to see if it was in stock before taking a ride. Quick response and all my inquiries were answered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Sottanella",
          "Nb_Reviews": 3,
          "Date": "2023-09-07T20:07:45.000Z",
          "Titre": "Customer Support",
          "Contenu": "I used the Chat feature, and I was able to get online with Ira almost immediately.  He was able to answer all of my questions in getting my order placed.  Great customer service.  Thank You!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "isaiah seguin",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T02:56:03.000Z",
          "Titre": "Audeze Maxwell Xbox edition",
          "Contenu": "Fast shipping! This Headset is always on back order. Lucky they had these in stock. Arrived in 2 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Hyman",
          "Nb_Reviews": 8,
          "Date": "2023-04-30T04:35:41.000Z",
          "Titre": "I appreciated the very competitive…",
          "Contenu": "I appreciated the very competitive price and the prompt shipping. These stands are beautifully finished and easy to assemble. I especially like that the speakers' bolt to the stand plate, so they are unlikely to get knocked over."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miles",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T13:08:20.000Z",
          "Titre": "World Wide Stereo does good work",
          "Contenu": "The online ordering process was easy. Pricing was very fair and free shipping was a bonus. My receiver was well packaged and arrived in perfect condition. Shipping was quick, and communication from order through final delivery was great. Good job!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "souhaib rahouani",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T21:25:27.000Z",
          "Titre": "watch tv",
          "Contenu": "If you're looking for a reliable IPTV provider, I highly recommend [resm-tv.com]. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dalton",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T21:46:07.000Z",
          "Titre": "I spoke with IRA S. | Very Helpful!",
          "Contenu": "I spoke with Ira S. He was highly knowledgeable and answered all my questions regarding my concerns to upgrade from my old Pioneer SC95 to an Integra DRX 8.4. In a nutshell, the Integra DRX 8.4 in terms of tonal accuracy and features punches above its weight class.Thanks again Ira for the great chat!- Dalton"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZORAIDA R.",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T17:55:33.000Z",
          "Titre": "Great Soundbar",
          "Contenu": "I was in the market for a new budget-friendly soundbar and after speaking with a rep at WWS, I ordered the Yamaha SR-B20A Sound Bar with Dual Built-In Subwoofers.  Wow!  What a difference!  I like that it has options (stereo, surround, movie, etc.) Perfect for a small apartment.  Thanks, WWS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL KISSEL",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T23:22:13.000Z",
          "Titre": "Prompt shipment and helpful tech support",
          "Contenu": "The Denon receiver I wanted was available and shipped promptly.  At one point, I thought I had an issue with the equipment and tech support was very helpful and guided me through the return process.  As it turns out, there was not an issue with the equipment and I have it hooked up.  It sounds great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHRIS H",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T02:49:28.000Z",
          "Titre": "Incredible service and speed of delivery. These guys know audio.",
          "Contenu": "Love the in-depth reviews of the products and passion for the hardware. Truly knowledgeable and the store and team are an underrated service! The site should get more awareness!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Burke",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T02:14:48.000Z",
          "Titre": "Great buying experience",
          "Contenu": "Website easy to navigate and find products.Order arrived quickly and was packaged well.All items were exactly as described.Great buying Experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Ward",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T21:45:34.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Product arrived in a timely manner and undamaged!! I am super happy with Stereo world and will keep them in mind for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVEN",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T09:25:19.000Z",
          "Titre": "Great customer service on a broken item",
          "Contenu": "The fast response to a broken door ,on a Denon AVR x4800h ,  I ordered a new one the next day. Got a RMA label and  shipped the old one back , I hope they will be just as fast with the price matching when I call tomorrow , but I think they will be just as fast with that also, can't wait to get my new unit in.. thanks WWS  Steven."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL KANE",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:11:00.000Z",
          "Titre": "Everything was quick and easy with fast…",
          "Contenu": "Everything was quick and easy with fast delievery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Butler",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:51:54.000Z",
          "Titre": "The product was exactly what my son was…",
          "Contenu": "The product was exactly what my son was looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROGER VANCE",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T23:05:19.000Z",
          "Titre": "Easy to shop online store",
          "Contenu": "Easy to shop online store. Lots of information about products. Quick deliveries.A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 4,
          "Date": "2023-10-11T13:00:26.000Z",
          "Titre": "Even though you never called back with…",
          "Contenu": "Even though you never called back with some questions I had about the turntable I purchased. I could not be more pleased with the speed I received my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Root",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:21:18.000Z",
          "Titre": "Great customer service and very fast…",
          "Contenu": "Great customer service and very fast delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enrique  Gonzales",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T11:45:40.000Z",
          "Titre": "Yamaha x50a soundbar",
          "Contenu": "Product shipped and arrived quickly in perfect condition, definitely would use this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Schlick",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T21:29:20.000Z",
          "Titre": "Great Product and fast delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T23:44:23.000Z",
          "Titre": "Lovely electronic gift to me.",
          "Contenu": "The product was as advertised and came to me sooner than I expected. The website was easy to navigate. I am enjoy listening to my new player."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Berry",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T22:06:04.000Z",
          "Titre": "A real person to chat with",
          "Contenu": "A real person to chat with, amazing. Ira knew exactly what my problem was, and explained all my options to me in great detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHAD BLACK",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T05:44:32.000Z",
          "Titre": "I genuinely like this website",
          "Contenu": "I genuinely like this website. Super easy to navigate. You get what you want at a great price. Shipping is ok.quicker,lol. Digging this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Kim",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:36:24.000Z",
          "Titre": "Fast shipping than I expected",
          "Contenu": "Fast shipping than I expected. And good product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BILLY HARJO",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T04:03:03.000Z",
          "Titre": "Received my order promptly and in good…",
          "Contenu": "Received my order promptly and in good working order.  I purchased a Denon AVR X4700H.  It is the perfect centerpiece for my system.  Thanks so much World Wide Stereo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK KRUSE",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:15:15.000Z",
          "Titre": "Denon",
          "Contenu": "Turntable was reconditioned but arrived “like new” at a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Severoni",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:35:59.000Z",
          "Titre": "Always enjoy working with Ryan Rumer…",
          "Contenu": "Always enjoy working with Ryan Rumer and the WWS team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:42:39.000Z",
          "Titre": "great selection, fast shipping",
          "Contenu": "Found just what I needed, at the right price! Processing and shipping was faster than expected. Great experience all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T22:36:33.000Z",
          "Titre": "Speakers were delivered the next day…",
          "Contenu": "Speakers were delivered the next day which was fantastic!  I haven’t installed them yet but I’m looking forward to hearing them in my yard!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tigrris",
          "Nb_Reviews": 18,
          "Date": "2023-05-01T02:22:07.000Z",
          "Titre": "Very honest company",
          "Contenu": "I oredered some stereo equipment from them that did not work in my home. My mistake.I sent back the equipment, and even thoug one of the boxes was opened they refunded me the full amout I paid.I wish all the online companies were this honest and easy to deal with.Thak you World Wide Stereo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOUGLAS SATTERFIELD",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T23:19:23.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service - great closeout on a great product.I am originally from the Philly area so it was a pleasure to finally do business with WWS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CRM",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T00:42:18.000Z",
          "Titre": "Great Experience",
          "Contenu": "Well packaged, quick delivery, product exactly as described.  Would absolutely buy from WWS again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DrBjoy4ul",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T17:43:46.000Z",
          "Titre": "Always a Great Experience & Price",
          "Contenu": "This is the perfect place to order your electronics (headphones or whatever you may need). The product delivers quickly and the customer service is A+!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Schteff E",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T22:11:49.000Z",
          "Titre": "Supes Happy w/ WWS",
          "Contenu": "Excellent experience from start to finish. Shipping was quick, I was able to easily track the shipment and am currently enjoying my purchase! TY"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T15:06:26.000Z",
          "Titre": "Fast shipping and well packed",
          "Contenu": "Fast shipping and well packed! I was worried about shipping an instrument like a turntable but it was handled well. Nice to replace my 45 year old unit, this is a great upgrade!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Deshong",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:10:02.000Z",
          "Titre": "I had purchased some equipment from WWS…",
          "Contenu": "I had purchased some equipment from WWS and just had a technical support questions which they were able to answer on the spot - which was awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 4,
          "Date": "2023-06-27T23:39:42.000Z",
          "Titre": "Stock, Price & Delivery all excellent!",
          "Contenu": "The selection was great & the prices were excellent. Very competitive. Delivery was a breeze. The delivery was on time the item arrived damages free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SYLVAIN PALMER",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T02:51:20.000Z",
          "Titre": "Bought headphones online",
          "Contenu": "Bought headphones onlineNeeded to return item and it was very easy with no questions asked. Excellent customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RSB",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T21:05:48.000Z",
          "Titre": "Shipped fast and came in great…",
          "Contenu": "Shipped fast and came in great conditions! Especially enjoyed the free shipping! Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Bruno Mello",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T21:07:49.000Z",
          "Titre": "easy process and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Kelly",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T00:28:04.000Z",
          "Titre": "WWS has what I'm looking for!",
          "Contenu": "Good price, speedy delivery and help just a phone call away. This is what I look for when I make my purchasing decisions. World Wide Stereo has me coverec!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WILLIAM ZORN",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:17:06.000Z",
          "Titre": "Easy return on the wrong size cable and…",
          "Contenu": "Easy return on the wrong size cable and quick delivery on the right one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarence Jones III",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T21:14:03.000Z",
          "Titre": "A real pleasure to do business with",
          "Contenu": "A real pleasure to do business with. You don't find that to often these days. Keep up the fantastic work ladies and gentlemen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 7,
          "Date": "2023-11-25T17:18:16.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "Very rapid turnaround from easy online ordering to shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK HENDRICKS",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T23:53:23.000Z",
          "Titre": "Small audio shops..",
          "Contenu": "I don't know much about your company..but have worked in small audio video local shops before and I love the vibe. You had the products that I was looking for so I bought them. I hope to continue to be a long time customer . Thank you for everything.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID ALT",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T07:49:16.000Z",
          "Titre": "Thanks",
          "Contenu": "Thanks, everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Bermudez",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T01:02:28.000Z",
          "Titre": "Great fast and reliable shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CARLOS QUINTANILLA",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T04:53:16.000Z",
          "Titre": "1st Time Buyer Glad I found them",
          "Contenu": "Smooth experience, Happy with purchase. Wish shipping would've been a little faster, but it is a rather big and heavy box."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THOMAS CHRISTMAN",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T00:28:36.000Z",
          "Titre": "Sonos ERA 300",
          "Contenu": "I ordered the new Sonos ERA 300 speakers and they arrived 3 days later! Super fast , excellent service !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T23:17:08.000Z",
          "Titre": "It was easy to order, nice selection",
          "Contenu": "It was easy to order and the CD changer arrived when  expected it. Nice selection at the website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Wieling",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T05:10:28.000Z",
          "Titre": "Great shopping experience",
          "Contenu": "Received my order quickly, it was double boxed, smooth transaction! Pleased with what I purchased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "roger haddock",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T15:58:50.000Z",
          "Titre": "was able to answer questions on stereo…",
          "Contenu": "was able to answer questions on stereo rack furniture to help me make a decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN RALPH",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T22:18:13.000Z",
          "Titre": "Loved the fact that you have a tutorial…",
          "Contenu": "Loved the fact that you have a tutorial for learning what to choose for your best experience. Great experience overall with the website and their communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T15:12:48.000Z",
          "Titre": "The Astell & Kern SR35 arrived promptly…",
          "Contenu": "The Astell & Kern SR35 arrived promptly in brand new condition. Great price and fast service."
        }
      ]
    }
  ]
}