{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.designmantic.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 54,
          "Date": "2023-07-10T21:21:32.000Z",
          "Titre": "The logo isn't yours",
          "Contenu": "I paid for a logo in 2016.In July 2023 I received an email saying that someone else is interested in my logo. If I want to stop the other company using my logo, i have to give them $599.Initially it felt like a scam, but I honestly cannot remember what the website stated 7 years ago, so I do not know if I was made aware of this practice at the point of order. If you go on the website now, it's made clear that you don't own the website exclusively.I initially gave a 1 star review. But updated it to a 3 star review on reflection. However, the company is pressuring me to remove the review, so it's gone back to a 1 star review. I'd avoid this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Smith",
          "Nb_Reviews": 3,
          "Date": "2023-04-20T01:20:31.000Z",
          "Titre": "I’ve had a very tough time…",
          "Contenu": "I’ve had a very tough time accomplishing something that should’ve been fairly simple. I reached out to customer service more than once, and spoke with an agent directly more than once, and still have not gotten my revisions. All I needed was a business card that I created to be fixed due to the fact that I could not get the correct font to save. It’s been over a week now and I’ve been told several times that this would get done and still nothing. I will be bringing my business software since I can’t seem to get this done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa Lynne Berard",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T20:29:59.000Z",
          "Titre": "Legal claims | Questionable Business Tactics",
          "Contenu": "I began receiving text to my personal phone from DesignMatic a few weeks ago telling me I had to purchase the rights to the logo I paid them to design for me in 2012 as someone else was interested in Buying it. It has my company name in the logo and it was registered and trade marked once paid for. The tactics the company is attempting to generate revenue is questionable. Be cautious about using this company."
        },
        {
          "Note": 1,
          "Lieu": "CM",
          "Pseudo": "Theodore Dasse",
          "Nb_Reviews": 2,
          "Date": "2018-10-24T13:42:22.000Z",
          "Titre": "Avoid. They are negligent and arrogant",
          "Contenu": "The Project Manager (Asif P. Lawrence) stopped communicating immediately I made payment for an urgent logo design project. E-mails to support remained unanswered to. 1 week after the deadline, I filed a complaint with PayPal and someone from Designmantic showed up and hurriedly helped prepare the logo, then explained I had to lift the complaint with PayPal before he sends the logo files. I found it disrecpectful, especially as they were 1 week late with the project.Later attempts to have the logo modified have been ignored till now. Avoid!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachael Garcia",
          "Nb_Reviews": 3,
          "Date": "2022-12-10T14:32:17.000Z",
          "Titre": "Trying to extort money from customer's",
          "Contenu": "I received a text and an email from DesignMantic late yesterday afternoon (Friday December 9, 2022) regarding a logo I purchased from them 7 years ago. They are claiming that another company is interested in buying the copyright/licensing rights to my logo. Further if I pay them a one time fee of $549 (by Monday) I can own the rights to the logo I had already trademarked and copyrighted through my patent attorney. Yes I already own the copyright and trademark so no you can’t sell it or try to extort money from me. I promise my attorney will have a field day with this. Wrong is wrong and what you are doing to your customer base is just that wrong. I will never use your services ever again and I will make sure to spread the word to all my friends, family, and small business owners."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T20:31:39.000Z",
          "Titre": "Feels scammy now",
          "Contenu": "This service was fine at the time, but now feels scammy. We purchased a logo from them about 6 years ago. Now, we're receiving emails and text messages from them telling us that we need to purchase the copyright to this logo that we already purchased. I logged into our account to see what kind of license we have, but I can't find that information anywhere. What makes it feel scammy is the amount of people who have recently had the same experience as us. I've found many complaints from others who have also been contacted by designmantic asking for more money for an 'exclusive license'. This was never mentioned at the time of purchase. Why would I buy a logo that I don't fully own? This practice leaves a bad taste in my mouth and I'll be sure to avoid designmantic for future design needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SP",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T22:24:35.000Z",
          "Titre": "Will never use again, trying to extort money!",
          "Contenu": "We purchased a logo from them 7 yrs ago, barely use it, but it's nice to have when a logo is needed for something.  Today, we got an email telling us that we need to buy our logo at a \"discounted\" rate of $549, or stop using it.  When buying a logo, we purchase the license to use the logo.  Our license to use the logo cannot be revoked!  Considering the hard handed tactics used by them, am guessing these guys are in financial trouble.  I'm sorry, but I'd stay away...To respond to the feedback from DesignMantic... in one of their email responses they told me \"If we will sell the rights of this symbol to our new customer so you need to take down the logo from your website or other platforms.\"  This is simply not true as selling the copyright to someone else does not revoke my existing license to use.I am not removing this review."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Rainbow Luk",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T08:11:58.000Z",
          "Titre": "I used DesignMantic to create a new…",
          "Contenu": "I used DesignMantic to create a new Logo with USD37 in July but DesignMantic charged my credit card of USD15 while I didn't purchase anything online in August.I have left 2 messages to their website twice since 6th Aug but I received no reply for 10 days already.I requested for a refund and I doubt why DesignMantic charged my credit card without my further authorisation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T10:58:33.000Z",
          "Titre": "The whole process of receiving logo…",
          "Contenu": "The whole process of receiving logo copyright proof just nothing seems official with my purchase til this day. I've received nothing official proving my rights to the logo"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Simmons",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T14:18:12.000Z",
          "Titre": "Zero stars! This service is a SCAM!",
          "Contenu": "I do not recall agreeing to a subscription with this service and I have been charged 15/mo since November 2019 for something I will never use again in my life... I don’t even recall using it to start. DO NOT USE THIS SERVICE!!!!!!! They will discreetly charge you monthly without remorse! There are PLENTY of other services who are customer centric, honest, and transparent... DO NOT USE THIS SERVICE!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Byron Motz",
          "Nb_Reviews": 1,
          "Date": "2018-07-18T17:14:07.000Z",
          "Titre": "Billed me for something that I never…",
          "Contenu": "Billed me for something that I never signed up for. Called 4 freaking times to resolve situation and they always want to call you back. STILL WAITING! Going to put a terrible review on every website I can find. Totally unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Yanson Yang",
          "Nb_Reviews": 1,
          "Date": "2018-03-28T13:53:36.000Z",
          "Titre": "DO NOT USE THEIR CUSTOM DESIGN!",
          "Contenu": "I went through to the custom design page which leads me to logoleader.com, I think they are somehow related. The first draft they provided me looks like a logo template which you can retrieve from free logo website. Take note that revisions can only be done on the draft they provided, if the draft is crappy you can't ask the designer to redo. They will charge you $20 each on new concept. In my case, they responded because my instructions were unclear and designer did followed my instructions. I have told them what my company represents and the services that we provide, I was looking for a designer to impress me with creativity and not requires me to input every details in my logo! I want suggestions for custom design! NOT TEMPLATES! If you don't like the design, you don't get money back. So custom design is a scam, AVOID AT ALL COST!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "V S",
          "Nb_Reviews": 1,
          "Date": "2018-06-23T18:18:07.000Z",
          "Titre": "This is a deceiving company! Worst customer service!",
          "Contenu": "This is a deceiving company. DO NOT use them. I purchased a logo and website and they took my website down and put up a page saying NON-PAYMENT when I had already paid for the full month! Their customer service is horrible. And they resell the logo that you buy! They are open only 9-5 NY time and always say \"We will get back to you.\" and they never do. They held my website hostage trying to get me to pay $27/mo for the website instead of the $9.99 amount I signed up for. They would not fix my MX record to point back to my domain host so that my email would work. No website, no email, lost customers for days and days! And they humiliated me by publishing a page on my domain that says non-payment so my customers thought my website wasn't working because I didn't pay. Just completely unacceptable. Zaheer Dodhia should be ashamed of this service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy White",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T09:26:46.000Z",
          "Titre": "Trying to extort money after illegally charging monthly fee",
          "Contenu": "I initially created my company logo with this company and paid the fee for the design and file formats. Then I started getting charged (to the credit card I had used) monthly by them for \"storage of design\". Got that stopped. Tonight I got an email from Alan Smith at this company saying he had someone else who wanted to purchase my design and he was protecting it for me at a cost of $560.  Here is the text from the email from him: This is Alan From DesignMantic. I wanted to discuss the ownership/copyrights of the logo design which you purchased from us “MY COMPANY NAME WAS HERE”. There’s a client who’s interested to get the rights to the same design since the rights of this design haven’t been sold yet. I’m holding it and giving you the priority to own the design since you were the first buyer of this logo and using the logo on your website at https://www. MY COMPANY WEBSITE WAS HERE/. Let me know if you’re interested. It will cost a one-time fee of $560.Regards,Alan SmithSenior Customer Support Executivecid:email address removedCall US: 1 -855-752-5503"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachael Garcia",
          "Nb_Reviews": 3,
          "Date": "2022-12-15T04:29:02.000Z",
          "Titre": "They are using extortion tactics with…",
          "Contenu": "They are using extortion tactics with their previous customer base to get them to pay for copyright fees that are not needed and potentially illegal. They are using client data  to manipulate and get clients to pay out. Is that even legal? Shame on you! You are not practicing ethical business practices and I’m certain there are small business owners that have fallen prey to these tactics. Do you even recognize the situation that small business owners have faced during the pandemic? Most have gone bankrupt and you are now trying to extort more money from these folks that have lost everything. Shame on you! According to 99designs a company that charges for and produces design services to a paying entity with the intent to knowingly do harm and defraud customers should no longer be in business. According to “DesignMantic” they provide and own design templates featured in their tools. A user can pick a template, customize and download it for use branding and printing purposes. However, the basic copyright of the design template (like symbols and graphic elements) remains with DesignMantic. That means customers are paying a very high price for an undercut and underrated service DesignMantic has no intention of letting the customer use as they maintain rights. Hmmmm. How exactly does that work when you have multiple conpetitors such as 99designs that aren’t using the same underhanded tactics. Again shame on you. Either adopt fair and ethical business practices or go out of business."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Maria",
          "Nb_Reviews": 3,
          "Date": "2021-03-24T22:54:24.000Z",
          "Titre": "Worst Company Ever",
          "Contenu": "Oscar promised me that the logo will be done today and I called in today asking for the logo to find out that Oscar is not in the office today and logo wont be done till tomorrow. I had owner of the company come in especially to confirm one logo design today and design mantic did not even bother telling me that Oscar is not in the office, instead Shawn was arguing with me stating that all their designs are done within 24 to 48 hours and its only been 24 hours, but as per the email sent to me by Oscar this was supposed to be done no later than today, how am I supposed to know their company policies ?Do not trust their deadlines, very unprofessional people and they must leave at 17:00 even if your work is not done. Doesn't matter I had the worst experience with them, I have never ran into a company before that's so unprofessional and on top RUDE !!!! instead of apologizing and making sure this gets done they argue with you, first due to their fault I looked very bad in front of the management and now I have to listen to them arguing with me defending something that is in black and white. horrible company stay away !!! I never leave reviews, I was so upset I had to make an account to get this done for the time first ....SEND YOU EMAIL WHERE ? NO EMAIL HAS BEEN GIVEN"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T22:10:57.000Z",
          "Titre": "SCAM ARTISTS",
          "Contenu": "I designed a logo on 2/21/16 and paid for my design. Over 6.5 years later, they're emailing me saying they have a client interested in my design. If I don't pay them for MY design, they're going to sell MY design to someone else. Why would that even be an option?! I understand someone may use a similar stock photo or design that I tweaked, but to send me the exact logo I designed saying they will sell the complete rights to someone else is absurd. Why would they be trying to sell my design?! I know they're going to point me to their terms and conditions that states they own my design, but they're SCAM ARTISTS if they are going to turn around and try to sell what I've designed. Why are they advertising MY design as something for sale?! DO NOT DESIGN WITH THEMEdited to add: The same customer service rep who initially told me he had a client wanting to purchase my logo reached out and told me they were giving me rights to my logo free of charge asking me to delete my negative review. I informed him that I would edit my review, but I think it’s a poor way to conduct business threatening to sell my logo to someone else unless I pay for the exclusive rights to it. He claims he’s going to do better in the future, but that remains to be seen. If you design with them, do not fall victim to this scam. Who knows how many companies they’ve preyed on like this."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Ahsan Jerry",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T20:46:23.000Z",
          "Titre": "Pathetic Customer Service. Rudest Sales person",
          "Contenu": "I've dealt with DesignMantic before when i was in US and create numerous logo from them. I contacted them again for the design service but there representative terminated my chat 3 times. Very Rude, Unprofessional. Wouldn't recommend Designmantic to anyone anymore!!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Steve Brooks",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T22:57:51.000Z",
          "Titre": "Used to be a great company while Adam…",
          "Contenu": "Used to be a great company while Adam worked there, now its trash!! Very unprofessional and rude representatives."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Haralson",
          "Nb_Reviews": 1,
          "Date": "2018-07-18T18:45:21.000Z",
          "Titre": "The contacted me to give a deal on…",
          "Contenu": "The contacted me to give a deal on files I was playing with for my company Logo . I told him I was not finished yet and was trying to nail down the color I wanted to go with . he says Thats ok you can change the colors when ever you want . for $49.00 I will email you the files the with the color changes . I said ok . So before I could finalize I get files of the Logos that I already have files on . I emailed back . No response to date . Thanks DesignMantic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy Page",
          "Nb_Reviews": 1,
          "Date": "2019-11-07T20:27:50.000Z",
          "Titre": "Bogus subscription",
          "Contenu": "They are very slick. When you buy a design with them, they manage to tell you can have free edits. But in the fine prints, they enroll you in a 3-month subscription in which they charge you. This is never made explicitly when you sign up.And no, they will not refund you..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan Long",
          "Nb_Reviews": 2,
          "Date": "2019-12-12T15:20:41.000Z",
          "Titre": "Caveat Emptor - business is difficult to work with...",
          "Contenu": "UPDATE 12/12/2019: I first called DesignMantic and asked to speak to the Head of Customer Support who had previously communicated with me. I was informed he was \"in a meeting\" and my number was taken. Not trusting that scenario (given the history) I also sent an email, which was returned as undeliverable. Apparently the individual no longer works at DesignMantic...why didn't they tell me that? \"Something is rotten in the state of Denmark.\"Therefore, I called back and spoke to whoever answered the phone. They agreed to refund the $21 that had just been charged and to cancel my account. I had, of course, asked to be canceled previously, so we will see if that actually occurs. The problem, of course, is that they still retain the ability to charge my credit card, and there is no functionality provided to remove one's financial information from their system. I shall be obliged to change my credit card number in order to actually know for certain that DesignMantic can no longer fraudulently charge me.UPDATE - 12/11/2019: Just noticed that after all that run around and final agreement from DesignMantic, I have been CHARGED YET AGAIN!!!  Unbelievable.UPDATE - 9/19/2019: DesignMantic's Head of Customer Support and Sales finally agreed to refund the $21. Three separate individuals, including the Head of Customer Support claimed they \"could not\" do this. For example: \"But I regret to inform you that as per our terms and conditions refund cannot be processed.\"My conclusion? In the process of my research I noticed that there are examples of similar experiences with this company, and almost verbatim communication. I believe DesignMantic Customer Service is following a script designed to convince the unhappy customer to give up, and if you don't they will eventually concede to what should be an immediate option: never charge a customer for something they don't want. Their pattern? First, show \"screen shots\" that supposedly evidence the customer signed up for a service. Second, offer to do additional work (which further embeds the customer in their labyrinth of options) at no additional cost. Three, finally agree to refund the money...if the customer is making a big enough stink about it.ABSTRACT:- I was billed for a service I did not want or need.- That service was deceptively portrayed during the check-out process.- Upon contacting their Customer Service, I was mistreated by two successive reps.- I reported the company to the FTC, and informed them of the Report #- I registered a complaint with the local Better Business Bureau, and informed the company- I gave this review, and informed the company- I was contacted by their Head of Customer Support and Sales, who again refused to refund my money, and suggested that I was completely incompetent throughout the process of purchasing.- I replied to his email.- I received a response acknowledging that they can make an exception to their policy and will be refunding my money, and asking that I remove my complaint and negative review.- I am leaving the record of this experience here, as I don't believe any customer should have to endure what I did in order to get the company to simply do the right thing.ORIGINAL STORY:I used DesignMantic to create and download a logo for $29 in August of 2019. I did not check a box for any unlimited additional edits, or any kind of ongoing service.When I was surprised by a $21 charge to my account in September, I called DesignMantic after having reviewed my account online to ensure that there is no evidence of any service being subscribed to, and nothing is available to cancel.I was informed that I had subscribed to their ongoing editing service (which I did not do, and which was not in anyway evident nor apparent during check out), and that while they would be glad to cancel my subscription, they could not refund my money.I pointed out that not only was I unknowingly subscribed, but that they can see that I have never utilized any additional editing options. Furthermore, even now knowing what I am looking for, I have been all over designmantic.com's website, and there is no indication that I have any subscription. The only suggestion that there is such a thing is that their Terms and Conditions, continually references a \"Service.\" The only reference to that in My Account, is labeled a \"FREE EDIT.\"There is no mention of any ongoing service in my account, no subscription, no option to cancel anything. This was an entirely phantom \"service.\" Nowhere is there any evidence of what one is purchasing, thinking that one is making a one-time, single purchase of a downloadable logo. This is a fraudulent approach to business, intentionally designed to harvest ongoing payments from individuals unaware that they have been roped into an unnecessary service.The two customer service reps I spoke with continued to repeat themselves, were using a phone line that was critically compromised by terrible break-up, refused to let me speak to anyone else, and placed me on hold for 3 minutes almost immediately after taking my call.This is a predatory business and I strongly recommend that no one do business with DesignMantic, as they are not honestly representing what is being purchased, and they are not interested in satisfying the customer.Update: 9-19-19The Head of Customer Support and Sales contacted me via email, and began in a polite manner.\"...I am Head of Customer Support and Sales at DesignMantic.com. Please accept my sincere apologies for any inconvenience caused. I completely understand your concern and once again sorry for the bad experience you had with the customer service representatives. Rest assured it will not happen again.\"Unfortunately, he did not continue in that vein, and his claim of sincerely apologizing and completely understanding is belied by what follows:\"However, I would like to clarify the following points before I can address your concern.\"  He then proceeds to describe the supposed process I went through in selecting what I purchased. His description does not even remotely resemble my memory of the purchase/check out process, and does not align with my goals in visiting their site to begin with.More importantly, however, this is all beside the point. The facts are these:- I did not knowingly purchase what I was billed for- Without ever having used ANY of their service, I requested cancellation and a refund.- They can validate that I did not utilize their service.The Head of Customer Support then insultingly offered me, not a refund, but an additional design service at no additional cost.\"Since we always value our clients and you are one of them therefore, I can offer you free design to compensate this amount. But I regret to inform you that as per our terms and conditions refund cannot be processed.\"This is entirely bogus. First, I have no need for another design, and if I did need one, I most certainly would not obtain it from this rude, shady company. Second, to claim that they cannot process a refund because of their Terms and Conditions is worthy of derision. It may not be their policy to do so, but they created their policy and they can amend it. Furthermore, no company or individual worth their salt would refuse to consider an exception to their rule on the basis of a valid concern, as I have expressed."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Philip Schlosser",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T10:26:55.074Z",
          "Titre": "Worst website ever",
          "Contenu": "okay first of all i wanted to design a logo for my firm. and everything goes well until i would like to pay and see how much it would fill, i pay for the logo and then i can see it is the worst quality i´ve ever seen, this site rip off you money, do not pay for it. Where is the service?????. SO Designmantic  if you want my kindness i would like my money return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuel",
          "Nb_Reviews": 2,
          "Date": "2016-01-17T06:29:29.000Z",
          "Titre": "I paid for my customized logo $46dlls, and did not receive anything.",
          "Contenu": "I had heard that this company was good, but it was until I paid for a customized logo for $46dlls and did not receive anything. I have called them several times, but nothing. I needed this logo ASAP, for my company but this is ridiculous I go to my account and it shows that I have a purchased logo but it tells me that I don't have any saved logos.\r Please help.\r I hope this gets fixed ASAP."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chung Niem",
          "Nb_Reviews": 2,
          "Date": "2016-04-16T19:30:52.000Z",
          "Titre": "Quoted $100, billed $180. Won't refund the difference",
          "Contenu": "I emailed multiple companies for quotes on logo designs. I emailed with Design Mantic twice accidentally. They said it would be $100 to modify a logo from their site and $180 to design from scratch. I modified a logo from their site and they charged $180. They won't refund because it was already billed. You can not trust these guys. They will rip you off and not refund."
        },
        {
          "Note": 1,
          "Lieu": "ZM",
          "Pseudo": "Douglas",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:28:06.000Z",
          "Titre": "Designmantic stole my money!",
          "Contenu": "Designmantic stole my money by not delivering a full package for which I paid. I tried to complain but got rather negative devoid of uncaring attitude. Up till now, I have not received my business cards design I should have received alongside the logo design! I tried following their visually simple method but it didn't work!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frankie",
          "Nb_Reviews": 1,
          "Date": "2015-04-03T19:58:19.000Z",
          "Titre": "Bad Customer Service",
          "Contenu": "The logo designer is fair and does allow you to create a custom logo. However, their printing and design services are horrible. The business card creator is difficult to use especially if you have a lot of text. Keeps giving errors and even when it is finally accepted, they email you that it is not good enough and your order is delayed. Customer service gives you no options but to wait. I will not use their services again nor recommend to anyone."
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Guillermo",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:47:08.000Z",
          "Titre": "Im dissapointed with your service",
          "Contenu": "Im dissapointed with your service. I bought the logo and presentation card designs and tried to change a number from the card because didnt want it anymore and coudn't do it. You tried to charge it as a new design when it wasnt that.I do not recommend you anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shaun",
          "Nb_Reviews": 1,
          "Date": "2016-06-22T19:01:17.000Z",
          "Titre": "Total Scam!",
          "Contenu": "This company is basically holding the web domain I registarted with them hostage and charged me twice for my logo and won't refund anything!  I'm losing business because I can't set up my website or business email because they won't do what they have to do so that I can point or transfer my domain to my host despite numerous emails and phone calls.  Their latest \"move\" has been to sell my domain to some other registar who says they don't have it (even though WHOIS shows they do) and who won't offer assistance either.  TOTAL SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Ramsden",
          "Nb_Reviews": 1,
          "Date": "2015-01-22T15:58:13.000Z",
          "Titre": "They will not Refund an Obvious mistake",
          "Contenu": "I created Design No. 2897132  without knowing I was a making a big mistake, I was led to believe that wording on the design  “this is a text field” was a field that I could edit when I downloaded the design.  But it was just a picture with the wording on it.  It is worthless to me as you can understand\r I soon after downloaded Design No. 2897223 which as you can see is the same design without  the “this is a textfield” which I am happy with.  \r There answer was too bad, we can't refund you...\r I would like a refund on the design since the error is obvious."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lorri Maiorano",
          "Nb_Reviews": 1,
          "Date": "2017-02-20T20:54:42.000Z",
          "Titre": "Your logo isn't really yours",
          "Contenu": "BEWARE you may THINK you are getting a custom logo but they will resell the exact same logo to your competitor in the same market. Don't waste your money branding your \"Custom logo\" as it could also belong to the competition around the corner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer from CA",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T16:15:58.000Z",
          "Titre": "Horrible experience so far",
          "Contenu": "Horrible experience so far, I have not even been able to access what I paid for, I paid almost $200 and they  did not send any receipt acknowledging the payment, as a matter of fact they sent an email saying thank you for paying $19.99. When I called and requested for refund, at first they said yes that it will be processed then I got an email a week later saying there will be no refund. So right now they have comfortably taken my $200 and provided no service to me. I am not done with them though, because that is not how to do business. So, everyone beware and be careful with Designmatic. If there is anything like zero star, that is what they will get from me. Customer from CA"
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Jeremy Wilson",
          "Nb_Reviews": 1,
          "Date": "2016-08-22T16:16:41.000Z",
          "Titre": "Misleading.",
          "Contenu": "Don't want to seem like a cheapo here but they advertised online free logos and of course i get greeted by a purchase screen. BS. I would have been happy to pay for the graphics if that's what they advertised."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Joacim",
          "Nb_Reviews": 2,
          "Date": "2017-08-23T06:50:14.000Z",
          "Titre": "I have asked by email to cancel my …",
          "Contenu": "I have asked by email to cancel my subscription. But nothing happen. Please help me to deactivate my account so I don't need to pay anymore. Best regardsJoacim B"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:32:42.000Z",
          "Titre": "Charge you for the design and then if …",
          "Contenu": "Charge you for the design and then if you want to change just the color, so you can use it with other background you have to pay for it. None sense!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charlotte Carrington",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T19:08:53.000Z",
          "Titre": "States it's free until the end",
          "Contenu": "States it's free until the end, not worth £30 very dissapointed it cost me this just for one photo!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kenyuana",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:14:45.000Z",
          "Titre": "No one followed up with me after I …",
          "Contenu": "No one followed up with me after I called about the coloring of my purchase.Poor customer service !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 2,
          "Date": "2017-08-22T15:13:49.000Z",
          "Titre": "difficult to use and repeat what you …",
          "Contenu": "difficult to use and repeat what you need. no support at all.   KC"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "chase",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T19:16:53.000Z",
          "Titre": "Disappointed",
          "Contenu": "The sign I recieved was blurry and the wrong material."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anita serbanescu",
          "Nb_Reviews": 1,
          "Date": "2015-10-19T22:20:01.771Z",
          "Titre": "Ridiculous",
          "Contenu": "I have paid for a design, and also for the high resolution, extra $9, but did not receive it. I called and they said they will send it, and they did but the wrong one. Had to call back and they sent it again but not the right resolution, a third time again came but with missing parts. They kept send me the the wrong thing, or the wrong resolution, or without transparency, a total disaster and a waste of 4 hours. I never thought this process can be so difficult. On top of everything else, they were very VERY rude on the phone, all the time, no experience with customer service whatsoever. I wanted my money back, since there was so much trouble, but they said, that  this will not happen because they don't do that. I don't know in what country they are from, sounded like India, but they are totally unreliable, respectfulness, and unprofessional. I will never ever use them again, or ever recommend them to anyone. I hope this review posts, so it can save others the headache they did to me, and hopefully maybe even work on their end and learn to treat their customers with more respect.\r Update after DesignMantic response.\r I have never received any calls nor messages from you, ever. Please don't lie, it's not professional. Yes they have tried to resend me the files with other changes, but after 9 or more tries, IT IS STILL WRONG!!! I give up, I have used another company. Please stop trying, I don't have time to respond to all the tries, which are still not right. I appreciate the fact that they try, but someone obviously does not listen or understand my request. It's a white logo, with the letters being two colors, one red and one blue. Anyway, I hope they pay attention from now on, and good luck! And don't ask anyone to remove their review, that does not make you a responsible company.\r Another update...\rI have received a phone call and a message today. I did receive my files, and they have cooperated fully until I got what I paid for. \rThank you for your full cooperation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jalisa",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:28:37.000Z",
          "Titre": "Its to expensive for a generic design"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T16:05:37.000Z",
          "Titre": "Horrible customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D. Goodmn",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:15:50.000Z",
          "Titre": "Pay and pay again",
          "Contenu": "I paid for a logo in 2017.In July 2023 and again in October 2023 I received an email saying that someone else is interested in my logo. If I want to stop the other company using my logo, i have to give them $599.I would not recommend these services. Although, they appear legit enough,  in the end they are shyster scammers."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "waleed alshammari",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T18:43:40.000Z",
          "Titre": "Its poor because  until now i wait you…",
          "Contenu": "Its poor because  until now i wait you to give me approval but no one answer :(But the employee he said you can use the logo as the trend mark and I requested any email approved to use the final logi"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michella tucker",
          "Nb_Reviews": 1,
          "Date": "2018-03-20T01:47:36.000Z",
          "Titre": "I want my Refund!",
          "Contenu": "I'm happy with my Logo. Received help by phone, which made the process easier. Fair prices. However, I was charged twice. I Have contacted your company by phone & email, without response. Hence to low rating!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T18:45:05.000Z",
          "Titre": "Offered an email signature with links…",
          "Contenu": "Offered an email signature with links to social media and can't produce them"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Krystal Jessome",
          "Nb_Reviews": 1,
          "Date": "2016-01-29T05:32:40.000Z",
          "Titre": "Please call me back!",
          "Contenu": "I really like the program, it is easy to work with and I've come up with a design that I really like but i need some phone support before I place my order.  I have called and emailed several times with no response. How do i get ahold of your company?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2016-11-04T12:58:51.000Z",
          "Titre": "Deceptive advertising on the website.",
          "Contenu": "I need a template for my business card. The downloads are flat images and can not be modified with common programs. If you want to change name for a different employee you have to go edit on their site and pay another 37 bucks.. Are you kidding me !!! What a ripoff. Avoid this site.I called and emailed. Just go to there website and click threw to the businesses card page it plainly states TEMPLATE. Avoid this site,I called and emailed. Guess what they told me \" you can purchase Adobe Illustrator and change it.\" Are you kidding me. That is 400 buck program. I just want what i paid for. VERY DISAPPOINTING"
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Glen",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T20:54:54.000Z",
          "Titre": "Very disappointed customer",
          "Contenu": "Very disappointed customer. After buying 2 logos I needed high resolution for large printing and subsequently bought the logos again with the high resolution option. After not receiving high resolution files I explained what I had done and the response was to pay another fee for each logo for what they claimed was high resolution files for large banner type printing. After providing the files to a company to create the large banner it was discovered that the files provided were not of high quality and gave a slightly blurred image of the letters and also curves in the logo were not smooth. As such, I do not recommend this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wiley",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:59:44.000Z",
          "Titre": "The designs I bought and paid for had a …",
          "Contenu": "The designs I bought and paid for had a border put on it when it was sent to me. No one has responded to my inquiry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T18:40:45.000Z",
          "Titre": "I only wanted a logo and got that",
          "Contenu": "I only wanted a logo and got that. I signed up for the wrong plan and paid too much.  I have asked for a refund but no response."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "M.M.M.",
          "Nb_Reviews": 1,
          "Date": "2018-08-08T21:13:34.000Z",
          "Titre": "High prices.",
          "Contenu": "Pricing is high above the product categories."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danielle",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T20:39:55.000Z",
          "Titre": "The colors were a bit off from what I…",
          "Contenu": "The colors were a bit off from what I wanted the end result to be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Brown",
          "Nb_Reviews": 1,
          "Date": "2017-11-09T21:36:48.000Z",
          "Titre": "Their Free Trial is NOT Free RESOLVED",
          "Contenu": "They offer a free trial but if you cancel during the free trial they charge you for the free trial.  What is the point of a free trial if it isn't free?  Misleading company who bombards you with unsolicited emails and does not deliver.UPDATE:  DesignMantic responded by cancelling my subscription without the charge for the free trial.  I am appreciative for that and have adjusted the rating accordingly."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Gunawan",
          "Nb_Reviews": 4,
          "Date": "2014-10-22T15:55:27.000Z",
          "Titre": "Great site !!",
          "Contenu": "If you looking for a logo, you should try this site..\rYou will be satisfied.\r Designmantic help me to cut off a lot of time working for a logo.\rIt is very fast and very easy.\rCreating a logo has never been so exciting like this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "audrey cristina borges pereira",
          "Nb_Reviews": 1,
          "Date": "2017-04-05T17:21:09.000Z",
          "Titre": "If you are using only to make a design …",
          "Contenu": "If you are using only to make a design it's great! Simple and easy.However do not make the mistake (as I did ) of hosting your site there. It takes hours to update when you change something, the mobile version is poor , you have very little flexibility to change the site, and their custom support will take days to get back to you. I opened 3 tickets with issues I needed help , 5 days later they answer me , only one of the requests and just saying it works when they try ....I'm trying to cancel my subscription there , I sent them an email today, let's see when they will answer .Update: they answered the email next morning, way quicker than i thought.They said it was a misunderstood in my tickets and asked me if I feel like my issue was solved to update the review.I still think it's a awesome site for creating designs, but it has a long way to improve for website hosting."
        },
        {
          "Note": 3,
          "Lieu": "OM",
          "Pseudo": "Muna",
          "Nb_Reviews": 1,
          "Date": "2016-02-22T18:41:53.000Z",
          "Titre": "Procedure",
          "Contenu": "It is really great service for start ups. I have an inquiry about the logo been created for my Co. Will it be exclusive for me?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:21:15.000Z",
          "Titre": "Just fair.....technology not that …",
          "Contenu": "Just fair.....technology not that impressive & messed up cards on 1st order.  They did correct it though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Smith",
          "Nb_Reviews": 3,
          "Date": "2017-10-03T15:10:56.000Z",
          "Titre": "gud service recommended!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T00:14:05.000Z",
          "Titre": "Basic designs"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "kemp persad",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:11:42.000Z",
          "Titre": "Using Designmatic since 2013",
          "Contenu": "Using Designmatic since 2013. They designed our company logo and also did promotional printing for us. Satisfied so far...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Lynne Berard",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T22:57:00.000Z",
          "Titre": "Updated review",
          "Contenu": "After my review sharing the attempts at extortion I received an email and text messages asking me to remove my review. As my review was honest I declined. I then told DesignMatic they could do the right thing and I would update my review so now that they have I am updating my review accordingly. They provided me with documentation stating the logo I paid them to design for my company was indeed mine and all rights related to."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "sang",
          "Nb_Reviews": 1,
          "Date": "2019-02-12T19:01:58.000Z",
          "Titre": "Wonderful, Time Saving and Professional Quick Soultions",
          "Contenu": "I dealt with Oscar R. Marshall. He didn't wasted my time and understood my design requirements. He offered me a custom pack and I am good to go with my designs. Loved your skills and ability to understand the customer's requirement. I reserved 1 star for the prices. I wish DesignMantic can offer more affordable prices."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Consuelo Solano",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T19:44:18.000Z",
          "Titre": "Good service but be aware",
          "Contenu": "John was very attentive and knowledgeable. I wanted to buy the rights for a design and he answered all my questions and concerns. The only problem was bad listening, reading to clearly understand the customer request is key to customer service, you can not read between lines you have to actually read every word. I wrote exactly what I needed twice, I sent a picture to make sure the message was clear and I am not talking about colors or design it was about what I was exactly buying and he still got it wrong. John was very fast and efficient fixing it but be aware the lack of listening skills is still there. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ideal Health Weight Loss",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T21:01:35.000Z",
          "Titre": "Great service",
          "Contenu": "I have been having a lot of interaction with John and we have worked together on ways to improve my small business-from business cards to digital signatures with QR codes, logo, SEO, and brochures... John is always willing to help and accommodate."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter Eccleson",
          "Nb_Reviews": 14,
          "Date": "2019-03-27T20:58:15.000Z",
          "Titre": "Pain free process - with a helping(ful) hand!",
          "Contenu": "Thanks to David Holand at DesignMantic for his assistance walking me through the design process. Sterling effort David!Result was really great and a launchpad for my new venture."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "DESMET Marc",
          "Nb_Reviews": 3,
          "Date": "2022-12-19T19:56:46.000Z",
          "Titre": "Logo creation is very intuitive and…",
          "Contenu": "Logo creation is very intuitive and fast.You get everything needed from letter to business card.Yes very usefull."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "shealyinspections",
          "Nb_Reviews": 1,
          "Date": "2018-06-06T14:21:20.000Z",
          "Titre": "Great service and logo",
          "Contenu": "Great service and logo. Didn't upload well for embroidery so only 4 stars. Flawless on every other aspect!!! Will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark DeSimone",
          "Nb_Reviews": 2,
          "Date": "2020-12-17T18:12:04.000Z",
          "Titre": "DesignMantic is great to work.",
          "Contenu": "DesignMantic is great to work with and they turn things around quickly.  I would like to be able to see all of my purchased item in my online account and that is one thing  I would say they should work on."
        },
        {
          "Note": 4,
          "Lieu": "VG",
          "Pseudo": "Kevon",
          "Nb_Reviews": 2,
          "Date": "2018-05-10T10:12:13.000Z",
          "Titre": "It was a great experience creating my…",
          "Contenu": "It was a great experience creating my designs and business cards.  However when I purchased my business cards the quality of the paper could have been better.  Nevertheless I would recommend persons use their services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2018-10-19T19:58:15.000Z",
          "Titre": "Rocky start but the design team came through...",
          "Contenu": "I've been using this platform since 2015 and have never experienced any major issues, until recently, when I tried to modify my logo for rebranding purposes. I was not able to update it, inside the platform, and had to encounter a few speed bumps to remedy the issue. Eventually, my design was updated by the design team and I am pleased with the results - although I prefer to create/modify my own designs as I am a graphics designer and having too much communication in a process that I am capable of handling on my own is very frustrating. DM did offer me a discount on the design services and I sincerely appreciate them for doing this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T19:35:37.000Z",
          "Titre": "Supervisor was excellent and very helpful.",
          "Contenu": "John was very pleasant to work with.  I had some questions which I am waiting for an answer.  Hopefully that will help me with my decision. James M. Finley"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICHARD",
          "Nb_Reviews": 3,
          "Date": "2018-03-19T16:14:26.000Z",
          "Titre": "I was pleased with the experience.",
          "Contenu": "I was pleased with the experience at DesignMantic. They are easy to work with. The download of a LOGO I purchased didn't have the version type I needed and I would have to pay extra for it. That was the only snag I had with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Liz",
          "Nb_Reviews": 5,
          "Date": "2019-06-06T14:28:03.000Z",
          "Titre": "Their logos are excellent",
          "Contenu": "Their logos are excellent. If you're just looking for an easy way to design a logo and download quick, you can't go wrong with DM."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerri Winston",
          "Nb_Reviews": 1,
          "Date": "2018-05-23T19:24:52.000Z",
          "Titre": "I felt like I got special attention to…",
          "Contenu": "I felt like I got special attention to details that were important to me. I have allready recommended to several people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 1,
          "Date": "2018-05-09T18:41:08.000Z",
          "Titre": "Great assistance from the online staff",
          "Contenu": "Great assistance from the online staff, very helpful with placing order, cards printed were perfect!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Cupka",
          "Nb_Reviews": 2,
          "Date": "2019-03-11T15:43:23.000Z",
          "Titre": "Literally thousands of unique logos to…",
          "Contenu": "Literally thousands of unique logos to choose from and when I had issues downloading the support staff responded immediately to resolve the issue."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Brinley Waddell",
          "Nb_Reviews": 5,
          "Date": "2018-04-22T02:54:15.000Z",
          "Titre": "GOOD SERVICE WITH SPEEDY RESPONSE TO…",
          "Contenu": "GOOD SERVICE WITH SPEEDY RESPONSE TO QUERIES"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenny S",
          "Nb_Reviews": 1,
          "Date": "2019-02-22T15:08:32.000Z",
          "Titre": "Very fast customer service on account…",
          "Contenu": "Very fast customer service on account to logos"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernesto Ramirez",
          "Nb_Reviews": 1,
          "Date": "2018-06-13T13:49:32.000Z",
          "Titre": "I like the webside",
          "Contenu": "I like the webside. but someone talk to me and tell me they want service nobody.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T14:20:28.967Z",
          "Titre": "Very Pleased",
          "Contenu": "We needed to create a logo for a new project and Designmantic made this process pleasant and easy. Other logo creation websites were clunky and limited in design options. With Designmantic, there are numerous design options and their customer support team worked patiently with us to get our logo and slogan just right. We were also pleased with the affordability of their purchase packages. We will definitely use them again for future projects and highly recommend their services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T00:58:29.000Z",
          "Titre": "Kind support and cleared up a…",
          "Contenu": "Kind support and cleared up a misunderstanding"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Derek",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T16:36:35.000Z",
          "Titre": "The next step",
          "Contenu": "I have now set up my site and have mastered the design criteriaI have a new domain to use and have had dozens of offers of help.Can you get me thru,contact,shopping baskets and PayPal so I can upload?New domain is www:blueandwhite decor.comCheersDerek"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous dude",
          "Nb_Reviews": 1,
          "Date": "2017-12-27T04:43:15.000Z",
          "Titre": "Have really enjoyed using this site to …",
          "Contenu": "Have really enjoyed using this site to get my new business off the ground. The fees have been reasonable especially for the product I’ve been able to create. I’m planning to continue using DesignMantic while I grow my business."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "RossG",
          "Nb_Reviews": 3,
          "Date": "2017-08-23T08:12:54.000Z",
          "Titre": "Did the job",
          "Contenu": "Did the job, with a timely discount.  Was just about able to manipulate the design into the form I wanted.  A few more fonts wouldn't go amiss, and the follow up selling is a bit excessive.  But happy with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:15:30.000Z",
          "Titre": "Excellent product and quality",
          "Contenu": "Excellent product and quality. Several of the logos were damaged (scratched and creased) during shipping. Perhaps a protective layer could be added to either side of the sheet to keep them safe in transit."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2019-01-09T17:15:22.000Z",
          "Titre": "Thank you, Oscar",
          "Contenu": "Thank you, Oscar, for your great help all the way to the end!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Foundation",
          "Nb_Reviews": 5,
          "Date": "2017-08-25T13:19:22.000Z",
          "Titre": "Very good company",
          "Contenu": "Very good company. Easy to use. I would suggest allowing more characters for longer business names. I was unable to put my complete business name in the logo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S&H Auto depo inc",
          "Nb_Reviews": 1,
          "Date": "2017-02-03T18:57:39.000Z",
          "Titre": "Good customer service quick turnaround time also purchased my logo from them great company I have recommended them to my friends",
          "Contenu": "Good customer service quick turnaround time also purchased my logo from them great company I have recommended them to my friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S Craft",
          "Nb_Reviews": 1,
          "Date": "2017-11-07T18:35:35.000Z",
          "Titre": "Job Well Done",
          "Contenu": "I received exactly what I needed. My design came out beautifully. The customer service was excellent!!!  Job Well Done!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alexis Cox",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T18:06:42.000Z",
          "Titre": "THEY WERE GREAT! Paid for custom logo with 3 edits - got more edits than paid for!",
          "Contenu": "I required a custom logo, as the stock logos on the site did not have what I was looking for, and was a little wary as I paid up front before receiving any graphics...  The logo designer, Asif P Lawrence, worked with me until I had the exact logo I wanted for our company, which was an amalgam of 3 logos they currently had on their site and a graphic which I sketched on a piece of note paper and took a photo with my phone and sent in.\rThey were professional, replied quickly each time I had something to add or note, and kept altering the logo until it was the way I specified even though it took a bit more than the 3 edits we had agreed.  I was probably really demanding and annoying, but they met all my needs and even reached out to call our office (in Canada) when clarification was needed.\rI'm not sure of all the negative reviews, as my experience with DesignMantic was optimal and I would use them again in the future for custom logo services.\r5 stars for servce but minus one star because I'm now unsure whether our company actually 100% OWNS the logo I designed and had commissioned... :/"
        },
        {
          "Note": 4,
          "Lieu": "SI",
          "Pseudo": "Rick Seen",
          "Nb_Reviews": 3,
          "Date": "2017-08-22T15:17:40.000Z",
          "Titre": "Thank you",
          "Contenu": "Very useful for illiterate people like me in the logo designing. Thank you for your supporting tool.R. S."
        },
        {
          "Note": 4,
          "Lieu": "GE",
          "Pseudo": "lorentso",
          "Nb_Reviews": 1,
          "Date": "2019-02-18T17:29:56.000Z",
          "Titre": "Thanks Adam for your work good luck ;-)"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T04:32:54.000Z",
          "Titre": "Quick and painless to select and design …",
          "Contenu": "Quick and painless to select and design the logo I wanted for my small business."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Christel",
          "Nb_Reviews": 2,
          "Date": "2017-11-03T20:06:25.000Z",
          "Titre": "Thank you for your job",
          "Contenu": "The job had been done just like what I asked for, definitely recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T14:26:46.000Z",
          "Titre": "Very good",
          "Contenu": "Very good,  easy, efficient and professional results."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Christian",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T15:14:19.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, fast, and lets you work well before commiting."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T16:58:07.000Z",
          "Titre": "Easy help",
          "Contenu": "Timely help in a time of urgent need."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Nikki",
          "Nb_Reviews": 2,
          "Date": "2017-08-29T23:47:38.000Z",
          "Titre": "Good work",
          "Contenu": "Good work, happy with the service"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Abu",
          "Nb_Reviews": 2,
          "Date": "2017-08-22T15:38:41.000Z",
          "Titre": "The logo was very good",
          "Contenu": "The logo was very good Thank you"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Julian",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T05:38:35.000Z",
          "Titre": "Good job!",
          "Contenu": "Very easy and fast logoservice!"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Tobi",
          "Nb_Reviews": 2,
          "Date": "2017-08-22T15:59:42.000Z",
          "Titre": "Quick turn around time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melanie",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T14:56:57.000Z",
          "Titre": "Good products!o",
          "Contenu": "Good products!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kerri",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T03:35:11.000Z",
          "Titre": "Business Card Order Made Simple",
          "Contenu": "Adam at Design Mantic made it simple to order business cards for my team at the office. He helped to edit a design from a previous order and offered a discounted rate for a multi-card purchase. He returned my proof for approval within a few short hours and promised a timely delivery of my printed order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristina Handley",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T02:53:03.000Z",
          "Titre": "Affordable Logo Design",
          "Contenu": "DesignMantic makes simple logo design very easy and affordable. I’ve used them for two start-up endeavors so far, and I’m very pleased. Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Drew Elliott",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T19:51:44.000Z",
          "Titre": "The best logo-maker period.",
          "Contenu": "There are many many logo creating websites out there, but after trying the majority this one is the best. This one has more customizable options than most, excellent ease of use, and it looks like they offer many other services that look great as well. Would definitely recommend. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T21:20:37.000Z",
          "Titre": "Shaun Paul at DesignMantic",
          "Contenu": "We have used Shaun Paul at DesignMantic a couple times now. He is currently working on our Company's 25th Anniversary logo and has been professional and very good at listening to what we have in mind to make sure we receive some great options. We look forward to seeing them what he comes up with again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie Organista",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T01:04:00.000Z",
          "Titre": "DesignMantic",
          "Contenu": "DesignMantic, and Shaun Paul specifically, reached out to me since I had purchased one of their designs many years ago, to see if I wanted to purchase the rights to the logo entirely! They had a client that was interested in the design, but reached out to me first for the first refusal. Shaun was wonderful, and kind and super helpful overall. They're wonderful overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JeanRiguel Ulysse",
          "Nb_Reviews": 3,
          "Date": "2020-11-17T17:14:08.000Z",
          "Titre": "I am a return customer of Design…",
          "Contenu": "I am a return customer of Design Mantic. Three years ago we purchased a \"Logo\" for another entity we were pleased then. This time we decided to use their service and in a matter of hours we a beautiful logo designed to our satisfaction. We also got business cards and letterheads designed as well. We're also planning to have them design our website. We encourage others to use their services.Thank you,Jean Riguel UlyssePresidentPinnacle Consulting Group, LLC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T17:59:11.000Z",
          "Titre": "Support above and beyond expectations!",
          "Contenu": "I needed help downloading the logo I created and Alan Smith, Senior Customer Support Executive, not only squared me away on the download -- he took it upon himself to give the logo a Quality Assurance look and discovered it wasn't properly centered. That had nothing to do with the download issue but was something I had entirely missed.  Alan did the QA on his own, discovered my error and fixed it. Great customer support above and beyond all expectations. Five Stars for Alan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T13:03:28.000Z",
          "Titre": "A pleasurable experience",
          "Contenu": "The process of creating our design which is the centerpiece of our recognition in the community was very simple. Obtaining the ownership rights at an affordable price was key. Working with John who created our business cards and stationary was a pleasure. We will turn to John and DesignMantic for our future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R and R",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T00:54:46.000Z",
          "Titre": "Shaun Paul at TrustPilot is the best!",
          "Contenu": "Shaun Paul at TrustPilot was very helpful and able to answer any questions that I had! I was just tinkering with the website and templates when he messaged me through the site. I will be proceeding with a custom logo thanks to him!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Stunda",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T18:15:17.000Z",
          "Titre": "Professional Top Quality Work - Highly recommend!",
          "Contenu": "I hired DesignMantic to assist me with a logo design and printing of business cards. Extremely pleased with the professionalism, quick response time  and quality of work - I have reordered cards and they were and continue to be especially helpful with some minor logo changes.  Highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ravi Bhola",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T02:22:20.000Z",
          "Titre": "Unique Design and Great customer service",
          "Contenu": "I had the opportunity to work with John Parker. He was clear, prompt and very easy to deal with. He prepared an awesome set of documents for me quickly and made some very valuable suggestions that were helpful in me getting the best scenario for the money that I spent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda C.",
          "Nb_Reviews": 2,
          "Date": "2018-03-27T01:11:46.000Z",
          "Titre": "Great start for my company!!",
          "Contenu": "I found DesignMantic while searching the web.  I'm so thankful I found them.  I designed my own logo.  I also got letterhead, envelopes, business cards, and tee shirts.  Everything I purchased was created with quality material.I am very satisfied with my purchases. Thank you DesignMantic!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Green",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T22:24:49.000Z",
          "Titre": "Created a company logo and letterhead image",
          "Contenu": "I started a small company (DBA) and wanted a catchy logo to put on my business cards and letterhead.  DesignMantic provided the online tools and images to allow me to create a logo I can be proud of.I purchased all rights to the logo and image for a great price.  John Parker walked me through the process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quinn Hofmann",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T22:57:18.000Z",
          "Titre": "DesignMantic - John Parker",
          "Contenu": "John Parker was extremely helpful and patient with the development/design of my company’s logo. His work was always timely and of consistent quality. DesignMantic is a great one-stop shop for my company’s logo, stationary and website designs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 2,
          "Date": "2018-08-21T02:58:39.000Z",
          "Titre": "DesignMantic is a gem",
          "Contenu": "DesignMantic is a gem. They are customer focused, provide excellent service, and are very prompt with quick turnaround on questions or changes to designs. I would recommend them to any small or medium size business looking for sharp, crisp, trendy design as they provide tremendous value for their customers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rish B",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T16:33:42.000Z",
          "Titre": "Logo design - Adam Benson",
          "Contenu": "Designmantic is a great convenient service. Very fast and responsive. Our design consultant Adam was efficient and provided a great logo for our startup business. I would definitely use their services again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roger Munyard",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T16:51:03.000Z",
          "Titre": "A satisfied return customer",
          "Contenu": "I have used DesignMantic twice now for designing my business card and logo. I found their website easy to use and was able to design my card without difficulty. DesignMantic were able to give me  a good discount on my second order and exceeded my expectations when having ordered and paid for my card I found a problem with it - of my own doing. A small change to my logo was made at no charge. Their after sales service with personal contact was very good and extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelina Frey",
          "Nb_Reviews": 2,
          "Date": "2020-07-14T23:59:07.000Z",
          "Titre": "I purchased an amazing design from…",
          "Contenu": "I purchased an amazing design from LogoDesign! I was assisted by Adam Benson who was absolutely awesome, very professional and patient.  He walked me through the process and everything worked in a timely manner. I enjoyed doing business with Adam and love my design!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Maks",
          "Nb_Reviews": 3,
          "Date": "2019-10-25T21:12:19.000Z",
          "Titre": "Great Experience With DesignMantic",
          "Contenu": "I had the great pleasure of working with Adam and his team with DesignMantic.  I will say we used all of our allowed revisions and actually then some.  We are beginning a new business and it took more time than I'm sure most do with creating our logo as well as our business cards.  Adam was easy to work with and their platform is great.  I will definitely recommend their company as well as I will be returning when we are ready to create our social logos.   Thanks Adam. --- Dave & Mercedes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica Breeden",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T16:55:22.000Z",
          "Titre": "I just want to say tis is the BEST…",
          "Contenu": "I just want to say tis is the BEST company I have ever used for our printing needs as a business and we have used several. They do top quality work. We have had business cards as well as shirts printe4d with our logo on them and there work is top notch. I would definitely use them in the future and recommend them to anyone looking for a GREAT company to have business material printed."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Wan Nurul Farihah",
          "Nb_Reviews": 3,
          "Date": "2022-10-31T16:19:49.000Z",
          "Titre": "Great logo maker",
          "Contenu": "There are a lot of logo design for ideas. Easy to use to build my own logo. Can customize the logo colours & text with wide range of options given. The logo template is attractive, up to date and not cliche. Support from Jonathan, the design consultant really helpful and fast response."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Eduardo Daniel Dubra",
          "Nb_Reviews": 1,
          "Date": "2019-06-21T13:54:42.000Z",
          "Titre": "DesignMantic has provided us with…",
          "Contenu": "DesignMantic has provided us with excellent service and support!. Oscar was very helpful and clear in his explanations about the product, the options and conditions of the purchase. Everything was quick and easy. The quality of the desings are also very good compared to other sites."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Natalia Pakhina",
          "Nb_Reviews": 1,
          "Date": "2018-12-21T20:14:53.000Z",
          "Titre": "Thanks for the great logo design!",
          "Contenu": "I had a great experience with DesignMantic across the whole process + the final logo came out really well. Mark was always ready to answer questions, find the solution and fit into the budget. Very much appreciated. I was lucky to chose DesignMantic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Taylor Mckinney",
          "Nb_Reviews": 1,
          "Date": "2018-05-23T17:26:04.000Z",
          "Titre": "Awesome experience with the…",
          "Contenu": "Awesome experience with the designmantics team!  Very professional, skilled, knowledgeable group of developers and designers. They really listen to hear your vision and your outcome. And go to work trying to create the feel and image of what you’ve expressed. Most importantly they meet me at the point of my development and design needs.  The service is affordable, professional, and your team is very attentive to detail!  I will recommend designmantics in a  heartbeat!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlotte A.",
          "Nb_Reviews": 1,
          "Date": "2018-08-09T12:31:18.000Z",
          "Titre": "Experience was 100% positive",
          "Contenu": "Experience was 100% positive.  Not only would I recommend them, but I most certainly plan to use them again in the future.  Found them to be extremely responsive, they produced all design proofs within the stated time frame (which was a much shorter time frame than I had expected).  They were extremely responsive to feedback and edits on my designs.  At the end of the easier-than-expected process they delivered high quality images that were EXACTLY what I had envisioned.  They delivered on everything they promised and exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Wade",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T19:50:47.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Very easy site to use.  Business card printer emailed me to ok business cards before printing as he had found some spacing problems.  Haven’t received cards yet but I like the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Stack",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T17:56:55.000Z",
          "Titre": "Great experience",
          "Contenu": "After a few years I was contacted to purchase my logo! I was given the opportunity to split up the payments which worked great for me! Alan worked closely with me to get exactly what I wanted! I highly recommend DesignMantic for all your logo needs!"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Jessica Yu",
          "Nb_Reviews": 1,
          "Date": "2019-07-19T06:16:45.000Z",
          "Titre": "Great logo design.",
          "Contenu": "Great logo design.The team is willing to solve issues that I had with high resolution file need.Yet the logo package could also provide high resolution package from the very beginning to avoid such issues and services needed afterwards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlotte Wildlife Stewards",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T23:04:36.000Z",
          "Titre": "We had been using this logo for years…",
          "Contenu": "We had been using this logo for years (had paid to use it, but not own it). When someone wanted to purchase the logo, the company offered it to us first. They promptly made the requested changes and we purchased the logo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Remie Longbrake",
          "Nb_Reviews": 1,
          "Date": "2019-04-03T01:00:58.000Z",
          "Titre": "I enjoyed my experience with…",
          "Contenu": "I enjoyed my experience with DesignMantic, specifically Oscar and the design team. They took time to understand what designs I had in mind and put my ideas to reality with much patience. Concept to completion date when quickly and smoothly. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Greg Hare",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T20:51:04.000Z",
          "Titre": "quick answers, patient help",
          "Contenu": "Jonathan made sure to answer any questions quickly; he also patiently waited to make sure we could get any issues resolved.   Professional"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T00:21:07.000Z",
          "Titre": "DesignMantic 5 Star Service",
          "Contenu": "Been using designMantic for just over 6 years. Easy to get started and adopt a logo that suits your brand. Would highly recommend and get in touch with Shaun Paul if you have any questions. Response time is great!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "sara cologni",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T18:13:19.000Z",
          "Titre": "Thank you to DesignMantic I could have…",
          "Contenu": "Thank you to DesignMantic I could have my fantastic logo in just 30 minutes and it was great. Thank you also to your very helpful and great Help/Center - and Mr. Oscar who helped me to complete the downloading of my logo files.I really do suggest DesignMantic for its efficiency and great results.Sara C. Bergamo - Italy"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Morten Stenersen",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T06:28:20.000Z",
          "Titre": "I looked around and tested several logo…",
          "Contenu": "I looked around and tested several logo tools, and Designmantic was my favorite. Made a great logo, and it's nice that you can buy vector files at an additional cost after the initial purchase since vector files are crucial for a lot of different marketing uses."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paula Laycock",
          "Nb_Reviews": 2,
          "Date": "2018-10-23T20:57:02.000Z",
          "Titre": "Fast, great service from DesignMantic",
          "Contenu": "Fast, great service from DesignManticAsked the guys at DesignMantic to send a higer res image of a logo I did 2 years ago.They were extremely fast and efficient and would have no hesitation in recommending them to other people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 3,
          "Date": "2023-02-24T03:07:23.000Z",
          "Titre": "BEST LOGOS ON THE MARKET WITH THE BEST…",
          "Contenu": "BEST LOGOS ON THE MARKET WITH THE BEST SERVICE!  The process was EASY.  I have purchased many logos from DesignMantic and all of them look amazing!  I did have an issue on this last purchase that was my fault!  However I called and spoke to John in support and he was AMAZING!  John turned a bad situation around and made it great!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "J Leppington",
          "Nb_Reviews": 13,
          "Date": "2020-02-06T17:42:48.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Highly recommend - excellent valueExcellent help from Adam. English Rooms now has a brandspanking new logo for its website and facebook page.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Robin Lofton",
          "Nb_Reviews": 1,
          "Date": "2019-04-30T08:29:22.000Z",
          "Titre": "Fantastic and patient designer",
          "Contenu": "Adam was fantastic to work with! I needed a logo and thumbnail for my podcast show. He was responsive, quick and very professional. I made a few mistakes but Adam was patient and made last-minute changes for me. I will definitely work with him again!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Charrex Express Limited",
          "Nb_Reviews": 1,
          "Date": "2018-06-27T17:15:53.000Z",
          "Titre": "Designmantic recently offered us…",
          "Contenu": "Designmantic recently offered us terrific service and for this reason I've referred someone already but their prices should be reviewed downward. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Krinsky",
          "Nb_Reviews": 1,
          "Date": "2019-08-21T16:06:53.000Z",
          "Titre": "We needed a new logo for our business…",
          "Contenu": "We needed a new logo for our business and DesignMatic was very helpful. We had a basic design in mind, but DesignMatic cleaned it up and made it professional. The revision process was easy and they were great to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T00:15:55.000Z",
          "Titre": "Paul was very helpful with thoughts and…",
          "Contenu": "Paul was very helpful with thoughts and ideas in creating logos for our new business venture. He was very professional, respectful and courtesy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Members Direct Home Loans",
          "Nb_Reviews": 2,
          "Date": "2019-06-06T17:43:40.000Z",
          "Titre": "I have work with DesignMantic for…",
          "Contenu": "I have work with DesignMantic for several years and each time their service and attention to detail has been top notch. Adam is very helpful and patience with our requests.  Kelly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kossi C. Fiadjigbe",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T18:17:16.000Z",
          "Titre": "Super easy to work with DM while making changes as needed",
          "Contenu": "DM is very good at taking feedbacks and apply it while striving to make your logo even better, and beyond your expectations."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Princewill Dimkpa",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T09:54:58.000Z",
          "Titre": "Very trustworthy",
          "Contenu": "This company is very customer centric and trustworthy. I have been dealing with them for about two years now so i can attest to their dedication. I highly recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earl L Kerl",
          "Nb_Reviews": 3,
          "Date": "2019-09-23T17:40:20.000Z",
          "Titre": "Excellent Design",
          "Contenu": "Adam Benson was a very good listener and he was very Professional. He really has a knack for putting things together and making them come out awesome!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "BabyG Love",
          "Nb_Reviews": 2,
          "Date": "2021-01-26T04:10:21.000Z",
          "Titre": "Exceptional Professionalism and Customer Service",
          "Contenu": "I’ve been dealing with Designmantic for a while now but the service I received from Shaun was exceptional. This was beyond professional and on time. Thanks for being a wonderful team leader Shaun"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra",
          "Nb_Reviews": 1,
          "Date": "2019-06-20T19:49:35.000Z",
          "Titre": "DesignMantic provide excellent service…",
          "Contenu": "DesignMantic provide outstanding service and support! On my most recent purchase, Oscar was very helpful and even assisted when I pulled the trigger a little too soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Honoraee",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T20:42:19.000Z",
          "Titre": "I called today to take care of a…",
          "Contenu": "I called today to take care of a problem that was already done and he was more then willing to do whatever was needed to be done to make things work for me, this is the type of services I love."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Josiah Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T02:52:04.000Z",
          "Titre": "Shaun Paul is a good worker! 5 star for him!",
          "Contenu": "A certain person named Shaun Paul helped me a lot! He was able to assist me in my logo-making process via the chat!"
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Peter Wilson",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T17:04:24.000Z",
          "Titre": "Best customer service ever",
          "Contenu": "Best customer service ever. They always comes to understanding with you and find solution for every problem you have. The most trusted service ever and meet your every needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miesha",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T16:02:09.000Z",
          "Titre": "Awesome!",
          "Contenu": "So easy to use. The customer service is awesome. Of all of the daunting tasks associated with entrepruership, I'm very grateful that this was very easy (and fun) to complete. Thank you, thank you, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orpheus Kennedy",
          "Nb_Reviews": 1,
          "Date": "2020-04-14T18:10:35.000Z",
          "Titre": "Great Team and Atmosphere!",
          "Contenu": "Worked with the DesignMantic team a few times and they are always great to work with.  Adam is awesome!  Great work, fast turnaround, and always very professional.  Will be doing business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane Sangster",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T17:59:57.000Z",
          "Titre": "Awesome service by logodesign.net",
          "Contenu": "Awesome service by logodesign.net. Everything went great except for one small issue which was resolved by Adam in one contact that took less than 2 minutes. Great team, great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "just dee",
          "Nb_Reviews": 2,
          "Date": "2019-05-30T18:13:59.000Z",
          "Titre": "Oscar was the contact man for me and I…",
          "Contenu": "Oscar was the contact man for me and I was a pain in his rear, but he came through for me and they developed an awesome logo.  I wasn't really sure what I wanted the logo to look like and it took a few revisions, but they nailed it.  I'm very happy with the results.  Great job Oscar and I highly recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Robidas",
          "Nb_Reviews": 1,
          "Date": "2018-06-07T14:54:22.000Z",
          "Titre": "Thank you Kevin for all your help!",
          "Contenu": "Thank you Kevin for all your help!We are very happy with the results of our business cards, envelopes and letter head :o)Sincerely,Judy Robidas"
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "mohammed ramahi",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T00:10:13.000Z",
          "Titre": "the best sevice",
          "Contenu": "WOW! the best experience ive ever had! the service was amazing! and i found all my answers for the questions ive asked by Jonathan! at first i lost hope...but then Jonathan helped me with all of my questions! and i have found the logo i want! whenever i ask he replies as fast as possible! im so lucky I've had him as a helper!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph nazeck",
          "Nb_Reviews": 2,
          "Date": "2018-05-10T15:31:25.000Z",
          "Titre": "The staff was very helpful in all…",
          "Contenu": "The staff was very helpful in all changes. Would highly recommend this company for help with your logo. Customer service these days is at a all time low, its nice to work with people that truly help to make you feel like a customer. Also to add they make sure you have the product you want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Dixon Thompson",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T22:00:19.000Z",
          "Titre": "Adam was very professional",
          "Contenu": "Adam was very professional. He listened to my idea of our company branding and created an excellent logo for us! I highly recommend DesignMantic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna McClure",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T18:45:47.000Z",
          "Titre": "Received Instant and patient help",
          "Contenu": "wow I received instant help with my questions when I tangled myself up trying to come up with a logo design.   They where very patient with me and helped guide me though the process. Since I am not tech savvy I needed a bit of help to use the site. Now I see just how easy it is. Thank you so much Jonathan for all your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "All Star Acosta Trucking Inc",
          "Nb_Reviews": 1,
          "Date": "2019-04-11T18:44:34.000Z",
          "Titre": "Adam",
          "Contenu": "AdamWorked on my Trucking Logo and i am so happy with this design is everything i imagined... Very quick and attended to all my little details.I will recommend Logodesign.net to all my families and friends.YOU ARE THE BEST GUYS AWESOME JOB !!!!BEST WISHES.....ALL STAR ACOSTA TRUCKING INC"
        },
        {
          "Note": 5,
          "Lieu": "CW",
          "Pseudo": "Neha Dua",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T15:31:38.000Z",
          "Titre": "ADAM Benson ASSISTED OUR TWICE FOR OUR…",
          "Contenu": "ADAM Benson ASSISTED OUR TWICE FOR OUR 2 COMPANIES. HE DID A GREAT JOB.INSTANT , FLEXIBLE AND PROFESSIONAL . Thank you :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T20:03:05.000Z",
          "Titre": "Quick and Easy Professional Logo",
          "Contenu": "Created a logo by looking at their designs, added the firm name, Adam gave me a discount code and I downloaded the design within a few minutes.  Very simple."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "NARESH",
          "Nb_Reviews": 11,
          "Date": "2018-03-19T15:47:58.000Z",
          "Titre": "A variety of download options available…",
          "Contenu": "A variety of download options available for your design. Very professional and delivered on time. Thank you Design Matic Team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher H Magee",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T12:04:45.000Z",
          "Titre": "The assistance with using the …",
          "Contenu": "The assistance with using the  DesignMantic website was great. My assistant contacted me unexpectedly and coached me through the process of completing my logo design for my company.  Without this assistance I would have gone to another website to complete my design."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T15:25:34.000Z",
          "Titre": "Great service",
          "Contenu": "David was very helpful, and gave me a good deal on my high quality designs. Will continue to keep using design mantic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Zakutny",
          "Nb_Reviews": 1,
          "Date": "2018-08-08T21:25:00.000Z",
          "Titre": "Very helpful",
          "Contenu": "I needed a lot of hand holding and help in creating my business card with the new logo and Richard was extremely patient and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delilah Chavez",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T00:41:35.000Z",
          "Titre": "Excellent experience!",
          "Contenu": "Excellent experience!  Great material, super user friendly and customer service went above and beyond.  Shaun Paul provided friendly, helpful and knowledgeable service; will definitely use again!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "S. Bani-Younes",
          "Nb_Reviews": 2,
          "Date": "2019-10-25T19:12:47.000Z",
          "Titre": "Can only recommend",
          "Contenu": "Very happy with support and offered solutions. Was very nice to work together with Adam from customer support. I can just recommend this team. The Price range is also fare. Thank you very much, guys!"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Noel Santos",
          "Nb_Reviews": 1,
          "Date": "2018-05-11T16:07:09.000Z",
          "Titre": "My experience with the company is…",
          "Contenu": "My experience with the company is great, special with Shawn. He’s very responsible with my request, any time that I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spaggia Italy",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T15:00:27.000Z",
          "Titre": "Fantastic Service",
          "Contenu": "Fantastic Service!  Extremely fast turn around time and completed project exactly as I needed.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Ashruka Melanie",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T20:57:28.000Z",
          "Titre": "fast",
          "Contenu": "fast, and awesome support. clear instruction and nice support. I am happy with this service. Thank you for supporting me you are great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberts Family Enterprises",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T22:51:17.000Z",
          "Titre": "Great job!",
          "Contenu": "Always makes it exactly the way I want and I just tell them what I want and they make it happen. John is always willing to help me with my crazy ideas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Gard",
          "Nb_Reviews": 1,
          "Date": "2018-02-09T21:46:41.000Z",
          "Titre": "My design logo came out exactly the way …",
          "Contenu": "My design logo came out exactly the way I wanted. Quick results and good communication. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Elsabe Trollip",
          "Nb_Reviews": 2,
          "Date": "2018-04-18T20:08:56.000Z",
          "Titre": "Really great service",
          "Contenu": "It was super easy to create my logo and when I ran into some problems, the DesignMantic team was really very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T06:55:57.000Z",
          "Titre": "Well it help me figure out my business…",
          "Contenu": "Well it help me figure out my business logo for my shop and find my business card too."
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "chibamba Kanyama",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T14:11:16.000Z",
          "Titre": "Shaun was very professional throughout…",
          "Contenu": "Shaun was very professional throughout the process of designing email signatures for my staff. I enjoyed the experience. We will continue to engage Design Mantic for other remaining needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Macy Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T16:12:47.000Z",
          "Titre": "They did a great job and was a lot…",
          "Contenu": "They did a great job and was a lot quicker than most any other company! The service is amazing! I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Daniel Barco",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T18:40:52.000Z",
          "Titre": "DesignMantic was a very page to create…",
          "Contenu": "DesignMantic was a very page to create my Logo, Brian Edwin was an excellent representative, he helped me with everything that I needed it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose Lorenzo",
          "Nb_Reviews": 1,
          "Date": "2018-09-17T15:45:26.000Z",
          "Titre": "Excellent service",
          "Contenu": "The process to have my design created and cards printed was very quick and easy. They were shipped to me and arrived earlier than expected.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Emily Williams",
          "Nb_Reviews": 2,
          "Date": "2019-02-01T18:43:22.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! David Holand helped me with my download and even gave me a discount on their live chat. Really impressed, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Stitik",
          "Nb_Reviews": 1,
          "Date": "2018-08-15T23:28:39.000Z",
          "Titre": "I designed a logo with thier online…",
          "Contenu": "I designed a logo with thier online design tool then had them customize it. Great service at a great price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "AA Abbas",
          "Nb_Reviews": 6,
          "Date": "2023-03-16T19:09:57.000Z",
          "Titre": "Great guys to do business with",
          "Contenu": "Great guys to do business with. Really appreciate the prompt replies to questions and open honest communication throughout."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "ZuriXpress Training and Projects Pty",
          "Nb_Reviews": 2,
          "Date": "2020-07-10T14:25:09.000Z",
          "Titre": "Quick responses from the consultants…",
          "Contenu": "Quick responses from the consultants (John). I love DesgnMantic, I have been using them for years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Pauldine",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T21:00:15.000Z",
          "Titre": "Outstanding",
          "Contenu": "Oscar was very professional and the service was lightning quick. I'll definitely use their services again!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Serban Madalin",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T21:07:56.000Z",
          "Titre": "Great logos and support is awesome !!",
          "Contenu": "Great logos and support is awesome !!! You can try it , they worth each penny , im very satisfied :) !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kendria morgan",
          "Nb_Reviews": 5,
          "Date": "2018-12-13T15:46:11.000Z",
          "Titre": "It was great working with Design…",
          "Contenu": "It was great working with Design Mantic! They listened to all my ideas and vision and brought it to life. I've already recommended them to my friends. Thank you Adam and your team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jp Hoffman",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T20:54:40.000Z",
          "Titre": "Wonder Customer Service",
          "Contenu": "Wonder Customer Service! 5 Star Service All The Way! Will Be Using Them Again For Sure!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T16:43:35.000Z",
          "Titre": "I had an excellent experience",
          "Contenu": "I had an excellent experience!  Great job on my logos!Thanks a lot David Holand!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "True Gains",
          "Nb_Reviews": 1,
          "Date": "2019-05-09T18:28:41.000Z",
          "Titre": "just bought my logo from this site",
          "Contenu": "just bought my logo from this site. adam kindly popped up and offered me a discount! amazing site and will definitely be using again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 2,
          "Date": "2019-09-11T13:31:14.000Z",
          "Titre": "Adam with DesignMantic provided great…",
          "Contenu": "Adam with DesignMantic provided great customer service and was very helpful. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris B.",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T21:49:00.000Z",
          "Titre": "Shaun was very helpful and…",
          "Contenu": "Shaun was very helpful and professional, he helped me to design my business card"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan McIntyre",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T16:13:23.000Z",
          "Titre": "Easy to create and customize designs",
          "Contenu": "Easy to create and customize designs. I am very happy with the service and speed  of the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enrique Gardano",
          "Nb_Reviews": 1,
          "Date": "2018-09-11T16:51:36.000Z",
          "Titre": "David Holand",
          "Contenu": "The designer, David Holand, is super and has listened and tried to make the logo I'm asking for in a very professional manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maya Karakaeva",
          "Nb_Reviews": 1,
          "Date": "2018-06-13T20:24:40.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, follow up and great job on the logo! Thank you David for all your help along the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Kay",
          "Nb_Reviews": 4,
          "Date": "2018-06-05T20:48:01.000Z",
          "Titre": "I've used this company multiple times and still would in the future",
          "Contenu": "I've used this company multiple times now and customer service is excellent and they are always friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T03:07:09.000Z",
          "Titre": "Shaun Paul was just great and…",
          "Contenu": "Shaun Paul was just great and informative as i have a several questions."
        },
        {
          "Note": 5,
          "Lieu": "KW",
          "Pseudo": "Abdullah B Al-Qadeeri",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T21:32:49.000Z",
          "Titre": "The best!",
          "Contenu": "The best!The service they provide is great for any business starters!...  took me less than 30 minutes to set my business cards, company envelopes, and an a4 sheet with logo and all!!.. Worth every penny! life saver!.. I thank you for this.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Femi Odunbaku",
          "Nb_Reviews": 2,
          "Date": "2019-05-31T17:32:16.000Z",
          "Titre": "Very elegant designs",
          "Contenu": "Very elegant designs. I found it difficult pick from all the fantastic designs."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Nicole Epifanio",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T15:13:30.000Z",
          "Titre": "Excellent service",
          "Contenu": "I have to say this service is great, fast and easy. Adam in customer service was very helpful with everything I needed."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Marco Simonetti",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T14:02:55.000Z",
          "Titre": "I'm very satisfied",
          "Contenu": "I'm very satisfied with the service and support. I found interesting design. Thanks."
        }
      ]
    }
  ]
}