{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.cases.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Kunde",
          "Nb_Reviews": 7,
          "Date": "2023-12-07T18:52:41.000Z",
          "Titre": "Badbadbad",
          "Contenu": "Really expensive freight that took a very kong time, should have been express at that cost. It also took  a very long time for them to deliver and on top of everything I had to pay tax and handling to FedEx after delivery🫣🥺"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherry  Futchko",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:25:17.000Z",
          "Titre": "Very disappointed in length of time to…",
          "Contenu": "Very disappointed in length of time to receive my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G Reithman",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:12:36.000Z",
          "Titre": "Didn’t have what I wanted but website…",
          "Contenu": "Didn’t have what I wanted but website said it did,took to long to receive I will never order again from them probably shouldn’t have something on your site if it’s not available,or have an explanation of when it will be available"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dionne",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T02:30:57.000Z",
          "Titre": "Need help!!",
          "Contenu": "My son ordered the 15 pro instead of the 15 pro max and I can’t figure out how to return and/or exchange this item. I would appreciate being contacted so I can make an exchange or return this item for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dimpy Gala",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:11:53.000Z",
          "Titre": "Extremely Dissatisfied",
          "Contenu": "PLEASE READ RETURN POLICY BEFORE BUYING THE PRODUCT. ALSO COMPARE PRICES OF THE SAME PRODUCT ON OTHER WEBSITES."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacy Jacques",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T02:23:22.000Z",
          "Titre": "I ordered from you because I needed a…",
          "Contenu": "I ordered from you because I needed a case quickly and you promised a case by a certain date.  I still have not received my package and I have been charged a fee by ATT because I haven’t yet activated my new phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T23:43:28.000Z",
          "Titre": "Awful customer service. Crooked company",
          "Contenu": "I ordered a cover case for my iPhone 14 pro. They sent a used opened package without any tracking or purchase information. Also the package had a missing part which they claim its the original producer’s problem.long story short,after contacting their customer service they offered me to return it on my own expense !!! I had a very unpleasant experience with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carolyn  Parks",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T04:18:41.000Z",
          "Titre": "No return policy for flawed, cheaply made item",
          "Contenu": "Although the return policy is clear on their website for returns and exchanges, when a product is flawed and cheaply made, a refund should be available.  I have ordered the phone cases before and they were high quality to match the high price.  This is no longer the case.  And they refused to give me a refund for the $3 case that cost me $90."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T22:32:30.000Z",
          "Titre": "Very poor shipping time",
          "Contenu": "I paid $22 for 2 Day FedEx shipping because we just bought a new phone for my wife and wanted to protect it only to find out this seller is a third party seller and doesn't have any control over the shipping. It took over a week to receive and I couldn't be more disappointed in this company. I would not recommend them to anyone. You'll get much better service from Amazon or Walmart.~~~~~~~~~~~~~~~~~~~~~~~~If you are the shipping point, why does it take over a week to receive an item after charging  me $22 for 2 day shipping?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sylvia Fletcher",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T11:42:09.000Z",
          "Titre": "The worst case ever from Piel Frama",
          "Contenu": "The worst case ever from Piel Frama. Doesn't fit the phone very well. All of my cases purchased in the past have been Piel Frama. This one doesn't qualify to even use the name. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori Curry",
          "Nb_Reviews": 4,
          "Date": "2023-06-03T23:53:36.000Z",
          "Titre": "The website allows you to pay extra for…",
          "Contenu": "The website allows you to pay extra for expedited 2 day shipping. But that's not what happens. I was very disappointed that I had to leave town without a case to protect my phone. And they won't refund the extra paid for 2 day shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher payton",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T00:35:49.000Z",
          "Titre": "The prop on the back of the case broke…",
          "Contenu": "The prop on the back of the case broke the second day of having it, the case also did not come with a screen protector. I wouldn't have spent $20 on this case had I known the main reason I picked it would break the second day and if I had known there wasn't a screen protector."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RON ROECKER",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T13:23:23.000Z",
          "Titre": "First I was told my order was being…",
          "Contenu": "First I was told my order was being processed, then 4 or 5 days later I was told it was there was a change and it was being processed. Plus I had to wait longer, it took about 10 days for the order to get to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "scott",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T04:41:02.000Z",
          "Titre": "Case has started to wear and discolored…",
          "Contenu": "Case has started to wear and discolored after two weeks. Not the otterbox quality that my other cases were"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Southon",
          "Nb_Reviews": 3,
          "Date": "2023-01-28T17:03:00.000Z",
          "Titre": "The cover I ordered had the sliding…",
          "Contenu": "The cover I ordered had the sliding door on it to cover the camera lens. The one I received does not. The main reason for me ordering this case was to have the hinge section of the phone protected. This cover, after one day of use, has already fallen off and I cannot get it back on. I'm very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Hood",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T01:34:35.000Z",
          "Titre": "I purchased a case specifically because…",
          "Contenu": "I purchased a case specifically because of where the flowers were placed on the case, and the case I got , had the flowers not in the same spot as pictured. Not happy that I have to deal with the hassle of  returning this item when you guys advertised the wrong picture for the case I ordered…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tokarz, Richard",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T21:00:03.000Z",
          "Titre": "Well first off the case did not fit my…",
          "Contenu": "Well first off the case did not fit my phone properly, it fit the size of the phone but the holes did not line up with anything, and secondly it took way too long to arrive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T15:16:41.000Z",
          "Titre": "The problem is with the product you…",
          "Contenu": "The problem is with the product you folks are ok . I didn't get a verification email nor did I get any shipping information until I called and  asked for the info."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randal Needham",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T02:57:59.000Z",
          "Titre": "Well first off I haven't received my…",
          "Contenu": "Well first off I haven't received my order yet, so guess you could improve on getting orders out faster."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynn Mashburn",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T09:20:06.000Z",
          "Titre": "Wanted the Defender Pro Max",
          "Contenu": "I was sent the Defender Pro.I ordered the Defender Pro Max.I want to return the Pro and send me the Pro Max.Thank you,Lynn Mashburn"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pissed off customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T21:55:51.000Z",
          "Titre": "To customer support",
          "Contenu": "To customer support. Do not bother me with irrelevant questions about returns or you will always stay a “small business”"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kari Hartikainen",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T07:27:13.000Z",
          "Titre": "Weeks to receive, still waiting",
          "Contenu": "It's taking weeks for me to receive it which I still haven't received it and it was in USD dollar wasn't so I had to get the exchange rate to Canadians so it was 30 extra bucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Steward",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T22:31:02.000Z",
          "Titre": "Still haven’t received it despite…",
          "Contenu": "Still haven’t received it despite paying extra for priority mail . Very late"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon Ferrell",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T23:44:45.000Z",
          "Titre": "Can't believe you made me pay shipping…",
          "Contenu": "Can't believe you made me pay shipping back to you, it cost me half as much as the Dan case...I'll never order from you again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toto",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:03:05.000Z",
          "Titre": "Very slow shipping time",
          "Contenu": "Very slow shipping time. I won't be using this website in the future"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Lochmann",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T00:52:19.000Z",
          "Titre": "Case causes phone volume buttons to not…",
          "Contenu": "Case causes phone volume buttons to not function."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Miller",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T16:20:29.000Z",
          "Titre": "Case did not fit my iPad and did not…",
          "Contenu": "Case did not fit my iPad and did not contain the features that were described in their ad!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Lewis",
          "Nb_Reviews": 3,
          "Date": "2022-11-09T01:12:57.000Z",
          "Titre": "I WANT A REFUND",
          "Contenu": "This does not look grey.  It looks clear and I do not want it.  I put a request on how to return this and get a refund.  NO RESPONSE AS OF YET!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken  Denning",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T05:02:16.000Z",
          "Titre": "NO screen protector this time.More…",
          "Contenu": "NO screen protector this time.More money, less product. Not good business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sara C",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:08:46.000Z",
          "Titre": "I have not received my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Smith",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T01:39:11.000Z",
          "Titre": "I have used a NiteIze phone holder for…",
          "Contenu": "I have used a NiteIze phone holder for some time now and am very happy with it. But the hook and loop fastener is worn out. So I ordered two new ones. The size clearly says XL, and yet it is a good inch shorter than the one I have been using. My phone won't fit in it. The old holster is a good inch taller. Yet the new one says Extra Large. So what is considered small?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Ekstrom",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T23:59:03.000Z",
          "Titre": "The case wasn’t the same as the photo…",
          "Contenu": "The case wasn’t the same as the photo on line.  I checked to return it as it showed no refunds for this case.  We decided we would use it anyway, but when we tried to fit it to the phone it was about 1/2 inch too short.  I checked the web site again and it showed it would fit my phone.  It sent a e mail to let them know with no response.  I got taken!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ambergayle Bunn",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T20:07:25.000Z",
          "Titre": "Not the case in the picture I had seen",
          "Contenu": "Not the case in the picture I had seen, and didn't fit my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa A Jennings",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T20:22:14.000Z",
          "Titre": "This product said it had a magnet and…",
          "Contenu": "This product said it had a magnet and really does not. That was the whole reason I bought this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent Cavarra",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T21:14:56.000Z",
          "Titre": "This is the second case the the first…",
          "Contenu": "This is the second case the the first case was fine for my LG however for my Motorola E the case did not fit it will not snap in causing the phone to fall out. I find it difficult to get in touch with these people over the last few days and getting a refund through eBay for 20 some odd dollars is a damn nightmare. If this message gets to the department who handles complaints kindly call me and notify me as soon as possible as this was a gift for a friend of mine.sorry I bought n paid for it through pay pal not e bay"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra Brower",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T04:24:22.000Z",
          "Titre": "You don't sell any A32 4g cases,that…",
          "Contenu": "You don't sell any A32 4g cases,that you told me that will fit my phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcy Buttocovoli",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T19:05:11.000Z",
          "Titre": "I have not received my order!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Calegan",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T12:38:43.000Z",
          "Titre": "Paid like $30 for a phone case",
          "Contenu": "Paid like $30 for a phone case. Its the same thin case as a $10 one. I return this one and only get like $25 back cuz they wont refund tax or something silly.*edit* “thank you for the reply cases. So beware everyone the something silly is the shipping cost. They dont give your money back for that even tho i had to pay to ship the item back anyway so really im out like $18 now”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G, Perez",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T17:44:44.000Z",
          "Titre": "Sent me the wrong case and now I have…",
          "Contenu": "Sent me the wrong case and now I have to pay for a return.......??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hector Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T01:40:12.000Z",
          "Titre": "Employee overlooked quality control",
          "Contenu": "Employee overlooked quality control. 1. Small gap @ right side of phone holder. Thankfully it still holds.  2. Right side phone button off.  Thankfully able to still use it.  3. Ear jack off.  Can't use.  Perhaps this was a returned item pass on to another consumer.  Too many errors to put a stamp of approval. It's not worth paying the cost to return item for a replacement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bat Matt",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T05:14:55.000Z",
          "Titre": "I paid for a specific phone case",
          "Contenu": "I paid for a specific phone case, and paid extra to receive it 2 days early. Just for it to never show, and upon me calling to ask why, I'm made aware you don't have my case that I paid for. So I ended up getting a plain black case, go figures, to replace the dream catcher colorful case I paid for, with the extra to receive it earlier. Just to get it within 7 days. If you don't have the case, take it down. It's false advertising. Thank you for fixing your problem though. Tuh."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Walters",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T15:38:09.000Z",
          "Titre": "I would like a refund or replacement of…",
          "Contenu": "I would like a refund or replacement of the proper fitting case.  CLEARLY you put the cart before the horse on the Moto G Stylus 5 G 2022.   It fits in the case but the volume buttons do not match up correctly and FORGET about the earbud jack.  That is 100% not accessable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra Morton",
          "Nb_Reviews": 2,
          "Date": "2022-05-08T16:17:01.000Z",
          "Titre": "I went to your site and put in the type of phone I have.",
          "Contenu": "I went to your site and put in the type of phone I have thinking that the case for that type of phone would be the right size. It is so small and my phone does not fit into it. There is no packing slip or instructions on how to send it back. I am very disappointed with the whole experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kristin houser",
          "Nb_Reviews": 2,
          "Date": "2022-06-19T18:12:33.000Z",
          "Titre": "I love Piel Fromo cases",
          "Contenu": "I love Piel Fromo cases, and have had a half dozen over the years.  I ordered a wallet case for my iPhone 13 mini.  What I received had \"iPhone 13 mini\" on the box, but the case is too small for my phone.  I immediately called cases.com and got the message that there was no phone customer service until 6/20.....unclear why.  I called again a few days later and got the same message.  I also sent a message thru the website and received no reply.  If I could give no stars I would.  I'm out a fair amount of money (these beautiful leather cases are not cheap) and I don't have a good case for my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 3,
          "Date": "2022-02-21T21:56:47.000Z",
          "Titre": "Total and complete Garbage",
          "Contenu": "Total and complete Garbage. The product ordered WAS NOT delivered !!!! You CANT RETURN SOMETHING THAT WAS NEVER DELIVERED!!!I was ripped off and you basically stole 50 dollars from me. Only thing worse then your products is your customer service......I was treated horrible by your customer service representative and continue to be treated poorly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Peterson",
          "Nb_Reviews": 2,
          "Date": "2022-01-30T04:34:27.000Z",
          "Titre": "Your case fit like a glove, no",
          "Contenu": "Your case fit like a glove,,  Glass protector sucked all the way around and the truth is putting my phone into my case and removal of it when it rings is really hard to get the phone into my hands,,, wish i has a way to contact you,,, $45 spent really sucked    at least the glass protector could of been better,,,I wont do it twice unless you exceed Excelo"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANA REYES",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T00:29:35.917Z",
          "Titre": "I keep getting the run around",
          "Contenu": "I keep getting the run around. All I want to do is return a screen protector that I received for a different phone. I just want to receive the correct screen protector for my phone. About 20 emails just to get this going and I still have not received my ordered product!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathon Green",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T14:22:33.000Z",
          "Titre": "Multiple emails only when I posted a review",
          "Contenu": "I ordered a case and was SENT the wrong case after multiple emails I received information to send back the wrong cases I was SENT, I was expected to pay shipping? They did offer to refund shipping along with an email telling me I should pay more attention to what I search for, I ask them to not email me again and I would just keep the case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.G.",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T03:19:57.000Z",
          "Titre": "13 days",
          "Contenu": "13 days to get a case.  Ordered December 14th, shipped December 17th, and delivered December 27th just in time to be not in time for Christmas.  Payed $3.99 for 5 to 7 day delivery. All companies have challenges but this is unacceptable. Do not blame the shipping companies.  This was the only order that didn't arrive on time for me.  Do better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristin S",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T10:11:37.000Z",
          "Titre": "Received an email to rate my case and I…",
          "Contenu": "Received an email to rate my case and I have not even received case. When I ordered it said 4-5 day shipping. It’s been 14 days. Order processed for over 7 days before it shipped. Said it was supposed to arrive yesterday evening by 9pm. Then got notification it would be late. Shipping tracker now says still in transit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chelsey W.",
          "Nb_Reviews": 2,
          "Date": "2021-11-08T22:22:49.000Z",
          "Titre": "THEY ARE SLOW!",
          "Contenu": "I know that shipping has been widely delayed as of late. However, I paid extra for shipping to expedite the process. Cases.com made the label on 11/2, but never provided the package to the carrier. They did not send the package to the carrier until 11/5 (a Friday) which greatly delayed my case - still haven't received it. Honestly, rather frustrating - why pay extra if they are just going to do what they want to anyway... VERY frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Scott",
          "Nb_Reviews": 2,
          "Date": "2022-07-03T04:52:14.000Z",
          "Titre": "You just sent the case with no…",
          "Contenu": "You just sent the case with no instructions and it is not compatible with my phone it is the right size but I can't take pictures without removing my phone from the case which means it has no protection"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C. S",
          "Nb_Reviews": 3,
          "Date": "2022-05-15T16:48:03.000Z",
          "Titre": "Broke within 24 hours.",
          "Contenu": "The outer case (glittery part) broke within 24 hours. I am using the gray inner shell, but, the buttons on the sides are cumbersome and difficult to push. I did switch from an Otter. I am going back. I do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T07:58:41.000Z",
          "Titre": "They do'not give full refunds",
          "Contenu": "They don't give full refunds"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Calvin Keyes",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T10:22:38.000Z",
          "Titre": "Weak product",
          "Contenu": "Screen protector broke during application. Case's kickstand cracked after a few uses, and seems as though one more use will cause it to snap off. Not happy with product which was not nearly as durable as advertised. Would not buy again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eddie Gardner",
          "Nb_Reviews": 1,
          "Date": "2020-04-25T13:48:09.000Z",
          "Titre": "This company is shady don't use!!!",
          "Contenu": "I will not use this company again. I ordered two phone cases & a screen protector. I paid overnight shipping took three days to get one case that was sent overnight mail the rest they sent regular mail. I called them & they informed me that I only paid for one overnight shipment. I paid for the whole order to be overnighted not 1/3 of the order."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2020-06-20T22:29:05.000Z",
          "Titre": "VERY DISAPPOINTED",
          "Contenu": "I ordered my phone case in March and it is now June and I still haven’t received my case. I have emailed multiple times asking for a refund as the tracking says it has been returned to sender but the company refuses to give me one. I paid over $45 for the case and shipping and am not ever going to buy from them again. Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr. Bill Kantner",
          "Nb_Reviews": 5,
          "Date": "2022-04-09T05:00:35.000Z",
          "Titre": "I returned the item in excellent…",
          "Contenu": "I returned the item in excellent condition and paid for my own shipping. You decided to only refund a partial of payment. Why did you deduct $20.11from my return? Not good business. Won’t recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANGELA",
          "Nb_Reviews": 3,
          "Date": "2022-05-04T18:01:54.000Z",
          "Titre": "I paid exta 10 bucks on top of shipping…",
          "Contenu": "I paid exta 10 bucks on top of shipping and got it a week later. It wasn't what I expected so had to return it and paid another 10 bucks on top of it so they literally made money off me. Not right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher D Craig",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T21:12:01.000Z",
          "Titre": "These cases are terrible cheaply made…",
          "Contenu": "These cases are terrible cheaply made if it wasn't such a pain I would return them I won't be buying from cases.com again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T08:47:04.000Z",
          "Titre": "Case doesn’t even fit my phone",
          "Contenu": "Case doesn’t even fit my phone. The box says iPhone 13 pro yet my phone doesn’t fit into it and the side button cut outs aren’t in the right spot. Did some comparisons with the real case-mate case I wanted and I’m pretty sure it’s fake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dylan West",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T01:43:30.000Z",
          "Titre": "The screen protector I ordered is very…",
          "Contenu": "The screen protector I ordered is very disappointing. Leaves bubbles still when I applied to my phones screen correctly. Thought it was gonna be a good screen protector but it didn't turn out to be."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nalin Singapuri",
          "Nb_Reviews": 11,
          "Date": "2019-12-02T21:54:45.000Z",
          "Titre": "can yall adhere to can-spam?",
          "Contenu": "I bought one case from them. In 2008. Order 150559.Still get emails to this day despite \"opting-out\" every time I am sent an email. Overpriced, poor selection, no respect for my privacy and unable to understand opt-in email marketing. How are these guys still in business?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Derek Weidman",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T02:23:35.000Z",
          "Titre": "Where is my order & why haven’t I heard anything?",
          "Contenu": "I have not received any communication on my order since I placed it. I placed the order on 10/16 and the order number is 452274. I have no idea if I will even receive the order I pain for because it’s like I’ve been ghosted"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zaesha",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T13:49:47.000Z",
          "Titre": "The scumiest scam website",
          "Contenu": "The scumiest scam website. They charge you a ridiculous price for shipping and wait till the actual date it's supposed to arrive then they send it off. I told them I wanted a refund and they never replied but funny thing is they finally sent what I bought to  ups for shipment super late after I complained with no reply. These ppl are charging for fast shipping and waiting a week after it was supposed to be shipped. So obviously they are keeping shipping money and screwing customers over. I learned that I shouldn't trust websites period that Look trustworthy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T05:29:48.272Z",
          "Titre": "Sent wrong case, ignored for refund",
          "Contenu": "cases.com sent me the wrong case and I've sent to email(s) with proof asking for a refund or a replacement and nothing has been said. I'm out 30 bucks. Silenced and dismissed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 5,
          "Date": "2021-11-03T18:25:06.000Z",
          "Titre": "You took too long and didn’t follow up in time.",
          "Contenu": "I ordered a case four weeks before my wife’s birthday.   You contacted me three days before her birthday to tell me the item wasn’t in stock. She chose an item in stock and received it three weeks after her birthday."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TSB",
          "Nb_Reviews": 43,
          "Date": "2020-05-12T18:22:23.000Z",
          "Titre": "I think this company is a scam",
          "Contenu": "I ordered a case from them, never got it. I emailed three times to let them know and got no response. When you call them you get this horrible robotic answering machine that wants you to leave a message. No customer service at all. I will be charging back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cristopher Banks",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T01:20:56.000Z",
          "Titre": "Company has things on their page that…",
          "Contenu": "Company has things on their page that say they're available when they are not actually in stock in their facilityI received a tracking number with no package sent 6 days later I complainedSaying that I was going to cancel payment and open a fraud investigationMy package was at the post office with a new tracking number that very day.They have really really bad reviews from quite a few people and after my experience I wouldn't recommend them to anyoneTake your chances or learn from someone else's experience \"FIND ANOTHER COMPANY TO ORDER YOUR PHONE CASE\"How can you sell something on your web page and then offer 2day FedEx delivery when you won't even have it in stock...!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T03:20:32.000Z",
          "Titre": "Case does not fit my phone and will…",
          "Contenu": "Case does not fit my phone and will cost to much to send back for a refund.. NOT worth it, due to it being your discretion upon receiving it back. Should spend more for something that works. Lesson learned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emi  Cornett",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T00:26:28.000Z",
          "Titre": "The case came and it would not fit my…",
          "Contenu": "The case came and it would not fit my phone right. It was very loose and the sides wouldn't stay on. Very unhappy as I paid extra for faster shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mail box",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T18:23:01.000Z",
          "Titre": "Delayed shipping",
          "Contenu": "Ordered a phone case and selected and paid extra for 3 day shipping, they then sit on it for 3 days before shipping it. What is the point in paying extra for fast shipping if they are going to delay 3 days before shipping!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kevin G.",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T04:03:31.000Z",
          "Titre": "Shipping is terrible",
          "Contenu": "Ordered 2 cases on March 9th.  Still haven't received them.  Not even sure they were sent.   Tracking number, but no longer tracking progress.    It's now March 23rd."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T02:56:20.000Z",
          "Titre": "I haven’t received my purchases",
          "Contenu": "I haven’t received my purchases.  It has been 2 weeks.  I was supposed to get it Friday and then it said it was going to be late but it didn’t say when.  Still haven’t received it."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T21:03:23.000Z",
          "Titre": "Case was damaged.",
          "Contenu": "Case was torn, broken and unusable inside packaging. There was also a sticky substance all over it. This was very unsatifactory especially since I waited over 2 weeks to recieve the case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RobinhoodsaScam",
          "Nb_Reviews": 2,
          "Date": "2021-12-25T10:45:48.000Z",
          "Titre": "Shipping is terrible its been almost 3…",
          "Contenu": "Shipping is terrible its been almost 3 weeks and it was suppose to be a week before x mas.well today's x Mas and its nowhere close to being here.terrible terrible terrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stephen allgeyer",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T19:39:09.000Z",
          "Titre": "Have not received item yet",
          "Contenu": "Have not received item yet. Maybe you should be more concerned about your delivery process than your pats on the back! OBVIOUSLY YOU GOT YOR MOST IMPORTANT JOB DONE!……CHARGING ME!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jo Wells",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T16:08:33.000Z",
          "Titre": "Only left 1 star had to",
          "Contenu": "Only left 1 star had to. Worst ever. Many of same complaints. Pay for overnight get it 2 years later. Called and Lady says we state on website we take 2 days to process, then ship. Ok well whats the point in paying for overnight shipping. I dont mean \" oh you can process then send overnight\" technically that's not overnight. Should not offer it. Amazon says overnight and boom its here next day. I just used cases.com cause Amazon cases for my phone was limited. And when you call after business hours it says calling after business hours. All our customer reps are busy will get with you asap blah blah. Or leave email to cases.com@customerservice with your number and ws will call back.  Not. BAD BAD COMPNAY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Simms",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:34:28.000Z",
          "Titre": "I order a phone case and it got…",
          "Contenu": "I order a phone case and it got delivered but it was not the phone case that was online it did not do what it said online they're supposed to do"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "donald D",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T19:46:55.000Z",
          "Titre": "Shady customer service Buyer Beware",
          "Contenu": "Shady customer service. Pay for product but never receive any track in info on case I order and paid for up front. My mistake for not doing research on this horrible seller total rip off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Pagano",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T23:08:59.000Z",
          "Titre": "Doesn't fit my phone is a 2020 not 2021"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Very Upset",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T08:29:37.000Z",
          "Titre": "The magnet is not strong enough to hold phone in",
          "Contenu": "The magnet is not strong enough to hold this phone.  Opened case, inner case with phone fell to floor.  Very upset now brand new iphone 13 pro max is cracked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T04:35:48.000Z",
          "Titre": "Case is not secure...very flimsy",
          "Contenu": "Case is not secure...very flimsy. Outer piece falls off constantly.  Not a good fit and doesn't offer any protection for device. Do not recommend!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ricardo Melchor Soto",
          "Nb_Reviews": 3,
          "Date": "2022-04-18T20:53:52.000Z",
          "Titre": "I placed my order on 03/31/2022 and I…",
          "Contenu": "I placed my order on 03/31/2022 and I paid for express delivery via FedEx it took over one week to get my phone cases, unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deruber",
          "Nb_Reviews": 5,
          "Date": "2021-12-20T01:48:14.000Z",
          "Titre": "Ordered a case",
          "Contenu": "Ordered a case, waited a week after the shipping label was created only to have my order canceled because the item was actually out of stock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Missy Terry",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T23:24:53.000Z",
          "Titre": "(UPDATED)To say I am disappointed would be an understatement …",
          "Contenu": "FYI-My original review was written May 1st 2020. Cases.com replied decided to reply acknowledging their \"small delay\" November 3rd 2021! Only a year and a half later...ENOUGH SAID buyer beware!!***********************************I bought a brand new S20 Ultra and was in desperate need for a case ASAP.  Cases.com was the only place I could fine the case I was looking for. I ended up pay almost $60 for the case! When the order was first placed I requested and paid for overnight delivery (another $23). Like Ibsaid I was desperate.Three days later the case was still not shipped. I emailed customer service and no accommodations were offered. I was able to get the $23 back that I paid for overnight. Here I am almost 2 weeks later still no phone case for for my S20!!! For the money I paid this is unacceptable.Cases.com will never get another dime from me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesus Chacon",
          "Nb_Reviews": 1,
          "Date": "2022-03-20T21:29:27.000Z",
          "Titre": "The order process and delivery was…",
          "Contenu": "The order process and delivery was perfect but the case has already come apart and it has not even been a month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Griffin",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T20:15:23.000Z",
          "Titre": "I have never got my order and it's been…",
          "Contenu": "I have never got my order and it's been 2 weeks! I'm starting to think this was a spam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Kimball",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T20:57:34.000Z",
          "Titre": "I'm still waiting on follow up for a…",
          "Contenu": "I'm still waiting on follow up for a requested return and have yet to hear back from the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 2,
          "Date": "2020-03-19T20:42:23.000Z",
          "Titre": "You have other choices",
          "Contenu": "You have other choices, Don't buy from them. their customer service is horrible and they are rude and nasty"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Priest",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T21:32:03.000Z",
          "Titre": "Never received my order",
          "Contenu": "Great price, but it never showed up. I ordered on 12/31/21 and it's now 1/15/22. :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T19:37:52.000Z",
          "Titre": "Package never arrived"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beverly Blake",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T21:27:37.000Z",
          "Titre": "You sent a black otter case instead of…",
          "Contenu": "You sent a black otter case instead of the clear flowered one I ordered!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Whitley",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T17:49:00.000Z",
          "Titre": "Wrong product was sent!!!!!😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Halle",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T20:33:07.000Z",
          "Titre": "It was the wrong case it didn't even…",
          "Contenu": "It was the wrong case it didn't even fit my phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monika Rowe",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T17:25:53.000Z",
          "Titre": "Still waiting for a return no",
          "Contenu": "Still waiting for a return no. Not very customer friendly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Whittredge",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T22:41:42.000Z",
          "Titre": "Sucked the case had the tits for the…",
          "Contenu": "Sucked the case had the tits for the controls on the wrong sides"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Chronister",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T20:31:09.000Z",
          "Titre": "I felt product was not as advertised…",
          "Contenu": "I felt product was not as advertised after I received it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brenda Crump",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T00:48:07.000Z",
          "Titre": "Cheap not worth the 28.00 + that I put…",
          "Contenu": "Cheap not worth the 28.00 + that I put out never again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremi Penrice",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T01:29:23.000Z",
          "Titre": "Weeks have gone by and still haven’t…",
          "Contenu": "Weeks have gone by and still haven’t received my order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MURIEL A MURRAY",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T20:18:26.000Z",
          "Titre": "Some of PIel Frama cases are not the…",
          "Contenu": "Some of Piel Frama cases are not the same great quality. I’ve purchased several cases in the past 15 years. The quality is not the same. Due to COVID, you cannot receive a refund for PIel Frama cases. This forced me to purchase another case. Customer Service (Anna) is excellent and was quite helpful! Unfortunately, Cases.com has lost a long-time customer.."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Will Morris",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T19:14:29.000Z",
          "Titre": "Misleading description",
          "Contenu": "Misleading description , photo different from the crocodile pattern on the real case, flatter and not padded etc. The only positive is that it has 3 card slots instead of 2 as shown/described."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joyce Tankersley",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T02:25:13.000Z",
          "Titre": "Got sent the wrong case I have a celero…",
          "Contenu": "Got sent the wrong case I have a celero 5g phone and I received a celero 5g phone case but the case is to short and my phone is a little long. So I need a refund or one a little bit longer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Regina",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T16:11:55.000Z",
          "Titre": "Personally I just don't like the case…",
          "Contenu": "Personally I just don't like the case and I'm thinking it'll be a pain in the butt to try and return, not to mention the shipping I'm sure I'll have to pay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher McQuilkin",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T23:42:00.000Z",
          "Titre": "Cheap Quality",
          "Contenu": "Did not expect quality of material to break  within less than a months time!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sandy Lavoie",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T23:00:55.000Z",
          "Titre": "Scratches on the otterbox case",
          "Contenu": "It is my 5th otterbox case, and for the first time I am disappointed . The case i received has scratches. It seem to be a used case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave M",
          "Nb_Reviews": 4,
          "Date": "2022-10-02T18:43:57.000Z",
          "Titre": "Hope you don't need it soon.",
          "Contenu": "The case I bought for my phone is perfect. No issues there!My biggest issue, and the reason for 2 stars is as follows... I had ordered a new phone from Verizon, a skinomi screen protector, and the phone case from here at basically the same time.I paid attention to shipping estimates so that everything would come in at the same time. Reason being I didn't want my brand new phone getting dirty or damaged before I had a chance to protect it.The screen cover from Skinomi came in from CA 2 days early! Before I had received the phone actually.The phone came in on time. Not sure where from but it doesn't matter.The case I ordered didn't get to me for another 3 days... Maybe it's the post offices fault, idk. What I do know is that my case wasn't shipped for 3 days after purchase. I also know it took 2 days to go from Aurora, CO through Denver before getting out of state. I seen that it took 4 days to get from CO to NY.Well I lived in Aurora, CO back in 2002. My now 20 year old son was literally birthed in Aurora Medical Center. I also know it took me 27 hours to drive from where I lived off Colfax to get to my mom's house in Buffalo NY. That's total trip time, including sleeping, eating, fuel and all.My question is how was everything here but the case? How did a screen protector from hundreds of miles further get here first? It was sent through regular mail too. Again, most of my complaint is with the us mail, admittedly.I however will never order anything from cases.com again. I can and have gotten items I purchased from China faster than I received my phone case from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles W  Gilbert",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T23:59:47.000Z",
          "Titre": "You never indicated that it was for a…",
          "Contenu": "You never indicated that it was for a galaxy A21.  I purchased it thinking it was for a Galaxy A13 4G."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mizan Raheem",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T16:56:29.000Z",
          "Titre": "Refund is a hassle",
          "Contenu": "Refund is a hassle, return is a hassle.Had to wait for a return code for several days. Then had to pay to return the item. No return label was provided. And they charged a restocking fee. An item described as tempered glass was actually plastic."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2022-10-30T18:00:11.000Z",
          "Titre": "The case I received is about 7/16\" too…",
          "Contenu": "The case I received is about 7/16\" too long.  The case won't fit the phone.  I checked and the phone is an S10 and the case say's if for an S10."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Spearman",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T21:05:33.000Z",
          "Titre": "Shipping time was acceptable as well as…",
          "Contenu": "Shipping time was acceptable as well as the case. However. The prop thing broke off completely the first day and I had to make a few modifications of my own. It seems like a tough case but would a screen protector be too much to ask?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LJ & Bart Herberick",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T16:15:34.000Z",
          "Titre": "The cases purchased did not fit the…",
          "Contenu": "The cases purchased did not fit the phones correctly. one of the cases purchased cracked the minute we took it out the package, another case was the completely different case than the actual phone now we have to go to the process of calling and returning and all the other Madness that goes on when things are not done correctly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly Ramsey",
          "Nb_Reviews": 1,
          "Date": "2021-11-21T18:51:34.000Z",
          "Titre": "First off I paid extra for shipping and…",
          "Contenu": "First off I paid extra for shipping and still had to wait a week for it and then when I tried it,it doesn't line up with all the buttons properly. It's a nice case that SAYS it's for MY phone but it's a little off and unfortunately I don't have the time to waste returning it and trying again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ricky",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T14:33:28.000Z",
          "Titre": "much too long for shipping it for it to…",
          "Contenu": "much too long for shipping it for it to be shipped out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "c.ann norsworthy",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T13:40:59.000Z",
          "Titre": "The case is great",
          "Contenu": "The case is great.  Your business practice needs work.  Don't mislead your customers by printing the shipping label and say you shipped a week before you actually shipped and don't blame USPS for it.  USPS comes every day so your 'carrier delay' nonsense is just that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TY",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T00:57:37.000Z",
          "Titre": "A Terrible First Impression",
          "Contenu": "I get that it was holiday season when I bought this but for it to take 15 days to get to my door without any heads up about holiday store closure or any update on my status until I sent an email was unacceptable. Now I have to pay for a return shipping as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C.Ann",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T13:29:07.000Z",
          "Titre": "Be honest about shipping please",
          "Contenu": "I ordered a case on Nov. 10.  It took 5 days for them to ship but they didn't actually ship it, they just printed out a label and SAID it was shipped. The USPS tracking says that it is still waiting for the package to be in their hands.  That's the kind of misleading thing that you expect from sellers on ebay, not a company doing business with Amazon. UPDATED TO ADD: company says shipping partners are to blame.  USPS comes every day and that is how it's being shipped so don't blame USPS for your delay in mailing the case to me.  At this point it's too late for the birthday girl to get her gift."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 2,
          "Date": "2021-11-05T18:36:21.000Z",
          "Titre": "While I would LOVE to give your company…",
          "Contenu": "While I would LOVE to give your company a higher rating because my case is perfect, I gave a lower rating because I PAID EXTRA to have shipping expedited. IT TOOK 3 WEEKS to get to me from within the country. Unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dana Errthum",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T04:15:24.000Z",
          "Titre": "I'm disappointed bc it's taking so…",
          "Contenu": "I'm disappointed bc it's taking so long. I ordered my case on February 16th and have not received it. Today is March 4th. So when it says 3-5 days, don't hold your breathe!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dbhoug55",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T18:29:22.000Z",
          "Titre": "Slow slow slow",
          "Contenu": "Unreasonable, unbelievably slow in shipping out product. Still 2 stars only because product was as advertised. Never again from this vendor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Cavanaugh",
          "Nb_Reviews": 2,
          "Date": "2021-11-05T03:42:44.000Z",
          "Titre": "Out of stock after order was placed",
          "Contenu": "Nice cases, ordered one but a couple of days later got an email saying they were out of stock. They offered a other but I didn't take the option"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "keith pettack",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T20:06:39.000Z",
          "Titre": "the screen protector doesnt seal all…",
          "Contenu": "the screen protector doesnt seal all the way and the case pops of phone very easily case will work but would not buy agin   !!!!!!   thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kaelyn Minor",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T08:52:02.000Z",
          "Titre": "Not a good quality case",
          "Contenu": "The case looks cheap and it even says on the side that it is made in China. It doesn’t look like a quality Kate Spade case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Watson",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T00:47:35.000Z",
          "Titre": "I was not pleased with the product",
          "Contenu": "I was not pleased with the product.  It's hard to use and bulky. Would not recommend it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Timberlake",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T11:33:28.000Z",
          "Titre": "I paid for 2nd day shipping....received…",
          "Contenu": "I paid for 2nd day shipping....received the package in 4 days after shipping...not satisfied"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Hess",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T13:01:35.000Z",
          "Titre": "The case did not fit my phone well and…",
          "Contenu": "The case did not fit my phone well and would cause the phone to randomly turn off. Not a good fit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 4,
          "Date": "2022-02-12T21:04:37.000Z",
          "Titre": "I was hoping for more of a glitter…",
          "Contenu": "I was hoping for more of a glitter effect, as opposed to a solid case that has no movement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "karen clark",
          "Nb_Reviews": 3,
          "Date": "2022-03-17T10:25:29.000Z",
          "Titre": "Very pretty case but the glass on my…",
          "Contenu": "Very pretty case but the glass on my phone was broken within a week of putting it on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T12:39:14.000Z",
          "Titre": "I had to take the case off the phone",
          "Contenu": "I had to take the case off the phone, and, when I did, the case fell apart."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T19:18:33.000Z",
          "Titre": "Late arrival and a different color from…",
          "Contenu": "Late arrival and a different color from the one I ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T19:09:00.000Z",
          "Titre": "Wife bought 2 and one didn't fit",
          "Contenu": "Wife bought 2 and one didn't fit, Bummer!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "randy jenkins",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T22:30:45.000Z",
          "Titre": "The time that it took to receive case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rlw",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T20:49:16.000Z",
          "Titre": "Cost to much for,what you get,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Burdick",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:20:12.000Z",
          "Titre": "I like these cases but a bit bulky like…",
          "Contenu": "I like these cases but a bit bulky like having a small suitcase in my hand. But they are okay I give it a couple of weeks and try to get used to it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:46:19.000Z",
          "Titre": "It is a case",
          "Contenu": "It is a case, that's all. No protection for screen, I thought was included in my order. The fit it excellent and the quality appears to be OK. Time will tell, don't want to drop it to see if it is drop resistant ."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Christie",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T04:25:18.000Z",
          "Titre": "Great case but...",
          "Contenu": "Love my new phone case! It is perfect amd just what I had hoped for.  Would have been much happier if there was a Canadian site.  Before receiving my case I had to pay customs/duties that I hadn't expected.  Between the extra cost for shipping and customs I wouldn't likely order from Cases.com again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kendra",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T22:51:24.000Z",
          "Titre": "I was disappointed with the case…",
          "Contenu": "I was disappointed with the case because it was advertised as a case that would fit my phone, but when it arrived and I took it out of the package to try, it did not fit my phone. It was for a completely different phone entirely. The online system of Cases.com is simple and user friendly, but unfortunately their search tells customers that cases will fit their phones when, in reality, the cases do not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sallye",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T01:08:13.000Z",
          "Titre": "I like the fact that the case is light & sporty!",
          "Contenu": "I like the fact that the case is lighter, the side buttons require a bit of pressure to change the volume, and wake up the phone.  I am very disappointed that there is not a lanyard available for to. I saw the cases that have the lanyards but I do not want a phone hanging on my neck or my waist. I find it much better as the lanyard around my wrist so the phone is under MY control at all times. I missed it so much I drilled 2 wholes and now I have a make-shift one. I don't feel it is as safe as the last one I got from you but it is better than caring my phone in my hand and dropping it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patty Manders",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T08:03:51.000Z",
          "Titre": "Liked that package arrived in a timely…",
          "Contenu": "Liked that package arrived in a timely manner. This was a gift from my daughter. Desperately needed cass/ protective cover. I need to return it. Felt so bad she paid so much for a piece of plastic w/piece of glass. Thought “Zagg” name was a bit more reputable. Will keep looking. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen  Keene",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T19:04:19.000Z",
          "Titre": "The promptness of the order was…",
          "Contenu": "The promptness of the order was wonderful.   The quality of the case is wonderful.   The website was very difficult to enter the code \"CASE\" to get the 15% discount.  I thought I did it correctly but my final bill reflected the full price...too tricky."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Deitch",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T17:49:21.000Z",
          "Titre": "Case is great but instruction to place…",
          "Contenu": "Case is great but instruction to place on my new phone was worthless.  Thanks to a couple of YouTube videos we were able to get this properly installed.  The case itself is excellent.  We like the rubber back that keeps it in place so it does not slide off the arm of my chair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George A",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T13:03:44.000Z",
          "Titre": "Good selection,  slow shipping",
          "Contenu": "The shipping was really slow. I ordered my case on July 6, and received it on July 14. If the shipping was free, that would be fine,  but the shipping was almost as expensive as the case ($13 shipping and $15 case)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T23:34:30.000Z",
          "Titre": "Good Product, Poor Packaging",
          "Contenu": "The case and screen protector arrived in good time. They fit the phone well. However, the packaging was excessive and non-recyclable. It would be great to simplify the packaging, which would probably reduce production cost and improve environmental impact."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Baker",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T02:54:39.000Z",
          "Titre": "The screen protector was advertised to…",
          "Contenu": "The screen protector was advertised to work with the fingerprint security and I could not get it to work.   Case is good.   Screen protector was easy to put on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seapet",
          "Nb_Reviews": 4,
          "Date": "2022-12-04T05:57:33.000Z",
          "Titre": "Excellent Quality - could have more features",
          "Contenu": "The quality of the case is excellent, but I would like the screen to be able to swivel so that the controls are on the bottom right."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Zach. W",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T08:03:36.000Z",
          "Titre": "Said it shipped on the 30th",
          "Contenu": "Said it shipped on the 30th, but only got shipped out the 6th. Took two and a half weeks to receive my package. Other than that, satisfied with my purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T02:48:54.000Z",
          "Titre": "Shipping is too slow for the premium…",
          "Contenu": "Shipping is too slow for the premium case prices. Never use USPS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neal Feikema",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T02:13:44.000Z",
          "Titre": "What I got wasn't really what I wanted…",
          "Contenu": "What I got wasn't really what I wanted and expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "No Name Needed",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T01:36:54.000Z",
          "Titre": "Any Legit Company Ive done business…",
          "Contenu": "Any Legit Company Ive done business with sends out an email confirmation the same or next day which would have been nice no real notifications from company doesnt make me feel secure in whom Im dealing with took over a week to get case from 3 staes away I dont know if that was post office or the company  case arrived and was what was expected overall theres plenty of other companies out there and Ill probably go elsewhere as I like being communicated with I run an online business as well and would never NOT communicate with prospective buyers  Funny isnt it I dont get those emails but boy almighty I can get plenty of nagging begging for ratings emails no problem whatsoever"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Buggadad",
          "Nb_Reviews": 2,
          "Date": "2022-09-22T22:19:06.000Z",
          "Titre": "The experience could have been better...",
          "Contenu": "The description of exactly which model iPhone the case I bought was not as clear as it could have been. (A short notation, such as, \"for Pro Max ONLY\", might have helped. I followed an outside link to this product, so fid not see the guidance to case models by the type of iPhone on the Cases.com site.) These OtterBox cases for iPhone look nearly identical. I wound up ordering the incorrect model case. I had to pay for the return shipping. Kind of \"meh\", overall."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T02:47:17.000Z",
          "Titre": "Cheap case for $25",
          "Contenu": "This case does not want to stay shut.  I have to watch it as it comes unsnapped on the right side."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LINDA SUE KOCH",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T07:12:25.000Z",
          "Titre": "The case itself is good",
          "Contenu": "The case itself is good! I did have problems with the liquid screen protector, it almost ruined my screen completely. It didn't adhere. I read the instructions carefully to make sure I did it right. I had to take it off and it left a serious amount of glue on my screen. Luckily I had some Goof off to removed the glue from my screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renee Hilbers",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T11:49:27.000Z",
          "Titre": "Small Business",
          "Contenu": "Small hardworking business owners, small company who work hard to fulfill your orders.  They honor coupons and are competitively priced.  Please know they have had to adjust their return policy due to consumer purchasing habits.  Make sure you know what you are ordering before you purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christian  Sabotta",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T16:49:41.000Z",
          "Titre": "Smooth purchase, sturdy product, but poor fit",
          "Contenu": "Despite being listed as capable of fitting my new phone the case I ordered did not fit properly. Ordering was easy, tracking was easy, product looked like picture and felt robust.  Liked the kickstand feature.  Very sad it did not fit, hence had to return for refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luke Walsh",
          "Nb_Reviews": 2,
          "Date": "2022-01-14T00:20:07.000Z",
          "Titre": "Piel Frama 904",
          "Contenu": "The quality of the case is wonderful.  I think the case is beautiful.  I love the magnetic holder of the phone that pulls off the case with ease. I'm disappointed in the design in that I was looking for something to put in my pocket, like a wallet should.  But their wallet case is too FAT to fit in a pocket.  In addition, in today's world, why would you make a pull-off case that is not compatible with wireless charging.  So, I consider this purchase just average."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tar",
          "Nb_Reviews": 2,
          "Date": "2021-11-30T13:53:54.000Z",
          "Titre": "The case looked used to me",
          "Contenu": "The case looked used to me. not used like for a long time but it seemed like this case was installed on another phone and then put back in the box. there are small scratches and one wear spot that seems to indicate this. i would have contacted support and asked for a new one but the shipping was so slow i could not wait for them to first receive my case back and then ship another one to me.i will certainly think twice about buying again from this site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T12:35:25.000Z",
          "Titre": "Inaccurate description",
          "Contenu": "The case is fine but the colors aren’t as shown. The picture shows dark grey, rose gold, and white. Which I was really excited about. What I received was silver, gold, and white. It’s still very pretty but not what I wanted. Honestly, could have bought this at the cell phone store for the same price and not waited a week. I just really wanted the other colors so decided to wait. Disappointing. The buttons are difficult to push as well. They’re not a soft cover but the hard plastic of the rest of the case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John L",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T10:52:55.000Z",
          "Titre": "I ordered the Pixel 6 OtterBox case…",
          "Contenu": "I ordered the Pixel 6 OtterBox case with 2 day delivery. I received it 2 full weeks later and was not refunded the difference in shipping costs, nor was I notified of the delay. 3 stars is strictly for the quality of the product, averaged with the 1 star for shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark in Pittsburgh",
          "Nb_Reviews": 4,
          "Date": "2022-04-18T18:16:10.000Z",
          "Titre": "Case fits the phone well and appears to…",
          "Contenu": "Case fits the phone well and appears to be sturdy enough to protect the phone.  VERY disappointed in the length of time it took to receive the case after order placement.  Hence, the main reason for an \"average\" rating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis S",
          "Nb_Reviews": 1,
          "Date": "2021-11-21T21:00:53.000Z",
          "Titre": "No value added",
          "Contenu": "I placed my order, you charged me and then the status was “back ordered” with no forecast for nearly 2 mos.  I have done business directly with Piel Frama before and I guess that is the way I will go in the future.  Nothing like a brand new naked iPhone 13 in your pocket!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "xxx",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T23:47:19.000Z",
          "Titre": "Slow shipping..",
          "Contenu": "Slow shipping...for whatever reason...looked like you held the order for like five days or something to me...and the belt holder... the little loop thing by where you would touch it putting it on the belt or off ...broke off with in 1 minute of messing with that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug Betts",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T22:06:57.000Z",
          "Titre": "Love the case",
          "Contenu": "Love the case, disappointed with the amount of time it took to ship. USPS received and delivered as agreed. If there was a problem with inventory, a note from the company indicating so would have been nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindy six",
          "Nb_Reviews": 2,
          "Date": "2021-11-12T01:50:09.000Z",
          "Titre": "Love the case",
          "Contenu": "Love the case, hated that I paid extra for priority mail and it still took 7 days. Even though the site said it would take 3-5,  I guess I should be glad I did pay for priority or I would still be waiting"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Anderson",
          "Nb_Reviews": 3,
          "Date": "2022-06-01T17:28:14.000Z",
          "Titre": "Love the charger, but don't think it was new",
          "Contenu": "Great item. It looks like the item send was not a new one. The packaging was pretty damaged. Wondering if it is because I applied a discount code to my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Reed",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T14:34:15.000Z",
          "Titre": "price was good",
          "Contenu": "price was good, item was a expected.  NOT happy with shipping time for a small item like case.  10+ days from orderm and lousy communication.  Will never order from cases.com again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bradley Stafford",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T22:49:34.000Z",
          "Titre": "Poor shipping and communication",
          "Contenu": "Poor shipping and communication.  Took 10 days and first it was going to be here on the 29th, then the 1st.  Finally arrived on the 2nd.  Probably wouldn't order again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 2,
          "Date": "2022-03-13T20:08:37.000Z",
          "Titre": "Wrong color/slow shipping",
          "Contenu": "Very slow shipping. Got wrong color merchandise. Still 3 stars because the color I got was the one I wanted that had been marked out of stock."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T18:50:16.000Z",
          "Titre": "The buying process was very great and…",
          "Contenu": "The buying process was very great and easy, but my case already broke. I haven't had it very long either. Maybe a month or so."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Vega",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:52:58.000Z",
          "Titre": "Great product.",
          "Contenu": "Great product, thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "vicki sauter",
          "Nb_Reviews": 1,
          "Date": "2022-03-27T22:51:32.000Z",
          "Titre": "the magnet that hold the phone in place…",
          "Contenu": "the magnet that hold the phone in place needs to be  stronger. otherwise the case is fine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Boken",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T20:47:53.000Z",
          "Titre": "I didn't get case on date told to me …",
          "Contenu": "I didn't get case on date told to me  complained and got it Dec 1st suppose to be Nov 15"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Orlando Fernandez",
          "Nb_Reviews": 2,
          "Date": "2022-05-13T11:34:10.000Z",
          "Titre": "It took longer than i expected to…",
          "Contenu": "It took longer than i expected to receive our package. Otherwise, it is ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denver Shepherd",
          "Nb_Reviews": 2,
          "Date": "2021-12-03T01:19:57.000Z",
          "Titre": "Shipping little slow when I paid…",
          "Contenu": "Shipping little slow when I paid priority mail. Got a good case. Though. Thankyou"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T23:02:03.000Z",
          "Titre": "case arrived ok.",
          "Contenu": "case arrived ok..  However from order to delivery was slow..Amazon much faster."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "W. Robert Scheidt",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T01:14:39.000Z",
          "Titre": "The fit for tote caneras is poor"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlton Butler",
          "Nb_Reviews": 2,
          "Date": "2021-11-07T03:31:52.000Z",
          "Titre": "Shipping took really long"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jackie Collins",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T02:46:39.000Z",
          "Titre": "Shipping was slow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry Simpkins",
          "Nb_Reviews": 2,
          "Date": "2021-11-27T20:47:55.000Z",
          "Titre": "Slow shipping!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "andrea daniels",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T03:24:46.000Z",
          "Titre": "Quality product met my expectations",
          "Contenu": "Quality product met my expectations. Decent price, also. Shipping took longer than expected but didn't create a problem. I would order again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customerval",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T19:25:04.000Z",
          "Titre": "I like the case",
          "Contenu": "I like the case , however I ordered it for the color. The case color as shown on the site and the packaging is completely different! Not even close! Extremely disappointed. The color future purchasers can expect would be a blue based violet. Also the ring is on the cheap side. Uncomfortable to hold onto."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAKE FAUST",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T08:41:59.000Z",
          "Titre": "Pleased with purchase",
          "Contenu": "The case is a nice color, feels solid, has a raised rim to protect the screen, and doesn't impede the use of the buttons on the side. The kickstand is nice but the only reason I'm giving 4 stars instead of 5 is if you bite your nails, it's impossible to get your finger under the stand to pull it out. I have to use a key or pen to get under it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maureen",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:45:12.000Z",
          "Titre": "Speck case for Samsung A23",
          "Contenu": "Products were shipped quickly and in excellent condition. Giving 4 stars because the case was shown in photos and described as blue and black. It is actually blue and purple, which I'm happy with, but others may be disappointed."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Paul Mirbach",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:41:35.000Z",
          "Titre": "The case was way too big",
          "Contenu": "The case I received was way too big. After timely response from the company, it transpires that I ordered for the wrong phone type! (Transposition error).The customer service since, to sort out the problem has been very good and shows that they care.Good customer service is just as important as good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mldnt",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T22:23:43.000Z",
          "Titre": "Good quality, attractive case",
          "Contenu": "The case was as advertized and of good quality.  Only difficulty was illegible instructions for the screen shield."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin E.Cramer",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T22:58:20.000Z",
          "Titre": "1st of all this company is legit I got…",
          "Contenu": "1st of all this company is legit I got my cell phone case,have to establish that 1st as I have been to trust worthy before with unreputable so called companies.Story short,I got what I paid for but shipping took about 8-10 days.As with all real businesses u get a tracking #.Hope this helped somebody as I don't usually leave reviews."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Williams",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T14:53:16.000Z",
          "Titre": "I ordered a case and had an issue that…",
          "Contenu": "I ordered a case and had an issue that made me dissatisfied. After a couple of emails, they sorted it out. I would try something again if I found an item I wanted from them in the future."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T00:57:24.000Z",
          "Titre": "Out of stock colors",
          "Contenu": "The choice of colors for the Itskins cases was limited to smoke and clear. I'd wanted two other colors that were out of stock. In the end, the two in-stock colors were different enough to tell the otherwise identical phones apart!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lia",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:19:57.000Z",
          "Titre": "Recommend Cases.com, MyBat, but not ZIZO",
          "Contenu": "Cases.com did great in delivering my two cases and screen protector in great condition and in a timely manner. I just want to say that the ZIZO company is kind of messed up. Since I bought the case here, its my understanding the so-called warranty doesn't apply because I did not buy it directly from them. Also, their so-called warranty doesn't cover anything but if they send you a manufacture-faulty item. Last I checked, its just good customer service to replace something new but damaged at no fault of the customer. So Cases.com did great and I love the products from MyBat. My ZIZO case is good, but I will avoid them due to their bad customer service and fake warranties. I would love to see Cases.com warn you of this kind of stuff before you buy it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MMaerz",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T15:55:27.000Z",
          "Titre": "The case arrived in a timely matter and…",
          "Contenu": "The case arrived in a timely matter and fit my phone perfectly.  The lens protector didn't work and no instructions were included."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Ware",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T12:59:48.000Z",
          "Titre": "Love my case",
          "Contenu": "Love my case. Top quality.  Decided to change my order the morning after I placed it. Called and customer service was excellent.Shipping could be more expedient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose Cohen",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T19:47:21.000Z",
          "Titre": "I ordered the case",
          "Contenu": "I ordered the case, it came quickly, but the screen shield that I thought was coming with the case did not. Called customer service and was phoned back very quickly. It wasn't clear to me there was a separate code for the screen shield on top of the code for discount, but the service rep offered me the screen shield for just the price of shipping @ $8.  I declined."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miranda Byers",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T15:18:54.000Z",
          "Titre": "Beautiful case!",
          "Contenu": "The website is easy to navigate, the case is absolutely gorgeous and the holos pop. My only issue is the case gaps where the volume buttons are. Other than that, I am loving my case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Idaho Joe",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T01:59:10.000Z",
          "Titre": "Great case as advertised",
          "Contenu": "Great case as advertised. Took a bit of time to get here. Would buy from them again and certainly recommend the Dbramante1928 Folio case! Have it for my S23U as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Stannard",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T03:13:26.000Z",
          "Titre": "The case arrived as promised",
          "Contenu": "The case arrived as promised. Easy to fit the phone to it and it seems to be the standard Otterbox level of protection.The color I ordered was ocean blue- this color is a light green."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurie Holbert",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T02:03:22.000Z",
          "Titre": "Ho-Hum",
          "Contenu": "Case is as expected. A bit more expensive than I would’ve liked, but overall the experience was alright."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Beagle",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T04:13:36.000Z",
          "Titre": "Samsung A54 5G wallet  Case",
          "Contenu": "Samsung A54 5G wallet  CaseIs less than expected on a positive note  it's Sturdy and has a (Noce textture😊👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Pierce",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:15:23.000Z",
          "Titre": "Just the right amount of grip and…",
          "Contenu": "Just the right amount of grip and padding. Would be nice to have a camera lens and screen protector."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina  Askme",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T05:47:05.000Z",
          "Titre": "I waited much longer than expected and…",
          "Contenu": "I waited much longer than expected and it would have been nice to get updates concerning the order from the company however I was able to track the item once the label was created, which was great, and the product was worth the money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzanne bako",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T04:59:49.000Z",
          "Titre": "Good service",
          "Contenu": "Good service. Beautiful case.  Would have liked to not have to follow up on shipping time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregg Szafran",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T17:37:02.000Z",
          "Titre": "I like the case and the customer…",
          "Contenu": "I like the case and the customer service was good.  Shipping was a little slow and the case description was a little lacking on the website.  I would buy again from Cases.com"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PJM",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T22:55:24.000Z",
          "Titre": "Received what I expected",
          "Contenu": "Received what I expected. No tracking details given had to contact them for arrival."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Steinhauer",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T05:27:20.000Z",
          "Titre": "Customer service",
          "Contenu": "Product fit great and was what I expected. My only issue was I never got a shipped email. I did get my product fast. Good experience tho."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T02:43:07.000Z",
          "Titre": "Nice looking readers",
          "Contenu": "The description of the glasses are spot on. Fast delivery. Great styles. Only drawback is the are pretty light weight. The ear piece will not last to long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Yagade",
          "Nb_Reviews": 3,
          "Date": "2023-02-21T17:45:54.000Z",
          "Titre": "Good customer service, but poorly manufactured product",
          "Contenu": "While customer service was accomodating, product, which I deem was poorly manufactured (yellowing), was disappointing, but not Cases.com's fault or doing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Gershman",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T21:09:38.000Z",
          "Titre": "Somewhat slow till it reached shipping",
          "Contenu": "Somewhat slow till it reached shipping, other than that, you're fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nabil Jacob",
          "Nb_Reviews": 6,
          "Date": "2022-10-07T11:08:36.000Z",
          "Titre": "The otter case was packaged well I…",
          "Contenu": "The otter case was packaged well I received it within 3 days, and the best thingwas saving $9. The price on Amazon was $64.95 and I paid $56."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T01:59:40.000Z",
          "Titre": "Good",
          "Contenu": "Good, waiting for the iPhone 15 pro to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justice Steele",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T17:30:10.000Z",
          "Titre": "Good case",
          "Contenu": "Good case, only complaint is that it took several weeks to get it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce --",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T00:56:31.000Z",
          "Titre": "Nice case",
          "Contenu": "The case is just what I wanted and it works great.  The shipping was a little slow.  I emailed them as to the status and got a prompt reply.  A few days later I got my case and am very happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "harlan",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T15:18:24.000Z",
          "Titre": "Nice case",
          "Contenu": "Nice case! It took almost 2 weeks to deliver though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Scialla",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:56:38.000Z",
          "Titre": "Review",
          "Contenu": "Service. And pricing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard  McCormick",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T07:46:25.000Z",
          "Titre": "Nice looking case",
          "Contenu": "Nice looking case, but I wished the sides and the lower front was raised higher."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 4,
          "Date": "2022-10-13T20:20:24.000Z",
          "Titre": "Great case",
          "Contenu": "Everything was great except I paid for three day shipping and it took over a week to get. I had a brand new phone with no case and that was my main concern. But I must say the case is excellent. I’ve had them through the list three, and I love it. I have the attachment that goes in your car in the back of the cases is built with a piece of metal inside the case and you can’t see it, I love this case and also it has kept my iPhone, in great shape all of them that I’ve owned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T02:51:49.000Z",
          "Titre": "Good experience, slow shipping",
          "Contenu": "Everything was as ordered. Shipping is a bit on the slower side but they are the only ones that carry the phone case i like."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolen Orndorff",
          "Nb_Reviews": 2,
          "Date": "2022-10-09T16:26:54.000Z",
          "Titre": "I like the case it's self",
          "Contenu": "I like the case it's self.  Hard to get at the power button though.  Just getting used to it.  A bit heavy but, made very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cora McCoy",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T00:15:32.000Z",
          "Titre": "The item I purchased was of a very good…",
          "Contenu": "The item I purchased was of a very good quality and I was very pleased with it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen North",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T06:10:46.000Z",
          "Titre": "Great looking case",
          "Contenu": "Great looking case! Would have liked to have gotten it sooner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guy Barker",
          "Nb_Reviews": 7,
          "Date": "2022-08-12T07:04:52.000Z",
          "Titre": "Excellent case, but somewhat pricey",
          "Contenu": "Cases.com delivered a case that was of excellent quality in a timely manner. The only negative was the price. I found the same case from another on-line merchant at a substantial savings, so I requested a return. They handled the return politely and expeditiously. The second retailer's price was so much lower that I was able to pay the shipping charges and still realize a substantial savings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VANESSA VERNACCHO",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T03:56:46.000Z",
          "Titre": "I think the case is a nice fit",
          "Contenu": "I think the case is a nice fit. I love the red color. And I love that it closes shut to keep the glass screen safe. Thank you very much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Critters Otterdahl",
          "Nb_Reviews": 4,
          "Date": "2023-05-11T22:27:13.000Z",
          "Titre": "More colors",
          "Contenu": "I like this case very much, I only wish it came in more colors"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michele  Griffin",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T02:25:55.000Z",
          "Titre": "Pleased with purchase",
          "Contenu": "I am very pleased with my purchase of a cover for my new Samsung phone.  I just wish I had known that it came in COLORS!   I also read the Terms & Conditions  -  very confusing.  Is it possible to reduce all the legalese to 50 words of regular English?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Viet Godfrey",
          "Nb_Reviews": 2,
          "Date": "2022-06-21T19:03:50.000Z",
          "Titre": "I am a repeat customer this is my…",
          "Contenu": "I am a repeat customer this is my fourth Cases.com order. I am in love with the Piel Frama Red Crocodile Leather Cases. I have had more than three different styles and I loved all three.  I had a little incident with my last case more wear than usual. I contacted customer service and Anna was amazing in helping me, we resolved the problem and I love my new case. Cases.com is a wonderful, caring company, they stands by their merchandise and stands by their customers and I really appreciate it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Redd Raynard",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T06:49:18.000Z",
          "Titre": "This is the second case I've purchased…",
          "Contenu": "This is the second case I've purchased from cases.com and I do believe my next 20 will be from cases.com. I work construction in Alaska and I've dropped my phone countless times outside and even now, whenever I take my phone out of the case, it still looks brand new. I wont take my phone anywhere without a case from cases.com"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R Chester Roby",
          "Nb_Reviews": 6,
          "Date": "2022-03-11T15:08:53.000Z",
          "Titre": "I am very pleased with the Otter Box…",
          "Contenu": "I am very pleased with the Otter Box case.  It took longer to receive, than originally expected, but customer service was quick to address all questions efficiently and effectively with detailed responses.  The product is quality and the service is great.  I have it 4 stars versus 5 stars due to the time it took to receive the item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Yankauer",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T21:29:24.000Z",
          "Titre": "Only two \"issues\"",
          "Contenu": "Only two \"issues\"a. I THOUGHT the case was two parts...a back AND a front... protecting the whole phone.                b. The shipping took FOREVER!!!I placed order online on Dec. 5 the.Phone was shipped Dec 10 the.Phone ARRIVED on Dec. 20 the!!!!I guess the US Postal Service needs yet ANOTHER raise... So their \"exemplary\".... NOT... service can slow down even more...Ridiculous!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joanne M",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T12:53:38.000Z",
          "Titre": "Love my new case..:.:",
          "Contenu": "Very happy with the product and shopping process. The case fits great and MagSafe comparable as described. The case came in a timely manner. My only concern was not receiving a shipping notification- I was pleasantly surprised when I received it- but it would have be nice to know ahead of time. We’ve had an increase in porch pirates that I’ve been keeping up with mail to avoid getting anything stolen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Rawe",
          "Nb_Reviews": 3,
          "Date": "2022-02-13T03:40:21.000Z",
          "Titre": "Great service and products!",
          "Contenu": "Great service and products for my kind of hard to find case for my Moto Stylus 5g. It has the vertical camera layout instead of the quad layout.Sofar it seems to be good and was easy to place the phone in.The only thing was the length of time it took to gat the case since it was from a nearby city."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra J  Dean",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T11:59:52.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery good looking case"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cal",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T04:52:49.000Z",
          "Titre": "the corners will start to break after a few drops",
          "Contenu": "It is a pretty good dual-layer case but after five or six drops that land on the corner then the corners of the case will start to break away.  I had one replaced under warranty in the first year and I just bought another one.I had to buy this one again because OtterBox does not make a Defender case for this model phone. Incipio - Dualpro Case for Samsung Galaxy A71 5G Uw Verizon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-08-01T03:14:39.000Z",
          "Titre": "The product size did not match",
          "Contenu": "The product size did not match, but the overall quality was excellent... Shipping did not arrive on time.  However, I learned how to be a better shopper and Google helped me save on shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Z.",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T21:16:27.000Z",
          "Titre": "Over all product as advertised",
          "Contenu": "Over all product as advertised. Delivery was timely , considering Covid19 situations. Only issue re : product was the screen cover didn't fit correctly or seal as I would have expected.Previously I had an Otter Box product that had a better fitted version. Over all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T15:04:43.000Z",
          "Titre": "Got what I ordered",
          "Contenu": "Got what I ordered; could use a more detailed write up as I thought it had more than one stand (couldn't tell from the image, if there were more, that were disguised as features incorporated into the plastic). Had some trouble with the delivery, common during the holidays though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hsiu Tan",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T04:55:22.000Z",
          "Titre": "The website is good",
          "Contenu": "The website is good. It takes couple of days for them to ship the item. But it went well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-11-07T11:50:48.000Z",
          "Titre": "Your web sight was very easy to use and…",
          "Contenu": "Your web sight was very easy to use and I was notified by e-mail  that your company had received my order. The shipping was prompt and pkg. Was left as instructed. The case seems to be of quality construction but only time will tell. I would recommend your company and buy from you again. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clark B.",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T20:51:51.000Z",
          "Titre": "Apparently great case but ...",
          "Contenu": "The case is fine and seems to be very rugged as advertised.Annoyingly it did not come with instructions about how to put it over my phone.It did come with a limited warranty that was printed in the smallest font I have ever seen!  Talk about \"fine print!\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William  Stahl",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T03:37:11.000Z",
          "Titre": "Lacking a bit but not bad.",
          "Contenu": "Good case. I’ve used otterbox for many years but I think this one is lacking the quality a bit. Still overall a pretty good case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Moore",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T15:09:24.000Z",
          "Titre": "The Wait Was Worth It.",
          "Contenu": "I have purchased several Piel Frama cases through Cases.com and have always enjoyed the quality and look of the product. I would have awarded 5 stars on this transaction, however, it took a month to receive the case. Now that I have it I can recommend this item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "St. Croix Data",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T06:51:06.000Z",
          "Titre": "Good prices, great customer service.",
          "Contenu": "The ordering process was pretty straightforward despite the fact that when it was all said and done, the order showed the wrong model.  Fortunately, I was able to reach a very nice lady who corrected the error and assured me she would get it out ASAP. For this reason, I will keep this company in my Rolodex.What I won't do is order anything during the Christmas season on the heels of a pandemic. I thought the shipment would be quicker with an upgrade of shipping, but you cannot expect any happy shipping stories during the weeks preceding Christmas. Cases.Com did their best, and I got exactly what I wanted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T02:17:33.000Z",
          "Titre": "Not true to life coloring",
          "Contenu": "Not true to life coloring, this case is silver, gold and white not a rose tone.  Otherwise, I love all my Kate Spade iPhone cases and after 10 years none have  failed to protect my phones , drops, bangs, yes even a throw.  Outstanding cases!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Truszkowski",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T20:31:46.000Z",
          "Titre": "Love my case I got from them",
          "Contenu": "Love my case I got from them, it took a little longer then I would have liked for it to arrive but it was definitely worth the wait. My nimbus 9 case looks great and is  well made. I searched Amazon over and over for a case for my galaxy a30s and I couldn't find anything I was certain about. Within minutes of being in their site I found a case that I loved and ordered it right away.  The phone cases are a little more costly then Amazon, but for the quality they provide it's worth the few extra bucks. They also had quite a few cases on sale. I got free shipping as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy Cobb",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T03:03:14.000Z",
          "Titre": "Price & quality are exceptional!",
          "Contenu": "Price & quality are exceptional!! Shipping was a little slow. That is the only reason I cannot rate 5 stars. Very much recommended this company if you're patient!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry Morrow",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T20:37:53.000Z",
          "Titre": "The phone case was great it fit nice…",
          "Contenu": "The phone case was great it fit nice and snug but the scree for the screen protector was slightly shorter and skinny for it even though it was supposed to be for it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frednj",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T16:02:35.000Z",
          "Titre": "Nimbus cirrus2 iphone13 Potomac case",
          "Contenu": "Shing was free but would have liked it shipped priority mail would have paid a little more if it was an option. Al in all everything was fine with cases. Com. Thanks live in nj shipping took 8 days"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marissa Grillo",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T18:15:29.000Z",
          "Titre": "Very expensive for a chinsey case",
          "Contenu": "Very expensive for a chinsey case. I couldn't find any other clear ones on Amazon so I went with this. Very disappointed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue T",
          "Nb_Reviews": 2,
          "Date": "2021-11-22T02:45:17.000Z",
          "Titre": "Quality wallet iPhone case",
          "Contenu": "The portfolio cc house case is working great. A little worried pockets may stretch out after using it a while. Would love to have snap cover or some type of strap to secure the cc’s in pocket."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frederic Carteron",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T04:07:55.000Z",
          "Titre": "Great case",
          "Contenu": "Great case. However, one plastic piece placed on the top of the Case broke while extracting the cell-phone. It should be either removed ou reinforced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 4,
          "Date": "2022-06-24T13:20:11.000Z",
          "Titre": "The case seems to be sturdy and as…",
          "Contenu": "The case seems to be sturdy and as advertised. No issue with it at all. Shipping was slow and absolutely ordinary. Case is a 5, shipping is a 3."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Young",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T03:57:41.000Z",
          "Titre": "Great case with kick-stand!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Eveleigh",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:09:29.000Z",
          "Titre": "Phone case. Good enough.",
          "Contenu": "I like the case for my phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Great phone case 👌",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T03:59:31.000Z",
          "Titre": "My son loved his new phone case",
          "Contenu": "My son loved his new phone case. The only issue that I had was with processing the order and getting it shipped timely. Otherwise a great value!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe McCarty",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T22:08:22.000Z",
          "Titre": "Decent quality",
          "Contenu": "Decent quality.  Good delivery tome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yago Xavier",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T19:10:00.000Z",
          "Titre": "Took too long to delivery but the…",
          "Contenu": "Took too long to delivery but the product is good. I even thought I got scammed at one point cuz they didn’t emailed me anything about the delivery delay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don  Foster",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T22:03:13.000Z",
          "Titre": "Lanyard",
          "Contenu": "Hi, would have been handy to easily locate lanyard for case I purchased.A little sketchy on order notifications and receive date as I recall.Best..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl Pumphrey",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T05:31:00.000Z",
          "Titre": "Fast and just as pictured"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RALPH W HOFFMAN",
          "Nb_Reviews": 3,
          "Date": "2022-04-03T15:29:16.000Z",
          "Titre": "The service was great",
          "Contenu": "The service was great.  But the case did not fit the phone properly had to cut the cutouts for buttons out to be able to use case"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T02:34:52.000Z",
          "Titre": "Good except for:",
          "Contenu": "Good except for:- It muffles the speaker more than I'd like.- the overlays on the buttons make them more difficult to press."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHARLENE LUZEY",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T16:50:57.000Z",
          "Titre": "Ordered a wallet phone case",
          "Contenu": "Ordered a wallet phone case.  Fits and works well.  Only thing I wish was that it came in other color choices other than black."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHAEL BULLINGER",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T00:04:35.000Z",
          "Titre": "Since I am still waiting on the cases I…",
          "Contenu": "Since I am still waiting on the cases I purchased, and you are asking for a review, 4 stars maybe even 3 stars is all I can give."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "senior citizen",
          "Nb_Reviews": 4,
          "Date": "2022-09-17T00:47:32.000Z",
          "Titre": "The case I bought for my new Samsung…",
          "Contenu": "The case I bought for my new Samsung phone is nice.  Nothing exceptional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Kirby",
          "Nb_Reviews": 3,
          "Date": "2023-01-31T23:28:45.000Z",
          "Titre": "No comment from me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Max Butter",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T18:53:55.000Z",
          "Titre": "It was ok but the service was good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew G Zatkalik",
          "Nb_Reviews": 2,
          "Date": "2021-11-16T23:31:07.000Z",
          "Titre": "Mistakes are Impressively Resolved",
          "Contenu": "The original order was waylaid. When notified, they sent it quickly. The order was exactly as pictured and works very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T12:12:51.000Z",
          "Titre": "Cases.com sells good phone cases for…",
          "Contenu": "Cases.com sells good phone cases for your phone, but the cases do not fit your phone. I was very disappointed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexis Olson",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T00:59:48.000Z",
          "Titre": "The case is great but it doesn't seem…",
          "Contenu": "The case is great but it doesn't seem like it would protect a whole lot if the phone was dropped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard A. Dent III",
          "Nb_Reviews": 3,
          "Date": "2022-01-13T23:49:03.000Z",
          "Titre": "Faux Skin LLC",
          "Contenu": "Case is great aesthetically. Functionality in terms of how it stands / props is a bit sub optimal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steph",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T19:50:16.000Z",
          "Titre": "Long wait",
          "Contenu": "The case itself is fine.  I was just not expecting the shipping to take as long as it did."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gaby",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T21:41:08.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, the only complaint is take a lot to ship the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROX",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T12:00:23.000Z",
          "Titre": "I like the case but it is for a Galaxy…",
          "Contenu": "I like the case but it is for a Galaxy 20 5g I needed one for a Galaxy Note 20 5g."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott McCallister",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T11:21:50.000Z",
          "Titre": "The case is awesome just took longer…",
          "Contenu": "The case is awesome just took longer than expected other than that I'm happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T04:36:42.000Z",
          "Titre": "This is a 5 Star RATING UAG Iphone 13 pro max Kevlar case",
          "Contenu": "This is a 5 Star Rating! Product was Excellent and Fast Shipping!! Very Happy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robbie Snyder",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T18:28:00.000Z",
          "Titre": "It fits good and my daughter likes very…",
          "Contenu": "It fits good and my daughter likes very hard to find a case for that phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dieseldude",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T00:57:43.000Z",
          "Titre": "Slow delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Flinders",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T23:26:42.000Z",
          "Titre": "Great case!",
          "Contenu": "Great case, fast service, great price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia  Ponshock",
          "Nb_Reviews": 2,
          "Date": "2021-12-20T03:04:38.000Z",
          "Titre": "I'm pleased with my case",
          "Contenu": "I'm pleased with my case. Only complaint is the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Mcnally",
          "Nb_Reviews": 3,
          "Date": "2021-11-02T09:48:09.000Z",
          "Titre": "Great job 👍",
          "Contenu": "Great job  fits like a glove and tough as nails ☺️👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laney Lee",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T00:30:20.438Z",
          "Titre": "I like it",
          "Contenu": "I like the case and it was delivered fairly quick"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wanza eudy",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T17:45:27.000Z",
          "Titre": "Colorful",
          "Contenu": "Colorful , & just what I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Y.",
          "Nb_Reviews": 1,
          "Date": "2022-02-13T00:15:41.000Z",
          "Titre": "Nice phone case...",
          "Contenu": "with a pocket for cards and kick-stand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauri",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:19:52.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! The attention to details and the follow up was amazing. Doing everything to try to make sure you get what you need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roderick Ahlers",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:24:55.000Z",
          "Titre": "New case board for the 15 Pro Maxi did…",
          "Contenu": "New case board for the 15 Pro Maxi did not use yet did not receive Phone yet but I’ve used this case on three other phones and it’s great I like it that’s why I’m on this one Jerry"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:11:51.000Z",
          "Titre": "Had the item I needed",
          "Contenu": "Had the item I needed, the price was reasonable, and I got it when they said it would arrive! Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T02:09:16.000Z",
          "Titre": "iPhone Case",
          "Contenu": "Cases.com has the exact style of iPhone case I wanted with excellent quality and relatively fast delivery.  I’ve bought my last 3-4 phone casss from Cases.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Abraham",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:45:26.000Z",
          "Titre": "Case and screensaver",
          "Contenu": "Case and screensaver: high quality. After years of buying less expensive screensavers, I could immediately tell the difference with the screen protector. It's soooo smooth to the touch and fingerprint free. Love the sturdy case too but removed the lanyard  after a few weeks of trying to get used to it. Mag charging is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Olsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:02:07.000Z",
          "Titre": "Cases are fantastic",
          "Contenu": "Cases are fantastic.  Arrived in a timely manner.We love our cases.  This was our third time to order.You guys do a great job.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "laf",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T05:11:58.000Z",
          "Titre": "Great Experience",
          "Contenu": "The case was on sale and arrived timely. I did; however, purchase an incorrect case and needed to return it. The return process was very simple. Overall I had a great experience and will definitely shop their site in the future."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "EnviroShred Inc",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:04:16.000Z",
          "Titre": "Great products and great customer…",
          "Contenu": "Great products and great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Gonsalves",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:39:41.000Z",
          "Titre": "Requested an exchange for a more costly item",
          "Contenu": "Requested an exchange for a more expensive item and the representative that helped me was excellent. Emailed me to inform me the new item was coming from Spain and she would contact me as soon as as the item arrive to request additional cost and when the item would ship out. She was the best made my experience a great one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:05:46.000Z",
          "Titre": "Great company",
          "Contenu": "Case came really quick and was as described. Everyone else including otterbox was out of the case for months but cases.com had it. No issues with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Jackson",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T00:24:15.000Z",
          "Titre": "Best Mybat Cases",
          "Contenu": "The quality of the mybat cases and quick shipping and tracking not too mention the Promo Code."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Mollis",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T12:31:16.000Z",
          "Titre": "Have received it and am happy with it..thankyou",
          "Contenu": "Still have not received the iPhone 15 case I ordered….so it finally came after traveling to Puerto Rico and all over the USA…it was definitely a problem with the postal service and not with Cases.."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joe Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:01:04.000Z",
          "Titre": "Case cover is beautiful",
          "Contenu": "Case cover is beautiful. Fest service. Will order again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eyrth",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T07:37:30.000Z",
          "Titre": "Corrected review.",
          "Contenu": "Originally this review was all about a case I received today. Later, also today, I clicked on an email requesting a review of my new phone case. Those two events were not in anyway related, but I thought they were. Never assume, right?This edited review is about my new very strong protective Otterbox case that came several days ago. It arrived sooner than the above mentioned case because Cases.com sent it right out, packed carefully and ready for the journey.  I had this case in hand a couple of days after it was ordered. And, I love it! ❤️My new Otterbox Defender Pro is my second Otterbox case for this new iPhone. My first case for this 15 upgrade was a Forest Green Defender.  It can get dirty, even slightly damp,and I know my phone is 100% safe. Years of phone drops into any and everything around has proven to me that an Otterbox case allows me to go anywhere but never worry about my phone.This review is about my most recently purchased Otterbox Pro Xt Defender.This amazing case protects my 15 as well as the case mentioned  above; it is an Otterbox, of course. They are both Defenders. However, this year I found that Otterbox added   to the always rugged Defender line up. My new MagSafe case is Pink, Clear, and has pretty flowers decorating it!This Defender won’t get as dirty as my forest green one but it’ll be dropped just as often, probably on harder surfaces. An excellent case. Very happy with this purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T16:24:41.000Z",
          "Titre": "Outstanding beautiful scarlet beast!",
          "Contenu": "I love this UAG case! It's gorgeous and obviously built to outlast any number of phones. I couldn't be more pleased. As to the color, wow, that scarlet really pops!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T15:44:50.000Z",
          "Titre": "Happy",
          "Contenu": "Had difficulty finding an otter case for my XS phone and was happy to find your company, thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Wainwright",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:58:44.000Z",
          "Titre": "Prompt, accurate delivery",
          "Contenu": "Called to be sure that order was correct because we ordered similar, but different, products.  Upgraded shipping at no cost.  Will definitely purchase from them again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T08:54:11.000Z",
          "Titre": "Great service",
          "Contenu": "They were great. I had put a box number in, and they emailed me to let me know that FedEx doesn't accept PO Box numbers. I was able to change the address with them to a hold-for-pickup FedEx location. Got my case, exactly what I ordered and in good condition. I would buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "X Clark",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T23:21:31.000Z",
          "Titre": "Personal touch, going above and beyond.",
          "Contenu": "The website wasn’t showing the ETA for my case, so one of the owners responded to my email and offered to expedite the shipping to ensure I had my case by the launch day of my phone. Went above and beyond when the other stores made me wait on hold for almost an hour. I will shop exclusively at this site from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Tardi",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:57:07.000Z",
          "Titre": "Easy to work with.",
          "Contenu": "Easy to work with.They follow up on orders and questions.Other companies should study their playbook."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Silvers",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:29:38.000Z",
          "Titre": "The quality of the case is amazing and…",
          "Contenu": "The quality of the case is amazing and the design is very beautiful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Haag",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T12:01:52.000Z",
          "Titre": "I bought a case and my daughter’s",
          "Contenu": "I bought a case and my daughter discovered it has a hole instead of a button for the new iPhone 15 Pro ringer/silent switch. I reached out to Cases and they offered alternatives and the option to return the case -seamless positive response!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Carollo",
          "Nb_Reviews": 4,
          "Date": "2023-10-14T23:18:05.000Z",
          "Titre": "I purchased two cell phone cases",
          "Contenu": "I purchased two cell phone cases, one for my wife and one for myself. The prices for the cases were great compared to other stores and I was able to get 10% discount on both cases the shipping was free and it arrives within a few days I would highly recommend shopping at cases.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Nunn",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T13:28:07.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! I had no issues figuring out the website (although I am not computer literate), the case was received earlier than expected. The whole process was inexpensive and pain free. Highly recommend./"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna DUFOUR",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T04:11:26.000Z",
          "Titre": "Great Company to Work WIth",
          "Contenu": "Thank you so much for helping us obtain the correct case for my cell phone.  We ordered the wrong size the first time and you refunded our money in a timely fashion which was greatly appreciated.  We now have the correct case and it didn't take that long.  Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy Nunn",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T03:25:10.000Z",
          "Titre": "The company offers unique desgns on…",
          "Contenu": "The company offers unique desgns on their cases.  So tired of all the black, grey and limited color choices offered by others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara Drasin",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T02:48:40.000Z",
          "Titre": "THE place to buy quality cases",
          "Contenu": "I have made many purchases from Cases.com.  Always helpful & knowledgeable - and I love my Piel Frama leather cases.  Beautifully crafted & wonderful color and texture choices. I always shop here for myself & my family. I tell all my friends to shop here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annette Gadus",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T15:16:50.000Z",
          "Titre": "I have never used your company before…",
          "Contenu": "I have never used your company before so I was a little hesitant. However, I was thrilled my Otter Box Defender Series holder for my I-Phone came within a few days at a great price and a free clear screen protector that usually goes for $9.99. I have used Otter Box for my older I phone so I knew the product was excellent. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy from Boston",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T21:35:31.000Z",
          "Titre": "Ignore negative reviews ~ all clear here!",
          "Contenu": "There was a delay. Anna was amazing. Problem solved, constant info on when it would arrive, fantastic customer service. Ignore the other reviews. All clear here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Avery",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:20:46.000Z",
          "Titre": "I have ordered a few times from this…",
          "Contenu": "I have ordered a few times from this company,  and I find the selection good, the prices reasonable, the items arrive quickly and as shown. I was mildly disappointed in the shade of purple of my new case, because photos aren't very true to color with purple, but it is a good case that I am very satisfied with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth A",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:56:49.000Z",
          "Titre": "Well made",
          "Contenu": "Well made, gorgeous with all the functionality intact. Only wish it had one more pocket for cards or the like."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Gibson",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T01:40:35.000Z",
          "Titre": "Best wallet phone case",
          "Contenu": "Anna was so helpful in reviewing each case and making sure I got the one I really wanted.  Not many companies have employees so helpful.  Plus you didn’t have to go through 10 minutes of pushing buttons before reaching a real person!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Mcsorley",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T04:05:13.000Z",
          "Titre": "Good response on delivery order",
          "Contenu": "Good response on delivery order . On time delivery with tracking status. And love the phone case . Good quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrine",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T07:44:14.000Z",
          "Titre": "Great deal and selections.",
          "Contenu": "Easy to navigate site. Prices were good for an Otterbox case for a Samsung S23 Ultra,  since it seems there aren't lot of color options for my phone. They also had a 20% off coupon. Standard shipping was free and it arrived early. Will definitely order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wheelsteal",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T02:37:44.000Z",
          "Titre": "they were great I ordered the wrong…",
          "Contenu": "they were great I ordered the wrong one, they took it back and  are sending me the correct one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tehila",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:22:12.000Z",
          "Titre": "A Satisfied Customer",
          "Contenu": "Order was processed soon, the quality of the case is good, delivery was fast and the case fits perfectly. I am very satisfied with your service. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Simpson",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T07:53:25.000Z",
          "Titre": "iPhone case",
          "Contenu": "Several sites recommended the case I ordered, as the best overall. Zagg was out of stock, as was everywhere else. You guys had the case. Fast shipping, very pleased with my new case!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Unger",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T13:09:40.000Z",
          "Titre": "As expected",
          "Contenu": "As expected, the quality is exceptional. I have been looking for the perfect case and this one fits the bill. The slots for credit cards are tight enough so your cards don't slip out and the case itself is very slim."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARY SELIX",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T07:05:55.000Z",
          "Titre": "The case is well made and is sipped and…",
          "Contenu": "The case is well made and is sipped and it was delivered in good time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Holliday-Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:27:53.000Z",
          "Titre": "Thanks to Cases.com",
          "Contenu": "Thanks to Cases.com, I FINALLY found the case that I wanted for my new iPhone 15 Pro Max. After an extensive 3 week search, I was relieved to come across their site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 7,
          "Date": "2023-09-16T05:54:39.000Z",
          "Titre": "Ordered the commuter case it's perfect…",
          "Contenu": "Ordered the commuter case it's perfect they didn't have black and stock when I got mine so I put my phone in a pink case which really isn't me so I'm happy to have it fast shipping good packing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Offenbecher",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:48:07.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Cases.com has awesome customer service, very pleasant to do business with, and very honest with their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUDITH SHEARIN",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T21:19:49.000Z",
          "Titre": "I appreciate that you are the only one…",
          "Contenu": "I appreciate that you are the only one who has what I needed. You also provided great customer service. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dona D.",
          "Nb_Reviews": 5,
          "Date": "2023-08-21T20:23:32.000Z",
          "Titre": "I purchased my third Piel Frama case",
          "Contenu": "I purchased my third Piel Frama case from Cases.com and unfortunately I had to ask for a replacement case. I was very pleased how easy it was to work with Cases.com and how they went the extra mile to secure a new case. This isn't the first time I've had a great experience after contacting them. Cases.com is a quality company with top notch professionals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tqmo",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:52:37.000Z",
          "Titre": "Great service",
          "Contenu": "To begin with, the company is very attentive. I had an issue ordering and I received a phone call to complete the ordering. How awesome and rare is that! Then I ordered the wrong item for my phone. The return and reorder went fast and smoothly. I will definitely order from them again and tell my friends. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T01:13:48.000Z",
          "Titre": "Great customer service!",
          "Contenu": "I ordered from this company, got my case quickly and it was as expected.   However I had ordered the wrong size for my phone.  I emailed and even on the weekend I got a very fast response.  I got  instructions with an online form to return the case since the specific product I wanted was not available"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C J",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T08:01:11.000Z",
          "Titre": "Fits perfectly, looks great",
          "Contenu": "Case for my new phone arrived sooner than expected. It has buttons on the up-down volume instead of just a hole. Makes it faster to use. I also bought a screen protector. Easy to follow instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:15:33.000Z",
          "Titre": "Convenient to find what I was looking…",
          "Contenu": "Convenient to find what I was looking for & easy ordering process. Case arrived within a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T19:00:33.000Z",
          "Titre": "I like the look of my new case & was…",
          "Contenu": "I like the look of my new case & was hoping that it would arrive before we left on vacation.  It took a few extra days to bring it to your location but I really appreciated the updates as to when you would receive the case & then when it would be shipped to me.  I must admit that the case was more expensive then I usually buy but they also do not last as long either.  My last case started flaking off just a few months after I bought it.  Hoping for much better wear with my new case.  Your warranty was a selling point also.  Thank you again.   Have a great week!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Y.",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T02:26:37.000Z",
          "Titre": "Cases had a great selection",
          "Contenu": "Cases had a great selection, and my pick didn't disappoint.  I received my case on time and the screen protector was a welcome bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GM",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T13:40:23.000Z",
          "Titre": "Always a great product",
          "Contenu": "Always a great product. This order was delayed due to availability and I was kept up to date with emails. Really liked not having to follow up on an order. Arrived when the updates stated. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Teach",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T03:02:11.000Z",
          "Titre": "Top Customer Service",
          "Contenu": "After three attempts to get a cell phone case that fit my phone, with no luck, I gave Cases.com a chance. I ordered a case then a few days later a representative called me to asked the details on what phone I had. They gave me the reason why I was not finding a case that fit and suggested the right one. This saved me from another disappointment and got me a decent case for my phone that fits!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry  Weller",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T03:08:48.000Z",
          "Titre": "I called left a message and and a very…",
          "Contenu": "I called left a message and and a very helpful and pleasant lady called me back. I was very surprised to receive a call back. A business with customer service is unheard of these days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Ennik",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T14:31:49.000Z",
          "Titre": "They always kept me updated every…",
          "Contenu": "They always kept me updated every couple of days. Delivery was a little faster than expected."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Harun Joe",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T14:51:59.000Z",
          "Titre": "Very trusted site to buy phone case",
          "Contenu": "Very trusted site to buy phone case. The cases were authentic. Quite variety of choices to look at. The most important is their fast response to any queries and shipping were also in time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nobody special",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T23:34:54.000Z",
          "Titre": "Fast shipping and great prices",
          "Contenu": "Fast shipping and great prices. Also had a bonus screen protector as a promotion. Definitely a value! Overall a pleasant experience and would order from again."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Wendy Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T12:56:56.000Z",
          "Titre": "Very easy to order",
          "Contenu": "Very easy to order, looks exactly like the picture no bad surprises and delivery was on point to Puerto Rico very fast!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Grossblatt",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T02:46:30.000Z",
          "Titre": "Replacement Case",
          "Contenu": "I needed a replacement case because my case that I bought from Verizon broke and the case was only a little over a year old. I needed to a purchase a new case and wanted the same model I had. I liked this case so I wanted to buy the same one that was as my last. The price on this site is cheaper then the one I bought the Verizon store in 2022. The item came in a timely fashion and overall I was happy with this item. I would do business with Cases.com in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sham Beri",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T21:50:24.000Z",
          "Titre": "The owner of the company Anna herself…",
          "Contenu": "The owner of the company Anna herself was involved in satisfying my need to get a customized phone case from Spain. The case arrived on time with the promised accessories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BW",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T08:05:26.000Z",
          "Titre": "Best of the best!!!",
          "Contenu": "Quality purchase with even greater pricing by comparison.  Fits like a glove.  Speedy delivery."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mario Quiroz-Gil",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T03:20:38.000Z",
          "Titre": "Ease to find the right item with very…",
          "Contenu": "Ease to find the right item with very good pictures from every side of it.Great communication company!Highly recommended to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard G. Luongo",
          "Nb_Reviews": 7,
          "Date": "2023-09-11T23:09:33.000Z",
          "Titre": "Alterations of case.The case fit but  away some…",
          "Contenu": "The case fit but l had to cut away some 9f the side because I could not use the finger print I'd or the volume controls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bdylan",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:20:05.000Z",
          "Titre": "Already had this case for IPhone 12…",
          "Contenu": "Already had this case for IPhone 12 mini and it protected excellently"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WILLIAM WILSON",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T01:31:12.000Z",
          "Titre": "Anna was exceptional to work with",
          "Contenu": "Anna was exceptional to work with. Product was awesome as well. You guys Rock!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angie Goya",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:07:22.000Z",
          "Titre": "The case is beautiful…",
          "Contenu": "The case is beautiful and I’m so glad I purchased it.  This is at least the third time I have ordered a Piel Frama phone case and have never been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Case",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T15:59:02.000Z",
          "Titre": "Previous Purchase for the LGK51 used to…",
          "Contenu": "Previous Purchase for the LGK51 used to have, was looking for the same kind folding case, and you had it so yes Bought for the Samsung A14 5G"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Boat Drinks",
          "Nb_Reviews": 7,
          "Date": "2023-10-10T01:12:33.000Z",
          "Titre": "Great selection & quality",
          "Contenu": "They have a great selection of quality products that are available in a reasonable time frame"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda McCray",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T03:27:43.000Z",
          "Titre": "LOVE THE PURPLE",
          "Contenu": "THE CASE FITS MY CELL FIRM AND ADDS WEIGHT LEAVING ME CONFIDENT IT WILL PROTECT THE CELL IF DROPPED."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VALERIE ANNE ROSS",
          "Nb_Reviews": 12,
          "Date": "2023-10-06T03:05:13.000Z",
          "Titre": "Quick Delivery on Kate Spade iPhone 15 Case",
          "Contenu": "I thought when I got on the waitlist that it would be two weeks before I got my iPhone 15 Kate Spade case.   I got a reply from staff to my email asking the status of the waitlist and was told the cases had just come and were available.  I placed my order and received the case very quickly.  Love it!  Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam  Broxterman",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:45:09.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Had no problem when I requested a return on one of my items. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Joost",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T11:27:16.000Z",
          "Titre": "Good support",
          "Contenu": "Good quick customer support chat right on the website. I had a strange request and the assistant helped me right away and figured it out for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Clarkson",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T22:54:48.000Z",
          "Titre": "I love it!",
          "Contenu": "The screen protector and case came on time. Very good quality. I love the color and feel of the case. It fits the phone perfectly.  The ring on the back opens to make a convenient strand for the phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T06:15:32.000Z",
          "Titre": "Product exactly as advertized.",
          "Contenu": "Cell phone cases and screen protectors arrived timely and fit well. Both cases look exactly as pictured. We would order from here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy  Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T03:58:42.000Z",
          "Titre": "The case is very durable",
          "Contenu": "The case is very durable. I like the color and like the bit of being on the sides. Well pleased with this purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Carollo",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T14:52:52.000Z",
          "Titre": "I purchased two cell phone cases one…",
          "Contenu": "I purchased two cell phone cases one for my wife and one for me. I was able to get 10% discount and the delivery was very fast. I would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Powers",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:15:39.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service. Receivad case very quickly. Like the case. Fits like a glove. Keep doing what you are doing. I will tell others to check you out if they are looking for a cell phone case. It's been a pleasure dealing with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 5,
          "Date": "2023-09-11T22:14:36.000Z",
          "Titre": "Support excellent",
          "Contenu": "Support excellent. Received an immediate answer to my question.I have purchased these covers before and they are of the highest quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Winslow Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T22:59:44.000Z",
          "Titre": "The website was easy to find the items… and shipping was great",
          "Contenu": "The website was easy to find the items I was seeking for my phone and checkout was fast and easy and I received my purchase within a few days was extremely happy with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Neumann",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T01:55:43.000Z",
          "Titre": "They found a discontinued product that…",
          "Contenu": "They found a discontinued product that I was looking for and called back the next day to let me know it was located."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael  Grady",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:01:13.000Z",
          "Titre": "I had ordered 2 different cases for my…",
          "Contenu": "I had ordered 2 different cases for my phone and both cases received would not fit my phone.Your case fits my phone to a \"T\".Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T02:36:18.000Z",
          "Titre": "Had the case I wanted even when it was…",
          "Contenu": "Had the case I wanted even when it was out of stock at otterbox, and for better price. Arrived within a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Webb",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T03:51:07.000Z",
          "Titre": "Good experience.",
          "Contenu": "Easy to order and fast shipping. Only company that had my OtterBox in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GlocalMe Customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-08T23:43:10.000Z",
          "Titre": "The phone case was a good price but it…",
          "Contenu": "The phone case was a good price but it didn’t have a place for change and the paper money slot was very tight and hard to put money in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Svetlana White",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T23:50:34.000Z",
          "Titre": "Excellent customer service!",
          "Contenu": "Excellent customer service!Anna is  provided professional, friendly and helpful communication that makes experience so great that’s why I come back again and again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RBBNC",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T15:29:12.000Z",
          "Titre": "Crystal clear",
          "Contenu": "Item descriptions are as advertised. The case and screen protector fits my phone excellently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vivian Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T02:21:23.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service. Made my return fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Christian",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T01:30:48.000Z",
          "Titre": "The owner of Cases.com was thoughtful",
          "Contenu": "The owner of Cases.com was thoughtful, friendly, efficient and honest.I recommend customers to purchase from this business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Gomez",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T16:23:41.000Z",
          "Titre": "Case did not have the case I was…",
          "Contenu": "Case did not have the case I was interested in but made it all better with a different case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Solomon",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T03:30:24.000Z",
          "Titre": "I never received my ordered case so…",
          "Contenu": "I never received my ordered case so right now I'm highly dissatisfied ! With the service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Cerna",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T05:58:50.000Z",
          "Titre": "Very accommodating and went above and…",
          "Contenu": "Very accommodating and went above and beyond to make sure I had the correct case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SG M",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:20:31.000Z",
          "Titre": "Finally found cases for a Galaxy A23 5G…",
          "Contenu": "Finally found cases for a Galaxy A23 5G UW"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Myrick",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T04:58:57.000Z",
          "Titre": "The time expected to receive the case…",
          "Contenu": "The time expected to receive the case was great and on time. The product is excellent and the price is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tessy",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T00:40:42.000Z",
          "Titre": "It was everything I was expecting....",
          "Contenu": "It was everything I was expecting and hoping for!! Awesome case!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T01:43:56.000Z",
          "Titre": "On tonly place i could get a otterbox for a Zfip5. Otterbox.com didn't even have any to dhip. Faster than i expected ime shipping received product…",
          "Contenu": "On time shipping received product earlier than expected. Great place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Davis",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T20:04:12.000Z",
          "Titre": "It worked first shot",
          "Contenu": "It worked first shot. easy ordering- quick shipping- right case just easy - easy - easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dana campbell",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T13:00:42.000Z",
          "Titre": "The case I ordered is perfect",
          "Contenu": "The case I ordered is perfect. It fits my phone just right. It was delivered right on time also. I am very pleased with the product and the buying experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Helm",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:03:46.000Z",
          "Titre": "Cases fit perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Sisco",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T02:43:54.000Z",
          "Titre": "Anna was great answered my questions on…",
          "Contenu": "Anna was great answered my questions on the phone and email helped me with an exchange"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T00:07:04.000Z",
          "Titre": "New case",
          "Contenu": "My case came withing a good time frame (5-7 business days) and fit my phone the way it was supposed to"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy C",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T12:16:30.000Z",
          "Titre": "Fast shipping and item came as…",
          "Contenu": "Fast shipping and item came as described."
        }
      ]
    }
  ]
}