{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.eaglesaver.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:30:34.000Z",
          "Titre": "I requested the return of a CD that…",
          "Contenu": "I requested the return of a CD that eaglesaver deemed defective. Maybe they damaged it. I never got it back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:13:15.000Z",
          "Titre": "Eaglesaver ripped me off for about 400.00",
          "Contenu": "I decided to send several orders of CDs to eagle savers. My experience has not been good the first shipment of orders sent off was quoted at 600.00. I was only paid 378.00 and even though FedEx had record of all boxes sent to eagle savers. I got email saying half over half of my shipment was missing from one order. I requested my items be sent back and received a response say they keep order open in case I found the items they didn't receive. I've sent several emails asking eaglesaver to send my property back or issues payments what did arrive. As of now eagle savers has ripped me off for 147.00 and refuse to acknowledge my email requesting order be sent back to me. According to FedEx Eagle Savers received the last order on December 4th 2023 11:00am quoted at 252.13. I have not received any responses from eagle savers after sending several emails asking  when payment would be issued. My experience dealing with eagle savers has been terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebekah  Hansell",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T08:19:14.000Z",
          "Titre": "All the videos I sent had hardly been…",
          "Contenu": "All the videos I sent had hardly been used. A-holes wouldn't take them. They didn't want to pay out the money. GREEDY FERENGI !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AW",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:22:12.000Z",
          "Titre": "No response to emails or return of CD based on questionable condition.",
          "Contenu": "I mailed a box of CDs to Eagle Saver and was surprised to get a response that over 50% of the CD were in unacceptable condition. I check every one and feel there were only a few that may have been borderline base on their guide. Given Eagle Saver would not provide partial payment they ask if I wanted the CDs returned. I responded YES the same day I received their email. I've not received the CDs back or had responses to my repeat emails. It's been over 2 months.  Very disappointed.12/1/2023 - Eagle Saver addressed the issue with a full credit for the CDs. My thanks goes out to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garabet Kassakhian",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T20:49:10.000Z",
          "Titre": "Bogus check issued by EagleSaver",
          "Contenu": "EagleSaver.com issued me a check that two different Chase branches in Los Angeles County, CA will not cash because the amount on the check did not match the amount in the bank's records. So far all my communications with EagleSaver regarding this matter have been given the royal run-around."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jerome hall",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T02:12:51.000Z",
          "Titre": "TERRIBLE TERRIBLE SERVICE",
          "Contenu": "TERRIBLE TERRIBLE SERVICE. DIDN'T BUY ALL THE CD'S SENT. THE MORE VALUEABLE CD'S WERE SENT BACK TO ME PER MY REQUEST THAT THEY DIDN'T BUY. THE PACKAGE THAT WAS SENT BACK TO ME HAD A STICKER ON IT SAYING: RECEIVED UNSEALED AND DAMAGED CONTENTS FROM THE POST OFFICE. CD'S WERE BROKEN INSIDE THE PACKAGE SENT BACK TO ME. VERY DAMAGED"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brenda Wellington",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T03:04:22.000Z",
          "Titre": "Your company doesn't return emails or…",
          "Contenu": "Your company doesn't return emails or phone calls except when they feel like it and when the customer feels will never receive one.I know from looking at them the disks sent in, especiallly a complete series of Dexter was not scratched but your company is saying it was. Your company either has some employees they may want to retrain or maybe fire for dishonest practices. The order also sat at your warehouse for days before even received in. I had what seemesd like all the higher paying dvd's removed from the payment. I b think your company rips off the customers and has bad  customer service practices purposely to deter and frustrate the customers from following up with anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony DeRosa",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:43:45.000Z",
          "Titre": "I have been trying to close my account…",
          "Contenu": "I have been trying to close my account for over a month now and you guys wont close it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan  Cain",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:44:43.000Z",
          "Titre": "0 stars DO NOT USE!!!",
          "Contenu": "I'm mad that I can't give 0 stars. DO NOT USE THIS COMPANY FOR ANYTHING!!! Every single thing about the process was off of what I was told. I was paid half of what I was quoted supposedly for cds with excessive wear only to get them back and they literally have no wear no scratches nothing they were in great condition. I believe this place is just burning cds and then not buying them. I wouldn't recommend them to anyone for anything EVERRR!!!! 0 STARS!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deirdre Dare",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T03:37:12.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible.   States most expensive item in order was not included along with quite a few other items that were definitely included.   This is a bad pattern with this company since this summer and has been documented by many others besides myself.  Someone is stealing within this company and they are doing nothing about it!  Will not send any more orders to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Biegler",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T02:34:58.000Z",
          "Titre": "Stupidly inaccurate quote",
          "Contenu": "Stupidly inaccurate quote. I was quoted over $138 and am only receiving $35. I wasted an awful lot of time for such a B.S. company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "XXXXX",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T03:00:29.000Z",
          "Titre": "Better communication and availability",
          "Contenu": "Better communication and availability. I live in the midwest. You are NOT available 8-11am my time. I wanted to ask a question but could not because you are not available. Not be able to reach you at my convenience is a real problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Mitchel",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T09:11:13.000Z",
          "Titre": "EagleSaver.com is a scammer the worst…",
          "Contenu": "EagleSaver.com is a scammer the worst communication skills they lack business etiquette. I don’t know how they’re in business stuff I will never ever bring anybody business there or will I suggest anyone going there they’re scammers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Miller",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T15:02:31.000Z",
          "Titre": "Untrustworthy. Be warned.",
          "Contenu": "I was told a check was mailed. I never received it. I contacted Eaglesaver by email. I was told to wait 5 more days if I don’t receive it to contact them and they would reissue another check. I waited 2 more weeks just to be sure. I have left numerous voicemails and emailed them multiple times with no response. They have stolen my products that I mailed them because I have never received a payment. It’s sad because I had dealt with Eaglesaver previously and always had a positive result. I am not sure what is going on with this company now but they can no longer be trusted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Shepard",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T22:01:15.000Z",
          "Titre": "SCAM ARTISTS",
          "Contenu": "There's ZERO communication. Don't have questions because they will never answer them. They do as they wish. I have to file complaints with the BBB and FTC just to get my stuff back. This is the worst business I've ever dealt with. SCAM ARTISTS!!! When given the list of items to be returned, I stated that I didn't wish to accept their offer and asked for the entirety of my items shipped back and payment to be halted. As I stated earlier they do as they wish and it takes a week or more if they ever reply. SO YES, THEY'RE THE EPITOME OF SCAM ARTISTS. It's ok I filed my complaints already. BBB score of F and 1 🌟. Get a CUSTOMER SERVICE CENTER! After receiving my so called heavily damaged items, I found out of the 13(heavily damaged) items, 1 DVD and 2 CD's had ZERO scratches, abrasions or blemishes. To be fair the other 10 did have some heavy wear but nothing that'd prevent them from playing without skipping. I checked every one before I shipped them. This is what happens when you refuse to communicate to your customers. By ignoring the customer they can manipulate the transaction anyway they see fit to increase their profits and lower the quote they give you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 11,
          "Date": "2022-08-25T09:18:02.000Z",
          "Titre": "Amazing decline in service !!!",
          "Contenu": "Their service has declined significantly! Order delivered a week ago still not processed and it now takes many days to even get communication from them! Never seen it so bad here in all the years I have dealt with them. Sellers beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deirdre Dare",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T04:23:09.000Z",
          "Titre": "Claimed 9 items were missing from my…",
          "Contenu": "Claimed 9 items were missing from my order.  Have had this issue with them in the past and double / triple checked this order and know for a fact all of the items were in there as I took a picture this time right before sealing the box for shipping.   Sure enough, the most expensive items \"missing\" from the order.  Someone in their receiving department is definitely stealing.   Reporting them to BBB and ICC for fraud.   It's not so much the money but the principle.   It is complete fraud."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natasha Hall",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T20:25:48.000Z",
          "Titre": "Scam to steal your items",
          "Contenu": "I have proof of delivery a week ago, yet Eaglesaver says they are still awaiting shipment. The do not answer calls or emails. This company is nothing more than a scam to steal your items. Definitely go with Declutter, I sent a shipment to them the on the same day and was paid 3 days later."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Cerqua",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T21:23:52.000Z",
          "Titre": "WARNING!",
          "Contenu": "Thought this might work until the end result. I sent in many Blue Ray as well as CD's. They contacted me staing several were not up to their standard, fine, so be it. The email said to write to them if I would like them returned, so I have, on 3 seperate occasions with the order #. I have not been contacted nor have I received my products back. THIS IS THEFT ! BE WARNED!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa Snowden",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T18:07:35.000Z",
          "Titre": "Bait and switch tactics",
          "Contenu": "EagleSaver knows they are purchasing older discs, yet they change the payout amount, about after giving a quote price, once CD’s are received. Not good business practice. Will not use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T23:11:04.000Z",
          "Titre": "Eagle Saver blaming ME for THEIR error!",
          "Contenu": "Looks like the company has really let us down this time. They are claiming that I entered UPCs for vinyl and then sent CDs to them. While I DID enter the CORRECT UPC number from the CD packaging, the DESCRIPTION on the packing list shows an incorrect UPC number with a correct description mentioning \"CD.\" Because of their error, my order was held up for two weeks and now they claim that it's MY FAULT for sending CDs, instead of vinyl and are shorting me on what they originally offered for the CD title, according to an email I received from them.Worse, I have sent two emails showing their error and neither one has been answered.Because I have one more order which they have received on 2/20 (but still have not acknowledged three days later) which has the same CD title, this will most likely happen AGAIN, due to their data-entry error. And, again, I will probably be blamed and my payout will be reduced.What a reasonably-run company would do is to apologize for their error and immediately forward the money I am owed for what was originally offered (maybe with a \"good will\" extra credit), when I sold the CDs to them. Of course, good luck with that..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Canini",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T14:32:42.000Z",
          "Titre": "It’s a Scam!",
          "Contenu": "This company is a scam!! Everything went along so well until I deposited my payment check and my bank told me it was not a legitimate check! They don’t respond to calls or emails..I have reported them to the Better Business B!  STAY AWAY!!! They’re thieves!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ethel Marciana",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T20:35:44.000Z",
          "Titre": "Total waste of time",
          "Contenu": "After physically scanning about 50 movies I go to check out.Only after checking out it informs me each individual dvd has to be at least 50 centsMost of my DVDs were 25"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Harrell",
          "Nb_Reviews": 2,
          "Date": "2022-09-15T00:35:01.000Z",
          "Titre": "Disappointed",
          "Contenu": "I am totally disappointed with this company. They committed legal robbery on me. For the price they quoted me they will quadruple their profit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Price",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T23:34:00.000Z",
          "Titre": "I sold$32.73 worth of DVDS I shipped…",
          "Contenu": "I sold$32.73 worth of DVDS I shipped the Federal Express. They received the on 4/24/23. As of 5/4/23. I had not received my check. I called them numerous times, and their recording said they returned calls promptly. HaHa, I sent at 3 emails. I have not heard a peep from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeannie lynn High",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T09:55:10.000Z",
          "Titre": "What happened to my 41.00 payment and…",
          "Contenu": "What happened to my 41.00 payment and my other order this never happened before with your company and I’m being honest ripped off"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david sheffield",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T17:18:14.000Z",
          "Titre": "Eagle Saver received My Items on…",
          "Contenu": "Eagle Saver received My Items on 9-14-2022 but it still shows that they are waiting on the itemswhen You call them You cannot talk to a live Person and they do not return callsthe least they can do is call or Email Me and let me know they received the items"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frederick Reed",
          "Nb_Reviews": 7,
          "Date": "2023-04-26T09:56:32.000Z",
          "Titre": "Very slow service",
          "Contenu": "Very slow service. Paying someone needs to be much faster and more reliable. Which is why I can only give them 1 star. I have seen others which give the payment faster."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Schellenger",
          "Nb_Reviews": 2,
          "Date": "2022-10-15T07:13:20.000Z",
          "Titre": "Scam",
          "Contenu": "They quoted me $102 but only gave me $68 after they received the 300 plus videos I sent. If they can't honor the quote within 5 or 10% they should send it back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed Klimek",
          "Nb_Reviews": 2,
          "Date": "2022-10-09T03:43:29.000Z",
          "Titre": "You quoted me $20.88 for my…",
          "Contenu": "You quoted me $20.88 for my merchandise.  I sent it in and you gave me $9.77.    You owe me $11.11. This is unacceptable.  Give me what you quoted me or send me my merchandise back!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T05:07:57.000Z",
          "Titre": "Didn’t give quoted price",
          "Contenu": "You quoted a price, sent packing list and now you are sending me a check for less than the quoted price after I sent all the games to youThat’s very shady"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EC",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T14:14:56.000Z",
          "Titre": "I think this was a scam!",
          "Contenu": "I don't know they promise you a whole 40 cents and then give you nothing! a joke!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T01:34:18.000Z",
          "Titre": "ripped off",
          "Contenu": "did not pay the amount ..said . ,way lower .no reason given"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T19:46:41.000Z",
          "Titre": "I would give zero stars if that was an…",
          "Contenu": "I would give zero stars if that was an option. Sent them over $300 in DVD's. No contact from them whatsoever. I do have confirmation from FedEx that they did receive the shipment. Tried calling them countless times, also emailed them many times with no reply. SCAMMERS!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Allgaier",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T22:00:25.391Z",
          "Titre": "Eaglesaver CONSISTENTLY rejects items…",
          "Contenu": "Eaglesaver CONSISTENTLY rejects items with the highest quotes.  It's always the high-priced items they claim have damage.  Somebody in the receiving department there is skimming and claiming the discs are damaged. It's happened to me multiple times, and it's always the higher-priced items.  No more!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Gardner",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T03:20:05.000Z",
          "Titre": "Be careful here!",
          "Contenu": "The only good thing I can say is you will eventually get some money. They did not take some of my DVDs. They said they were fake. They said they will send them back for free if you request. I did request and did not receive a response. This place might be a scam. Be careful if you use them. I have used places like decluttr and sellbackyourbook without any problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MICHAEL MARKOVITCH",
          "Nb_Reviews": 4,
          "Date": "2021-12-10T02:40:17.000Z",
          "Titre": "A TOTAL WASTE OF TIME",
          "Contenu": "I spent 3 hours scanning 300+ cds and when I tried to process the order, I got a message indicating that the average price per CD must be at least 75 cents. I was instructed to delete the lower priced CD's to get me to an average of 75 cents per item. This would result in my deleting 270 of my 300+ CD's. A TOTAL WASTE OF TIME. IF YOUR TIME IS VALUABLE, DO NOT USE THIS SERVICE!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 3,
          "Date": "2021-11-13T02:58:32.000Z",
          "Titre": "I received a total quote for roughly…",
          "Contenu": "I received a total quote for roughly $520. I had 13 items get rejected and i was only paid $248. I emailed them multiple times a day asking them to fix the error and send me the rest of the balance. They didn’t even have the courtesy to answer any of my emails. I’ve been using this company for a few years and they have only gotten worse and worse. How they can mess up something every single order is truly a reflection of how little they care about their customers and their own business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T18:29:41.000Z",
          "Titre": "Avoid - EagleSaver will rip you off",
          "Contenu": "Conveniently Eagle saver “did not receive” the 2 series that they were going to pay me the most money for. So now I don’t have the movies are the cash. They also said half of my movies were not “authentic” even though they were still in the factory sealed plastic. I definitely would not recommend selling to EagleSaver, you’re going to get ripped off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sabine Harrison",
          "Nb_Reviews": 1,
          "Date": "2021-09-12T17:47:53.000Z",
          "Titre": "This company is terrible",
          "Contenu": "This company is terrible. After sending my items to them, they claimed it was incorrect and cut the invoice amount by 20%. Worse still I never got paid. Because they claimed I did not send what I invoiced they offered to return the items at their cost. Three months later I am still waiting. Never got them back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hollywood",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T22:18:57.000Z",
          "Titre": "Lots of work, little payoff.",
          "Contenu": "The process of scanning on the app is fairly easy, but I sent in 72 items and they only accepted 28. Meaning I sent off 72 items and got a check for $35 which included a BRAND NEW NEVER OPENED PS5 game! Only do this if youre desperate for money but dont expect much."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennasiandh",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T14:26:02.000Z",
          "Titre": "Horrible service and their promise to…",
          "Contenu": "Horrible service and their promise to turn around payment within 24 hours after they receive your shipment is the biggest load of B.S.  More like a week. And good luck ever getting in touch with them. They do not respond to emails and you cannot reach them on the phone. The most you can do is leave a voicemail and hope they hear it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tanayia Sturdivant",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T00:28:13.000Z",
          "Titre": "Last Minute Reminder",
          "Contenu": "I was halfway though with processing all of my dvds when it tells me last minute that the minimum average is $0.75 or greater. It should’ve warned me with the first ineligible one instead of me wasting thirty minutes of my time typing the UPC. It’s already bad enough that the app’s scanner rarely works. Decluttr is definitely the better choice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "disgruntledwoman",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T03:27:11.000Z",
          "Titre": "I'm completely unsatisfied",
          "Contenu": "I'm completely unsatisfied. Eaglesaver is ruturning an almost perfect TV Series Boxed Set stating that the items didn't match. I scanned the barcode and their website matched it to exactly my product. Every case was original and all discs, inserts and the packaging were there and intact. There have been more that one release with the same barcode, for the same product. I don't know what their problem is. Also, tried to sell the Final Season of Game of Thrones and they rejected that too. What an annoying disappointment. I would rate it zero if that were an option."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 4,
          "Date": "2020-12-29T14:56:29.000Z",
          "Titre": "Gone way down hill!!!",
          "Contenu": "Dealt with this company for years with great customer service, accurate information, quick payments. They have deteriorated severely! Orders arrive and take weeks to process and payments sent. Expected pay date listed when placing an order no where near accurate any longer. The last order I will ever again send to them, that was delivered over a week ago, still not marked as received, and obviously no payment yet and still waiting for communication!!!Never Again- BEWARE-"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Hughes",
          "Nb_Reviews": 2,
          "Date": "2020-07-08T23:16:28.000Z",
          "Titre": "NO NO NO",
          "Contenu": "I am so upset right now. After scanning around 30 dvds, a window popped up saying the average cost per dvd had to be a dollar-lol!!!!!!!! They wouldn’t pay me even half that for any of my dvds. I wish that window had popped up first. Such a waste of time and I will tell everyone I know not to use this- it’s A JOKE!!! I’m most upset about the time I just wasted!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Rogers",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T00:36:34.000Z",
          "Titre": "What a waste of time!!",
          "Contenu": "What a waste of time!!!  Went on a site that gives you the highest value for your DVD...when you click sell to buyer (Eagle Saver) the price is different by alot..LESS...It is not clear on how it works...can't check out... Very frustrating. I won't waste your time!!!  I wish I knew before spending all this time on Eaglesaver site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gia",
          "Nb_Reviews": 6,
          "Date": "2021-09-21T00:02:58.000Z",
          "Titre": "Simple on line ; personal contact impossible",
          "Contenu": "The process is simple and very easy. On line instructions are concise and detailed , yet the availability of a live person to contact seems impossible. I have tried several times to call and no one picks up. I have a growing list of items  I will have to spell out in an email because I can’t get anyone on the phone! This is type of sub par service does not bode well for you ... I would have given you five stars if it weren’t for that."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mr",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T05:31:36.000Z",
          "Titre": "Don't waste your time",
          "Contenu": "Used them twice to sell back textbooks and both times said they were not in acceptable condition and didnt pay. Feel they are not honest about condition of books since the second one was in very  good condition. Stay away, use another company....also if you say you are not accepting textbooks, why are you offering quotes for textbook ISBNs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann Babson",
          "Nb_Reviews": 2,
          "Date": "2020-10-04T15:38:27.000Z",
          "Titre": "This company is a scam",
          "Contenu": "This company is a scam. Don't trust them. My order summary shows they owe $23.56 to me but sent check for $13.81. They wont respond to my call about it. They now, after this review, decided that there was a disc missing (there wasn't any missing when sent) this is a scammy justification that I'm sure they have pulled on people before me. They could have mentioned that to me a few weeks ago if true. So easy for them to do to \"justify\" a ten dollar reduction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2020-07-02T04:05:03.000Z",
          "Titre": "They ripped me off",
          "Contenu": "EagleSaver kept my Sons of Anarchy series and has not paid. They received it on May 5 so going on 2 months. I have emailed them several times and each time they apologize for the mixup and ask for my PayPal account. Send them a email and it takes a week to get a response don’t use this company.Update 7/1/20 Finally received payment today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan W. Petrucelli",
          "Nb_Reviews": 7,
          "Date": "2020-09-08T21:03:42.000Z",
          "Titre": "SCAMMER ALERT!!!!!",
          "Contenu": "I have sold to them for several years. Last week, i sent three massive boxes of DVDS, $350, $110 and $100. I have Fed Ex shipping numbers as proof. They REFUSE to answer my calls and emails. I filed a formal charge with the BBB and will take them to court if they don't send me my money.SCAMMERS!!!!!!!!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Parm",
          "Nb_Reviews": 3,
          "Date": "2019-08-16T07:22:00.000Z",
          "Titre": "Will never use again",
          "Contenu": "I placed an order to sell. My items are in very goo condition. They refused some of them saying they were scratched etc..They only sent half of what they quoted due to refusing half my items. They asked if I wanted the not taken items back. I replied that I wanted the items returned that they did not take, and I have yet to receive the items back. Use Decluttr instead. They pay less but are a lot easier to deal with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gia",
          "Nb_Reviews": 6,
          "Date": "2021-09-21T00:02:20.000Z",
          "Titre": "YOU ARE UNREACHABLE",
          "Contenu": "YOU ARE UNREACHABLE - I've tried several times to contact you by phone and have never been successful  I have DVD's that the scanner will not recognize and don't know why. I even took the time to send a list of them into to you and got no response. .I don't why you advertise a phone # and indicate to contact all you, when no one ever picks up the phone and it rolls to an automatic v/mail.... very poor customer service The \"average\" rating is due to the easy process when items are scannable... and your delivery of the  $$$ is quick."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Hensley",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T16:31:17.000Z",
          "Titre": "DON'T USE EAGLE SAVER",
          "Contenu": "Got a quote for cds and dvds. Despite guarantee of four days for the quote, the next day the quote changed. Emailed for help; no response. Decided to sell less stuff to satisfy new conditions. Forced to restart quote and got half of what I was offered before. I called. Never received phone call or email back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KJS",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T11:28:30.000Z",
          "Titre": "The entire process was just awful",
          "Contenu": "The entire process was just awful. Won't ever use Eagle Saver again!  Told one of my friends about it after I spent the day trying to \"sell\" my stuff I had to delete it off my order because the average wasn't high enough not to even bother to download the app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 6,
          "Date": "2018-03-31T14:15:32.000Z",
          "Titre": "I was told 2 of my dvds were not in my…",
          "Contenu": "I was told 2 of my dvds were not in my order so I was not credited for them.  I know for a fact they were in the box since I checked off each dvd using my copy of the packing slip as I placed them in the box (they were placed in the middle of the box).  I have an idetic memory.  I will never sell to eaglesaver again and I will also tell all my friends to not sell their dvds to them because they will most likely get ripped off.  I lost 11.00 because of this rip-off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annoyed",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T21:21:40.000Z",
          "Titre": "Terrible communication and refused…",
          "Contenu": "Terrible communication and refused items as non authentic when in original packaging"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reinado",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T14:16:51.000Z",
          "Titre": "No payment",
          "Contenu": "I sent the items with the prepaid envelope provided, I received an email that 1 of the items had scratches and was not being paid but I never received payment for anything. I sent an email and no response from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Lister",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T15:49:04.000Z",
          "Titre": "Does not respond to emails or voicemails",
          "Contenu": "I received an email that most of my dvd's were not genuine copies which is crazy as I bought them just like the rest of them. I responded immediately to their email that I would like them sent back and didn't receive a reply. Also sent another email and called twice during normal business hours, no one answered and so left detailed messages twice and no response back. I do not want to be cheated out of my dvd's and want them returned.You see Eagle Savers reply about a tracking number Aug 28th, I still haven't received the dvd's back and it is 9/10/20."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jen Love",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T02:44:50.000Z",
          "Titre": "PROCEED WITH CAUTION!!!",
          "Contenu": "PROCEED WITH CAUTION!!!I used their app to scan many books, and after I had a box worth of books that they said they’d accept, and quotes me on, when they got them, they refused to payout for the highest priced book.  They said they don’t accept that type of book, yet to they didn’t deny the book when I scanned, and they quoted a price for it. Any reasonable person would think if they didn’t want to accept a book, when you scan it, it would say they aren’t accepting that book, and they wouldn’t quote you a price for it. Don’t waste your time with this company, I’ve had better luck, and better prices from others."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KEITH GAYLORD",
          "Nb_Reviews": 39,
          "Date": "2021-11-13T18:57:39.000Z",
          "Titre": "Totally Incompetent",
          "Contenu": "Used them before and they were good.  This time it was the worse experience ever.  They have the worse customer service ever.  Never heard back from them for a week.  Will never use them again.  Do not waste your time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.A.",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T12:33:40.000Z",
          "Titre": "Scammers - Avoid at all costs.",
          "Contenu": "They don’t care about you and will scam you. I mailed in a box of dvds. Scanning them with the app and dropping them directly into a box if they were accepting them. They received my box and emailed me to let me know 5 movies were not in the box. Conveniently they were some of the more expensive ones. Emailed and called them. Nobody ever answers their phone even during the recorded message’s stated hours. Nobody returns your message even if they say they will within 24 hours. And now, they’ve paid me based on the new “lower” price and I still can’t get a hold of anyone. They’ve literally stolen 5 dvds from me. DO NOT USE THEM!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael Washington",
          "Nb_Reviews": 1,
          "Date": "2014-01-31T12:20:28.000Z",
          "Titre": "Thank you very much",
          "Contenu": "Um I called the JP Morgan Chase Bank in midtown Atlanta and they told me that the check that I was issued was a fraud and then turned me away to go to another bank. The clerk that told me that the JP Morgan and chase check was phony also told me that she wanted to call the police because she had originally suspected that I myself had forged the check that was sent to me in the regular mail. Other than that I was very pleased and hope to continue to do business with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2014-08-08T02:28:58.000Z",
          "Titre": "Seller Beware",
          "Contenu": "Of all the sell back places Eaglesaver.com had the least bad reviews, but I should have kept looking... Sent two boxes of various DVD's and CD's that were kept in a storage closet, most were brand new looking. Of a $40 quote they sent me $20 and claim that most were heavily scratched, can't wait to see what they send back. **Make sure to catalog and take pictures of everything you send to any of these organizations, they are in it for money and paying full price isn't profitable**"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LaShawn Roseboro",
          "Nb_Reviews": 3,
          "Date": "2019-08-01T17:16:23.000Z",
          "Titre": "Didn’t get back items not paid for and now not accepting items under $1",
          "Contenu": "My first time using EagleSaver.com was great. They took all items entered. My second and third order I did not receive the full amount offered due to what they say had more wear on them. Most of the dvd’s I sent were brand new and never opened. I also did not receive those items back that I was not paid for. I have continued to use the site because I have no use for the items I have, but now they are NOT accepting anything under $1. Well you can guess that MOST of what’s entered in cart is under $1. Currently Looking for another way to get rid of dvds, cds and games."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kimberly",
          "Nb_Reviews": 2,
          "Date": "2020-08-05T15:44:22.000Z",
          "Titre": "Lack of Communication",
          "Contenu": "I cannot get ahold of them. Tried calling and emailing with no response. Still have not received payment a week after they stated that payment had been sent. Bad customer service. Appears that they stole my DVD’s.Update:EagleSaver finally responded after feedback was left on trustpilot. I did finally receive payment today. I am leaving my feedback as one star due to the fact that my experience was so negative. Most importantly was their lack of communication with regard to payment. All around, I did not enjoy working with EagleSaver and I would not have chosen them as a buyer if I could foresee this ending."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 3,
          "Date": "2018-08-08T21:51:09.000Z",
          "Titre": "I would not recommend EagleSaver.com",
          "Contenu": "I would not recommend EagleSaver.com for the selling of old video games or gaming equipment. I was quoted a price to sell some larger ticket items, and then when they received them I was told that they could not reimburse me for them as they had no way to test them to assure that they worked. Now I have to wait for the items to be returned, so I can sell them to a site with the necessary equipment needed to test these older video games, etc.  What a complete waste of time, as they should have been able to anticipate this issue prior to giving me a guaranteed quote."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david",
          "Nb_Reviews": 3,
          "Date": "2021-10-16T09:52:01.000Z",
          "Titre": "TAKING FOREVER TO GET MY MONEY",
          "Contenu": "TAKING FOREVER TO GET MY MONEY.   EAGLESAVER GOT PRODUCT ON 10/4 ITS 10/16, NO MONEY YET AND I CANT GET A HOLD OF THEM  THEY ALWAYS HAVE THEIR ANSWERING MACHINE ON.  GIVES ME SECOND THOUGHTS TO USE THEM AGAIN."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2016-05-20T03:19:25.000Z",
          "Titre": "Lying about buying",
          "Contenu": "I took a whole lot of time entering \"upc\" codes, packing them up, and shipping them there only to be told \"we do not buy these movies\"!!!!  Why can't they say invalid code or something???!!!!! I personally think they didn't want to pay out the money!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T14:29:23.000Z",
          "Titre": "Do business with this company at your…",
          "Contenu": "Do business with this company at your own risk. I have had nothing but bad experiences with them. I have had 3 orders with them, and none of those 3 have gone smoothly. Their processing and response times are horrendous. Actually reaching someone through e-mail or phone is a challenge, if not impossible (they definitely do not respond back within their stated 24 business hours). For my first two orders, I did eventually get paid but there were issues, countless delays and virtually no communication. For my third order, they claim to have paid me but I can find no trace of the payment and have been unable to get any response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 2,
          "Date": "2020-05-29T14:34:53.000Z",
          "Titre": "My first three orders went great but it all changed. Be aware!!",
          "Contenu": "My first three orders went great, then refused Xbox games from my kids, so asked to ship them back. Then next order a DVD series was all the sudden missing 2 dvds, which is 100% not true. I checked everything before sending, so they took off 38.00 from the order for the complete series.  now I can’t even log into my account. Says I can’t place orders when I try to sign in. No email explaining why account is locked. I think Why is cause I asked for 1 rejected order back, out of 6 orders.  I will sell to different company. My dad had 1000s of dvds and passed away suddenly so I am selling to help my mother out financially."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ayana",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T16:42:04.000Z",
          "Titre": "It has been two weeks and I still…",
          "Contenu": "It has been two weeks and I still haven’t received payment. Beware I believe this is a scam. Eagle saver responded in the comments. I sent my package June 12 not the 17th and now they are not acknowledging my emails or taking my calls. They refuse to pay me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan W. Petrucelli",
          "Nb_Reviews": 7,
          "Date": "2020-09-10T20:34:23.000Z",
          "Titre": "WARNING EAGLESAVERS ARE SCAMMERS!!!!",
          "Contenu": "WARNING! THESE \"PEOPLE\" ARE INTERNET SCAMMERS. I HAVE FORWARDED THREE PROOF OF DELIVERY, OFFICIAL DOCUMENTS FROM FED EX, THAT 3 BOXES I SENT WERE DELIVERED AND SIGNED FOR. I SENT THEM TO THE BBB AND JACKSONVILLE POLICE DEPARTMENT"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Fuck eagle saver",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T18:57:37.000Z",
          "Titre": "Already took barely any of my titles",
          "Contenu": "Already took barely any of my titles, and paid barely any for the ones they took. Got a quote of $28 and sent it in, great condition on most of the items and received $13. Nice scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krista",
          "Nb_Reviews": 1,
          "Date": "2020-04-14T17:29:27.000Z",
          "Titre": "Scam",
          "Contenu": "Scam. They originally were buying one of my games for $8.00, but after they received the game they said the casing was in \"poor condition\". This game had zero scratches, no barcode or rental stickers on the cover, and even had the manual (or whatever it's called now) inside. In other words, there was nothing wrong with it at all and it looked fairly new. This was the most priced item in my cart. In this same order, I had another game that DID have some scratches and had TWO used barcode stickers on the cover, AND had some of the plastic cover piecing chipped. And yet this was acceptable. Probably because they were only offering $0.30..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 1,
          "Date": "2018-02-15T23:29:33.000Z",
          "Titre": "They suck!!",
          "Contenu": "They suck!!  Send about 20 dvds and they weren’t scratched and they only paid me 5.00 of the 22.00 they were suppose to. They are however sending them back to me with no charge you have to ask them too. Otherwise theI’ll keep them for free"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2018-01-22T22:13:32.000Z",
          "Titre": "Scam?",
          "Contenu": "I got a quote, shipped my dvds, received email that they got it, but no check! They say 3-4 business days but it’s been since Jan 12 and today is Jan 22.  They haven’t  responded to my emails or phone calls. Hoping I wasn’t scammed!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2019-10-18T09:21:10.000Z",
          "Titre": "Poor Choice for Cd buyback",
          "Contenu": "First time I used Eagle Saver, they rejected my entire order due to excess surface wear.  I have used other companies in the past and NEVER had this issue, selling over 3,000 cd’s.  I won’t be using EagleSaver.com again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PubliusRedux",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T04:31:10.000Z",
          "Titre": "Sold over 100 DVDs to this company",
          "Contenu": "Sold over 100 DVDs to this company, some of them first rate, and recieved $116.  If I had had the time time could have made at least twice this much at a garage sale.  Highly recommend you shop to sell somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Wellman",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T16:33:23.000Z",
          "Titre": "God is awesome.",
          "Contenu": "You quoted me $40 and I am getting much less."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-02-28T16:19:12.000Z",
          "Titre": "I was lied to",
          "Contenu": "The app was easy to use. The scanning feature worked very well. The price offered seemed fair. Shipping was a breeze. However, quite a few items were rejected, most notably one that was promised a $9 value. Why the rejection? Excess wear. Impossible!!! 95% of my CD collection was used one time. I burned it to mp4 and then put it back in the jewel case never to be used again. To reject for this reason was an outright lie. I won’t use them again for anything. Be careful if you do. Response to response. Another lie. I sent three boxes. You conveniently noted the one you were most truthful. How about the other two shipments? You returned a full box of perfectly good CD’s. Care to answer now?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Simpson",
          "Nb_Reviews": 2,
          "Date": "2019-11-06T02:25:27.000Z",
          "Titre": "Sent 2 got paid for 1",
          "Contenu": "I sent all the seasons of Frasier and you said you only received 1 of the 2 and only paid me half. Not only will I not be using your services ever again but I will not be referring your services to anyone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pablo",
          "Nb_Reviews": 1,
          "Date": "2017-06-13T04:56:26.000Z",
          "Titre": "Didn't get qouted price did better at …",
          "Contenu": "Didn't get qouted price did better at pawn shop just got ripped off screw me ounce shame on screw me twice shame on me never again mentioned company during a streaming not to sell to you to all my followers th good day"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 2,
          "Date": "2021-09-06T17:43:33.000Z",
          "Titre": "Don't give you what they say they're…",
          "Contenu": "Don't give you what they say they're going to give u...its a scam....stay off this app...and btw...its been 3 weeks and I still haven't received my stuff back!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2019-03-02T03:54:54.000Z",
          "Titre": "Doesn’t seem like the most honest since…",
          "Contenu": "Doesn’t seem like the most honest since I was told that movies that were brand new in the wrapping weren’t good enough quality. I’ve yet to receive back the movies that were supposed to be sent back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 3,
          "Date": "2018-08-26T21:13:52.000Z",
          "Titre": "Avoid this website...",
          "Contenu": "Despite a price quote guarantee for my items that I was selling Eaglesaver would not buy them because “they didn’t have the equipment to test them”, so I promptly requested that my items be returned to me free of charge as advertised. Now 3 weeks later, I still have not received my items. I have also emailed Eaglesaver 6 times without a single response. I have called their telephone number with no answer, so left 3 voicemails. Despite them saying that they will definitely respond within 24 hours, now weeks later I still have not been contacted. Definitely do NOT recommend this website! The items that they wouldn’t except were the expensive items, and now it appears they are keeping them anyway and likely selling them for significant profit!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2017-12-05T14:36:58.000Z",
          "Titre": "Thought it was going to be a good experience but....",
          "Contenu": "Everything was really easy to send to them but now their check has been returned and I had an additional $15 charge taken out of my account.  Not good Eaglesaver. Please make this right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 4,
          "Date": "2016-03-31T02:32:23.000Z",
          "Titre": "Horrible Company that says one thing but does another",
          "Contenu": "I read all the positive reviews online and was excited to send in my first items. I boxed up 5 boxes full of my family's items and sent them to Eagle Saver. When they received them they said that there were many of them that did not meet their minimum condition standards. On their homepage they state that they will return any items that they won't buy free of charge. When I asked for the items back they refused. It didn't matter to them that their homepage said they would send the items back for free they still refused. They refused to stand behind what they put on their own website! I even went so far as to send them a screen shot of what they have up and they didn't care. They said it would cost them too much so they weren't going to keep their word."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2019-05-26T21:11:52.000Z",
          "Titre": "Sketch and Dishonest.",
          "Contenu": "I sent 5 blue rays in and they wrote back that they only received 4.  They then went on to tell me that the movies I listed were different than the ones that I sent.  I know that next time I will take a picture to show proof that they were indeed the correct movies.  The whole thing just seems sketchy and dishonest.  I do not recommend and will definitely not be selling anything to EagleSaver again in the future.UPDATE after their reply: I keep my single star because I know for a fact that I entered the bar codes EXACTLY as they appeared.  On top of that, the fact that one was \"missing\" shows how unorganized and unprofessional they are.  One obviously got lost and they tried to put the blame on me.  Make sure you take pictures of everything you send as proof so the same thing doesn't happen to you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "adam",
          "Nb_Reviews": 1,
          "Date": "2016-09-10T21:49:49.000Z",
          "Titre": "didn't get what they said they where going to give me",
          "Contenu": "i didn't get what it said i was going to get. Which i think is messed up you say 121 dollars it should be that not 83. Thats just my opinion though so you make your own decision."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Merrie Warner",
          "Nb_Reviews": 1,
          "Date": "2020-12-26T17:26:20.000Z",
          "Titre": "fraudulent business practices",
          "Contenu": "First off, the prices they offer are ridiculously low. .17 cents, .37 cents per item for the most part. Then, after I finally compiled and mailed in my items, they emailed me informing me that i did not send something, which i did. (They said i omitted a duplicate, which they WILL NOT accept duplicates- it says clearly as you enter your titles.) I emailed them stating as much, but then received another email informing me that they would be mailing me a check for far less than we had agree upon, and still would not respond to my first email.then, when i pushed harder, the person asked for my order number. if we are going back and forth, and he knows what i \"omitted from my order\", knows how the amount of the check he is sending me, then how does he not  know my order number?  It feels manipulative and fraudulent. i will never work with Eagle Saver again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T23:38:29.000Z",
          "Titre": "They say they don't nitpick.",
          "Contenu": "They say they don't nitpick.I would say they do nitpick to reject an order.They come up with unstated rules that are not listed to reject an order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T18:10:25.000Z",
          "Titre": "Absolutely horrible customer service…",
          "Contenu": "Absolutely horrible customer service and communication. There were some brand new items in my order that needed to be sent back to me. No big deal. When I received some of these items they were damaged cosmetically, and this wasn’t from shipping. The dvd series cover was ripped off from the front and back. I confronted Eaglesaver about this. They offered a 50% off refund for its value. I accepted the offer. I have yet to get the refund, and it’s been 2 months of me emailing them literally everyday. Some days they take 48 hours to get back, sometimes it takes them 6 days to get back. Last time I checked a clerk sent me a memo on PayPal for me to pay Eaglesaver the 50% refund. I emailed them to correct it, it’s been 4 days, and they still have not emailed me back. I even called and left a message 1-2 weeks ago, and still nothing. Again, I’m emailing them everyday and no one is getting back to me. A huge disappointment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bernadine",
          "Nb_Reviews": 2,
          "Date": "2019-11-11T14:02:21.000Z",
          "Titre": "Slow slow slow site to navigate",
          "Contenu": "Slow slow slow site to navigate.  Scanner takes forever to ficus.  $20 minimum is ridiculous as us the 75 cent per item minimum.    Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joan",
          "Nb_Reviews": 2,
          "Date": "2020-06-12T00:43:24.000Z",
          "Titre": "More trouble than it’s worth.",
          "Contenu": "I went to the EagleSaver website and started entering bar codes for CDs. After I had entered them and wanted to check out, I was told my order did not meet the 75 cents average item minimum and I should remove some lower priced items. This is rather ridiculous when they are paying 16 to 25 cents for many cds. This should be made clear before you enter items.  I removed low priced items and tried to check out. I have been on the site before but I could not reset my password. I got the reset emails so I know my account was on file. I left the website and re-installed the app and was able to log in, but my cart was gone. I had to re-enter the cds. All this for $26.00! Also, on the app you can scan the barcodes, from the website you have to enter them manually. A little note on the website saying “Install the app and you can use a scanner” would have saved a lot of time. All I have left is the low-priced cds, so I won’t be using EagleSaver again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Georgie Snyder",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T22:32:46.000Z",
          "Titre": "They won’t respond"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 3,
          "Date": "2021-01-06T06:15:49.000Z",
          "Titre": "Went from trustworthy to shady",
          "Contenu": "I sent in $1100 in trade in DVDs which the tracking number showed them as receiving on December 27th. I haven’t received payment and it is now January 6th. EagleSaver.com will not respond to my emails and marked the order as paid as of December 31st but hasn’t sent me any money. They also claimed that they didn’t receive a couple items which I know for sure were sent. The fact they don’t respond to my emails asking when I will receive payment is alarming. Their customer service has gone downhill and their business practices are worthless. They receive thousands of dollars worth of merchandise but are too lazy to update the order to acknowledge receipt. Now it appears that they will steal your merchandise without even paying for it. They give you deadlines to meet as a customer but they don’t do the basics such as updating the order status. With everything going on in the world, they should do everything possible to pay their customers as quickly as they claim to and answer emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luisa",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T16:28:23.000Z",
          "Titre": "Given that I never received the payment...",
          "Contenu": "Given that I never received the payment after getting the email that they had received the shipment, I cannot give this more than one star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Tait",
          "Nb_Reviews": 3,
          "Date": "2020-11-25T11:57:22.000Z",
          "Titre": "do not  send anything to this company …",
          "Contenu": "do not  send anything to this company  at all they will not respond  this will be the last time i will send anything at all ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:18:55.000Z",
          "Titre": "Not very upfront about policies",
          "Contenu": "Not very upfront about policies. Rejected most of the CDs that were sent because f condition. Would argue that most rejected were in good condition and worth the $.25 that was offered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lyne",
          "Nb_Reviews": 16,
          "Date": "2023-11-17T23:41:09.000Z",
          "Titre": "I used to be able to enter multiple…",
          "Contenu": "I used to be able to enter multiple ISBN#'s, NOW only 1 at a time. I also sent you 2 books that have a 979# and you did not even acknowledge them. Odd, I thought."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 5,
          "Date": "2023-09-29T20:22:34.000Z",
          "Titre": "Is Anybody There?",
          "Contenu": "Sent emails, many phone calls and still have not heard back. This is unacceptable for providing good customer relations.  So, Fed Ex shows delivery of order, but eaglesaver site shows still waiting..and so am I."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 11,
          "Date": "2022-11-03T15:56:50.000Z",
          "Titre": "even worse now…!now to add further… had a payment…",
          "Contenu": "now to add further… had a payment issued after a week but a typo  on PP email address prevented it from going anywhere. Have asked them for advice or any info for days now, as to what , if anything can be done, BUT after message after message last few days asking for advice/ help they will not even offer or return any messages at all, just avoiding it!such a shame!***UPDATE-had to file a claim with local BBB as this CO. refuses to communicate in any way regarding a problem! SELLERS HERE BEWARE!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dorothy",
          "Nb_Reviews": 6,
          "Date": "2023-06-20T17:38:05.000Z",
          "Titre": "Got an email stating there were missing…",
          "Contenu": "Got an email stating there were missing movies, when I checked to see which ones, I know they were in there, and funny they just happen to be the ones that were a bit more than the others.  I am sorry what a scam, because I went through and made sure all they accepted were in the box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan  Tallman",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T03:28:11.000Z",
          "Titre": "Don't sell to eaglesaver waste of time",
          "Contenu": "All item are like new I only watched once. But they gave bull crap story on condition and didn't accept."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol Kokas",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T16:01:24.000Z",
          "Titre": "Not worth all the effort",
          "Contenu": "Not worth all the effort.  Spent great deal of time logging in items for consideration, packaging and mailing only to have many items rejected once received.  All of this when you are only receiving pennies for many of the items."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyrone Oraguzie",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T23:06:54.000Z",
          "Titre": "I'm not too fond that most of the…",
          "Contenu": "I'm not too fond that most of the products I have to sell to this company were popular, but they couldn't accept them. That made me feel like this wasn't the right company for me to go for it. I could have gone on a market to sell it in person better than being rated for that price isn't profitable for me to have."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C kramer",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T05:25:23.000Z",
          "Titre": "I used the pictures for the cd and DVD…",
          "Contenu": "I used the pictures for the cd and DVD conditions on their website, yet MOST of my disc's were rejected. I had an estimated payment of 72$, but recieved $30.None of the disc's were heavily damaged and none of them skipped, becuase I checked. They were willing to send them back to me, however I declined because I was decluttering. I used 4 different services to take my old books, cds and dvds, although u sent the most to eagle. I will think rice about sending my old items to eagle, becuase they rejected 64 items. The 2 other services rejected 1 and the 3rd none. I can't be bothered going through all if the websites again.  I am not happy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jane Q. Public",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T06:09:24.000Z",
          "Titre": "Trustworthy Albeit Slow and Disorganized",
          "Contenu": "This is the first time I have done business with eaglesaver.com.  PROS: They did send me a list of DVDs and CDs I was sending them (Packing Slip) as well as a prepaid FedEx postage label.  A tracking number confirmed that EagleSaver had received my package on April 24, 2023.  CONS: It took nearly 2 weeks from the time they got my package for me to receive my check.  Also, they did not confirm via email that they had received my package or that they had sent me the check.  And finally, I tried to log into my EagleSaver account to see what was happening since I had not heard from them, but couldn't get into my account. So I tried several times to reset my account password, but to no avail.  The company needs to look into these things because otherwise they provide a good service for people to make a few dollars for their used DVDs and CDs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerryleak",
          "Nb_Reviews": 4,
          "Date": "2022-12-15T20:29:17.000Z",
          "Titre": "I am wary of selling to Eaglesaver anymore",
          "Contenu": "This company used to be one of my favories but in the last several months, I have found that they will always find a reason to reject a book or DVD.  I only send books or DVDs that are in excellent clean condition and have read their condition requirements and what they will and will not purchase. I am aware they will not purchase textbooks, and strangely, they will reject a book such as a self-health or book on alternate religion, deeming it a textbook, when clearly it is not. If you attempt to send them an email asking for details, etc. you will not get a response back.  In fact, no matter why you send them an email, you will not get a personalized response back, just a \"canned\" answer that does not address your specific question."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "marvin  pope",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T11:49:40.000Z",
          "Titre": "the problem is it takes too long to…",
          "Contenu": "the problem is it takes too long to evaluate and let the customer know how much will be approved and when the money will come... a week or more is too long when its should just be a couple of days instead."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 11,
          "Date": "2022-10-29T11:45:28.000Z",
          "Titre": "A once very reliable company…now ALWAYS…",
          "Contenu": "A once very reliable company…now ALWAYS many days behind, always the same excuses! they will pay for orders… just plan on a long wait for payment. Sellers be aware."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Hunter",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T02:49:11.000Z",
          "Titre": "It's hard to make the minimum twenty…",
          "Contenu": "It's hard to make the minimum twenty dollars with low prices paid"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan  Marshall",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T20:45:37.000Z",
          "Titre": "You didn't show my package as being…",
          "Contenu": "You didn't show my package as being received. Then I only received a partial payment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marc Zampella",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T10:52:28.000Z",
          "Titre": "Rates are to low",
          "Contenu": "Rates are to low. Shrink wrapped dvds or games should have a higher value"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Katie OConnell",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T04:32:58.000Z",
          "Titre": "I was qouted $22 but only paid $13 with…",
          "Contenu": "I was qouted $22 but only paid $13 with no explanation"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T17:50:14.000Z",
          "Titre": "Good idea, poor end result.",
          "Contenu": "We sent 7 books and over 150 CDs, the CDs played just fine, and the books were like new.  Eaglesaver rejected one whole order and over half of our second order for “condition”.  Of course we aren’t going to go the hassle to have them sent back, we are trying to get rid of them and if we can get a little money for the media all the better.  It is a perfect hustle for Eaglesaver to build their inventory with out paying, as people are trying to get rid of this media, they won’t want it back.  It is unfortunate because of the time it takes to scan all of these items into their app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Carpenter",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T17:23:54.000Z",
          "Titre": "Feels like a bait & switch.",
          "Contenu": "They 'rejected' the 5 DVDs with the highest price quote in my order (along with about a dozen others).  They claim they were in unacceptable condition, but all of the DVDs I sent were clean and played fine.  Their minimums are ridiculous.  Will not use their services again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "steven",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T21:50:30.000Z",
          "Titre": "i am a first time customer and i sent…",
          "Contenu": "i am a first time customer and i sent some items that i had sold to them.it took a couple of days to arrive to them.so they sent me a email saying that my check would be available in 3-4 business days it has now been 7 days and i have not received my check.i have contacted them email and voicemail concerning this matter and have not heard anything from them.based on this i will not do business with them again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 2,
          "Date": "2021-02-04T23:01:41.000Z",
          "Titre": "Musings on the used cd resale market",
          "Contenu": "Hi I know the cd market is a flooded market.I would like to see better and more consistent pricing. I don't really know what you do with themyou keep them or wholesale them out to someone else.Offering 10cents, even if I  calculate the shipping price.. the Cd's worth more than that.Also, I realize you are a business-- one I am not in, so my thoughts are just an opinion and not part of how you do business. Other than a gripe about the market you seem to be fair and honest"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T03:43:33.000Z",
          "Titre": "I’m sure that covid has adversely…",
          "Contenu": "I’m sure that covid has adversely affected your business but I feel your customer service has suffered and you are low balling your customers. I have yet to receive the pitiful “check” you were to send to me. In the past, your company was quite reputable but my opinion has changed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T04:20:22.000Z",
          "Titre": "Not worth the time and effort",
          "Contenu": "You spend the time to get the quote for your order and you follow the requirements only to hear that they are taking half the items you sent. You also request to get the unsold item back and I've yet to see them. There are other apps that take all items they quote you for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 9,
          "Date": "2019-04-13T16:26:30.000Z",
          "Titre": "Challenge entering ISBN or bar code numbers",
          "Contenu": "Every time I entered a ISBN or bar code number for a buy back quote, the system did not recognize the number.  I had to enter the number on another site, cut and paste - the very same number - back into the EagleSaver search window before it was accepted.No matter how many times I manually entered the numbers they were rejected.  The only thing that worked was the cut and paste."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Betty",
          "Nb_Reviews": 3,
          "Date": "2021-09-20T21:16:45.000Z",
          "Titre": "Never again!!",
          "Contenu": "After inputing the UPC#'s, it showed me what I was to receive from Eaglesaver.com-a total of $39.12. What I received - $21.85, was $17.27 LESS than that! I scrutinized the Cd's that were returned to me, and I see NO REASON for this! I was supposed to receive $7.71 for one CD that got returned. In my opinion, it was close to \"New\", and maybe if they took off some of the money I was to receive, I could see it. But to GET NOTHING for it was totally awful !! I would not waste my precious time in the future dealing with Eaglesaver- what I expected and what I got were two different things!! Thanks but No thanks......"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gloria",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T11:56:05.000Z",
          "Titre": "Poor service",
          "Contenu": "Sent in dvds and it took a week before they looked at them. Then was told 2 of them were missing. I packed all in a box per packing slip so they lost 2 that were worth the most. Said they would inventory but have heard nothing. Will be selling my dvds elsewhere from now on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T23:07:55.000Z",
          "Titre": "Not happy seller",
          "Contenu": "I know 99 % of my items were with no scratches and a bunch were brand new yet a big lot of them you stated were ruff condition I am still waiting for the return of these items as requested . I don't have these issues with another site I sell to I tried you a second time as you do take more titles and your pricing is about the same . but that being said if I an going to get a bunch back ?  then its no better for me the seller and now I am waiting to see if they even come back ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Claudia",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T17:40:58.000Z",
          "Titre": "Very disappointed that they don't find…",
          "Contenu": "Very disappointed that they don't find all cd's in the shipment. They have insurance through Fed Ex. So technically they should reimburse for the stated amount. But I'm dealing with a lot so good luck with them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2018-09-01T11:19:23.000Z",
          "Titre": "You sent back items to me that you…",
          "Contenu": "You sent back items to me that you seemed were not “authentic “. I ABSOLUTELY know they were legitimate copies and not fakes. Your authentication process is obviously non existent!Will never do business here again based on that fact!Disappointed for sure-A shame-"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deena",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T18:49:07.000Z",
          "Titre": "It's alright if you want quick cash",
          "Contenu": "It's alright if you want quick cash, and don't care about your items.  I sent my items in, got about $20 less than quoted for them not accepting 5 items (which averaged .33).  They claim they would mail my unaccepted items back upon request.  I told them I would like them back and they told me that the items would be shipped back within 5 days, and a tracking number would be provided.  It's been longer than 5 days, no tracking number, and no response to multiple e-mails asking for tracking number.  The money for the accepted items was sent pretty quickly.  But, I will not be using this company again.  Other reviews I noticed before using this company had the same issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2019-07-22T19:31:18.000Z",
          "Titre": "Not reliable any more!",
          "Contenu": "Used to be so reliable BUT not now!Don’t expect your pay date to be accurate as they always seem to be many days behind and give excuse after excuse! Service has gone downhill in my recent experience!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T02:20:19.000Z",
          "Titre": "Disappointing experience, and a waste of time",
          "Contenu": "The item I sent was incorrectly deemed to be not authentic, so they refused to purchase it.  At least they paid postage, but it was still a total waste of my time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "gregsbaby",
          "Nb_Reviews": 2,
          "Date": "2022-07-03T03:38:18.000Z",
          "Titre": "Quote was great..",
          "Contenu": "Actual quote no so great. I was quoted $65 and sent $40?? I do appreciate it but no thanks to do business again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T05:06:50.000Z",
          "Titre": "Low prices per payout",
          "Contenu": "I found the service relatively easy to use, aside from restrictions on maintaining a minimum average price per item in the cart. The prices paid out per item were very low."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Agate",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T14:30:00.000Z",
          "Titre": "Not worth the time",
          "Contenu": "I guess some of my items were bad but all that work for $10 which was originally $40.  I should just donated my stuff to someone."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "XxxxxZzzzzzz",
          "Nb_Reviews": 1,
          "Date": "2017-01-22T23:14:46.000Z",
          "Titre": "Disappointd",
          "Contenu": "dads that were full set were returned saying a disk s missing when all disks where there. No idea what people don't pay close attention.  Sold to the competition."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 10,
          "Date": "2022-03-13T15:49:53.000Z",
          "Titre": "First -rate -- until now",
          "Contenu": "UPDATE: After several inquiries, they made good on this and included the price of the \"missing\" item in a future shipment. So kudos to them for responding and making it right. I recently gave Eaglesaver a 5-star review because I'd never had any serious problems with them during a long period as a regular customer and veteran of well over 100 shipments. However, on my latest smaller shipment than usual, they contend that one DVD was missing. No, it was not. I distinctly remember packing this brand new and sealed DVD set. If it went missing, it's due either to incompetence or a less than honest employee who simply filched it. It also happened to be the most expensive item. Anyway, payment was issued after subtracting this DVD. As they know, I've been totally honest with them during a long period as a very satisfied customer. So this is disconcerting, and efforts to communicate with them so far has gone unanswered. I would have expected better and am very disappointed at being used in this way by what otherwise has been a topflight company. A shame. Sincerely, Ed Bark"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marina Rabin",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T16:39:15.871Z",
          "Titre": "I was paid substantially less than…",
          "Contenu": "I was paid substantially less than promised. No explanation was given as to why the payment was much lower."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle Cutter",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T00:34:27.000Z",
          "Titre": "Only got 1/3 of what I was quoted for"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicole Decker",
          "Nb_Reviews": 2,
          "Date": "2014-03-03T21:22:59.000Z",
          "Titre": "I will never sell to them again.",
          "Contenu": "While their prices were higher than other sites I will never sell anything to them again.  They said I didn't send a couple of my CDs (and they were the higher priced ones). I did send them! I asked for the unaccepted ones back. It's been about a month and I have yet to see my CDs back.\rOk let me update my review since they e-mailed me asking to modify my negative review.\rThey did credit me for the CDs \"I did not send\" in the end. Overall my advise is to keep up with the orders you submit. I feel like they didn't fully go through my order to see that I sent all the CDs. They sure weren't at my house! I do not believe they missed my CDs on purpose and they corrected the issue. However I had to take the time to figure out why my quote was lower and it should have been gone through correctly the first time. I'm 100% satisfied with the customer service but due to them not going through my order to see I sent all the CDs will never sell to them again. I got my full quote but I had a bad experience overall."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2018-06-24T22:23:47.000Z",
          "Titre": "It takes a LONG time to get a quote for…",
          "Contenu": "It takes a LONG time to get a quote for each book...way too much time to make it worth it...get's frustrating"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MICHAL E WHEELER",
          "Nb_Reviews": 2,
          "Date": "2019-01-06T23:30:07.000Z",
          "Titre": "Brand new wrapped dvds were sent and…",
          "Contenu": "Brand new wrapped dvds were sent and Eagle rated them unacceptable, keeping them by their dysfunctional site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Case",
          "Nb_Reviews": 4,
          "Date": "2020-08-07T12:24:16.000Z",
          "Titre": "Poor experience",
          "Contenu": "Payment still not received more than a week after I was notified of approval"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "larry",
          "Nb_Reviews": 1,
          "Date": "2016-08-12T13:47:06.621Z",
          "Titre": "1.00 average per sale",
          "Contenu": "most dvd prices seem to  be less then i.00 hard to sell due to this limit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T04:26:30.000Z",
          "Titre": "Didn't receive all money for items and…",
          "Contenu": "Didn't receive all money for items and no response back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gia",
          "Nb_Reviews": 6,
          "Date": "2022-02-26T12:41:52.000Z",
          "Titre": "The fact that you have no way of…",
          "Contenu": "The fact that you have no way of assisting in getting the DVD's or CD's UPC codes that are LISTED on the items to be read is ridiculous or that you privide a phone number that no one picks up... this has been your consistent poor service prior to the pandemic so don't use that as an excuse. elow is the email trail of your horrible service . The instructions that you provide  Well .. respond to my reply ... you're the supposed experts .... why don't the 12 didgit codes work and for the other what would I leave out ???Respond please,On 02/21/2022 12:01 PM Regina Masciantonio wrote:These are the codes on the disks ... the first 2 have a 12 digit code . Your instructions indicate that I sho't tuld include preceding numbers and ending numbers that left the last 4 with more than 12... your instructions are flawed ... I wouldn’t have any idea what to leave out for UPC codes to make them validSent from my iPhoneOn Feb 21, 2022, at 10:00 AM, EagleSaver.com  wrote:Hello,The codes must be 12 digit UPC codes.The codes you have provided are not 12 digits.Unfortunately, we cannot purchase items that do not have a 12 digit UPC code.Sincerely,EagleSaver.com Customer ServicFrom: REGINA MASCIANTONIO [mailto:Sent: Sunday, February 20, 2022 9:07 AMTo: Subject: UPC code that DO NOT WORKImportance: High0208314234267 - Time pieces The Best of Eric Clapton 233627070000-  Kenny Greatest Hits - not working 00400027009046 - Elton John -One Night Only0208314333242 - Tina Turner Simply the Best 07464356472 - The Best of Earth Wind and Fire 1058663145224592 - Barry White all Time Greatest HitsI expect an answer ASAP, I have tried in the past to call you and you never answer the phone. My cart is almost ready, and must be done by 02.25.22.Thank-you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pope Skip",
          "Nb_Reviews": 4,
          "Date": "2019-12-20T17:58:07.000Z",
          "Titre": "Way too many rejected DVDs",
          "Contenu": "Way too many rejected DVDs, when ALL were purchased via Amazon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Drury",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T09:07:28.000Z",
          "Titre": "Very slow",
          "Contenu": "Very slow and that's about it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PBS Series Fan",
          "Nb_Reviews": 2,
          "Date": "2019-03-19T01:57:39.000Z",
          "Titre": "Please send me my dvds that you…",
          "Contenu": "Please send me my dvds that you rejected,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T01:14:37.000Z",
          "Titre": "Lack of communication/ difficult to get error corrected",
          "Contenu": "Final Update-After getting my second response from the BBB 10 days ago, Eagle Saver did finally send me payment via paypal today.Update- The company never emailed or called me back. So, I had to file a BBB complaint. Their response ignored the error that they had originally promised to look into, and just said that they could not accept without the book. They really did not answer my complaint or question. It has been a week since I responded to the company's response. I wish the company would have just communicate with me either way in the beginning, because by them ignoring me I am out my blu ray set and the quoted price. Original review-This is the second time that I used them. The first time went smoothly, but beware when they make an error it feels like they are not going to correct. They e-mailed me late last  Wednesday that they couldn't accept my Blu-Ray for Cinderella, since the book from the set was missing. I e-mailed them back right away that this was an error, because the book is attached and actually a part of the Blu-Ray case. I think that the person checking them must have not noticed since the pages were crisp and new (I never used the book part).I received an e-mailed Thursday morning from them, saying that they would look into it and get back to me shortly. After waiting to hear something all day Friday, I e-mailed again to see how correcting the error was going. By midday Monday, I tried calling since still not hearing from them after Thurday morning. I left a voicemail, since there is no way to get a hold of a person on the phone.I am worried that they will give away the Blu-Ray away before they get around to looking into it. I don't really want them to just send the Blu-Ray set back, since I cannot be sure it will come back in the same condition that I sent it, since the case is cardboard. I made sure to package it special.If there is an error on their part, you do not get your quoted price the next day as advertised. I am still waiting to see if you get it back at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Taco Mike",
          "Nb_Reviews": 1,
          "Date": "2016-12-13T13:51:14.000Z",
          "Titre": "Wouldn't use again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T10:38:52.000Z",
          "Titre": "took 13 dollars off the offer ripoff!",
          "Contenu": "poor service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 7,
          "Date": "2023-12-21T10:23:42.000Z",
          "Titre": "Slow process to scam",
          "Contenu": "End result OK  Scanning in titles with your app is a real pain.   Have your tech guys look at how Decluttr scan in works.  Much easier and FASTER!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cate",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:12:08.000Z",
          "Titre": "For the most part the company is great…",
          "Contenu": "For the most part the company is great to use, however, for the past eight months when you scan a game code into their system a fancy blue wheel appears and it cannot process the items. These are not second rate games either, they are standard barcodes from the manufacturer. I know it is not my system because I use a price comparing website which has no issue recognizing the barcodes, and pulling up a price offering from a number of companies, including Eaglesaver. However, the Eaglesaver site does not register the barcodes on games when scanned into their system. I have reported this to Eaglesaver using their contact information, more than once, and have yet to receive an answer, and the site still responds as if it does not recognize the barcodes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Schmelter",
          "Nb_Reviews": 5,
          "Date": "2023-04-05T16:25:19.000Z",
          "Titre": "Some issues to address.",
          "Contenu": "Your scanner is not as good as Declutter or booksrun. Long wait time,  sometimes just does nothing, is,,no results. Also, keyboard does not include x. Another thing is several finger presses are needed....more then other sites.  Please address these issues for customer convenience.🌅👍☮️"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T15:41:32.000Z",
          "Titre": "I've been using Eagle Saver for almost…",
          "Contenu": "I've been using Eagle Saver for almost 1.5 yrs.  It seems like the conditional requirements keep changing, even though the written requirements are not any different.  Overall this is an ok way to get rid of excess media."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria Wright",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T18:58:10.000Z",
          "Titre": "They are good",
          "Contenu": "They are good. Don't give as much for any movie as expected. And said that couldn't remit payment for like 10 movies saying they were heavy scratched but I checked every single movie before sending and non were in that condition. But got payment super fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leland Bair",
          "Nb_Reviews": 5,
          "Date": "2023-01-21T20:19:44.000Z",
          "Titre": "Not as expected.",
          "Contenu": "They sent back 4 discs saying that they were scratched, but when I viewed they were almost perfect.  They also returned a series saying that it wasn't authentic.  I bought it from Amazon and it came properly wrapped and was in perfect shape.  I will sell these to another company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T05:02:00.000Z",
          "Titre": "I’d give them 3.5 stars if I could",
          "Contenu": "I’d give them 3.5 stars if I could. I appreciate the fact that they send back unwanted items. I have, however, received items back with the reason listed as “heavy damage”, yet upon inspection they are pretty much flawless. Communication is lacking. Don’t bother calling, even though the website says to call regarding questions, you’ll never get an answer or response. Time for turn over from sending, delivery and payment is good.  The 1st 2 times I sent items they accepted them all. The following 2 times they sent 1/2 of them back. The quality of items didn’t change, therefore I’m not sure the reason for the refusal. Their scanner is basically useless, and you’ll need to spend a lot of time punching in all of the numbers. Many of their upc codes are wrong, and when you contact them or send in the correct upc code, they disregard the information, even though the website tells you to contact them if the upc is coming up wrong?!? Not sure why the quality of the scanner is to poor. I utilize other sell back apps and they have awesome scanners. Overall, not a bad site, and to reiterate… I do appreciate the company sending the items back. I have disregarded other sites due to the lack of this service. Not a perfect system, but not horrible either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew R Snouffer",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T05:49:55.000Z",
          "Titre": "Some items of DVDs doesn't match with…",
          "Contenu": "Some items of DVDs doesn't match with the CPU ID number and comes it with a different item.  Also if DVDs were accepted on the logging, it should be accepted after being logging in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "david",
          "Nb_Reviews": 3,
          "Date": "2022-09-08T04:15:04.000Z",
          "Titre": "next time i think i just might just donate them to the library",
          "Contenu": "my order i sent took 9 days not 24 hours and they were some new and others just used once. should have been processsed faster no matter what. this is the second time at least i sent brand new unopen dvds and wasnt given even a penny more thana used one,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kacey",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T15:23:42.000Z",
          "Titre": "Update to my previous review…",
          "Contenu": "This is an update to my previous review when I could not get an update to my order that was delivered after emailing and calling. My order sat for 6 days after delivery. I tried to email requesting an update twice and I called and left 2 voicemails because no one was ever available to take a call. I was afraid that I was going to get ripped off of 72 brand new DVDs. I finally left a 1 star review on Monday 2/13 and low and behold the next day I get an email that my order has arrived and is being processed. I feel you need to update your website from stating that your order will be processed when delivered and payment within the next 24 hours because that is not my experience. My order sat there since 2/8 with FedEx delivery proof and didn't get processed until 2/14. There was no contact from customer service. As stated above no replies to my numerous emails or phone call inquires. With so many scams out there just be transparent with your process. EagleSaver did accept more DVDs than DeCluttr and at better pricing and the process was very easy. The reason for the 3 stars is for the lack of customer service and the stress I felt for thinking I was being scammed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T01:58:38.000Z",
          "Titre": "Great company but the app missed the mark",
          "Contenu": "The company did purchase all of the movies that they said they would, and for the amount of money that they said they would.  I received the check in a timely manner.  My biggest issue is with the app!  It takes too long for the scanner to scan the UPC, then it takes too long for it to find the movie and list the purchase price.  There were a lot of UPC codes that I had to type in because the scanner couldn't read them (but a competitor's app read them just fine).  Sometimes the app couldn't find the movie based on the UPC.  And worst yet, I went through and scanned around 100 items.  When I hit continue they ALL DISAPPEARED!  I had to re-scan...!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DANIEL WHITEs",
          "Nb_Reviews": 3,
          "Date": "2023-07-29T04:48:37.000Z",
          "Titre": "I didn't like that I keep",
          "Contenu": "I didn't like that I keep. I had to keep calling and leaving voice messages. And nobody called me back. I didn't like to pack that. They said they were open from 8:08 AM to 5 PM Pacific. I called 2 or 3 times or more. I still there was nobody available. I got voice message after voice message, I left message. I'll be there in 5 minui. Said you have to message nobody called me back.  I almost had to open a FedEx case case. I do like to pack that they did pay for the people of customer service. I will pray for customer service. I will pray for Thair message system. Thank you and God bless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T13:38:35.000Z",
          "Titre": "I really don't like that prices change…",
          "Contenu": "I really don't like that prices change from when you send it in and they receive it. You should honor what you quoted. Also several blu-rays were \"missing a disc\", yet I checked every one of them before I shipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JohnF405244",
          "Nb_Reviews": 6,
          "Date": "2022-08-24T22:51:09.000Z",
          "Titre": "Over two weeks after shipping the box…",
          "Contenu": "Over two weeks after shipping the box and no contact. Didn't know what happened until I e-mailed. You should have at least contacted me first to explain the delay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jan W",
          "Nb_Reviews": 3,
          "Date": "2023-08-12T09:23:01.000Z",
          "Titre": "The process was easy enough but what…",
          "Contenu": "The process was easy enough but what you offer in purchasing is VERY minimal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T03:15:55.000Z",
          "Titre": "haven't received an answer to my question",
          "Contenu": "I emailed to find out where my payment was since I had sent it out late.  I haven't heard back and have confirmed that the return dvds did arrive and were signed for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kacey",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T17:41:06.000Z",
          "Titre": "User Beware",
          "Contenu": "This was my first time using this kind of service. They have very good reviews and I had a bunch of brand new DVDs that I didn't know what to do with until I found this site. I spent 2 hours keying the 100+ DVDs I had into their system to get a quote and EagleSaver ended up wanting 72 of them. Yay, so I thought. The process was super simple up until my package was delivered to them. Package was delivered on Wednesday 2/8/23 and the website says that you will be paid the next day well here we are 5 days after my package was delivered and my account says still waiting on shipment. I sent an email to them on Friday 2/11 to check on an update and sent them the FedEx delivery confirmation as well, did not hear back. I tried to call them later Friday evening but their hours are 8-5 Pacific time which is strange because the package was delivered to Florida. So needless to say the I did not hear back. Here we are Monday evening and 2 emails later no response and no update to my account. I also called, no one available to take my call leave a message, I did. Here we are at 6 PM on Monday and still have not heard from them. I called them again and pushed 2 instead of 1 hoping to get someone on the phone and again no one available to take my call, leave a message. Now I will be hitting 6 days past my package was delivered to them, 2 emails and 2 phone messages and I still have no update. I am out 72 brand new DVDs and no funds as promised on their site. Just beware. I know some reviews are good and some are not this has just been my experience with them. If they contact me or fulfill their end of the deal I will update but as of right now I don't have much faith in that considering the website says you will be paid the day after delivery and here we are 5 days later and I cannot even get someone to email or talk to me.2/15/23 Edit - My order was processed on 2/14 and I did leave another review. Like I said in that review. With all the scams going on nowadays just be transparent or have someone in customer service available to answer customers concerns. Had I been notified that they were behind schedule the process would have not have been stressful at all. It was really easy to navigate their site and print labels and their prices beat DeCluttr and they also took more DVDs than them too. I will be using EagleSaver again. and recommending should someone need this kind of service. Updating from 1 star to 3 just due to the lack of customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon  Crittenden",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T08:52:17.000Z",
          "Titre": "A little slow on responding but finally…",
          "Contenu": "A little slow on responding but finally did a few days after.... All in all you paid me..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jasmine  Aliara",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T16:01:45.982Z",
          "Titre": "A decent solution to my clutter problem.",
          "Contenu": "I have used this company a few times to sell unwanted clutter. It was difficult to effectively communicate with them about my most recent shipment of DVDs - I had to contact them multiple times about it, their responses to my issue were short and a bit vague, and they don't really answer their phone. I would probably do business with them again, however. I would say I'm satisfied, but they could definitely do better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexis",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T16:14:53.000Z",
          "Titre": "I was very skeptical of this website…",
          "Contenu": "I was very skeptical of this website and while the transaction OVERALL was okay, it was filled with multiple delays, days and days of silence, unreturned emails and phone calls, and capped off with a claim that they didn't receive one of the items that I know was in the box.  While I did get paid part of what they offered, it was a massive hassle and I would not do it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2021-09-22T03:08:32.000Z",
          "Titre": "OK - good if you're just looking to declutter",
          "Contenu": "Service for the most part was good.  Was disappointed with the ridiculously low prices offered for some DVD sets that I was offering, but my main goal was decluttering so I still went ahead.  Did not expect to get a note that some of these were deemed \"too used\" and I could have them sent back or they would just give them to charity.  Seemed pretty petty since the 8 sets (of the 30-40 I sent) amount to about $3 total."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-08-17T04:57:11.000Z",
          "Titre": "Only paid half",
          "Contenu": "I did t. Like it showed.the full price.and still didn't get half"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 2,
          "Date": "2021-07-20T08:56:34.000Z",
          "Titre": "Cheap.",
          "Contenu": "They reject too many titles. They only respond by email so when they don't respond you wonder when they're going to. They are cheap and don't pay what what the dvds, cds and games are worth. Out of hundreds of books hardback and paperback, I have never successfully sold EagleSaver a book of any kind. I think they're lying when they say they buy books because it is impossible to sell books to them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T13:42:32.000Z",
          "Titre": "Frustrating but they paid what they promised",
          "Contenu": "They paid what they promised. I almost didn't send anything in because of the 20 dollar minimum. Its pretty hard to get to $20 when you offer 35 cents or less for most things. For 35 cents I might as well just keep the games. I really only wanted to sell one game but had to sell several to get to the 20 dollar minimum.  I found the experience frustrating and slightly insulting"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 3,
          "Date": "2021-01-29T23:09:24.000Z",
          "Titre": "Web site was easy to use and process…",
          "Contenu": "Web site was easy to use and process was just as stated.  My only disappointment was that I had some movies that did not have a UPC on them so I looked them up on the internet and got a UPC but Eaglesaver wouldn't take them.  Not really sure why.  Other than that it worked great and I had a check and my returned DVDS in under 2 weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Augie Holtkort",
          "Nb_Reviews": 5,
          "Date": "2022-02-15T05:00:27.000Z",
          "Titre": "My order had been received several days…",
          "Contenu": "My order had been received several days before I sent in an email about the status of my order.  Upon receiving my emails, the wheels began to turn and I did get $ sent via PayPal for my CDs.  Sometimes it pays to be a squeaky wheel."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 7,
          "Date": "2020-08-24T17:45:18.000Z",
          "Titre": "Horrible communication",
          "Contenu": "Horrible communication! No notifications of any kind were sent at any point except in response to emails I sent asking what was taking so long. They had my package for 3 days but it was still showing as \"awaiting delivery\", so I emailed to find out what the delay was. Then I had to ask twice when my rejected item was going to be returned - that took a month! Entire transaction from start to finish took 6 weeks - definitely not what it says on their website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 3,
          "Date": "2020-08-12T08:37:28.000Z",
          "Titre": "Didn’t return all of my “rejected”…",
          "Contenu": "Didn’t send all the rejected DVDs back at first but they found them and sent them.Update. It’s 20 days later and I’ve yet to receive my DVDs back. The tracking number states that they were brought to the post office and they’ve been sitting there for 20 days waiting to be accepted by the USPS. Doesn’t make any sense at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachael",
          "Nb_Reviews": 1,
          "Date": "2019-11-22T16:45:44.000Z",
          "Titre": "I did not read through all the…",
          "Contenu": "I did not read through all the instructions before creating my quote.  And I do understand that some of the items would not be accepted.  The reasoning for the items that were rejected was excess wear.  80% of the items returned do not fit that description.  I am glad that I was able to sell most of my items.  But I would not recommend or use the service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PhxKat",
          "Nb_Reviews": 3,
          "Date": "2021-07-27T22:24:43.000Z",
          "Titre": "As long as you can wait for a check to mail",
          "Contenu": "Have used several times. Once they receive your box they'll  issue a check quickly -but then you wait on USPS for payment check (your ONLY CHOICE). Their claim of an option to have direct PayPal payment is false. They claim to offer Paypal direct payment YET NEVER accept your Paypal email address (my PP account has been in use for well over a decade, no excuses) so I am forced to wait for the check and hope the USPS doesn't lose it.*After their automated reply*THEIR website will not allow you to imput your Paypal email, there is no issue with Paypal's website"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T04:19:30.000Z",
          "Titre": "Straightforward process with some caveats",
          "Contenu": "Process was straightforward. Only about 30% of my DVDs were accepted, which is understandable because not all DVDs are in demand. Keep in mind you have to hit a certain minimum amount for the order to be accepted; I forgot the amount but the average buy back price of the DVD had to hit a certain amount, otherwise you have to remove the lowest cost DVDs to hit this number. This was not communicated beforehand. I got my money shortly after the DVDs were accepted. The phone app is a bit clumsy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tamara",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T12:41:14.000Z",
          "Titre": "Overall I appreciate the service you…",
          "Contenu": "Overall I appreciate the service you offer.  On a negative note, I get tired of having perfectly acceptable wear/tear rejected once the items are received.  I assume you use that canned answer for anything you just decide you don't want after receiving the shipment.  I know I have sent items that have never been used more than one time and were kept in their cases rejected for excessive use/scratches.  When I ship off my items I have an expectation that they are in good shape, cases are not broken and the money I've been quoted will be paid.  This doesn't happen and is frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 2,
          "Date": "2019-05-08T01:10:37.000Z",
          "Titre": "They have a very limited library...",
          "Contenu": "They have a very limited library of items they take compared to competitors. On the plus side they have an app and the ease of a scanner. Prices are comparable to other sites as well and they cover shipping costs. They process items quickly and accepted items without incident. Payment was made promptly. Not my first choice just based on the limitations, but trustworthy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "charles",
          "Nb_Reviews": 1,
          "Date": "2019-07-13T02:44:32.000Z",
          "Titre": "Returning DVD's",
          "Contenu": "Told us that they did not want some 10 dvd's on June 16th and asked us if we wanted them back or donated.  We requested them to be returned to us the next day well within the 5 day period for responding. Nothing happened for 2 weeks or more and we had to inquire as to where the dvd's were.  They apologized, found the dvd's and returned them to us July 12th.Mix up somewhere but ended well.  We will still do business with them in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 2,
          "Date": "2020-05-23T13:16:04.000Z",
          "Titre": "I'd rather do business somewhere else.",
          "Contenu": "It's really a crapshoot as to what they will take. Sometimes they reject near mint books and I can't figure it out. I'd be more upset about it, but they do return the rejected materials for free so there's that. EagleSaver is definitely not my first choice when selling old books and media."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2018-01-19T18:08:49.000Z",
          "Titre": "They have for the most part been good …",
          "Contenu": "They have for the most part been good although they provided a quote for a movie then when they received it did not honor their quoted price saying the dvd was not one they would take even though they had quoted a price in their system. The dvd was a new release with a quote of over $5. Just wondering if they didn't want to pay out the quoted price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 1,
          "Date": "2016-07-09T14:12:09.000Z",
          "Titre": "EagleSaver to the Recue",
          "Contenu": "I just wanted to comment how easy it is to use and profit from EagleSaver but my only issue was and still is a still unsolved password problem.  Every-time I attempt a login I am prompted my password is incorrect but it isn't.  I have reset my password numerous times with no remedy and have contacted customer service but the issue is still not fixed.  Other than the password issue I would give EagleSaver 5 stars..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MAXX",
          "Nb_Reviews": 1,
          "Date": "2016-08-03T20:43:45.000Z",
          "Titre": "Poor buyback policies.",
          "Contenu": "I had over 150 DVDs to sell but couldn't sell them because EagleSaver requires the average price to be a dollar. Which is idiotic since they are only able to offer a few at the required price. I was only able to sell them a few when they could have gotten over 150. That is bad to not be able to make it easy for your customers to sell back anything to them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BM",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T03:20:10.000Z",
          "Titre": "Was paid for what I spent but they…",
          "Contenu": "Was paid for what I sent in but they weren’t clear about wanting a minimum of $1 per item on average until I tried to submit and that made it a frustrating experience as I had to part with some items I wasn’t ready to yet. I couldn’t sell a lot of the items I wanted to because they were below 50 cents and I had over 100 additional items I wanted to sell that they could accept that other places won’t but couldn’t without dragging the value down. Giving 3 stars for being paid what I was promised but wouldn’t recommend if you are looking to offload media."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 8,
          "Date": "2019-04-13T21:24:35.000Z",
          "Titre": "Changing Trade-in Criteria",
          "Contenu": "Order was processed rapidly and check emitted. However, 4 of submitted products were rejected using puzzling criteria -- a problem of \"subject content\" in spite of the product being accepted at input. Telephone contact was made for clarifications, a message was left, but no follow-up occurred."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 5,
          "Date": "2016-07-13T16:29:21.000Z",
          "Titre": "Hit and miss",
          "Contenu": "Only had one issue with a dvd I bought off Amazon. I was told it wouldn't be bought because the discs were copies. Considering I bought it new off Amazon directly, the discs certainly weren't burned discs. The employees don't always do a good job and know what they're doing. Sold it no problem to a similar site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2020-06-06T15:07:16.000Z",
          "Titre": "Simple process, low payout",
          "Contenu": "Very easy to work with, shipping and payment process was simple, and EagleSaver bought CDs that others would not, but still the payout is very low.  Still, I was able to clean out my old CDs and got slightly more back on them than I would donating them all to Goodwill."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 2,
          "Date": "2020-06-26T18:02:41.000Z",
          "Titre": "Not up to their previous standards ...",
          "Contenu": "I understand that COVID-19 has made it more difficult to do business. Nonetheless, I must say that I'm truly disappointed in my recent experiences with EagleSaver. They have not lived up to their commitment to pay \"within1 business day of receipt.\" Further, all calls regarding existing orders go immediately to VM, and they have not lived up to their commitment to respond to email/VM queries \"within 24 business hours.\" Payment has been very slow, and I'm still waiting for them to acknowledge receipt of my most recent shipment, which was delivered Tuesday."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T00:19:58.000Z",
          "Titre": "Stole CDs from me",
          "Contenu": "Process was easy, prices were better than other sites. Only complaint is that several CDs that I know were in the box were listed as missing, including one you committed to paying $37 for. So it feels like you  just stole this multi-cd package from me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2014-05-29T22:39:15.000Z",
          "Titre": "It was an \"okay\" experience",
          "Contenu": "Well I was happy to find a place that would purchase my books but I was very dissapointed in the amounts that are offered for them. And I have a whole closet of books to sell but Eaglesaver only bought a quarter of what i wanted to sell. So i still have a bunch of books im stuck with. I will not be using Eaglesaver again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marion",
          "Nb_Reviews": 1,
          "Date": "2014-07-24T19:52:39.000Z",
          "Titre": "The jury is still out!",
          "Contenu": "The first time I used EagleSaver it was good.  Second time I had questions because of rejections on the most expensive of the DVD's.  I had Series 1,2,3 which I purchased from different amazon sellers all 3 were rejected for different reasons by EagleSaver.  Which I found strange I lost almost $20 from that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 3,
          "Date": "2020-07-07T21:26:47.000Z",
          "Titre": "I wished you all would offer more for…",
          "Contenu": "I wished you all would offer more for all the movies, especially ones that aren't even opened. I think for someone to pay $19.95 per movie and only receive $.12 is a little ridiculous and your company will turn around and sell it for $10.99 or $19.95."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T16:41:28.000Z",
          "Titre": "No Follow Trough",
          "Contenu": "Eaglesaver decided that the most expensive book I delivered to them was not in good condition.  Moisture stains?  No.  This book was the best of the lot.  As per their policies, I asked that the book be returned to me.  They have failed to do so, and that makes their motives suspect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "XX",
          "Nb_Reviews": 1,
          "Date": "2015-08-19T02:23:44.000Z",
          "Titre": "Too Good to be True?",
          "Contenu": "Up until the point of receiving a check for the items sent in, all was well. No complaints whatsoever- Quick, effortless, and convenient! However, the amount of the check received was a third of what the projected amount was to be. A third of the amount I was shown when I input the items I was going to send in. I understand the concept of estimates, but I feel that the customer should receive a slip explaining what was purchased and for what amount. Perhaps even an e-mail explaining the conditions that weren't met or whatnot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2019-06-03T15:27:25.000Z",
          "Titre": "I would give 5 stars",
          "Contenu": "I would give 5 stars, but one on one communication with them seems to be missing. It seems like any time you call in with a question you get there machine. The machine says all calls will be answered within 24 hours- not true, please don't shoot the messenger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2020-11-14T01:38:51.000Z",
          "Titre": "No communication whatsoever",
          "Contenu": "No communication whatsoever. Had to email them 3 days after they received my shipment to find out what was going on and never received a reply. \"Surprisingly\" the order was completed not longer after I sent the email. Seem to make up their own rules when it comes to items. Told me one item was essentially pirated when it was purchased at our local Target and the UPC matches to it perfectly. It is what it is. Lack of communication will keep me from using their service again. I will say getting paid was very quick and easy just would have like someone to answer me..seems like a lot of reviews talk about their lack of transparency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 4,
          "Date": "2021-12-24T14:21:42.000Z",
          "Titre": "It was not worth it",
          "Contenu": "It was not worth it. I entered approximately 150 CDs and they ended up buying only about 50 of them for a total of $20. The only positive was the free shipping and fast payment to PayPal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William S.",
          "Nb_Reviews": 1,
          "Date": "2019-07-27T15:16:55.000Z",
          "Titre": "Good for DVDs.  Squat for books.",
          "Contenu": "Pretty pleased with the acceptance rate of DVDs, quotes offered, free shipping and the quick turnaround in pay.  Not impressed with the acceptance rate for books.  I have entered at least 100 book ISBNs and only received a quote for one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 1,
          "Date": "2017-02-10T03:07:46.000Z",
          "Titre": "Intuitive process. Prompt response. Questionable minimum requirements.",
          "Contenu": "Their website (though dated looking) worked quite well, and they offered many items that other websites would not accept. The process (including shipping) was easy and intuitive, and the assessment and payment of the order was extremely prompt.Really the only complaint -- and it is kinda substantial, imo-- was the minimum requirements for the order:  \"The order value of items actually shipped must be $20.00 or greater and the minimum average value per an item shipped must be $1.00 or greater.\"Most websites require something like $10 minimum at $0.75 per item, which seems much more reasonable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2017-03-16T15:01:04.000Z",
          "Titre": "OK but wont used again",
          "Contenu": "They did not accept all the DVDs ,Said I had to request them back in five days or they would DONATE TO CHERITY ,I requested them back by e-mail have not heard any thing back . BUT THAT SAID they sent the check on the ones they accepted very fast , SO Make sure you check your DVDs and CDs and make sure there in PERFICT shape, They may look good to you but they want them perfect. In Response to your reply I did contact you at the e-mail address you said to and put order number and said ship items back you did not accept , I feel that if you don't accept something you should just ship back . I am not questioning the Companies HONESTY Just saying wont use again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 1,
          "Date": "2018-08-22T05:54:01.000Z",
          "Titre": "Only accepted half my order",
          "Contenu": "Only accepted half my order based off the reason they weren't accepting that item. Why give me a quote for it? Also its taking forever to get my items returned. My first experience could have been much better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 7,
          "Date": "2019-07-16T14:35:03.000Z",
          "Titre": "I like EagleSaver.com",
          "Contenu": "I like EagleSaver.com. They are honest and process your order quickly.I don't like that they keep changing the average amount of the items submitted. It was .50, .75 and now it is a dollar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2014-03-15T05:55:20.000Z",
          "Titre": "Overall OK",
          "Contenu": "My experience overall was sufficient. However I found another site that offered more money for the dvd's. Eaglesaver was reasonable. Nevertheless, their prices I don't believe were fair compared to another site I went to. One thing that was extremely positive was the fact they paid for shipping and allowed you to print out a fedex shipping label. Another problem I had was the fact that the site I sold most of my DVD's to had bulk pricing which made the transaction go easier. Where Eaglesaver does not offer Bulk and I had to individually place each upc number in and press enter. To make the shopping experience better I suggest offering a little more for DVD's and offer Bulk pricing like most of your competitors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 3,
          "Date": "2016-12-06T14:02:09.000Z",
          "Titre": "Quick response but a lot of requirements",
          "Contenu": "I had many more DVDs to trade in, but the requirements for more than $20 and an average of $1 per trade-in item meant that I couldn't trade all of them in. That was a little frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Audilee",
          "Nb_Reviews": 1,
          "Date": "2016-01-05T16:16:21.000Z",
          "Titre": "Okay, not sure why items were returned",
          "Contenu": "I received $100 less credit and they returned some of the items for \"disc has heavy surface wear\". I don't understand that as there's no water damage, nor rips/tears."
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "Mia Patel",
          "Nb_Reviews": 8,
          "Date": "2021-12-24T11:25:31.000Z",
          "Titre": "I bought here my phone for college .But…",
          "Contenu": "I bought here my phone for college .But honestly I bought not so cheap and the first breakdown I got in 5 months .  They fixed it so thank u"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T01:17:18.000Z",
          "Titre": "mixed review",
          "Contenu": "i like eaglesaver because they give more money than the other websites...but twice now I've had an order where you claimed items were not in the box. I pack these boxes myself and check off each item as i put it in the box so i know 100% that its there. first time it happened it took me a lot of messaging to finally get credit for the item.your answers to messages are painfully slow and not helpful. it just happened again recently and i just didn't have the energy to go through that again but i lost like $6-$7. I lost my job back in april due to covid and going out and finding these items for you is paying the bills and putting food on the table so i take it very seriously and any loss is felt. also it would be nice if your app worked faster and scanned more like decluttrs app. it can tell what the item type is without having to keep switching between cds and dvd and scans much faster."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Just C. C.",
          "Nb_Reviews": 3,
          "Date": "2020-11-21T04:08:15.000Z",
          "Titre": "I really like Eaglesaver",
          "Contenu": "I really like Eaglesaver.  I was able to get some old CDs off my hand.  I just wish they would accept CDs and DVDs that have a low value like 25cents...etc"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2019-10-26T01:46:31.000Z",
          "Titre": "Disappointed with actual payment…",
          "Contenu": "Disappointed with actual payment amount. Significantly different than what online quoted price indicated. No detailed email on why a lower payment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "scott behrens",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T02:49:24.000Z",
          "Titre": "Perfectly good dvds and covers but was…",
          "Contenu": "Perfectly good dvds and covers but was told they weren't satisfactory.  Should have sold on Facebook market place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2018-05-29T22:40:40.000Z",
          "Titre": "As of today I still have not received…",
          "Contenu": "As of today I still have not received my  $41.22 payment that you said was sent in your May 19th email. Please look into this. This is disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 9,
          "Date": "2022-02-12T15:42:32.000Z",
          "Titre": "More restrictions than others",
          "Contenu": "More restrictions than others.   Prices change way to fast.  $20 order level is getting more difficult.Pay well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Geoffrey",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T21:28:43.000Z",
          "Titre": "EagleSaver is so easy and quick",
          "Contenu": "hello EagleSaver it's almost the end of the year - and i have not received any of the missing checks from you.additionally, i have not received a response from any of my emails to you. we're not discussing (discussing? huh. it's really not much of a discussion, is it?) a substantial amount of money, so this shouldn't be an issue for a company like yours.i'm hoping after much insistence from me, you will respond and resolve this issue.any update, EagleSaver? it's been an additional two months since your post regarding the checks being re-issued, but i still haven't received the checks or any communications.thank you, geoffrey leval============EagleSaver is so easy and quick. Their app couldn't be easier.so far, the biggest problem is getting payment:  out of five packages sent to EagleSaver, i have only received payment for two.  a third is said to be on the way, but i still haven't received it. i'm hoping their responsiveness will get better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T13:20:55.000Z",
          "Titre": "The transaction was swift",
          "Contenu": "The transaction was swift, however when the check came it didn't reflect the inventory shipped.  An explanation would have been nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2019-10-10T02:01:00.000Z",
          "Titre": "The app was slow to use",
          "Contenu": "The app was slow to use. If item was to be deleted you were bumped back to the original page. Annoying when trying to scan quickly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T12:31:42.000Z",
          "Titre": "Not great turnaround",
          "Contenu": "Not great turnaround time, and denied one of my submissions, without telling me why. Good pay for what they did take though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2018-05-26T12:41:50.000Z",
          "Titre": "They said two books were not in the…",
          "Contenu": "They said two books were not in the box, but they were packed with everything else.  I will be sure to take pics if I use them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T05:27:27.000Z",
          "Titre": "Bad customer service but good company",
          "Contenu": "Great company! Horrible customer service. Says they respond in 24 hours but took almost a week to get back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renato",
          "Nb_Reviews": 3,
          "Date": "2019-09-28T19:43:04.000Z",
          "Titre": "The whole process was smooth and easy",
          "Contenu": "The whole process was smooth and easy. But the prices offered for the DVDs were extremely low. Sometimes just a few pennies."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LACY",
          "Nb_Reviews": 2,
          "Date": "2018-07-26T23:21:53.000Z",
          "Titre": "Gave ok prices",
          "Contenu": "Gave ok prices.  But refused the one dvd series I bought brand new at walmart.  Told me it wasn't original?  Um..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew R Snouffer",
          "Nb_Reviews": 4,
          "Date": "2014-08-13T14:36:06.000Z",
          "Titre": "good for selling but not with everything",
          "Contenu": "I use EagleSavers for good reasons.  But sometimes the site would not expect items like novels or other graphic novels."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T22:44:02.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use , prompt payments, but low prices for CD's and very low pricing for DVD's."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amelia",
          "Nb_Reviews": 1,
          "Date": "2017-05-13T15:40:49.000Z",
          "Titre": "Pros & Cons - carefully consider the cons! Otherwise, amazing!",
          "Contenu": "Pros: The money they quote you really gets paid out very fast. Easy shipping. Amazing customer service (they email you back within the business day which I was pleasantly surprised by how fast it was). Not shady! Legit! :) Very happy about that.Cons: There are all these limitations around what you can donate and how much i.e. the .75 average price per item and the $20 minimum. This should be explicitly detailed right there on the front page. I spent an hour manually entering UPCs and ISBNs only to keep getting rejected due to the .75 average price and $20 minimum requirement. When I asked customer service why this is and that it should be placed on the front page, they gave me some excuse why they couldn't do that. But that just felt like BS to me. They said it's on the FAQs page but it's not explicitly stated there. This was my only friction and hence why I rated it 3 stars instead of 5. Also there's the limitation of the quote expiring in 4 days. I was literally a minute after my expiration date and then they no longer accepted a handful of my items! You can imagine how frustrating that was given what I already stated above."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philoctetes",
          "Nb_Reviews": 1,
          "Date": "2017-08-18T20:25:31.000Z",
          "Titre": "Prices are lowing and they take more …",
          "Contenu": "Prices are lower than many of their competetors  and they take more than a week after receipt to pay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "1st time customer",
          "Nb_Reviews": 1,
          "Date": "2014-02-12T04:15:18.000Z",
          "Titre": "No check has been 2weeks!!",
          "Contenu": "My check was sent out jan 30 and it's feb 11..where is my check... Hopefully I get it soon!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Enstinctz",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T15:21:38.000Z",
          "Titre": "Good place to make Money just a lil…",
          "Contenu": "Good place to make Money just a lil slow with processing  and sending you your money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2019-05-29T14:31:36.000Z",
          "Titre": "I sold dvd to EagleSaver",
          "Contenu": "I sold dvd to EagleSaver.  I think that they were worth more than what they paid me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bradley",
          "Nb_Reviews": 1,
          "Date": "2017-07-01T12:39:51.000Z",
          "Titre": "Got less money than promised with no …",
          "Contenu": "Got less money than promised with no explanation.  Besides that they came through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-08-04T14:18:32.000Z",
          "Titre": "Too many items not eligible for…",
          "Contenu": "Too many items not eligible for purchase.  Low purchase prices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T03:24:40.000Z",
          "Titre": "I thought the price out was too cheap…",
          "Contenu": "I thought the price out was too cheap on some of the CDs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew R Snouffer",
          "Nb_Reviews": 4,
          "Date": "2019-08-10T04:38:01.000Z",
          "Titre": "there were few items that the site…",
          "Contenu": "there were few items that the site wouldn't buy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet G",
          "Nb_Reviews": 2,
          "Date": "2022-07-29T04:12:37.000Z",
          "Titre": "The communication was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Kacal",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T05:42:04.000Z",
          "Titre": "Gave less than half that was quoted"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2017-12-28T03:21:36.000Z",
          "Titre": "Got less than I expected from the order …",
          "Contenu": "Got less than I expected from the order I entered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-01-29T14:40:15.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, reliable.  But pay is very low."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T06:36:32.000Z",
          "Titre": "Payment is taking a bit longer then…",
          "Contenu": "Payment is taking a bit longer then expected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steph",
          "Nb_Reviews": 1,
          "Date": "2018-04-16T22:27:40.000Z",
          "Titre": "Frustrating cart changes can't save and collect more to send.",
          "Contenu": "Frustrating cart changes.  Better than most."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T14:49:33.000Z",
          "Titre": "very poor service and slow if no payment"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2019-12-28T06:40:49.000Z",
          "Titre": "Could be a little faster on the payments"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2016-12-08T00:08:16.000Z",
          "Titre": "okay",
          "Contenu": "okay, I received a check for my DVD's."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2019-03-04T14:48:39.000Z",
          "Titre": "Shorted me 10 bucks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 1,
          "Date": "2016-08-30T14:20:00.000Z",
          "Titre": "Textbook sell back",
          "Contenu": "Great experience!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodonna Reynolds",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T18:58:54.000Z",
          "Titre": "I don’t think you are very honest I…",
          "Contenu": "I don’t think you are very honest I asked to have my dvd’s returned that some had never been opened that you decided not to pay me for after offering me money and you claimed to donate why not give them back as I asked"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keenan Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T05:02:16.000Z",
          "Titre": "I am pretty pleased with the experience…",
          "Contenu": "I am pretty pleased with the experience overall. Have several items from the quote returning but that's totally cool. Glad things have gone smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T17:21:25.000Z",
          "Titre": "Second time's a charm",
          "Contenu": "This is my second time using EagleSaver and the experience was perfect. They communicated right away when they received my packages and paid immediately after. They did exactly as they said they would. I neglected to award five stars only because my first experience was not as great (slow or no communication and delays in receiving payment). I am going to assume that EagleSaver has ironed out those earlier issues based on my second experience, which was terrific. I will use their services again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damien Dumouchel",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T06:49:32.000Z",
          "Titre": "The service was easy to use",
          "Contenu": "The service was easy to use.  They communicated well, and they processed the order very quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lezly",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T18:06:01.000Z",
          "Titre": "Generous price. Status updates nonexistent",
          "Contenu": "Prices were very generous for the blu ray DVDs compared to other sites. Scanner didnt work super well but nice to have the manual option. Free shipping is always great. Their process after shipment was less than desirable. Zero communication once the package was delivered. Only received payment when emailed about the status. Otherwise, seamless transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 7,
          "Date": "2023-09-20T15:14:59.000Z",
          "Titre": "Eaglesaver Experience",
          "Contenu": "It's nice to trade in no longer useful stuff and get money for it, but my order took over a week after being delivered to be checked thru, so -1 pt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josie",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T15:23:20.000Z",
          "Titre": "From Seller side",
          "Contenu": "From Seller side: All was great except after I shipped the order, I never received an email or anything acknowledging shipment or receipt of it. I had to email ES to ask for status after only seeing \"awaiting shipment\" on my account for 2 weeks. They responded  to my email within 2 days saying they received it and payment was coming (so that was good). So ES just needs to communicate a little better and send an email to sellers when order is received with a payment ETA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Crowley",
          "Nb_Reviews": 4,
          "Date": "2023-02-18T02:29:09.000Z",
          "Titre": "This transaction went smooth but the last didn’t and previous transactions have also not gone so smoothly!",
          "Contenu": "This transaction went smooth. I only sent a few items and there were no deductions. In the past I’ve had severe deductions. For example, my last transaction I sent many DVDS and CDS. The entire transaction was rejected! I spent a lot of time and effort into that (scanning items, cleaning/replacing cases, cleaning discs in a professional machine, packing the items, shipping the box, etc.) only to get a zero return! Not even a reduced or partial offer. I would have been better off using a different buyer who pays a little less but honors their agreement. Next time I will have to explore other buyer options unless you can explain and change my mind? I have been using EagleSaver for a long time now and made many transactions with them. All of my transactions have had price deductions (which obviously didn’t/doesn’t make me happy) but the transactions were processed nonetheless. Can you help?Regards,Gregory Crowley"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt M.",
          "Nb_Reviews": 5,
          "Date": "2023-07-26T13:22:58.000Z",
          "Titre": "Normally I’d give them a 5 out of 5,",
          "Contenu": "Normally I’d give them a 5 out of 5,But last few times it took them longer to process an order. Also, I received an email on Sunday saying that within 24 hours I would receive my payment. I just got it today, 3 days later. That’s the first time I’ve had that issue but it was annoying. Beyond that, the site is solid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mindy S.",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T20:56:01.000Z",
          "Titre": "Order went thru but not on time",
          "Contenu": "Order went thru but not on time. My package arrived on a Thursday & I didn’t receive any update until the following Wednesday. Still happy with the company though and will send in more stuff soon!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rob hammer",
          "Nb_Reviews": 10,
          "Date": "2023-03-17T04:49:18.000Z",
          "Titre": "The process was easy scanning the DVDs…",
          "Contenu": "The process was easy scanning the DVDs in but your customer service is horrible I've called multiple times with not one single phone call back that I'm not happy about"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KA Walo",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T02:22:21.000Z",
          "Titre": "App can be slow but easy process",
          "Contenu": "The app can be a bit slow and would go off and on but it does get the job done. The entire process was quite easy. Scan or type in the sku and get a price quote. note if no sku you cannot add just by title. Then add to your sell list or not. I was surprised at some DVDs that had a much higher value than I thought. I finished the process, accepted eagle savers offer, printed out my FedEx label and paperwork. note it was easier to complete my order on my laptop. Boxed up my order and dropped it off at fedex. My only complaint is it took 4 more days to get paid than quoted but that's acceptable. It would be more helpful for the account page to acknowledge receipt of goods when it reaches their warehouse. I would do business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riley Scarbrough",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T05:07:06.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service, however i feel that the process does have some flaws because how can something I know to have shipped not arrive. I’ve sold like 5k$+ on Eagle save would recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "IJS",
          "Nb_Reviews": 5,
          "Date": "2022-11-23T05:54:16.000Z",
          "Titre": "Zero communication, but got my $...",
          "Contenu": "They did offer a decent amount for the product I was selling, but I had an issue with the shipment process and EagleSaver wouldn't respond to my numerous voice messages or emails in regards to the issue. I did eventually get my money(after days of frustratingly waiting for a reply), but a follow-up to my concerns with a simple response would have been nice..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sy clark",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T06:33:20.000Z",
          "Titre": "I’m then end, it was as expected",
          "Contenu": "The final payment on our order was slightly delayed from the email I initially got but in the end it was as promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chester Wiggley",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T07:42:36.000Z",
          "Titre": "First the good",
          "Contenu": "First the good.  EagleSaver has proven to be an honest and reliable company.  No game playing, no screwing around with reductions for honestly graded items or \"Missing items\" like companies such as Booksrun are famous.  Payment is prompt.  It is sometimes difficult to  meet their minimum (but far, far easier than D'Clutter, which is near impossible).  However allowing the submitted items a grace period is a HUGE PLUS.   Here  are the three reasons they do not get five stars.  1) The website blows. 2). So does the App.  Both are extremely slow, badly designed and faulty.  If the website does not recognize the ISBN it states you entered the wrong type of item. Yet if you scan with the App, often it will recognize that item. The App might say it is not accepting, yet paste the ISBN into the webpage and it might. 3) No customer service response.  I recently had an item (pre-ISBN) looked up the ISBN and tried to contact EagleSaver.  Wasn't sure they would accept pre-ISBN items.  Three emails over three days and four phone calls (where the answering machine states we will be back to you in 24 hours). No response at all.   Perhaps, it is an operation with limited resources and they cannot upgrade their web and App presence,  maybe they are having trouble retaining adequate staffing.  So I will cut them slack as they have fulfilled everything else with excellence over the past two years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Lira",
          "Nb_Reviews": 12,
          "Date": "2023-12-02T15:42:44.000Z",
          "Titre": "I give Eagle Saver 4 stars",
          "Contenu": "Update, 12/2023: my last few orders have been processed much faster(consistently 1-2 days) and payment issued at the time of processing.  I am pleased to see these improvements.I give Eagle Saver 4 stars, a composite based on two things.Five stars for item acceptance and price paid.  They pay much better than competing sites, and they refuse very few items.Three stars for service.  Their website says \"You will be paid by PayPal or Check within 1 business day of the receipt of your items.\".  I am currently on my 7th order with them, and I have *never* been paid in a single day.  The fastest has been at least 2 or 3 business days, at best.  As I write this review, I had a package delivered to them 2 business days ago, and it hasn't been paid.  What's more, their site says they are still waiting for it, which is verifiably untrue.  At least other sites acknowledge receiving your package as soon as they get it, and processing follows.  It always keeps me a bit on edge with the way Eagle Saver does it.   But they have always paid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas  Carroll",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T12:47:29.000Z",
          "Titre": "This experience would have been perfect…",
          "Contenu": "This experience would have been perfect short of one thing and that is communication. The call center NEVER picks up or calls back. Otherwise a seamless great experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GAA",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T06:25:25.000Z",
          "Titre": "Great experience overall",
          "Contenu": "Great experience overall. Easy to use website. Only thing that could be better is more realistic estimate of turnaround time to reflect Eaglesaver's requests to FedEx to delay delivery because of whatever impedes delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Bruggeman",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T15:13:29.000Z",
          "Titre": "All in all an easy process to use",
          "Contenu": "All in all an easy process to use to sell CD's.  Prices received are better than the other company I have used.  I would give 5 stars if there were more options to search the database."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toussaint Dupree",
          "Nb_Reviews": 3,
          "Date": "2022-08-03T14:27:00.000Z",
          "Titre": "My First EagleSaver.com Order",
          "Contenu": "This is my first time using EagleSaver.com to recycle unwanted DVD's. I did a head to head price quote comparison on each DVD with one of EagleSavers competitors. I found Eaglesavers's prices to be higher than their competitors almost every time which was great for me, being the seller. I also noticed that EagleSaver was willing to buy a much larger percent of the DVD's I was selling than their competitor. One thing EagleSaver.com does that I think is great, that their competitor does not do, they identify the DVD by title once the UPC number is put into the system or the barcode is scanned, even if they are not offering a price quote to buy it. There are two areas of the EagleSaver.com process that concerned me and are the reason I did not give them five stars. First, their response to my telephonic, and email inquirer's were well outside of the twenty-four hour window they committed to. Secondly, on a couple of occasions they gave me price quotes on DVD's but when I select \"Add to cart\" I got a message saying \"Please contact support team\", which I did via telephone message and email. The end result was an email from them three days later telling me they were not accepting that DVD. I am not sure why the DVD was not rejected from the beginning like normal for DVD's they are not buying. The shipping process was free, and the post receipt payment process was expedient, both were as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Cerqua",
          "Nb_Reviews": 2,
          "Date": "2023-02-04T22:13:58.000Z",
          "Titre": "Very good, not great",
          "Contenu": "Ease of use as well as prepaid shipping. Quick turn around for the monies earned. Kept informed with each step taken as well as condition issues. I did find that the prices paid were on the low end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T04:02:19.000Z",
          "Titre": "I wish the turnaround were a bit…",
          "Contenu": "I wish the turnaround were a bit quicker but I've never had any issues getting paid and will continue to do service with Eagle Saver."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kendra singleton",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T07:50:24.000Z",
          "Titre": "It took an entire month after sending…",
          "Contenu": "It took an entire month after sending the package almost to here from you. Other then that your service was great thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Martin",
          "Nb_Reviews": 4,
          "Date": "2023-06-20T20:32:48.000Z",
          "Titre": "Much better prices than decluttr",
          "Contenu": "Much better prices than decluttr. First experience went well, will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T20:31:05.000Z",
          "Titre": "Very good offers",
          "Contenu": "Very good offers.  some problems entering data.  $20 minimum is a little high"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Lee",
          "Nb_Reviews": 5,
          "Date": "2023-08-25T03:09:47.000Z",
          "Titre": "Highest prices",
          "Contenu": "Highest prices.  Customer service not so great - but always works out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JBDiscounts",
          "Nb_Reviews": 3,
          "Date": "2022-10-16T02:44:48.000Z",
          "Titre": "Eaglesaver only takes half the items…",
          "Contenu": "Eaglesaver only takes half the items sent in. I'll have to send to other buyers when i have a chance whe more than one buyer accepts the book or cd."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda j  Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T00:57:49.000Z",
          "Titre": "communication with me phone or email…",
          "Contenu": "communication with me phone or email could have been better and the quantity that I sent wasn't exact but all in all your only human and I would do business with you again and recommend you to friends"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 9,
          "Date": "2022-12-31T01:34:40.000Z",
          "Titre": "Pay well -  Price are better than most",
          "Contenu": "Better pricing - they tend to get still as you get to minimum level --- Takes like week"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 11,
          "Date": "2023-01-12T14:59:32.000Z",
          "Titre": "Improving service dealing with staffing shortages",
          "Contenu": "They are trying harder and better, and doing their best with limited staff as of late."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith  Buntz",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T02:56:04.000Z",
          "Titre": "The system seems to work well",
          "Contenu": "The system seems to work well. But unfortunately the customer service is lacking with communication. I would definitely use the company again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MS  LEE",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T05:40:25.000Z",
          "Titre": "There's always a good offer plenty of…",
          "Contenu": "There's always a good offer plenty of ways to ship free and easy to access website."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Stefano Meda",
          "Nb_Reviews": 6,
          "Date": "2023-06-23T23:09:38.000Z",
          "Titre": "The App is pretty slow and scanning…",
          "Contenu": "The App is pretty slow and scanning somewhat difficult. The rest is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Dustman",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T02:58:10.000Z",
          "Titre": "Made good on their quotes and payment…",
          "Contenu": "Made good on their quotes and payment promises, the entire transaction from free mailing via FedEx of items sold to direct payment into PayPal acct took a little longer than expected, about 10 days in all and unfortunately there is no live phone assistance for questions but confirmation emails were sent thru the processing, FedEx tracking was spot on and most importantly, payment was sent. A few items I sent were rejected for not being up to standard but I sent a large quantity, so the number not taken were minimal and they returned those items as I requested. Overall satisfied with my experience with Eaglesaver and would use again and recommend to others looking for easy to load quotes, \"get the camera app\", easy and no cost shipping and trustworthy of receiving payment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 6,
          "Date": "2023-01-27T17:53:27.000Z",
          "Titre": "I really like your service",
          "Contenu": "I really like your service.  I just wish you would mark the package as received right when it comes in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 5,
          "Date": "2023-01-18T23:00:06.000Z",
          "Titre": "Wish they did t turn down so many and…",
          "Contenu": "Wish they did t turn down so many and paid a little better. Other than that they are very easy and quick to work with"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Woelk",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T14:08:06.000Z",
          "Titre": "They are kind of picky",
          "Contenu": "They are kind of picky, and there are hoops to jump through, but I got paid and in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T21:24:51.000Z",
          "Titre": "Easy system to use...However was hoping…",
          "Contenu": "Easy system to use...However was hoping for the prices to be a bit higher"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Just C. C.",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T15:35:13.000Z",
          "Titre": "I can't complain, pretty cool",
          "Contenu": "I love Eagle Saver.com.  The amounts could be better but overall the process was very smooth and easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T14:58:49.000Z",
          "Titre": "Didn’t take some of my cds but sent…",
          "Contenu": "Didn’t take some of my cds but sent them back for free which was nice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristy",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T07:00:57.000Z",
          "Titre": "I gave it 4 stars because while I…",
          "Contenu": "I gave it 4 stars because while I accept that you couldn't take all of my sent items, I would have preferred you included the title of the items not accepted in the email. The only thing provided was the code, which I couldn't identify with the correct movie etc because I no longer had the movie in my possession. Otherwise I am very happy with my usage of your services, thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rutz Patricia",
          "Nb_Reviews": 3,
          "Date": "2022-07-02T22:59:05.000Z",
          "Titre": "I would have given 5 stars if…",
          "Contenu": "I would have given 5 stars if the scanning process was usable. It didn't work most of the time and was frustrating putting in all the numbers using my iPhone. Otherwise, your site was very easy to use and your response was immediate.  I have about 400 more music cd's but they didn't meet your minimum requirements, so I must look elsewhere. Thank you for your speedy response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN TINDALL",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T23:08:51.000Z",
          "Titre": "The eaglesaver website was as easy to…",
          "Contenu": "The eaglesaver website was as easy to use as one could be.  Payments offered were good compared to other websites.  Sending items was convenient.  Almost all DVD offerings were accepted.  On a more recent use of the website some UPC codes were not recognized as being for the right category (Book, CD, DVD, or Video game)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy Perkins",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T16:42:45.000Z",
          "Titre": "Eaglesaver.com has met my expectations",
          "Contenu": "Eaglesaver.com has met my expectations.  I inherited many CD's and they converted the CD's to cash, so that they would not end up in a landfill and I could use the cash for something else I wanted to purchase.  The procedure was simple, but you never know how a company performs, until there is a problem.  My box of CD's was lost by FedEx and Eagle.com sent me the value of the CD's they quoted after a few emails to them regarding the situation.  I would definitely use this company again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2022-02-10T12:49:09.000Z",
          "Titre": "I think the overall process for selling…",
          "Contenu": "I think the overall process for selling my DVD’s was very good and straightforward, however the barcode scanner was a bit clunky and sometimes unreliable in its ability to properly recognize a barcode.  Having said that, I would still use your services again, and recommend it to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2021-10-06T23:28:20.000Z",
          "Titre": "Pretty positive experience",
          "Contenu": "Pretty positive experience! They paid for shipping and I received the check about a week or so later.  It would make it much easier if there was a barcode scanner.  The one downfall I had was I didn't see the minimum price they accepted and had already entered quite a few items.  However, the positive was I received a reminder stating my items were not at minimum accepted price.  Overall I would use their service again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T13:54:11.000Z",
          "Titre": "Great service!",
          "Contenu": "First of all, I was very excited to find a website that would still buy used DVD's.  I had a lot of them and hated to just get rid of them.  It was even better that Eagle Saver bought back the majority of what I had.My only issue was how tedious the process is to enter the barcode.  However, that is really my only complaint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 3,
          "Date": "2021-07-31T12:36:03.000Z",
          "Titre": "I really like EagleSaver!",
          "Contenu": "I really like EagleSaver!  I’ve used multiple sites in the past but this one has been my trusted “go to” for a long time.  The site is easy to use and the payments are issued quickly!The ONLY gripe I have is that sometimes I will send a movie to them in my package, and it showed up on the site, but they will email me to tell me that it’s not valid even though the upc is correct and the disc is in flawless condition.  It doesn’t happen often but it does happen and that can be frustrating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loretta",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T14:07:10.000Z",
          "Titre": "Everything was just as stated with just one issue.",
          "Contenu": "Everything was just as stated. Response and check issuance was quick and effortless. The only issue that was concerning is several of the DVD's were considered unacceptable according to the guidelines stated. I viewed one of the DVD's \"Wuthering Heights\" and the picture quality and sound were viewable without interruption of sound or picture quality. The DVD case was in perfect condition also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2021-05-04T01:03:54.000Z",
          "Titre": "Nearly Exceptional",
          "Contenu": "Overall great experience, and I really can't complain too much about the prices offered for most items.  (You always wish for more, but for the most part I was satisfied.)My main complaint has to do with the app; it's great that you can scan UPCs from your phone, but the app is very sluggish, and just gets worse as you scan more items.  You can speed things up again by killing and restarting the app, but that really shouldn't be necessary."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberley Pitman",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T16:19:06.000Z",
          "Titre": "Great Experience!",
          "Contenu": "After accumulating a \"ton\" of DVDs, BluRays, and 4Ks, we decided to clear out what we really don't need to see again.  EaglerSaver.com made it easy to evaluate the value and turn almost all of them into cash.  Shipping was easy and the check arrived in a very timely manner.  Highly Recommend!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Deveau",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T02:13:05.000Z",
          "Titre": "Eagle Saver has really helped me by…",
          "Contenu": "Eagle Saver has really helped me by buying used DVDs or unused for a fair price. After watching a movie a couple of times, as long as I keep it from being scratched I go on the site, enter the DVDs and I know how much the check will be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mickey",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T12:52:38.000Z",
          "Titre": "DVDs and CDs yes. Books no.",
          "Contenu": "Eagle saver is a great place to sell DVDs and CDs. It is not, however, a good place to sell books. They do not buy textbooks, I get that. But their app will quote you lots of books that they will later say they do not buy. I say don’t give me a buyback price if you won’t buy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-19T16:28:24.304Z",
          "Titre": "Efficient and Responsive",
          "Contenu": "I think they deserve four stars, despite the paltry payments for CDs, and their rejection of many that I can't figure out why.  They are efficient and I needed to get rid of the collection, without a lot of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T16:48:08.000Z",
          "Titre": "Takes a long time to get paid",
          "Contenu": "Takes a long time to get paid. I sent an email after 7 days of waiting. No response. 3 days later I get an email stating they received my shipment and would be processed. 2 days later I finally receive payment. Be prepared, it takes almost 2 weeks. It's kinda scary you don't get follow up as quickly as you want. But I give them 4 stars because they came through. Guaranteed quite prices and payment in full. Minus one star for lack of response time. I will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2021-10-29T05:44:58.000Z",
          "Titre": "I have in the past sold cds and DVDs I…",
          "Contenu": "I have in the past sold cds and DVDs I got my check on time shipping took a little longer than normal I thought  took 6 days to get their  they rejected 3cds for scratches not to big deal they did inform me when my items came that was nice will do business again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexa",
          "Nb_Reviews": 5,
          "Date": "2022-07-26T14:00:36.000Z",
          "Titre": "Very simple buyback process",
          "Contenu": "Very simple buyback process, and quick payment, too.Would give 5 stars if there wasn't the $.55 cent per item average requirement in addition to the minimum value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2020-06-24T04:25:49.000Z",
          "Titre": "Overall and incredibly easy way to get…",
          "Contenu": "Overall and incredibly easy way to get rid of unused CDs, DVDs and books.  Wish they accepted more titles but I am not too disappointed. Loved the fact that made the process SO EASY!  As long as you have your own boxes laying around, then the shipping is completely free!  They were VERY prompt on payment and it appears I got pretty much the same amount as the estimated quote.  Would definitely use again. Make sure you use the app to scan your items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela McMullen",
          "Nb_Reviews": 4,
          "Date": "2021-10-05T16:07:14.000Z",
          "Titre": "Was fairly easy to use",
          "Contenu": "Was fairly easy to use, and some of the prices were fair. The scanner is a little tricky, but was well worth the work.  I was consolidating and was happy to get some money for movies that I was getting rid of anyways. Shipping was easy, and the payout was quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vincent",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T04:08:24.000Z",
          "Titre": "Great service but needs bugs fixed.",
          "Contenu": "The service is great and the input is good but after 40-50 items the scanner starts slowing down big time. When I get to item 70 its moving at a crawl. And somewhere around 85 items it has deleted my entire list two times already so that's a big that needs to be fixed. I had to send two orders in the same box before because it was freezing so bad at item 50. Please fix this. I have about 400 more DVDs to sell you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 3,
          "Date": "2020-02-03T13:18:05.000Z",
          "Titre": "Great concept",
          "Contenu": "Great concept!  My grandson is saving money for a car and gas money.  This site offers a way to be good to the environment and get paid at the same time.  Thanks for a great service - It couldn't have been easier - we only needed to find a box and our check arrived promptly.  Only one exception - we couldn't get the scanning app to work on our Iphones.  Other than that one thing -- I would offer a 5 star rating..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T16:19:31.000Z",
          "Titre": "Selling media to EagleSaver.com",
          "Contenu": "Over the last few months I have been extremely pleased with selling DVDs to EagleSaver.  In general the prompt payment and free shipping has no equal.  I have only one complaint and that would be the lack of customer support when a question arises.  On numerous occasions I have needed a response and it is very difficult to get feedback in a prompt manner, ether by phone or email.  I will point out that this is my only complaint and overall I am very pleased!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stage",
          "Nb_Reviews": 5,
          "Date": "2020-01-18T04:49:11.000Z",
          "Titre": "Wish there was a bar code scanner for…",
          "Contenu": "Wish there was a bar code scanner for my I-phone.  Once I figured out how to enter the DVD's into the cart it was great.  Surprised that they offer very little for DVD buy back, but in some cases MUCH More than other sites.  THEY ALSO PAY SHIPPING which was a GREAT Bonus.  I highly recommend them...It sure beats throwing or giving perfectly good DVD's away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stonepark91",
          "Nb_Reviews": 3,
          "Date": "2020-01-24T04:34:48.000Z",
          "Titre": "Quick Pay, Smooth Process but CDs are undervalued.",
          "Contenu": "This is a great service for selling music CD's . However, I feel like you get the short end of the stick, because they don't pay much but I'm sure they resell what you sold them for a lot more.  So it's not a win-win.  But it's a way to raise a little cash and free up some space around your house if that's more important to you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 10,
          "Date": "2019-12-22T14:01:58.000Z",
          "Titre": "Overall first rate",
          "Contenu": "Overall first rate. Sometimes unresponsive to direct questions, but basically I can’t complain. I’ve learned, however, that books are basically value-less to Eagle Saver. In the case of older first editions, that’s surprising to me. So if you’re clearing out page-turners, Half-Price Books remains a much better place to go, even if they often pay minimally."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T10:26:27.000Z",
          "Titre": "My first impression of Eaglesaver has…",
          "Contenu": "My first impression of EagleSaver has been great. In fact it was so good that I immediately got a second batch together and sent it right out to them. Everything they say they will do they did and then some. There is only one problem with them and that is when I look up a movie it comes up something else. I have explained to them twice what the problem is and they think it is me inputting the wrong upc number. That's the reason why I can not give them 5 out of 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 2,
          "Date": "2019-08-02T03:53:21.000Z",
          "Titre": "Usually prompt",
          "Contenu": "Usually prompt. Not always informative. Pays well for some items but doesn't purchase items you'd think they would. Doesn't buy most cds and hasn't bought a single book out of a hundred even though they advertise that they buy books. It's also weird which dvds they buy and which ones they don't, they are very hit and miss. But their service is usually prompt and accurate. 4 out of 5 stars!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T02:25:45.000Z",
          "Titre": "Good Company",
          "Contenu": "I think they are great I just wish they paid more for items. Most things I scan are 49 cents or less. I understand it’s about demand but some of the stuff is really good and sells on eBay for more than $10. I’m very happy with the turn around time for the stuff I send though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Zampella",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T05:45:18.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Wish some DVD titles were over .050 though.Thanks,Marc Zampella"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ATrain",
          "Nb_Reviews": 4,
          "Date": "2020-11-27T14:28:34.000Z",
          "Titre": "It took over 2 weeks to get my $$ but I…",
          "Contenu": "It took over 2 weeks to get my $$ but I did get full value, some other websites withhold or make up some stories about the condition of the cd's etc. Also had issues logging back in to check on the status of my order. Will probably use again though, maybe it'll be a little faster next time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reah",
          "Nb_Reviews": 2,
          "Date": "2019-07-05T15:28:30.000Z",
          "Titre": "Issue with checks",
          "Contenu": "I had 3 orders with eaglesaver. Packaged and mailed the DVDs, from arrival to check issuance was less than a week. Got the checks a few days later. Took them to Chase bank who said the checks were bad and couldn’t be cashed or deposited.  Sent an email to eaglesaver, they responded within 24 hours and told me checks are good and try again. I did an online/electronic deposit if the checks via Chase app and they went through ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2019-11-15T19:42:38.000Z",
          "Titre": "Eagle Saver is hands down the best…",
          "Contenu": "Eagle Saver is hands down the best place to sell media in the internet. But to be fully transparent I do find the process to be a bit frustrating due to site lag when inputting upc’s as well as carts forgetting your history. It can be worked around of course, but some sort of update might be helpful to the customer.Otherwise though, well done!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phyliss Robichaud",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T12:10:48.000Z",
          "Titre": "I enjoyed doing business with…EagleSaver",
          "Contenu": "I enjoyed doing business with eaglesaver. They processed my order very fast and I got my check fast too. The only problem was one set of my Dvd's was not acceptable to them. I was disappointed in this because it was a set that I only watched one time and because of that I thought it would be ok. But I do understand they have a certain standard that must be meant when buying merchandise. I would definitely do business with this company again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2020-12-13T23:50:30.000Z",
          "Titre": "I was impressed with the site and the…",
          "Contenu": "I was impressed with the site and the immediate offer(s) made.  The label printed accurately, as did receipts.  The payment was made, although it took a bit longer to receive than anticipated.  But, due to pandemic and holiday mail, it was understandable.  One drawback was that the help number given out on website was disconnected or no longer in use to answer any inquiries.  This should be corrected.  I am still pleased with the result of my first order of business and have recommended the site to a few friends.Greg BMinnesota"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dolores",
          "Nb_Reviews": 4,
          "Date": "2021-06-11T16:23:28.000Z",
          "Titre": "Sent in a order to this company, received payment within 2 days in paypal .",
          "Contenu": "Sent in a order to this company and they were fairly reasonable, although a few items were returned which I did not quite understand because at first it appeared that they were accepted. For this reason I deducted 1 star, overall they are a good company to deal with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 3,
          "Date": "2020-03-26T18:08:50.000Z",
          "Titre": "Communication needs work but reliable and prompt",
          "Contenu": "According their FAQs on their site, I was suppose to receive an email when they received my order.  I never received such an email.  Also, I received an email telling me that they had accepted my order and that a check had been mailed, two days after they actually mailed the check.They did, however, pay within one day of processing my order as indicated on their website.   Therefore, I would continue to use them and would recommend them to anyone else who had books, DVDs or CDs to sell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louis A Silviotti",
          "Nb_Reviews": 6,
          "Date": "2020-12-29T18:42:39.000Z",
          "Titre": "The web site only takes the numbers for…",
          "Contenu": "The web site only takes the numbers for id, while titles should be able to be input when numbers are not available. Pricing is adequate while receiving the check takes a while. Some things need to be upgraded in order to be a site I would highly recommend to other sellers or buyers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T06:19:40.000Z",
          "Titre": "The process is very quick and fast",
          "Contenu": "The process is very quick and fast. While I used the website to enter the UPC numbers, the site did occasionally pick up a wrong title. Maybe it's a database issue but it's 99% accurate. The only drawback I see is they say they'll buy a blu-ray (say for $0.75) but when you go to check out, it won't accept anything less than $1.30 to be shipped back. So why say you'll accept a title when the value is under $1.30?I would still use Eagle Saver again. And yes, I would recommend people to use Eaglesaver to sell blu-rays."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2019-07-17T19:06:17.000Z",
          "Titre": "The only problem I'm having is that…",
          "Contenu": "The only problem I'm having is that some of the DVD/Blu-rays I scan in their original cases, come back as Audio CD's or they don't recognize the code !!!!!!!   I've called a number of time and cannot get through.  I've sent a number of emails and receive the same stock response every time.  Although I am satisfied with their service overall, still frustrated with their non response or repeating the stock return email and not actually answering my questions!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 3,
          "Date": "2021-01-26T21:08:02.000Z",
          "Titre": "In general",
          "Contenu": "In general, I love this site. They return what they can’t buy. But I wish the app would reflect what books they will buy. I says they will buy but when they get it they say not the type they will buy. Please upgrade the app so it does not give a quote if they don’t want it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T07:46:45.000Z",
          "Titre": "Fast Payment- free shipping",
          "Contenu": "Pro: Very quick payment for the DVD's and Blue-Ray's that we sold them! Also easy free shipping to get our stuff to them.Cons: Website took forever to load each barcode and show an offer, and on a computer you have to load them one at a time and wait between each one.Also, and prob not their fault, but the offers for the DVD's was pretty low- I think a few were $.25 for brand new sealed Blue-Ray's depending on the movie, but you can find Blue-Ray's at the Dollar Store now, so I suppose that's a fair price. As I continue to clean out the house, I will likely use them again when I find more movies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 2,
          "Date": "2020-04-16T16:22:15.000Z",
          "Titre": "Easy App/Process, wish for a bit more titles",
          "Contenu": "Easy interface, scanning app to use.  Scanning was occasionally a bit clunky for a few items, but overall worked decently.  Would have liked if they accepted a few more titles but understand their business model allows for certain things/types.  Shipping is a breeze - appreciated that aspect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mary",
          "Nb_Reviews": 2,
          "Date": "2020-06-06T22:32:37.000Z",
          "Titre": "Need better instructions/directions",
          "Contenu": "Need better instructions/directions on how to transfer/ enter UPC codes. It took me a while to figure it out. Still trying to figure out how to enter more than one UPC code at a time.Otherwise instructions were clear for packaging and shipping. I received my payment in a timely manner"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francisco De Nova",
          "Nb_Reviews": 5,
          "Date": "2019-10-09T02:53:27.000Z",
          "Titre": "The site and app are great",
          "Contenu": "The site and app are great, Free shipping to send items is amazing; the only complaint I have is that they are very picky with items and make a big deal out of very small things to not buy items then they ask if you want to recycle items with them( I suspect they keep and sell without paying for them)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2020-08-30T13:08:25.000Z",
          "Titre": "This has been a slow process",
          "Contenu": "This has been a slow process, however, given the current environment, I understand. It is an easy process and amount I was told I would receive is fair.  I was told my check payment was processed a week ago and I still have not received it.  Please respond and give me a status."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luc",
          "Nb_Reviews": 2,
          "Date": "2019-12-17T10:24:58.000Z",
          "Titre": "Give the best price!",
          "Contenu": "Very good buyer! They give the best price if you want to sell your cd-dvd and books! They supplies the fedex label so very easy! When it gets delivered could take a bit of time to review and make the payment! I wish it would get paid faster but overall it’s a very safe and good place to sell!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim D.",
          "Nb_Reviews": 2,
          "Date": "2020-01-30T01:30:05.000Z",
          "Titre": "Great way to get cash for books",
          "Contenu": "Great way to get cash for books, games, video games, textbooks.Excellent description, listings, and turnaround time for a check to be sent and delivered.Would prefer another way to send it instead of the post office or Fedex. Fedex not readily available in my area. Would prefer UPS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ida",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T04:04:40.000Z",
          "Titre": "My experience with EagleSaver was…",
          "Contenu": "My experience with EagleSaver was positive. I was a little angry when I received my first check from my first order, but I do understand that they have certain rules and guidelines, and that they expect the customer to know those rules and guidelines if they want to do business with them.  One thing I do appreciate is that in the email they sent me, they explained why I was not being compensated for certain items, and that I would be receiving those items back at no charge to me. That was great to hear. I did receive my rejected items back in a timely manner.Yes. I will do business with them again. The process was an easy one.Thanks,I. Robertson"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T13:19:21.000Z",
          "Titre": "I was a little surprised to NOT receive…",
          "Contenu": "I was a little surprised to NOT receive the full value of the receipt for the DVDs due to what EagleSaver had claimed were \"scratches\" in the DVDS; however, EagleSaver was prompt in sending me a check for most of the amount promised. Also, shipping to them was free on my end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T14:43:25.000Z",
          "Titre": "Selling used CDs and DVDs",
          "Contenu": "I have sold used CDs and DVDs to EagleSaver.com on three occasions starting in August 2019.  It is easy to obtain prices using the UPCs. It is extremely easy and convenient to print the prepaid label and drop y package at a Federal Express location.  For all three shipments to them, EagleSaver.com has accepted everything I have shipped (I do keep my items in pristine condition) and sent me a check for precisely the amount indicated.  I would like their site even more if there were a way to offer to sell legitimate imported CDs (not bootlegs) that bear no UPC."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HARUO",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T19:11:30.000Z",
          "Titre": "12/27/2020",
          "Contenu": "12/27/2020I would like to give 5 STARS! but I have not received my payment yet. Please read below:Order Date: 12/06/20Hi HARUO SHIGA,We have received your order and payment will be issued within 24 hours.Please confirm that your address, E-mail and payment preference is correct.(note: please respond to this email only if edits need to be made).You may view a comprehensive accounting of this Order by logging into your account. If you have any questions, please go to our Help Center or Contact Us. We appreciate your business.EagleSaver.comOrder InformationOrder Number: 1124226Name: HARUO SHIGA"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T22:17:25.000Z",
          "Titre": "I was surprised to discover a website…",
          "Contenu": "I was surprised to discover a website such as this. The company gives fairly decent prices for DVDs. They pay for the shipping of the movies. Overall the experience went well. The only complaint I have is that Fedex stated they delivered the package. Eaglesaver failed to update the system to reflect the package was received. I believe it was five days after the actual delivery date the company stated they were in possession of the goods. Also, Eaglesaver did not meet the target date. Just as the acceptance being behind, the mailing of payment was as well. The company did mail the payment as promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T11:54:10.000Z",
          "Titre": "Placing an order was very easy",
          "Contenu": "Placing an order was very easy. Instructions were clear and scanning items made price check faster. Notification emails let you knowstatus of orders. I will definitely use site for future sales."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T12:25:14.000Z",
          "Titre": "Love that there is a site out there…",
          "Contenu": "Love that there is a site out there that will buy old DVDs and Blu Rays.  Just wish that they would either drop the minimum average of $0.75 or offer more per disc.    $0.21 and $0.37 for most items....come on....   all in all great site and will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T14:23:40.000Z",
          "Titre": "This would be a 5* review",
          "Contenu": "This would be a 5* review, but it would only give me the option of shipping via FedEx and there aren't a ton of FedEx shipping locations close. The closest one has so many restrictions on what, how and how much you ship that I don't even try anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2019-09-13T23:41:56.000Z",
          "Titre": "This was a great way to clean out some…",
          "Contenu": "This was a great way to clean out some old games and movies. Very impressed with how quickly my items were evaluated and payment received. Yeah, a handful of stuff was rejected, but not bad really. Would definitely make this my first choice to sell my used media!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natasha",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T19:12:38.000Z",
          "Titre": "Mostly good service but some weird rules that frustrated me",
          "Contenu": "It wasn't until I was checking out to sell that I was told that my cart had to have an average of 1$ for my stuff to be able to sell. Not sure why that is, nothing explained why that was necessary and I've never experienced that with any other service I've ever used. Then when my stuff arrived, they changed the values on things so I got less that what it quoted me at, again with no explanation of why. However, they are the only service I've used that is nice enough to return things that they won't accept. Overall, mostly a good service but some of their rules were frustrating and without reason."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "anthony",
          "Nb_Reviews": 5,
          "Date": "2021-09-18T15:16:52.000Z",
          "Titre": "Very happy except for the reasons they…",
          "Contenu": "Very happy except for the reasons they give when they reject an item.  One recent item that was over $14 was rejected for heavy ware but my dads DVD’s are either new never used or seen once. Don’t understand"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan David Hook",
          "Nb_Reviews": 3,
          "Date": "2020-07-29T04:50:48.000Z",
          "Titre": "As easy as promised",
          "Contenu": "I was impressed with the ease of the process. Just list your stuff to get a fast offer, then ship. A check comes in about a week. It couldn’t be more simple, and who wants to make cleaning out your unwanted items to be complicated?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anna morellon",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:03:17.000Z",
          "Titre": "EagleSaver is first choice for selling cd's and Dvd's",
          "Contenu": "Eaglesaver made it very easy to sell my unwanted dvd's and cd's. The buy back prices were fair and payment was made very quickly. I would recommend this company to be first choice when selling items they accept. I will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Mendez",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:49:04.000Z",
          "Titre": "My experience with eaglesaver.com was…",
          "Contenu": "My experience with eaglesaver.com was amazing. Simply amazing quick and easy, prompt and courteous. Don’t bother calling you’re not going to get through, but they are there at the other end. Trust me they came through and only a few of my products didn’t meet their grade of conditioning, but I would say 98% did and I was paid probably within 24 hours of receiving my package. I think you and will continue doing business in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jillian Roth",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:35:59.000Z",
          "Titre": "Great experience all around",
          "Contenu": "Great experience all around; definitely recommend. Accepted most of my DVDs when I checked the ISBN and upon arrival - definitely above board. Can't say the same for the other website I tried, which for that site I give two thumbs down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John W Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:53:58.000Z",
          "Titre": "Great CD buyback experience!  Recommended!!",
          "Contenu": "Great customer experience, working with EagleSaver.com from start to finish!  I was updated by email each step of the CD buyback process.  Prices are fair.  \"Quotes\" are paid out promptly!Will do business with this Company again!!Recommended!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim E.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:03:16.000Z",
          "Titre": "Easy Trade In System with fair pricing / easy shipping",
          "Contenu": "The website was easy to understand and follow, the prices are given instantly, and the process itself from sending in the items to receiving payment was a breeze. We're currently decluttering our house and it was a quick, convenient way to offload our unused media. Even shipping was included which was a welcome surprise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seong Kim",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T04:03:21.000Z",
          "Titre": "Great Online CD Buyers!!!",
          "Contenu": "EagleSaver is one and only Online Buyer who valued my CD collections with reasonable manner. They paid so quickly and they also returned the items back to me well if it didn't met their qualification. These are the reason why I am enjoying with their true services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T16:09:27.000Z",
          "Titre": "I checked out 7 different sites",
          "Contenu": "I checked out 7 different sites. This company paid the most for the CD's and DVD's I had, mobile site was easy to navigate and payment was quick and in my account within days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn Whitfield",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T07:25:32.000Z",
          "Titre": "I found the answer I was seeking",
          "Contenu": "I was looking for a way to get something monetarily for old DVDs that were cluttering up my house and I found a program which lead me to Eaglesaver. It was pretty easy to use. They paid shipping cost and the amount I received was the exact amount quoted before shipping. I’m very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale D.",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T21:49:01.000Z",
          "Titre": "Best pricing quoted on all items I sold…",
          "Contenu": "Best pricing quoted on all items I sold to Eaglesaver compared to other sites. Ease of sending items to Eaglesaver. Quick communication and follow-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth S.",
          "Nb_Reviews": 6,
          "Date": "2023-12-12T00:37:56.000Z",
          "Titre": "Paid in full!",
          "Contenu": "Paid in full, no nonsense.  That's usually the case with EagleSaver, which is why I feel confident whenever selling to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damon Morris",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:16:40.000Z",
          "Titre": "This company gives the best quotes…",
          "Contenu": "This company gives the best quotes around. with PayPal is easy to get paid instantly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Torbert",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:10:04.000Z",
          "Titre": "Great experience!",
          "Contenu": "Great experience!! Value quoted for items is substantially higher then others…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christy roberts",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:00:49.000Z",
          "Titre": "Easy and quick transaction",
          "Contenu": "Easy and quick transaction. I have been doing business with EagleSaver.com for over 4 years now and they are very fast and reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lealy Parlin",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:05:15.000Z",
          "Titre": "It was an easy process",
          "Contenu": "It was an easy process, amd they give you options for the pay out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Jorgensen",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T16:53:14.000Z",
          "Titre": "Payment Received Quickly",
          "Contenu": "I received payment very quickly, within 2 weeks of mailing my box to them I think. The whole process of packign up the media and labeling the box is pretty easy. My only complaint is that there are sveral items that scan in as the wrong title and there is no way to look items up by name. POssibly customer service could assist but I just chose not to send those."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Slater",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T20:50:12.000Z",
          "Titre": "best place to sell movies to",
          "Contenu": "best place to sell movies to. never had a bad experience with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Miller III",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T17:23:12.000Z",
          "Titre": "Excellent first experience",
          "Contenu": "Excellent first experience!  I was skeptical at first but the quoted price was very reasonable compared to other similar bulk buyers, shipping was easy, and payment was prompt.  I already sent another box!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juet Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:14:00.000Z",
          "Titre": "Eaglesaver keeps its promise",
          "Contenu": "The company lives up to its commitment to provide updates and its promise to pay quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alexander",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:10:22.000Z",
          "Titre": "A+ service and turnaround",
          "Contenu": "I have used eagle saver numerous times with no issue... Great place ... Very trustworthy.. Payment is made very quickly. Overall A+ service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cyrus",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T20:28:22.000Z",
          "Titre": "Always a pleasure working with you and…",
          "Contenu": "Always a pleasure working with you and the rates are always solid - thank-you for being amazing and making great use out of films and items I enjoyed and want to pass along to someone else while still getting value. Thank-you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul  Santa Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T15:25:10.000Z",
          "Titre": "Everything went exceptionally well",
          "Contenu": "Everything went exceptionally well , I used to use Decluttr to sell DVDs / BluRay / Television Series but they have become nightmarish to deal with. My only negative is the fact that the barcode scanner does not work and inputting several barcodes was / can be painstaking , if this issue was fixed then I would say you deserve a 110 %"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy s",
          "Nb_Reviews": 6,
          "Date": "2023-11-15T17:18:11.000Z",
          "Titre": "Get paid for your dvds!",
          "Contenu": "EagleSaver has been so helpful in having a good way to do something with our dvds, plus get paid for them. The process is very easy; I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Traci Burke",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T17:16:38.000Z",
          "Titre": "Great Experience",
          "Contenu": "EagleSaver is easy to use and they are quick to process the items that you sell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Horizon",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T04:29:16.000Z",
          "Titre": "Easiest way to declutter all the older…",
          "Contenu": "Easiest way to declutter all the older DVDs and Video Games, have been having them for all long without knowing about this website. Fast payment, free shipping label was provided. Excellent transaction. Prices could have little better but thats ok."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T02:07:47.000Z",
          "Titre": "Always prompt and a real honor to work…",
          "Contenu": "Always prompt and a real honor to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PK",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T13:35:38.000Z",
          "Titre": "Decluttering experience",
          "Contenu": "Even though it was time consuming on line, it was very easy to accomplish.  I was able to declutter a great number of items, was easy to pack up and take to Fed Ex.  Received communication on when package was received and when my funds were issued.  Would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T06:49:07.000Z",
          "Titre": "Best Merchant for Selling DVDs",
          "Contenu": "Best Merchant for Selling DVDs- The inventory system is extensive and easy to use.- Payments are higher than competitors.- Shipping is free.- Communication is timely and to the point.- Payment is quick.You couldn't ask for more.  I highly recommend!  They have earned my repeat business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:01:13.000Z",
          "Titre": "Very quick payment!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda  R",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T07:19:55.000Z",
          "Titre": "Easy money",
          "Contenu": "Entered the info for my dvds and was given a total, I printed the slips that were emailed to me, shipped my package, boom…money in my account…easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 6,
          "Date": "2023-10-25T16:25:47.000Z",
          "Titre": "My wonderful experience",
          "Contenu": "My order and payment were processed within days of me mailing my package.  There were a few items that were not acceptable but they were returned to me at no charge.  I only sell to this company because they are honestly the best.  Try them out.  You won't be sorry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:07:50.000Z",
          "Titre": "Seamless transaction",
          "Contenu": "Seamless. Did exactly what they said they would. Will use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T00:52:24.000Z",
          "Titre": "Worth It!",
          "Contenu": "The process from start to finish was seemless. I entered the information and appreciated the immediate price. Shipping was simple and received paper check just as advised. It was a breeze and well worth it. Now I have a whole cabinet to use for something I actually use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "peter fuller",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T12:24:54.000Z",
          "Titre": "It was a good experience working with…",
          "Contenu": "It was a good experience working with Eaglesaver. I received 4 confirmed order payments, still missing order # 1266229, as far as payment,$26.82, confirmed. I may have not noticed that order, as far as email notice. Thanks again for the very good experience, I now have extra $ to order more books & dvds on ebay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hoh",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T15:06:16.000Z",
          "Titre": "Highly recommended!  Super fast!",
          "Contenu": "Easy to read and follow instructions on their website and app in order to prep and mail cd’s.  They received my order in a very reasonable time and once they confirmed receipt of my order, I was paid via PayPal within 12 hours, 40 minutes!  Fantastic job guys/gals!!  Super happy with their service and will use them again in the future!  Highly recommended!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis",
          "Nb_Reviews": 11,
          "Date": "2023-10-20T15:46:51.000Z",
          "Titre": "Eagle Saver \"rocks\"",
          "Contenu": "I have been doing business with Eagle Saver for many years now.  They are very trustworthy and treat you like you are important to them.  They offer free shipping of the items you want to sell and work with Fed Ex which is a great company also.  I never sell my DVD's to anyone but Eagle Saver.  You rock!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 10,
          "Date": "2023-07-26T15:10:55.000Z",
          "Titre": "Continued great service",
          "Contenu": "Continued great service. But it had been a while since I sent anything because Eagle Saver's price offerings seem to be dwindling to the point where it's difficult to hit the $20 minimum."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Heath",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:01:02.000Z",
          "Titre": "The process was easy",
          "Contenu": "The process was easy and everything was as represented.  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:34:52.000Z",
          "Titre": "Sold movies and received exact amount quoted",
          "Contenu": "I sold a bunch of DVD's I had laying around. I received the exact amount I was quoted and I had my check a week after they received the movies. Pretty painless way to clear out some space!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 4,
          "Date": "2023-10-12T17:59:21.000Z",
          "Titre": "Fair and fairly quick",
          "Contenu": "Consistently fair and in a timely manner. Good customer service.Trying to reach them via phone is frustrating  though😆"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Gantt",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T03:43:07.000Z",
          "Titre": "So far excellent transaction",
          "Contenu": "So far excellent transaction! They did as they promised. Kept me informed when they received my shipment and was paid within the same day. Let’s hope that the other 6 boxes go just as smoothly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jefferson Robert",
          "Nb_Reviews": 8,
          "Date": "2023-08-11T00:43:37.000Z",
          "Titre": "Eager Saver is \"one of the best company…",
          "Contenu": "Eager Saver is \"one of the best company for CDs and Books and DVDs buyback as well have very good DVDs and BOOKs and CDs item for sales as well as penty in stocks for all and any occassion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Korey M",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:37:08.000Z",
          "Titre": "Ease of use and how quickly the process…",
          "Contenu": "Ease of use and how quickly the process worked"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Hoffman",
          "Nb_Reviews": 7,
          "Date": "2023-03-09T19:09:47.000Z",
          "Titre": "A name truly apropos",
          "Contenu": "It's hard to believe, harder still to be personally affected by a company who sets heights above all others the baseline for service. EagleSaver.com a name truly apropos.William Hoffman"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. D.",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T03:50:34.000Z",
          "Titre": "Very Good Way to Sell Videos, Books, and Games",
          "Contenu": "There is a very professional ran company.  We have had NO Trouble whatsoever.  Very informative on when they receive your box and when your funds are dispersed.  Recommend completely!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:27:45.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Very simple. Once they received my package payment was quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Phipps",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T03:31:54.000Z",
          "Titre": "The check was sent but there wasn’t a…",
          "Contenu": "The check was sent but there wasn’t a Signature! I immediately got a response and was reissued a check with an extra $10!!! Thanks Eagle Saver!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebekah  Hansell",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T04:16:24.000Z",
          "Titre": "So fare so good I've done several…",
          "Contenu": "So fare so good I've done several orders. I'd say they are pretty fair on price. Since I was just cleaning up my blu ray collection. Prompt in service and getting back to you if you need help. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Smith",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T03:36:27.000Z",
          "Titre": "Very easy process",
          "Contenu": "Very easy process. But…some videos I could not process because they scan as an audio cd or cassette. About 10 or so. You need to review that. Otherwise very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacqueline Rysz",
          "Nb_Reviews": 8,
          "Date": "2023-10-19T15:11:46.000Z",
          "Titre": "Very pleased with Eagle Savers",
          "Contenu": "Very pleased with Eagle Savers! They were very prompt with their payment, and I feel their quotes are the best of any other service out there. They are definitely 5 stars in my opinion!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regina Knezevich",
          "Nb_Reviews": 6,
          "Date": "2023-02-11T00:44:15.000Z",
          "Titre": "This is my first time using…this was my first time using Eaglesaverk",
          "Contenu": "This is my first time using EagleSaver.com I am not very tech savvy so I emailed EagleSaver and received helpful info . I was able to use the site quite easily , scanned my products , was given the estimate , a call tag , content sheet and summary and very speedy payment . I am very pleased with EagleSaver and have already recommended it to some of my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L.C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T04:16:09.000Z",
          "Titre": "Easy Transaction",
          "Contenu": "Easy Transaction. Would do business again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T07:39:56.000Z",
          "Titre": "The Best out there 👌",
          "Contenu": "Best quotes compared to other buyers and fast payout. Over 5 years experiencing their great customer service, I don't have any bad experience. Great people👍🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 5,
          "Date": "2023-04-05T18:16:34.000Z",
          "Titre": "Use Pay Pal to get paid on time .",
          "Contenu": "Even though the USPS took 12 days to delivery my check the experience with Eagle Saver was good.  FedX delayed delivery for a few days but Eagle Saver processed my order in a very timely manner.  I wish Eagle Saver would have a live person taking calls.  The best responses occured when you send an email To Eagle Saver.  I would do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francis Pineiro Jr",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T17:13:25.000Z",
          "Titre": "Selling of my DVD Collection",
          "Contenu": "Process to identify DVD value and shipping was easy and pain free.  Only downside would be that the average of the DVD value must be .50 which does leave me with quite a few DVD's that can't be sold.  Overall, very good site for selling DVD's."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genie Kemp",
          "Nb_Reviews": 3,
          "Date": "2023-06-08T13:13:58.000Z",
          "Titre": "Happy to find EagleSaver.com!",
          "Contenu": "When I realized I could not easily discard of all the CD disks my husband and I had accumulated, I was so happy to find EagleSaver.com.  The process was easy and I made a little money as well as safely disposing of the many CD's we had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Bailie",
          "Nb_Reviews": 6,
          "Date": "2023-04-08T05:16:18.000Z",
          "Titre": "True To Their Word",
          "Contenu": "The website was very easy to use. I sent my packages with free shipping and the day after they arrived I received the funds into my PayPal account. They were true to their word and gave me the amount agreed-upon. I’m very impressed and will use their service again. I highly recommend this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Marr",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T06:54:30.000Z",
          "Titre": "I look forward to doing more business…",
          "Contenu": "I look forward to doing more business in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Baylog",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T12:46:17.000Z",
          "Titre": "Smooth Transaction",
          "Contenu": "Extremely easy experience. Logged info of product, got quote, packed up my items, dropped at FedEx, money in my account few days later. Will def use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene Truong",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T22:37:12.000Z",
          "Titre": "It’s been great",
          "Contenu": "It’s been great, payments are always on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Slam",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T04:37:19.000Z",
          "Titre": "Paid me promptly",
          "Contenu": "At first I was skeptical since I read some bad reviews about them.  So when I sent in my CDs, I wasn't expecting much.  But to my surprise, they provided status for every step and then paid me within 24hrs of receiving the shipment.  Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Greenbank",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T09:55:13.000Z",
          "Titre": "Great service",
          "Contenu": "They're fast, fair, and great with communication. All good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nheap",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T22:21:59.000Z",
          "Titre": "I like the feedback and communication…",
          "Contenu": "I like the feedback and communication from the company back to me. This is my first experience with selling books, and they make it easy. I’m looking forward to downsizing in the near future, and have a lot of books to sell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mindy",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:32:36.000Z",
          "Titre": "Really easy way to declutter",
          "Contenu": "Really easy way to declutter and make a little money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T04:21:43.000Z",
          "Titre": "As promised.  On Time.  Fair.",
          "Contenu": "Straight forward with the order.  Of course not everything goes through what you send.  So when making an order make sure you find as many as you can to make it pay off!! Thanks for the quick turn around service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cam",
          "Nb_Reviews": 8,
          "Date": "2023-02-19T03:54:54.000Z",
          "Titre": "I found the whole process of listing my…",
          "Contenu": "I found the whole process of listing my inventory to your website to be smooth and uncomplicated. Your offers for the DVDs were fair, and the shipment and payment process went great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darin Gray",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T04:28:03.000Z",
          "Titre": "Your continued consistent service and…",
          "Contenu": "Your continued consistent service and attention to detail that has made my experience fantastic! This company is the prime example of professional excellence. Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 4,
          "Date": "2023-04-27T17:28:12.000Z",
          "Titre": "Their Ap is great and easy to use",
          "Contenu": "Their Ap is great and easy to use.  They provided the shipping label and instructions to send the merchandise and paid promptly upon receipt.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krista",
          "Nb_Reviews": 6,
          "Date": "2023-11-03T13:54:39.000Z",
          "Titre": "Process is very simple",
          "Contenu": "Process is very simple.  Payment for sent items are received within a week"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario Brescio",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T11:35:40.000Z",
          "Titre": "Worked with EagleSaver twice!",
          "Contenu": "Worked with EagleSaver twice…both times they were fast, efficient, honest, professional.  Would definitely recommend and will use again…great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C.A. Kneubuhl",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T21:14:34.000Z",
          "Titre": "Great experiance",
          "Contenu": "Well the app worked well in scanning and loading. I accepted the quote and mailed the product, as soon as they got it and checked it all to make sure it was as I said I was sending they send the payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Feratovic",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T07:24:00.000Z",
          "Titre": "Respond to any questions immediately…",
          "Contenu": "Respond to any questions immediately great staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Buiel",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:52:23.000Z",
          "Titre": "Prompt & communicative during the…",
          "Contenu": "Prompt & communicative during the processing of our returns.  A pleasure to do business with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 25,
          "Date": "2023-04-13T04:23:02.000Z",
          "Titre": "I love this site",
          "Contenu": "I love this site. I receive excellent trade prices and payments arrive quickly through PayPal. I highly recommend using them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 6,
          "Date": "2023-07-04T15:32:57.000Z",
          "Titre": "Always a Great Experience",
          "Contenu": "Wonderful company who I have sold to for the last 16 years. Always reliable. Easily the most honest and respectable company I've sold to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T12:50:24.000Z",
          "Titre": "I’ve used Eagle Saver for years and…",
          "Contenu": "I’ve used Eagle Saver for years and they’ve always been reliable and fair when it comes to their pricing, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 7,
          "Date": "2023-05-02T03:23:00.000Z",
          "Titre": "Smooth transactions",
          "Contenu": "Smooth transactions. Sometimes tough getting Fed EX out to pickup.   Fast payment.  Reasonable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael  Hallman",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T04:07:05.000Z",
          "Titre": "Easy to do business with your company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "eulogio a tejada tejada",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T03:05:09.000Z",
          "Titre": "to they can make up money from stuff they dont like or no using no more thay it is my concerning ????",
          "Contenu": "im more than happy to meet up in my cumputer eaglesaver,com to makeup a good deal with my unusing dvd cd and game plus???"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mark conner",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T12:20:20.000Z",
          "Titre": "The system works well",
          "Contenu": "The system works well, takes a little while without a scanner, but if you need some quick cash and you have lots of DVDs , this is one of the best ive seen yet. Thanks Eaglesaver!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Mahan",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T18:10:30.000Z",
          "Titre": "This was a very easy process selling…",
          "Contenu": "This was a very easy process selling some CDs and books.  Payment arrived very quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherie",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T16:01:34.000Z",
          "Titre": "Convenient way to sell DVD's and CD's",
          "Contenu": "Fast, efficient, and convenient. I have worked with you previously and will do so in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige Blalock",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T02:10:18.000Z",
          "Titre": "Very easy to use and helped me sell…",
          "Contenu": "Very easy to use and helped me sell things that I've had sitting onto he shelf forever. I was so grateful for the communication as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SZ",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T10:59:05.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service.  I sent my games by FedEx and within 5 days the money was in my Pay Pal account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:06:09.000Z",
          "Titre": "first time experience very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 25,
          "Date": "2023-10-19T11:52:12.000Z",
          "Titre": "A truly excellent service",
          "Contenu": "A truly excellent service; very fair prices and fast payments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CMS",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T03:50:47.000Z",
          "Titre": "Wonderful resale service!",
          "Contenu": "I was very impressed with the speed and efficiency of the itemization, mailing, review, and payout procedures. Top notch and very professional!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Bouwhuis",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T17:52:57.000Z",
          "Titre": "Easy!",
          "Contenu": "Easy!Easy to follow instructions! Happy to get a little money back and allow others to enjoy the movies and music."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L.E. Jackson",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T22:43:52.000Z",
          "Titre": "Easy Breezy",
          "Contenu": "I appreciate the ease of inputting the UPC, the communication via email with questions and the accessibility of the site through my mobile and computer.The turnaround of payment has been effortless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T02:46:08.000Z",
          "Titre": "Easy Process",
          "Contenu": "Great process from start to finish.  DVDs mailed on Monday and check issued on Friday.  Will be sending more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 6,
          "Date": "2023-03-23T15:21:11.000Z",
          "Titre": "I only sell to this company",
          "Contenu": "I only sell to this company.  They are always honest, dependable, and quick to pay.  They're great!!  Sell to them and you won't be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise  Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T14:31:16.000Z",
          "Titre": "It takes time to get your movies…",
          "Contenu": "It takes time to get your movies accepted and the average total but they pay and are honest thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T05:07:53.000Z",
          "Titre": "Great experience",
          "Contenu": "Eagle Saver made the process very easy.  I found the website very intuitive and easy to use.  The process was pretty simple and I got a few bucks for CDs that I no longer used and took up space."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T21:21:54.000Z",
          "Titre": "App is user friendly",
          "Contenu": "App is user friendly. Got our quotes printed off labels sent package got our money in 6 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margi Lane",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T19:04:42.000Z",
          "Titre": "They were fair and honest with me",
          "Contenu": "They were fair and honest with me.  I know they processed my shipment as quick as possible.  Instructions were clear and easy to follow.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer B",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T14:59:44.000Z",
          "Titre": "Fair services",
          "Contenu": "I did some shopping around and checked on quotes from other buyers. EagleSaver offered the most from the ones I looked into. It was a quick process and fair. I'll be using EagleSaver again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Higgins",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T18:36:14.000Z",
          "Titre": "Simple Process Efficient & A Great Way…",
          "Contenu": "Simple Process Efficient & A Great Way To Sell Your Used Books & DVDS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Stephenson",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:54:24.000Z",
          "Titre": "Sell cds",
          "Contenu": "I made some extra money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay  Erwin",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T06:30:36.000Z",
          "Titre": "Very fair on the quotes",
          "Contenu": "Very fair on the quotes, also your website is Awesome...Enjoy doing business with your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "maggie  von palmer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T04:58:40.000Z",
          "Titre": "Processing the books were easy",
          "Contenu": "Processing the books were easy. Packing in stuff sent to you and ship off. The rest is taken care of and I got paid within a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert CD",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T16:18:00.000Z",
          "Titre": "This was my first experience using…",
          "Contenu": "This was my first experience using Eagle Saver. Very pleased with the process."
        }
      ]
    }
  ]
}