{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.drivesolutions.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charolotte Jones",
          "Nb_Reviews": 4,
          "Date": "2021-06-06T00:43:23.000Z",
          "Titre": "I ordered the Dell Inspiron 5735…",
          "Contenu": "I ordered the Dell Inspiron 5735 (M731R) Drivers Recovery Restore Resource Utilities Software with Automatic One-Click Installer Unattended for Internet, Wi-Fi, Ethernet, Video, Sound, Audio, USB, Devices, Chipset.I expected a Boot up disk - which it is NOT.That information should have been included in the description.Plus it was NOT delivered when promised.Wasted my money and time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Ceasar",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T04:22:22.000Z",
          "Titre": "bad cancel",
          "Contenu": "bad. My card is broken"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Chris B",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T03:46:35.000Z",
          "Titre": "While customer service was A+..(before they freaked out) The drives are not",
          "Contenu": "While customer service was A+, the drive sent reports 100% usage at less than a MB/s transfer rate. By far the worst drive I have ever used. 1/600th of the max possible speed is sad. I understand that 600Mbps is sequential perfect world performance, but I get better results on any other drive, and this is an SSHD! Dissapointed to say the leastUpdate* drive solutions emailed me begging for a better review, and tried to justify selling bad drives. If I bought a lemon car from a car dealership, I wouldn't blame the manufacturer I would blame the company that chose to sell faulty hardware.Then, they decided to publicly say my hardware is the problem, not the drive they sent. Even if I had a hardware problem, this drive does not perform. You are a STORAGE company. If the STORAGE you sell is faulty, it's your fault. My review originally reflected on both the drive and the company, and I said the company is solid. I change my mind. Any company this desperate for good reviews on failing performance is sad. I do not recommend this company, and I will not return the drive because I'm confident they would just sell it again to another buyer while claiming it is functional. Overall, stop begging for better reviews, it makes you look bad and has convinced me to never recommend them again to anyone.The reply from the company implied that the products they sell have nothing to do with their company. I disagree. For another comparison, imagine ordering a pizza and it's delivered burnt to a crisp, and the pizza place says \"Well... Really you should be reviewing the flour from the company we bought from, it's not our fault it's bad!\" I really don't care if your company doesn't have perfect reviews, you obviously are begging/possibly bribing for good reviews and that's a you problem. Stop bothering me. Tired of companies desperate to look good at any cost. Just check their reply(if they don't change it). They believe that they are independent of the services they provide, but that's not how the world works.Once again, you selling bad product DOES reflect badly on you, and it's really not my problem to make you look better than you are."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Cooper",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T17:51:33.000Z",
          "Titre": "I haven't received my delivery and it…",
          "Contenu": "I haven't received my delivery and it is a week overdue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T01:12:11.000Z",
          "Titre": "Poor Quality Products",
          "Contenu": "I first bought from Drive Solutions over a decade ago and have been a returning customer since.  Recently I ordered a new SSD drive for my PC, duplicated my old operating system HDD drive and installed it on my PC.  The new SSD drive failed in less than 45 days and I was forced to purchase one from another source and reconfigure my system from scratch.  It seems the quality of the products sold by Drive Solutions is on the decline.  Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 3,
          "Date": "2016-10-21T20:30:37.000Z",
          "Titre": "no information on compatibility of products",
          "Contenu": "I purchased an SSD and an upgrade kit.  No information listed to inform me that the upgrade kit EZ UP3 can only be used for the drives that Apricorn.com sells. The two products I purchased were not compatible. Three days wasted trying to use both together, and I cannot return the product for a refund because I had to open the product only to find out they would not work together."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "David A. Bushnell",
          "Nb_Reviews": 5,
          "Date": "2016-11-04T21:49:55.000Z",
          "Titre": "Untrustworthy -- Order & Shipping Errors",
          "Contenu": "1) Order Desk sent Paypal Request to wrong email address, resulting in delayed order2)  Wrong item shipped to SE Asia3) USPS int'l rates are twice the normal official rates4) Impossible to reach customer service by 800 tel. Voice menu loops. Only email works but must wait at least 2 days for response5) I will sell incorrect item on eBay, and consider myself lucky to end the customer \"relationship\"AVOID - AVOID - AVOID"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda R",
          "Nb_Reviews": 8,
          "Date": "2016-08-11T15:49:11.417Z",
          "Titre": "Customer Service Does Not Respond",
          "Contenu": "I have tried for four days now to get in touch with a live person.  I've emailed, called and left messages but NO REPSONSE.  Just trying to get an RMA number so that I can send product back but they don't respond.  So, until they actually respond I am leaving this bad rating because their customer service is not deserving of anything greater."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed in AZ",
          "Nb_Reviews": 2,
          "Date": "2014-11-07T02:22:16.000Z",
          "Titre": "My 1st Order on Oct 27th Still Haven't Been Able To Contact",
          "Contenu": "My 1st Order on Oct 27th (msata ssd) and havent heard anything since the confirmation email. Tried to contact via phone (no answer - left messages never returned). Tried to contact via email - again no response. It is interesting that they requested me to fill out a satisfaction survey from a company that I Still Haven't Been Able To Contact! Paid with PayPal and will file a claim to get my money back!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stevanovic Milos",
          "Nb_Reviews": 1,
          "Date": "2014-08-30T12:39:46.000Z",
          "Titre": "Really bad!",
          "Contenu": "Got memory for my HP lap top. The one they sent was wrong, tried to call them and email them for 4 days and finally got one of them on the phone. Decided to return the item and I still have to pay the shipping both ways. So mistake was theirs all the way but I had to spend extra money for shipping. ... Really bad experience with them. Will never buy anything from them ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Q.",
          "Nb_Reviews": 2,
          "Date": "2016-02-19T14:13:18.740Z",
          "Titre": "Neither order nor confirmation email ever came.",
          "Contenu": "After submitting my order online, my order summary appeared on screen with a note that indicated I'd receive a confirmation email soon. It never came and my order never came, so after 17 days I sent an email cancellation request. Let's see if that disappears too. At least they did not charge my VISA card. Months ago I had ordered an item that came in good shape, but then I received no advertised email, either. Not acceptable business practice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John S",
          "Nb_Reviews": 1,
          "Date": "2014-12-23T01:35:01.000Z",
          "Titre": "Forget DriveSolutions if you think you might have to return something",
          "Contenu": "They were great on taking my order, accepting my money and delivering my product.\rForget it when it comes to returns. There's no packing slip, no return instructions in the box. The website instructs you to call or email to get the required RMA except they don't answer the phone, return their voice-mails or respond to emails.\rYou're basically stuck."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BEN W",
          "Nb_Reviews": 1,
          "Date": "2014-01-18T23:12:48.000Z",
          "Titre": "Re Apricorn registration only",
          "Contenu": "Tried to register product 3 times filling out long form that was out dated and very agrivating. Would not allow purchase date input beyond December 2013. Then when completed form submitted gave error message \"CAPATACHA CODE IS INCORRECT\" but did not say what the code was, then cleared form requiring start completely over from scratch. If Apricorn cannot write code for a registration form then their computer product quality is questionable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olatunji",
          "Nb_Reviews": 1,
          "Date": "2016-05-10T16:05:47.000Z",
          "Titre": "Very Bad Customer Service",
          "Contenu": "Customer Service is the worst I have never seen in my life, phone never get answered, if you leave a message, you never get a call back.  I bought an item from DriveSolutions and the item was returned and up till the time of this rating, I have not gotten a refund back.  I have sent several emails, but never responded.  This is a shady business.  If anybody want to proof me wrong, call their numbers.  Calls is always going in circle.  I will not recommend anyone doing business with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2016-10-24T22:07:08.000Z",
          "Titre": "Not what I ordered !!!!!!!!!!!!!",
          "Contenu": "Memory (ram) was not what I ordered!  I ordered  a name brand 2 X 4GB kit (PC2-6400) 800 MHZ SODIMM 200 pin for my HP G70 467CL laptop.What I got was two separate 4GB, by a no name non US manufacturer(Korean) inside two static bags within bubble wrap. Were is the 2 X 4GBkit and this it even compatible ????? What I received was two single4GB (PC2-6400)___ 666 MHZ not the 800MHZ I ordered.  Waitingon shipping Label to return this $200 dollar order.  I have work in thisfield for over 45 years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rafael",
          "Nb_Reviews": 3,
          "Date": "2017-10-06T21:49:26.000Z",
          "Titre": "Cannot get any customer support",
          "Contenu": "Cannot get any customer support, or talk with anyone regarding a replacement for a defective hard drive, do not buy here, I think they are a scam company. Tried calling their local phone, and recording that phone was disconnected, maybe packed their bags and skipped town. Will report them to the BBB."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristi Jackson",
          "Nb_Reviews": 1,
          "Date": "2015-01-28T16:58:27.000Z",
          "Titre": "Defective Product/No communication",
          "Contenu": "I ordered and received a defective product. I tried calling two different customer service numbers listed on the website but never could get a live person. So I tried sending an email to the customer service email listed on the account. That was five days ago and I still haven't received any kind of response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Messer",
          "Nb_Reviews": 1,
          "Date": "2014-12-04T21:51:56.000Z",
          "Titre": "Unreliable customer service",
          "Contenu": "After receiving my order,  I found that I was able to get my computer fixed under warranty.  I made multiple attempts by phone and email to get a return authorization number. I never received any communication back and now stuck with a part that I don't need.  I would not buy from them again."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Dominic",
          "Nb_Reviews": 1,
          "Date": "2015-11-28T19:09:52.119Z",
          "Titre": "Unfortunate !! I tried making a purchase",
          "Contenu": "Sorry\rI sent a query regarding my purchase on line got a reply. We are busy due to ...will need 48 hrs. Did not receive any reply but this query.. It is funny. I confirmed with my bank regarding the transaction which had not gone through. I am happy..!!!"
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "oral williams",
          "Nb_Reviews": 1,
          "Date": "2015-09-21T14:53:35.652Z",
          "Titre": "after sale service",
          "Contenu": "after sale serviice is extremely poor, i placed an order for a HDD ,I had no problems communicating with a sales rep before the purchase but when my item got lost in transit i had to be emailing their office to no avail\rreally poor"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2014-01-06T17:15:32.000Z",
          "Titre": "Nothing worked after placing my order",
          "Contenu": "I placed my order, tried to process using their paypal feature, it didn't work.\rI went back in and processed it using my\rcredit/ debit card, processed shipping two days @$13.50...two days later item still not processed or shipped. Tried to call... No answer... Left voicemail no response. Wrote an email regarding auto pilot system still no response.\rFinally canceled the order... Still no response.\rNow you have sent me a half dozen emails regarding my experience. \rIt's wasn't a good one and due to the fact they never processed my order maybe that's why they never had to cancel it.  No customer service equal poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OpByron Humestion",
          "Nb_Reviews": 5,
          "Date": "2015-02-13T21:07:08.000Z",
          "Titre": "What happened???",
          "Contenu": "Hi, I ordered a hard drive but, they never took money out of my account or sent me a hard drive. I sent an email but, haven't heard anything. It's like I'm dealing with a ghost company that isn't really there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 2,
          "Date": "2015-01-17T04:03:42.000Z",
          "Titre": "No customer service",
          "Contenu": "I bought the drive that they recommended for my machine. It didn't fit. Still waiting for ANY sort of customer service regarding whether they actually have one that fits. Repeated requests, it's been weeks. Terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "melissa",
          "Nb_Reviews": 1,
          "Date": "2013-08-14T17:49:45.000Z",
          "Titre": "Won't order through this company ever again.",
          "Contenu": "I followed all of the steps to find the appropriate hard drive for my mac- i'm not a genius but i can follow directions.  Oh wait- no directions.  If I knew that when i spent $150.00 on my hard drive that I'd have to go and pay someone else $150.00 to format it- I would have just had them take care all of it at the Apple Store.  DriveSoulutions should make it very clear all of the steps necessary to make their products compatible with your computer before you make your purchase so that the choice is yours instead of leaving you with a useless piece of hardware that flashes a question mark every time you try to self install.  Ridiculous and not worth the money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-06-05T18:21:58.000Z",
          "Titre": "They SUCK",
          "Contenu": "Ordered the wrong part.  No one answers the phone at any hour nor returns phone calls.  They lie about sending RMA number so you can return.  NEVER BUY FROM THEM.  Turning they in to the Better Business Bureau."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kira",
          "Nb_Reviews": 1,
          "Date": "2018-09-02T16:55:15.000Z",
          "Titre": "I was charged for a hard drive but…",
          "Contenu": "I was charged for a hard drive but never received it or any Communication on their part. I can't get through to anyone to find out why I was never shipped what I paid for. Absolutely ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARI",
          "Nb_Reviews": 1,
          "Date": "2015-10-26T21:26:35.846Z",
          "Titre": "REALLY  BAD CUSTOMER SERVICE!!!!!!",
          "Contenu": "I NEVER WRITE REVIEWS BUT THIS TIME I JUST HAD TO.  REALLY BAD CUSTOMER SERVICE. YES THE WEBSITE IS OK REALLY GOOD INFO ON HELPING YOU GET WHAT YOU NEEED BUT. REALLY BAD IN GETTING YOUR STUFF ON TIME. I HAD TO RETURN A HARD DRIVE AND I RETURNED IT IN AS SOON AS I COULD IN THE SAME PACKAGING IT CAME IN EVEN ADDED SOME BUBBLE WHRAP SINCE SEPTEMBER OK IT GOING TO BE NOVEMBER NEXT WEEK AND STILL HAVENT HEARD FROM THEM. I CALL NO ANSWER TO MY MSGS. I EMAIL AND NO ANSWER TO MY EMAILS. SO  THEY GAVE ME NO CHOICE BUT WRITE A REVIEW ON HOW BAD THEY ARE DOING WITH THIS SO CALLED SO CALLED DRIVE SOLUTIONS..... SOLUTIONS ON WHAT.   IM VERY UPSET WITH THEM NOT ANSWERING AT ALL. HELLO LET ME KNOW WHATS GOING ON WITH MY RETURN PLEASE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-04-05T02:34:23.000Z",
          "Titre": "Been waiting for an RMA...",
          "Contenu": "Shipped the product quickly but apparently not too keen to take it back. Waiting for over a werk for a response to my RMA request. Don't know if product works. Never tried it as need resolved."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MR SPUD",
          "Nb_Reviews": 1,
          "Date": "2015-07-07T19:53:10.602Z",
          "Titre": "ROTTEN PLACE TO ORDER FROM",
          "Contenu": "your shipping is ridiculous for an item wighs maybe 3 ounces, I will never place another order or even look at your products. Please take me off your mail lists, I don't need the spam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CPUbolts27",
          "Nb_Reviews": 1,
          "Date": "2015-08-14T07:33:10.724Z",
          "Titre": "STAY AWAY!!!",
          "Contenu": "I normally don't write reviews, but the horrible service received compels me to warn all potential customers to STAY AWAY!!!.\r I ordered a hard drive from DriveSolutions and found the site easy to navigate and the price to be acceptable. Unfortunately, the hard drive that I received from DriveSolutions crashed on me only hours after installation.\r Trying to get in touch with customer care to resolve the issue (via e-mail or phone) was extremely difficult. Phones go to voicemail and e-mails do not receive response. Eventually a service agent answered who was able to help with the return process. \r Defective item shipped back (on my dime), UPS confirmed receipt. No one answers the phone, no refund for the item.\r Do business with these people at your own risk.\rYour experience may be better, same token however, \rit may be worse."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-04-16T04:22:08.000Z",
          "Titre": "I ordered a drive",
          "Contenu": "I ordered a drive, they asked me how I would like it shipped and I have not heard anything from them since. I have sent several emails which have gone unanswered?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-05-23T10:05:48.000Z",
          "Titre": "Waste of time tbh fam",
          "Contenu": "Placed an order, something went wrong, ended up buying nothing? I don't know exactly what happened but they let me know that placed an order for no item at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William D. Benner",
          "Nb_Reviews": 2,
          "Date": "2014-01-07T23:45:16.000Z",
          "Titre": "They ripped me off.",
          "Contenu": "They sent me a cracked,broken hard drive.  I had to take it to a Staples to find that out.\rI will never again deal with these crooks or recommend them to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Baxter",
          "Nb_Reviews": 2,
          "Date": "2014-06-30T20:18:44.000Z",
          "Titre": "Waiting for a answer on my order",
          "Contenu": "Wrote a order on the 20th and have no confirmation of shipment or any other information.  Asked for information a couple of hours ago and nothing so far."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shelley Monkman",
          "Nb_Reviews": 1,
          "Date": "2015-05-05T01:12:11.000Z",
          "Titre": "TERRIBLE. i paid for an item. It was not sent.",
          "Contenu": "I have sent 4 e-mails. I called twice with no reply. The item by the tracking was never sent. I am still trying to follow up and/or get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-03-12T23:31:13.000Z",
          "Titre": "Where is it?",
          "Contenu": "Thank You, *********for your purchase on Tuesday, February 10, \r2015 at 04:52:05.\r----------------------------------------------------------------\rHere is what you ordered:\r Item Name                     Option    Item Price  Quantity        Item Total\r------------------------------------------------------------------------\renc30  EC-ST5B                            $28.50        1            $28.50\r------------------------------------------------------------------------\rSubtotal:                                                        $28.50\rTaxes:                                                            $0.00\rShipping:                                                        $10.00\rShip Via:                               Fed Ex Ground 1-7 Business Days\rTotal Price:                                                     $38.50\r No sign of this order as of 3/12/20015, went to the nether regions I guess. ???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2013-06-11T05:01:28.000Z",
          "Titre": "DO NOT PURCHASE FROM THIS COMPANY",
          "Contenu": "I ordered 1TB laptop disc drive and an external SATA case.  For $200, they sent me only the SATA case ($20 worth), and nothing else.  WHAT a RIPOFF!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "edwgre",
          "Nb_Reviews": 3,
          "Date": "2017-08-30T21:48:43.000Z",
          "Titre": "sent the incorrect drive",
          "Contenu": "sent the incorrect drive, I have email and called numerous times, no response, these guys used to be good but no more, they suck!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-02-19T00:24:22.000Z",
          "Titre": "bad service",
          "Contenu": "they sent me a bad hard drive, after calling four times for a refund they said they would send me a return label and still have not."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T08:44:38.000Z",
          "Titre": "Fake stock at the website."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JCSN",
          "Nb_Reviews": 1,
          "Date": "2014-02-23T02:55:55.000Z",
          "Titre": "Battery will not charge!!!!",
          "Contenu": "I purchased a replacement battery for my Lenovo Ideapad.  The battery will not charge at all.  It is now an expensive paperweight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2017-12-08T14:11:58.000Z",
          "Titre": "Never recieved the product ordered and …",
          "Contenu": "Never recieved the product ordered and never got a response from them when I sent an email for help on the matter."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "A.R:",
          "Nb_Reviews": 1,
          "Date": "2019-02-16T19:05:36.000Z",
          "Titre": "No answer to my question at all",
          "Contenu": "No answer to my question at all! - Listed item seems to be sold out without updating the HP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelsey, P",
          "Nb_Reviews": 1,
          "Date": "2014-04-24T15:14:55.000Z",
          "Titre": "completely dissatisified ,lost all my files",
          "Contenu": "I recently purchased a hard drive with an upgrade kit for notebook that advertised an easy gig cloning software with data select. I followed the instructions exactly as stated on the disc and received a \"completely successful\" message I followed the instructions as to how to disconnect and restart my computer. It was not successful and called the 800#. Their tech told me that the disc sent out was 2 years old and that I should go to their website and download the new version put out 2 weeks ago. I did and put it on disc. I tried that and have now lost all my files on my hard drive. When I called back and spoke to  someone in sales they agreed that the disc should not have been included with the kit and forwarded me to tech support. They advised me to retry the system but by then everything was already lost and there was no advice on what to do. The computer reads: operating system not found. I am now out the $55.00 for purchase and shipping of the kit and now need to purchase windows 7 professional to reinstate my computer and then deal with lost files. I have installed hard drives to my other computers with no problems, so to say I am completely disappointed is an understatement. I would strongly NOT recommend this product to anyone!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2013-06-19T20:38:56.000Z",
          "Titre": "waiting for my order",
          "Contenu": "I have not received my order or any word on it   two weeks and still waiting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 2,
          "Date": "2016-02-16T05:16:14.781Z",
          "Titre": "Not what I ordered and rude service!",
          "Contenu": "Their website showed I was ordering a 9.5 mm hard drive, but what I got was a 7 mm hard drive. Since the phone number to the company was NOT on the packing slip, I looked it up online and called about the problem. I was told that 9.5 mm thick hard drives stopped being made about two years ago and that the 7 mm hard drive I received would work fine. I let the customer service girl know that their website needed to be updated, since it showed a 9.5 mm size. \r I let the girl know about some other problems with the order and from the way she responded to me, I could tell she thought my concerns were silly! \r The other concerns were: \r 1. On the part of the invoice that was on the package and showed my mailing address - right under my name was my e-mail address and right under my mailing address, was my phone number! I don't appreciate my e-mail address and phone number being right there where the whole world can see them!!! It makes me think that this company is not being careful with my banking info either!!! I've never in my 56 years - had a company put my e-mail address and phone number right there on the package - where anybody can see them!!! (and I've ordered online a lot!)\r 2. The bubble wrap that my hard drive was in, was NOT taped at the ends!!!\r 3. Their phone number was NOT on the packing slip!!!\r Talk about NOT paying attention to detail! Well, these details have made up my mind to NOT order from them ever again! This was my FIRST AND LAST order with this company!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2014-01-07T16:11:27.000Z",
          "Titre": "Sad very very sad",
          "Contenu": "I still waiting for my parts to delivered to me Where are they?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dk",
          "Nb_Reviews": 1,
          "Date": "2018-04-17T03:40:35.000Z",
          "Titre": "Drive came DOA",
          "Contenu": "Drive came DOA. Seller doesnt respond to return request."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Hegarty",
          "Nb_Reviews": 1,
          "Date": "2013-04-22T21:23:16.000Z",
          "Titre": "CUSTOMER SUPPORT IS THE WORST I HAVE EVER ENCOUNTERED",
          "Contenu": "I WOULD NEVER BUY ANYTHING FROM THIS COMPANY AGAIN."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-09-05T02:25:56.377Z",
          "Titre": "Misleading info on the web site",
          "Contenu": "Wrong hard drives are listed for Vaio laptop"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-05-10T04:48:38.000Z",
          "Titre": "No package",
          "Contenu": "I didn't get my package bad business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bailin",
          "Nb_Reviews": 1,
          "Date": "2014-03-08T17:54:19.000Z",
          "Titre": "Not happy.",
          "Contenu": "Have not recieved my order"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "espinel",
          "Nb_Reviews": 1,
          "Date": "2014-06-29T21:31:45.000Z",
          "Titre": "what opinion_?",
          "Contenu": "never dispatch my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2014-01-27T17:13:01.000Z",
          "Titre": "It's doesn't work. I want a refund!!!!!!\"",
          "Contenu": "I want a refund!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T23:43:35.000Z",
          "Titre": "Wrong tracking #, dud HDD",
          "Contenu": "Was given the wrong tracking ID and had to contact to correct it. The HDD had bad sectors, so I wasn't able to get it going after fdisk/format/scandisk etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 4,
          "Date": "2020-11-06T17:11:01.000Z",
          "Titre": "I have tried 13  times to \"sign in\" to…",
          "Contenu": "I have tried 13  times to \"sign in\" to my account to check on estimated arrival of item I ordered.Your \"captcha\" screen is so difficult to read with your background that It always fails despite my USING a MAGNIFYING GLASS to try and read it correctly.I have never experienced such a problem B4. Perhaps you ought to consider reviewing it and either changing the background or the font. The two are, in my humble opinion, incompatible. If there is some other explanation I would be interested in hearing about it.F. Green"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "OSA",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T18:12:48.000Z",
          "Titre": "Very disappointed",
          "Contenu": "It was not until I wrote to customer service that you provided shipping information. It seems that you sent the order until I remind you if you had already sent it. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2020-05-25T18:38:39.000Z",
          "Titre": "You were much easier to deal with…",
          "Contenu": "You were much easier to deal with before you started with the\"Password\" nonsense and sign in pages. It told me my password was invalidand made it impossible to sign in so I had to do it as a guest.                                                                   David Waite"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2020-07-17T11:03:51.000Z",
          "Titre": "Go back to your old website",
          "Contenu": "Go back to your old website. Easier to pick theproduct I want and fewer pages."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Oswaldo",
          "Nb_Reviews": 2,
          "Date": "2018-09-02T19:41:44.000Z",
          "Titre": "Bad Experience ...",
          "Contenu": "Order DSI46739527 never reached its destination, I contact customer service and they did not give me a solution, even though they put a complaint to the postal service. I still await an answer .. as well as the order.Last week the order DSI93793286 was paid, I still do not receive any notification that it has been sent.I hope there is someone who can help me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2018-04-13T20:20:57.000Z",
          "Titre": "Appalling packing.",
          "Contenu": "For people who deal with shock sensitive products, I found the condition of the packing appalling. The hard drive cam in a box with bubble wrap, however, although they shared the same box, the drive was not wrapped in the bubble wrap and was DROPPED by FedEx on the front porch. I didn't know with who, I should be more angry with, FedEx or DriveSolutions.com!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T20:38:18.000Z",
          "Titre": "Order placed on 1/18 still not received …",
          "Contenu": "Order placed on 1/18 still not received today 1/29.  Spoke to representative and notes were not updated on sale of initial rejected Discover card charge, which was reprocessed and charged appropriately within an hour.  Due to sales or accounting notes not being updated, the shipment was not processed.  The Representative just told me that they would try to ship it out 2 day shipment for the inconvenience. This was my first order with your company.Barry Conover"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Option",
          "Nb_Reviews": 2,
          "Date": "2017-03-11T19:33:28.000Z",
          "Titre": "Programme is clunky",
          "Contenu": "Program requires you to attend it as it functions.  It is slow processing instructions and there is no way to skip bad sectors on the original drive.  As a result I am about to attempt to run the program for the fourth time as it has hung all three of the previous attempts.  So the program seems to be both annoying and essentially useless.  Too bad the original Ghost program has been around for about 30+ years.  Any version of it should be bug free."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 3,
          "Date": "2015-09-17T21:16:46.390Z",
          "Titre": "product arrived as promise not technical support!",
          "Contenu": "product arrived as promise.  After transfering old drive image over to new drive the new drive would not boot.  Send email to technical support and received automative reply about high support demand answer may take 24 to 48 hours.  It has been well over 48 hours with not response.  bottom line, don't expect support from this vendor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "neal krakow",
          "Nb_Reviews": 1,
          "Date": "2015-09-25T03:10:10.461Z",
          "Titre": "no support",
          "Contenu": "I was thinking about a new drive for my laptop. and saw good reviews on drive solutions, so asked questions by email and got a 2 day response, not to bad. purchased a drive and installed it. the new drive was slower than my old drive, I figured something was wrong because this was an ssd. sent 2 emails to customer support about the problem, then called and got put on indefinite hold. laptop really sucks now. buy directly from Seagate, your better off and you'll save 20 bucks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2013-09-12T21:34:40.000Z",
          "Titre": "Poor Customer Service Response",
          "Contenu": "I expect when I work with a business that they will work to exceed my expectations. In my interaction I needed to return a product. The Return authorization took a call. The item was shipped back and it took me more calls to actually get the credit processed.\rIf you focused more on customer service, answering calls, emails the customers might stick with your company. I liked the purchase experience unfortunately the return experience was a slow/bad experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael",
          "Nb_Reviews": 1,
          "Date": "2013-06-04T15:25:04.000Z",
          "Titre": "note worth the trouble",
          "Contenu": "i bought a hard drive on line.  as i write this review i am still waiting for the unit.\rthere processing of orders needs to be revamped. so if and only if i received the \rhard drive will i consider another review. until then i guess i will purchase another \rfrom another source. so beware of this site . you might not get your stuff."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2014-01-14T02:49:46.000Z",
          "Titre": "the drive was wrong and the sevice was slow to deliver",
          "Contenu": "I order a hard drive for my laptop computer and received a hard drive for a desktop computer. The hard drive order was slow to be processed and delivery ti me was slow. I ordered a data transfer kit from another company after ordering the hard drive. The kit was delivered in 2 days and the hard drive was delivered about 1 week later. In would still like to give them a chance to get my order correct. 1T laptop hard drive for a Compaq Presario CQ50-110US. Are you able to correct the order?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T05:42:42.007Z",
          "Titre": "Lousy response time.",
          "Contenu": "I placed my order 10 days ago.   I received a very prompt acknowledgement of the order.   Then nothing since.  It has not even shipped yet which is annoying as I paid a bit extra for faster shipping.  I guess from reading the page carefully when it ships it will ship faster but that has nothing to do with when, if ever, they decide to ship it.  This is also running out the warranty which runs from the date of order not when I receive it.   I would definitely hesitate to order from this company again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-05-26T20:17:45.499Z",
          "Titre": "THEY DON'T ANSWER THEIR PHONES",
          "Contenu": "HAD QUESTIONS REGARDING MY ORDER, PERHAPS NEEDING TO CHANGE IT. TRIED SEVERAL TIMES - THEY NEVER ANSWERED. IS THERE ANYBODY THERE AT ALL?\r NOW I HAVE FOUND MY ANSWERS FROM OTHERS.\r I NEED TWO 4 G CHIPS......\r SO I BOUGHT ELSEWHERE FOR A PAIR AT $70 INSTEAD OF ONE AT $60.\r GO FIGURE."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Customer!",
          "Nb_Reviews": 1,
          "Date": "2017-12-24T20:40:56.000Z",
          "Titre": "I had trouble getting hold of a person …",
          "Contenu": "I had trouble getting hold of a person to get my questions answered. All I kept getting was a recording that wanted me to leave a call back number.  When I finally did reach a person, they couldn't answer any of my questions. After talking to 3-4 people I finally got to talk to someone that tried to help me. I was told that I would get a call back when this person got an answer to my question, but I did not!Over all, the communication and help was very poor. I did finally receive the item that I ordered and the item worked fine. It was just a struggle getting to that point!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Fischler",
          "Nb_Reviews": 2,
          "Date": "2016-11-29T21:30:17.000Z",
          "Titre": "Disappointed!!!",
          "Contenu": "EZ Upgrade did not do the job. I tried twice to copy my old hard drive to a new hard drive. The first time I waited over 26 hrs for the program to finish it concluded \"clone failed\".  This was using verify, it stopped at 49% complete and never moved for all those hours. The second time I turned off the verify control and it took over 7 hours to run the program and still concluded \"clone failed\".Then the program report asked to check file and sector errors before attempting to clone again. I have no idea how or where to check for file and sector errors."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick F.",
          "Nb_Reviews": 1,
          "Date": "2014-06-26T23:03:33.000Z",
          "Titre": "Product didn't work...cuts service very poor",
          "Contenu": "I had issues with the product and tech support was of no help...they told me to call the manufacturer.  I did that and they determined that the drive that had been shipped to me was defective.  After numerous calls back to Drive Solutions, I requested a return and was provided an RMA & sent the drive/software back at my expense.  I then sent 3 emails to customer service and left two messages...no response.  After two more full weeks, they provided only a partial credit.\rI will not purchase from this company again and would encourage others to look elsewhere.  This is not a quality company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert A. Maine",
          "Nb_Reviews": 2,
          "Date": "2015-02-04T23:48:38.000Z",
          "Titre": "Misleading website & insured won't cooperate for mdse. return.",
          "Contenu": "Dba DriveSolutions  website claimed to have the right hard drive for every computer (with a exhaustive listing of PC's to match).  Turns out that the drive offered didn't match my Lenovo notebook machine (--as not all of the drive specs were listed on the drop-down describing the drive). So, tried to return the drive within the required 30 days.  Neither their sales nor \"Cust Svce.\" lines would respond, despite several msgs. left.  2 E-mails to request a return authorization completely ignored. Finally turned to VISA card cust. svce. to dispute charge 2 days ago (last resort).  No response YET from vendor. Whew!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2016-03-15T23:27:04.000Z",
          "Titre": "Surprise and Beware!!  Theyll ship you used junk drives",
          "Contenu": "I had to replace an internal HDD that failed in a Panasonic Toughbook, and easily found an in-stock 80GB replacement.  The HDD listing said nothing about new, used,reconditioned, and their FAQs section states:  . . . all our drives larger than 30GB are new. . . , so I paid the $115 for the drive.  I was disappointed to receive a battered, used drive, with old user-applied labels half-peeled off, and some guys name scrawled on it with Sharpie, then erased with solvent, along with part of the serial number. Definitely not NEW and not a confidence builder for a critical laptop! It would have been nice if VERY USED had appeared in the item description before I made my decision.  Buyer beware!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trevis Williams",
          "Nb_Reviews": 1,
          "Date": "2013-04-19T07:32:40.000Z",
          "Titre": "Outdated and Dysfunctional",
          "Contenu": "I tried ordering a laptop harddrive for a friend and the site user-interface is so old and outdated that it made this a chore. What I was trying to do required me to use my Billing address, and their shipping address. Each time I tried to confirm payment after entering credit card information, there was an error.\rApparently, the billing and shipping address cannot be different on this site.\rTurns out this error was void, because the part was actually ordered, but I had already went elsewhere thinking I had failed to order. Then it was return for refund shenanigans from there. \rSo  I'll stick to Crucial.com.\r By the way, the Customer Service Rep seemed to have an attitude"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rene",
          "Nb_Reviews": 1,
          "Date": "2018-06-12T11:48:06.000Z",
          "Titre": "frustrating and confusing....",
          "Contenu": "The idea of packaging the adapter with Apricorn software is great on your end, the adapter is really nice but the disc with Apricorn software is the most confusing thing I have encountered in years!I run 5 computers with Gentoo-Linux and I am used to tinkering but this was very frustrating.I ended up downloading software from Amazon and clone my hard drive.The instructions go on and on about all kinds of things but should be much shorter and to the point.Following step by step instructions was not possible because it didn't apply to the software.Right from the first step it went wrong. There was no .DMG icon on the disc but there were 12 read-me files that were tightly written and take forever to go through and understand.I could go on and on but will not have the space here.This is not for me, sorry!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cheers",
          "Nb_Reviews": 1,
          "Date": "2013-10-20T19:47:41.000Z",
          "Titre": "Cannot trust the Hard Drive selection Tool",
          "Contenu": "I purchased an overpriced hard drive for my laptop using the selection tool provided on the website to ensure I would not have any issues with compatibility. I even purchased the same enclosure recommended on the site to clone my hard drive, but hold and behold, they sent a unit that was not compatible. I made some research to make sure I was not just being stupid, finding three different methods to clone the unit, but after calling technical support and explaining the situation I was only given options I had already tried. Had to call the HD manufacturer directly to realize there was no way around the issue. Now I am too far down the line to return the unit. Got stuck with it and am yet to figure out a solution. Will have to purchase new OS and install everything in the new HD and hope it will be the end of it.\rSad story."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gregory tootle.",
          "Nb_Reviews": 1,
          "Date": "2015-03-17T10:12:52.000Z",
          "Titre": "still right where Iam .a no running computer.",
          "Contenu": "I cannot get my computer to boot up.It keeps asking for a boot disc.Here Iam ,spent 155.00 and a incomplete hard drive boot.Any suggestions?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-06-04T19:29:22.000Z",
          "Titre": "Did not like shipping",
          "Contenu": "For what i paid for shipping,an not getting it like i was suppost to in the time that was stated is a croc. Did not like my experience."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Customs",
          "Nb_Reviews": 1,
          "Date": "2017-06-22T00:02:42.000Z",
          "Titre": "Custom fees",
          "Contenu": "I wasn't advised that I was going to pay customs fees (25$). Very disappointed, asked for a credit. No one answered my email."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jsobry",
          "Nb_Reviews": 1,
          "Date": "2015-10-30T19:10:49.595Z",
          "Titre": "Very hard to decide on which Hard Drive to purchase.",
          "Contenu": "There was a mixup due to a lost email.\rWhen I called I got excellent service and the matter was immediately resolved. Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-10-26T15:11:45.229Z",
          "Titre": "DirveSolutions HDD Purchase",
          "Contenu": "The HDD should be provided with mounting screws, regardless of the additional mounting hardware that may or maynot be purchased."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Douglas Stidham",
          "Nb_Reviews": 3,
          "Date": "2013-11-09T13:17:11.000Z",
          "Titre": "Where is my order?",
          "Contenu": "I ordered an external 500GB drive on 11/02/2013. No contact on shipment confirmation. Ship my drive or return my money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 2,
          "Date": "2013-09-09T02:25:06.000Z",
          "Titre": "One week and no product as yet",
          "Contenu": "No product as yet and no confirmation from drivesolutions regarding our order!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S Porter",
          "Nb_Reviews": 1,
          "Date": "2017-01-10T18:22:09.000Z",
          "Titre": "I ordered one hard drive and you charged me for two.",
          "Contenu": "I received no help from your customer service department."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "aylor my name is not aylor it is taylor thanks gord",
          "Nb_Reviews": 1,
          "Date": "2014-12-11T15:17:44.000Z",
          "Titre": "what seems to be the holld up you have the propper numbers for my card they are again 04/20",
          "Contenu": "i am in need of the drive please send it to me k gord"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-11-22T02:47:53.662Z",
          "Titre": "Wrong order",
          "Contenu": "I got the wrong order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-06-07T03:10:16.000Z",
          "Titre": "TARDS",
          "Contenu": "TARDS. VERY BAD."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Penniston",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T03:56:23.000Z",
          "Titre": "Have not received anything yet!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marc Levante",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T19:41:53.000Z",
          "Titre": "Ordering was easy but web site crashed and no email confirmation",
          "Contenu": "Ordering was easy and smooth. I am a new customer and your web server crashed when creating an account. So, I can't create an account. Also, it's been half hour and I don't have confirmation of the order"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "robert rodriguez",
          "Nb_Reviews": 2,
          "Date": "2020-02-26T04:07:40.000Z",
          "Titre": "Came with no screws and device wasn't firmly secured in packaging",
          "Contenu": "For now, I'm giving the product I ordered three stars since I haven't installed the hard drive yet because it didn't come equipped with screws! I don't have any tiny screws laying around that will fit. So now I'll have to go on a wild goose chase to find anywhere that sells tiny screws before I can finally install and test the hard disk drive (hpdt68 DT-SATA2 4 TB 5900 RPM). Besides that, I do give Drive Solutions credit for the fast shipping. I was a little disappointed that the hard disk drive wasn't firmly secured inside the box it was shipped in so I hope the drive wasn't damaged. Of course, I won't know until I install the drive...once I find the tiny screws...a store that has them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T01:38:00.000Z",
          "Titre": "Ordered drive but never received it",
          "Contenu": "Ordered drive but never received it.  No shipping information either.   Emailed, no response.  Called 10 times during business hours but message says call back during business hours.  Never again.Update 11/8. I did get my drive. Lesley from Drive Solutions was very diligent and helpful to get me  my drive. She was very professional and took care of the problem.  The reason I didn’t get my drive originally was that it was shipped to the wrong address. That was not DriveSolutions fault.  However, if I would have gotten shipping information sent to me after the order, I would have been able to find this out sooner for myself. Secondly, after not receiving the drive or shipping, I did email twice and didn’t get a response.  And I did try to call many times during business hours, and the message always said call during business hours.  I got my drive thanks to Lesley.  I don’t like writing bad reviews, but I have to say, I don’t know if I would have ever gotten a response had I not done so.  Anyway, I’ll rate a little higher because of Lesley, but there were still issues getting hold of the company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carl B.",
          "Nb_Reviews": 9,
          "Date": "2020-04-26T17:36:34.000Z",
          "Titre": "Disappointing Data Transfer Info",
          "Contenu": "Not enough information about data transfer kits and drives. Your site tells me that my Dell Precision Desktop T3500 can use various SATA 3.5\" drives, so I assume that's what's in my computer. But your one and only desktop data transfer kit says it transfers data using a USB connection to any 2.5\" SATA drive. Not a 3.5\" SATA drive. Why not?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AP",
          "Nb_Reviews": 1,
          "Date": "2020-04-05T22:00:46.000Z",
          "Titre": "I don't order drives that often",
          "Contenu": "I don't order drives that often, and I wish you had clearly stated \"does not ship with drive caddy.\"  Other than that, it came fast (with standard shipping), it worked, and the price was okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffery Gavrock",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T14:24:49.000Z",
          "Titre": "It worked pretty well but many updates…",
          "Contenu": "It worked pretty well but many updates you have to install manually and they still haven't worked. Some of it my fault because it's an older desktop and haven't used it in many years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T03:48:09.000Z",
          "Titre": "Slow out of the gate",
          "Contenu": "Slow out of the gate - took way too long from the time I placed my order to the time it was shipped. Good selection of hard drives for my laptop and reasonable prices, though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Fry",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T15:50:05.000Z",
          "Titre": "Well as navigation goes",
          "Contenu": "Well as navigation goes. The website is spot on. As shipping goes it says 2 to 3 day to get here. Still hasn’t showed up yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-06-20T15:47:32.000Z",
          "Titre": "Great Place to shop, decent experience",
          "Contenu": "Good overall experience, but the online shopping experience needs some work.  Once the order is placed, there is really no follow up, no where on the site to check on the status of your order.  Only way to get any updates is to email them, but it usually takes a day or two to get any feedback.  Would be nice if you could check the status of your order on line."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dick Geist",
          "Nb_Reviews": 5,
          "Date": "2015-02-02T17:20:41.000Z",
          "Titre": "Good Service - Despite Hassles and extra cost",
          "Contenu": "I had problems using their website with PayPal, but after switching to a credit card it all worked.  But then I found 3 emails from them for my order(s).  Did I have 1 or 3 drives ordered?  Had to call to check.\r Then HD arrived dead.  However a phone call got a quick shipment out to me of a new working drive and an RMA#.\r However I had to pay the $9 postage to ship the first defective drive back to them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BobbyT",
          "Nb_Reviews": 4,
          "Date": "2017-08-21T02:12:07.000Z",
          "Titre": "Have a BIG selection of hard drives",
          "Contenu": "Have a BIG selection of hard drives, but there is almost no helpful info available. I bought what I thought was a new hard drive for a laptop that I was given, whose hard drive had failed.It would not fit; I wrote to them and they wrote back saying I simply had to fit the drive into the old caddy - DUH, no one is THAT stupid (I hope).I wrote back asking if they could supply such, but got no response.I have since found a caddy AND CONNECTOR on ebay, which I HOPE will work."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gord H",
          "Nb_Reviews": 1,
          "Date": "2015-07-09T00:08:14.124Z",
          "Titre": "Wrong Part",
          "Contenu": "I ordered a 160 GB Toshiba Hard Drive but I just received an 80GB Hitachi hard drive and charged the full amount.  I just went to the website and clicked on the 160 GB drive item again and got the same part number, so I did not make a mistake.  I will install this Hitachi drive soon and if it truly only is 80 GB than I will ask for some refund but have little hope for that (they did not return a phone call).  Maybe avoid this website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2015-06-29T03:30:41.745Z",
          "Titre": "Excellent solid state drive, poor EZ Gig cloning software",
          "Contenu": "The new laptop solid state hard drive proved to be excellent. But the EZ Gig software for cloning my Windows 7 system was problematic. After repeated failures tech support directed me to another cloning software product from another vendor which eventually worked.\rI'm very happy with the solid state hard drive but very disappointed in the cloning software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 2,
          "Date": "2014-04-03T08:12:53.000Z",
          "Titre": "Hitachi Hard Drive a perfect fit",
          "Contenu": "I hard to replace my laptop hard drive and came across the DriveSolutions.com site. I was impressed by the selection immediately and found what I needed by brand and even found one with a higher rpm rate than the original. I chose Hatachi because it was the original manufacturer of my old  SATA drive. Regular shipping took 5 days but the price made it worth it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P.S.",
          "Nb_Reviews": 2,
          "Date": "2015-02-10T18:24:13.000Z",
          "Titre": "Incompatible Hard Drive",
          "Contenu": "I easily ordered and subsequently bought a new hard drive for my laptop, which was listed as being compatible, but it was not. I tried calling about the issue, but the phone number they left in their auto-response email didn't even work. However, I was able to talk to someone by email and she was very helpful. I would rate higher if I could've spoken to someone by phone one of the several times I tried calling. Go email if you have questions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay Stainbrook",
          "Nb_Reviews": 1,
          "Date": "2014-12-19T17:24:51.000Z",
          "Titre": "Hard drive Blues",
          "Contenu": "I ordered my hard drive off the website. The one I received was not the same one I ordered. I seemed to be compatible with my computer, but I had a few questions about it before I installed it. I called, I had to leave a message for them to get back to me. No one ever called back. The customer service is definitely not up to par."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Byrd",
          "Nb_Reviews": 1,
          "Date": "2015-05-17T19:57:56.000Z",
          "Titre": "Chart great but clone product a dud for a Mac",
          "Contenu": "I bought my HD upgrade from your site because of the detailed chart on which disc works for which model of each computer/laptop. It gave me confidence I was buying a HD that would work.\rAlso bought the EZ-UP-UNIVERSAL-B kit for cloning old disk to new. It had software for cloning on PC/Windows. I have a MacBook. For Mac it gave directions to use the Mac Disk Utility restore function. Directions were out of date (i.e., didn't work for current version of OS-X) and their tech support didn't help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 6,
          "Date": "2013-09-20T23:12:13.000Z",
          "Titre": "If at first you do not succeed.........",
          "Contenu": "I ordered a hard drive for a laptop and a \"clone making\" kit. Three days later I found a letter in my \"spam\" filter telling me that two days earlier my credit card had come back \"not valid number\". I tried for a half a day to call, but just sat \"on hold\" for an hour at a time.\rFinally, four days after the initial order, I ordered again. This time the hard drive and transfer kit was shipped. After I received it, every thing worked just fine. Laptop good as new.\rGlenn Heard"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2013-09-28T20:39:25.000Z",
          "Titre": "Pins and Needles",
          "Contenu": "I have yet to receive a confirmation email after a week of ordering. I have found everything that I'm looking for, I just hope I get it. Once I get my products, my opinion might change, but as my header says, sitting on pin and needles."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pollack",
          "Nb_Reviews": 5,
          "Date": "2014-10-22T01:01:30.000Z",
          "Titre": "Never returned my phone calls or emails",
          "Contenu": "I tried to contact customer support several times, via email and by leaving a phone message and you folks never got back to me -- very disappointing. On the other hand, excellent website and super prices. Quick delivery of my order"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lowe",
          "Nb_Reviews": 1,
          "Date": "2014-07-01T08:13:31.000Z",
          "Titre": "Product works fine but shipping was very slow.",
          "Contenu": "I ordered a replacement hard drive for my laptop as the original one was damaged.  Received the drive, installed it and reinstalled software.   Everything seems to be working perfect.\r My one and only issue is that when it came to the shipping selection.  There was no info as to where this product was being from, at least not that I could see, so I chose the cheapest method (FedEx Ground).  After FedEx picked up the package and sent me a tracking number I was able to see the item was being shipped from CA and would take a full week to get to me in NY.  Had I known where the product was being shipped from I would have chosen Priority Mail for a couple extra dollars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cooper",
          "Nb_Reviews": 1,
          "Date": "2014-07-12T22:43:08.000Z",
          "Titre": "Only on line orders?",
          "Contenu": "Called several times to place a phone order but got a recording.\rI did manage to order online though.\rI believe you tried billing my Ralph (bro) twice for this order?\r(He paid with his CC not I.) \rThe parts worked OK."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-02-24T14:13:08.000Z",
          "Titre": "Toshiba Hard Drive",
          "Contenu": "So far good, it's what I ordered. My only complaint would be with shipping. Paid extra for 2-3 day shipping. Received on day 5. I know it may be out of your hands, but the shipper (USPS) not honoring it. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob L.",
          "Nb_Reviews": 1,
          "Date": "2016-06-11T17:08:32.000Z",
          "Titre": "Failure to ship per stated policy",
          "Contenu": "Ordered items 24 May 2016 before 10 AM. Paid $16.50 for PRIORITY MAIL shipping in order to have items ( HDD and Memory Cards ) by the weekend. Shipping policy states orders before noon ship the same day.Received notice from USPS of items shipped on 31 May 2016, a FULL WEEK AFTER ORDER DATE ! Received items on 3 June 2016, a week after I needed them ! There was no communication from DriveSolutions as to out of stock or other reason for a delay. So I got FLEECED paying for 2-3 day shipping ( The Post Office met their obligation ) and Receiving GROUND SHIPPING TIMELINESS ! Products are installed and working fine BUT the SERVICE IS NOT AS ADVERTISED ! I WON'T BE ORDERING AGAIN as long as there is another option ! Thank You."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2016-07-03T21:42:10.000Z",
          "Titre": "Not a stellar experience",
          "Contenu": "Ordered an SSD drive and an adapter.  SSD drive arrived but without the adapter.  Called, and they acknowledged the problem and immediately shipped the adapter.  However, they shipped the wrong adapter."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-08-18T16:33:23.532Z",
          "Titre": "HDD didn't work",
          "Contenu": "I received the SSHD and unfortunately it didn't work. But i was assured that i will be receiving a new SSHD so when i get it, i will update and tell in-depth about the experience. Thank You."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sylvia",
          "Nb_Reviews": 1,
          "Date": "2013-11-14T21:27:04.000Z",
          "Titre": "order please!",
          "Contenu": "I ordered a hard drive about a week ago but have not heard anything; no tracking no or confirmation of order from driversolutions; just that the order has been placed from Paypal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2013-08-15T16:55:06.000Z",
          "Titre": "Good news, bad news",
          "Contenu": "The Good: I had ordered two disk drives. Their prices were a bit higher than another distributor but the free shipping more than compensated for the difference. The order was placed on backorder and were shipped within 3 working days. Overall the time between ordering and receipt was less than a week. Pretty good.\r The Bad: Our SPAM filter uses \"greylisting\" to block unwanted email. It does this by delaying receipt of senders not recognized. Normal senders resend withing a couple of minutes; spam senders do not. DriveSolutions' mail server acted like a spammer and never attempted to resend the confirmation email.\r The Ugly: I called DriveSolutions 4 times leaving a message each time requesting confirmation of the order. No response. The 5th time I got lucky and connected with a human who very polite and helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "San Martin",
          "Nb_Reviews": 1,
          "Date": "2014-03-18T22:47:21.000Z",
          "Titre": "good products but delivery takes too long",
          "Contenu": "have ordered before and have been happy w/ products. this time its been a week & I am still waiting for my hard drive. might be tempted to use Amazon next time!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2013-06-12T17:57:18.000Z",
          "Titre": "Distrubed",
          "Contenu": "I had used the web site to find a hard drive for my laptop not knowing the specifics of the hard drive only my laptop. With what I found on the help find a hard drive, I ordered the drive. Ordering and delivery was exceptional. When I tried to install the drive, I found that the connector was the wrong type. I needed a PATA 44 pin connector and what I received was a SATA connector. I contacted Sales/Customer Service via E-Mail for a RMA and help in getting the hard drive I needed for my laptop. It’s now been 72 hrs later and I still have not heard from either of them for an RMA or suggestion on a hard drive, I'm a bit disturbed. I will attempt to call them to try and speed my request. I did receive an automated response that said it might be up to 48 hrs for a response, other than that the only other thing I have received was this “Voice your opinion” which I am doing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2020-03-07T19:25:15.000Z",
          "Titre": "I got the wrong hard drive",
          "Contenu": "I got the wrong hard drive, I ordered 750 gb and got 1 TB."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marvin leto",
          "Nb_Reviews": 2,
          "Date": "2013-12-16T15:13:09.000Z",
          "Titre": "good product did not get the shipping i ordered took almost a week when ordered 1 to 3 day",
          "Contenu": "the  product was good and came packed to achieve max protection from damage \rHowever the shipping did not live up to what i paid for  \rAll in all  ok"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Hunkins",
          "Nb_Reviews": 1,
          "Date": "2014-10-22T20:49:55.000Z",
          "Titre": "Service lacked a little bit.",
          "Contenu": "The website indicated that an email will be sent when the package is being shipped. Did not receive the package but the package was received."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2017-06-26T22:54:53.000Z",
          "Titre": "Mixed billing and shipping postal codes",
          "Contenu": "When I ordered my new HDD Drive Solutions emailed me an order confirmation email where all the information was correct. What they didn't do was forward the information correctly to the deliverer; they gave the deliverer the postal code for my shipping address instead of my delivery address and I didn't catch it until the day of delivery. My order, which had 2 day delivery didn't come until 5 days later (one of which was a Sunday, so that's a bit forgivable). If you do order from them make sure that all your information is correct on the deliverer themselves or you may run into the same problem I did.Tl;Dr the hard drive was ok, the delivery was not.Edit: A representative got back to me, apologized for the mistake, and offered a refund for the delivery. I do appreciate that Drive Solutions refunded me my delivery charge, but it's frustrating all the extra time I had to both wait for the delivery and to deal with this afterwards. They did all they could to make things right and, again, I appreciate what they did."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-12-15T21:16:28.612Z",
          "Titre": "Hard drive shipping",
          "Contenu": "Hard drive I ordered came as requested but there was no ntification of shipping email as advertised.  Overall good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T02:40:41.000Z",
          "Titre": "Paid for next business day delivery",
          "Contenu": "Paid for next business day delivery, it took 2 days.  Asked for a partial refund with no response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brad H",
          "Nb_Reviews": 1,
          "Date": "2015-01-15T01:33:45.000Z",
          "Titre": "Hard drive returned",
          "Contenu": "I did not receive my drive due to Fedex returning my product back to your warehouse."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2017-07-01T13:47:13.000Z",
          "Titre": "Paypal portion of website did not work …",
          "Contenu": "Paypal portion of website did not work properly."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2015-11-22T15:55:27.964Z",
          "Titre": "I have order a 7200 rpm hard drive they sent me a 5400 rpm",
          "Contenu": "It was to complicated to return an re-order"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Schnee, Canton GA",
          "Nb_Reviews": 1,
          "Date": "2015-01-08T03:55:31.000Z",
          "Titre": "Delivery was good, follow-up questions were never answered.",
          "Contenu": "I ordered a 2 TB SATA drive \"compatible\" with my wife's Dell Laptop when there were signs of imminent disk failure on December 21, 2014.  It arrived promptly a few days later.  Drive Solutions' FAQs told me that there was likely to be a small interposer between most laptops' drives and their disk interface itself.  That was a great help when I saw that it needed to be taken off the old drive and put onto the new one before installing the new drive.\r I had many questions about their software offering to help in migrating the data to the new drive, so I e-mailed Drive Solutions with them, but I immediately got a reply that advised me to phone them because it would take several days to get a response from their technical support team by e-mail.  It is now 16 days later and I STILL have not gotten an answer to my e-mail. That's not very good customer service.\r Also, their phone system SUCKS big-time! I could not get through after 3 work days of trying (about 50 times), so I started looking elsewhere for answers.  Eventually, I found the manufacturer of the gadget that Drive Solutions offered, and then found a number of choices from Apricorn including the full manuals for the Apricorn software and a hardware gadget which I eventually bought (one of the Apricorn offerings) and tried using it to migrate the data.  Nobody and nothing ever told me that the Apricorn product (interface, software and enclosure) could NOT handle a situation where even ONE bad sector existed on the source drive.  At least Apricorn DID answer their phone (on my FIRST try) and I got the lowdown on that problem but only after wasting 3 full days trying to make the product do what it was NOT going to ever do.\r I did eventually got all the content onto the replacement drive (another WEEK of time, gone) but only because I had a recent Windows \"System Save\" on an external hard drive, a Dell Recovery disk, an installable DVD with Dell's OEM version of Windows/7 and an up-to-date backup of ALL the data files on separate external hard drives.\r This is not for the faint-of-heart, but a data recovery vendor may not have the patience I did and, if they tried at all, would have cost MUCH more money that I eventually spent or just have said \"too bad\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SC",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T22:45:42.000Z",
          "Titre": "Above Fair",
          "Contenu": "Had to modify the tray sent but it all worked out"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Jose Calcerrada",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:06:31.000Z",
          "Titre": "Easy drive search and ordering  process",
          "Contenu": "Searching for the right HD upgrade for my laptop was easy. The ordering process was also easy and the price was great. Didn't give 5 stars due to not receiving an order confirmation email. Did get an order shipping notifcation email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sony Nguyen",
          "Nb_Reviews": 3,
          "Date": "2019-11-13T04:18:05.000Z",
          "Titre": "Very organized, easy to find needed parts",
          "Contenu": "Very organized, easy to find parts that match manufacturer brands, excellent packing, competitive pricing! However shipping charges are high and a bit slow shipping. Ordered part from Nov. 4th, received on Nov. 11st.Thank You, DriveSolutions.com"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 4,
          "Date": "2021-04-23T14:34:53.000Z",
          "Titre": "My only dissatisfaction with…",
          "Contenu": "My only dissatisfaction with DriveSolutions is I find the automatic $12.00 shipping charge via UPS or USPS for two Dimm chips surprising. Does it really cost that amount to ship such tiny articles? Maybe so. I'll see if the actual shipping charge shows on the package when it arrives. If amount is that, OK. If not, why the extra amoumt?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2021-10-28T11:08:46.000Z",
          "Titre": "With your addition of extra layers of…",
          "Contenu": "With your addition of extra layers of \"paperwork\", you havemade it more difficult to purchase hard drives. Other than that,I depend on your extensive inventory of hard drives when I need them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Kurbiel",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T19:59:19.000Z",
          "Titre": "I think delivery could be a little…",
          "Contenu": "I think delivery could be a little quickerOther wise okThese are bare drivesNo operating systemsA novice like myself could use some more advise"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T13:27:50.000Z",
          "Titre": "I ordered a laptop hard drive",
          "Contenu": "I ordered a laptop hard drive.  I then got an email saying my credit card had been declined, and showing all of the card info submitting to my bank.  Called my bank to ask why the charge had been declined.  Bank says the wrong cvv had been submitted with the order.  Phoned DriveSolutions.com to ask them to resubmit the charge and take care to give the correct cvv.  Did so by phone message because nobody picked up the phone.  It's been a over a week now, and there is no sign anybody reviewed the phone message or did anything in response.Update:  Lindsey in their customer service dept. phoned me.  All problems have been fully taken care of to my complete satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Halverson",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T14:13:16.000Z",
          "Titre": "The product was exactly what I wanted…",
          "Contenu": "The product was exactly what I wanted and delivered quickly. I did find the install instructions confusing and ended up using a Youtube video to walk me through it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Buddy",
          "Nb_Reviews": 2,
          "Date": "2019-12-14T03:38:15.000Z",
          "Titre": "Well they shipped me the wrong item but…",
          "Contenu": "Well they shipped me the wrong item but they jumped right on it when I emailed them. The overnight-ed me the correct item at no additional cost and sent me a RMA label so I could return the incorrect drive to them at no cost to me. So far, the new drive is working just fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TROY CHERRY",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T19:18:13.000Z",
          "Titre": "The hard drive came on time and I…",
          "Contenu": "The hard drive came on time and I managed to install it and so far it's working ok. I'm satisfied and the computer upgrade item seems to make my PC run a lot faster."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOSEPH",
          "Nb_Reviews": 2,
          "Date": "2019-07-21T16:42:10.000Z",
          "Titre": "I had a pleasant experience shopping…",
          "Contenu": "I had a pleasant experience shopping with this site. I found what I needed and was able to purchase at a reasonable price with no hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T16:15:08.000Z",
          "Titre": "I got my order in quick and timely…",
          "Contenu": "I got my order in quick and timely manner. They contacted me to ensure my order was accurate since I did two separate transactions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option, The best price service and quality product",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T19:04:13.000Z",
          "Titre": "Crucial SSD",
          "Contenu": "The SSD is great! But it did not come with a mounting bracket when your site said it come with one. Which is a good thing since it provably would be the right one anyway."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T17:50:24.000Z",
          "Titre": "Great price",
          "Contenu": "Great price - great shipping time - only complaint is the packaging was a little 'homemade'...but it kept it safe!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2020-02-20T12:02:10.000Z",
          "Titre": "Your shipping time is much improved and…",
          "Contenu": "Your shipping time is much improved and yourproduct is still reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Carrubba",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T02:57:23.000Z",
          "Titre": "I ordered a drive",
          "Contenu": "I ordered a drive, it came, I installed it, and so far it's working like a charm"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Hal Grossman",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T01:15:35.000Z",
          "Titre": "Good substitute and help with…",
          "Contenu": "Good substitute and help with transferring the data."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dave Conger",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T02:34:44.000Z",
          "Titre": "The order went well",
          "Contenu": "The order went well. Shipping seems to move very slowly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Green",
          "Nb_Reviews": 2,
          "Date": "2022-01-14T21:53:47.000Z",
          "Titre": "The drive is good,But fedex took a long…",
          "Contenu": "The drive is good,But fedex took a long time to get it here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2019-10-22T20:33:33.000Z",
          "Titre": "Exactly what I ordered and delivered on…",
          "Contenu": "Exactly what I ordered and delivered on time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DANIEL L MCBRIDE",
          "Nb_Reviews": 1,
          "Date": "2013-09-20T02:15:42.000Z",
          "Titre": "YOUR SITE IS GREAT & THE PEOPLE I TALL TO , WERE VERY HELP FULL !!!",
          "Contenu": "i HAVE NOT CLONE MY HARD DRIVE AS OF YET, THE CLONING DEVICE WOULD NOT WORK WITH THE HARD DRIVE I BOUGHT, UNLESS I PUT THE NEW HARD DRIVE IN MY LAP TOP AND HOOK UP MY OLD ONE TO THE DEVICE (NOT TO INSTRUCTION) I WANTED TO DO IT TO THE INSTRUCTION ON THE CD..\r   SO I CALLED THE PEAPLE THAT SHIP IT TO ME AND THERE GOING TO SEND ME A DIFERNT KIT. VERY EASY TO WORK WITH .\r         NICE PEOPLE\r          DANIEL MCBRIDE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KE",
          "Nb_Reviews": 1,
          "Date": "2015-10-28T17:54:55.413Z",
          "Titre": "Hard drive from Drive Solutions",
          "Contenu": "I bought a hard dive from Drive Solutions for my Dell laptop computer a week ago. It has been working nicely well. What I like most was their fast shipping! I needed to use my computer and got the drive in two days, which saved my life. One thing is that their email response to customer inquiry is kind of slow. You may want to use phone instead."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Higgins",
          "Nb_Reviews": 1,
          "Date": "2013-04-19T01:06:57.000Z",
          "Titre": "Call your order in.",
          "Contenu": "I don't know what happened to their online ordering system but it did not process my order at all.  So after a couple of days I called to check and they confirmed no order was ever received, however, upon saying that, my order was taken over the phone in a very courteous professional manner that made dealing with them a pleasure.  My ordered item arrived within a couple days of placing my order. Very happy with their service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Kaufholz",
          "Nb_Reviews": 3,
          "Date": "2016-03-05T18:59:47.235Z",
          "Titre": "Almost great",
          "Contenu": "Actually, DriveSolutions.com WAS great. It was the Sabrent external hard drive enclosure purchased to transfer my data that was funky. The enclosed directions were for an older OS than I have and when I called their customer support line a tech support guy - who couldn't have been less willing to help - suggested that I buy Carbon Copy Cloner which I did. So the process wasn't clearly defined but the hardware works well, arrived quickly, and was very affordable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wood",
          "Nb_Reviews": 1,
          "Date": "2014-11-22T03:47:45.000Z",
          "Titre": "Slick - easy, preemptive strike to avert an inevitable disc crash",
          "Contenu": "Phoned sales to verify what I needed, ordered online, delivered on time via Fedex ground, hardware and software worked exactly as billed.  Some of my programs though installed, will require re-entering license keys...the only reason I gave this 4 instead of 5 stars.  Had I been warned about this minor on their site, I'd have been prepared for that surprise.  My new disk is bigger and faster and my laptop booted up fine after replacing the old hard drive with the new, cloned, one."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Spencer",
          "Nb_Reviews": 1,
          "Date": "2016-03-20T08:39:21.000Z",
          "Titre": "as advertised",
          "Contenu": "I liked that they Gave me options on hard drives. I purchased an upgrade from my previous broken one. Which arrived on time. \r I mistyped my address and within 24 hrs they sent me an email confirming it's correctness.\r Only upset was I don't believe it takes 15 $ to send a small envelope through usps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anjanette",
          "Nb_Reviews": 1,
          "Date": "2014-01-18T19:05:56.000Z",
          "Titre": "Speedy shipping.",
          "Contenu": "I ordered a new hard drive for my Macbook mid 2010. The drive was delivered quickly and packaged nicely. It was installed and the computer is back to new working great just like before. I am so glad I found Drive Solutions to bring my Mac back to life. My only problem was that I did not receive my tracking information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2017-08-08T00:06:14.000Z",
          "Titre": "Pretty good",
          "Contenu": "The drives arrived in good condition and was compatible with my computer as per the site. Only complaint would be the slow processing time on DriveSolutions end. It was 5 day before they shipped the order out. Other than that everything is working great. Would recommend to first time drive buyers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie Blank",
          "Nb_Reviews": 1,
          "Date": "2013-10-31T09:39:47.000Z",
          "Titre": "Didn't think it was coming",
          "Contenu": "I received a new harddisc for my laptop and an install kit for it.\rIt all worked as desired, and I am happy with the experience\rThe only problem was that Drive Solutions did not email a tracking number to me.\rWhen I saw that PayPal had paid Drive Solutions, I sent them a flame saying, \"Send me a tracking number or refund the PayPal payment and cancel the order.\rThe next day, the package was on my porch. So, I will use Drive Solutions the next time I need a harddisc\r Regards......Charlie"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glenn Kelly",
          "Nb_Reviews": 17,
          "Date": "2014-05-28T15:35:51.000Z",
          "Titre": "I normally shop here for all HDD and Memory Upgrades",
          "Contenu": "... but this time around, DriveSolutions.com was not up to date with the SSD's that are compatible with a MacBook Pro 17\" (Early 2011) and in fact, did not list any SSDs at all.  Other World Computers (OWC.com) has been selling compatible SSDs for years now so it appears that DriveSolutions simply is not up to date when it comes to Apple Products and Upgrades.\r Despite this, DriveSolutions is always my number one choice for PC upgrades of which I have bought many products the past few years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-11-06T03:08:26.000Z",
          "Titre": "EZ Upgrade 3.0 for laptops",
          "Contenu": "EZ Upgrade 3.0 for laptops is an  excellent product, however support not so great. got a 0xc0000225 error code. was told a fix would be available in three months.  I googled the error code and got the solution. The Master Boot Record was corrupt. Support should have known about this fix."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Marko",
          "Nb_Reviews": 2,
          "Date": "2014-06-30T16:14:39.000Z",
          "Titre": "Exactly what I needed",
          "Contenu": "A useful website with all of the different hard drive options available for my specific computer.  Package came quickly with no delays.  Shipping seemed a little high for a tiny HDD; the shipping price could be improved.  I'd accept a slower and cheaper shipping option if it were available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ljsoule",
          "Nb_Reviews": 1,
          "Date": "2015-12-31T03:30:16.744Z",
          "Titre": "Product = great; website = not so great",
          "Contenu": "It took several attempts to get the online order actually placed (I would place the order in cart, but when I'd go to pay, it wouldn't be there or when I'd choose a shipping method it would empty my cart...even tried different browsers) and when it was finally completed, the confirmation email never came.  I could see that I paid for it by looking at my paypal statement and the new hard drive came in the expected amount of time...I guess I would have been happier if I had been able to confirm that my order had been received and shipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2014-01-14T10:42:06.000Z",
          "Titre": "Product worked very well.",
          "Contenu": "While the product worked as advertised, it took some delving into the help info on the disk to find that the Security chip in the Lenovo T61p BIOS needed to be disabled to run the clone.  I have been unable to get through to support to find out if the chip then needs to be re-enabled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom from Boise",
          "Nb_Reviews": 1,
          "Date": "2016-01-22T18:17:29.534Z",
          "Titre": "Replacement HD for HP Pavilion Laptop",
          "Contenu": "Needed a replacement drive for my HP Pavilion DV6.  Had just what I wanted at a fair price.  Was delivered unexpectedly fast.  Name brand HD that plugged right in.  I would buy from them again.  Am considering upgrading to a faster drive for my Lenovo and maybe some RAM."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Joynes",
          "Nb_Reviews": 1,
          "Date": "2015-03-11T00:26:33.000Z",
          "Titre": "Driver was received on date promised, well packed and is now installed.",
          "Contenu": "Only concern was I did not receive an Email notifying me that it had been shipped, consequently I contacted them to determine its whereabouts only  to have it delivered shortly afterwards.      Good service but unfortunately I had not been notified of the shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2019-01-18T01:50:38.000Z",
          "Titre": "Excellent Drive, Poor documentation",
          "Contenu": "I purchased a replacement HD for my Dell Inspiron 5000 after the original drive died. The DriveSolutions replacement drive installed and ran without incident; the quality of the product seems excellent, at least so far. But I could not give more than a 3 star rating simply because besides the receipt, there was not so much as one piece of support material contained in the package. A diagram; an explanation of setting up the drive - or any drive for that matter; a resource to go to for more in-depth help. Fortunately I had enough experience to install and set up the drive myself. And as I said, the drive is working just fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 1,
          "Date": "2016-03-31T16:10:09.000Z",
          "Titre": "Overall a good experience.",
          "Contenu": "I am a novice in the tech world, but I found ordering what I needed very easy. Items were received in days. when I found out that I should not be transferring data, I called Drive Solutions and they accepted my return even though the package said not returnable if opened. Was very happy about this accommodation.  My only suggestion is really to the manufacturer of the data transfer part...should either answer their help line quickly or state on package that transferring data from a damaged hard drive is not recommended. This may seem elementary to most, but a movie like myself wanted confirmation."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "KiwiBloke",
          "Nb_Reviews": 1,
          "Date": "2014-04-28T20:41:21.000Z",
          "Titre": "Order placed and paid for but so far no contact from Drivesolutions",
          "Contenu": "The pruchase process and payment went fine, but I have not had a single email regarding the progress of my order which seems very strange. Normally I would expect a confirmation email.\r I hope to hear from them soon, but it has been nearly wo weeks!\r A bit concerned.\r UPDATE!\rDrivesolutions have since contacted me as a result of myTrustpilot comments and the order confirmation problem was due to emails not getting to me. They have assured me that the order is being processed, and I have no reason to doubt them.\rTRUSTPILOT would seem to be working and DriveSolutions do take the feedback seriuosly. Well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2014-03-04T16:55:29.000Z",
          "Titre": "Install was smooth, WIndow XP did not like drive",
          "Contenu": "Installation in my ThinkPad T43 went very smoothly, I liked being able to partition the disk for a dual-boot system before cloning. Only issue was that Windows XP said it wasn't a disk that had been tested with XP. Otherwise worked very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "josiah",
          "Nb_Reviews": 1,
          "Date": "2013-08-23T02:14:35.000Z",
          "Titre": "Great Selection",
          "Contenu": "They had the parts that I needed,and they make it very easy for you to choose the parts that you need. If they don't have it,it probably wasn't made. Would recommend them to any one who is looking to up grade their computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clemmer",
          "Nb_Reviews": 1,
          "Date": "2014-11-19T02:47:56.000Z",
          "Titre": "Disk drive hardware compatible but software restore failed",
          "Contenu": "After I looked up the compatible replacements drives for my computer model on the DriveSolutions web site, I chose to upgrade from my existing 500MB 5400RPM to 750MB 7200RPM.  I received the drive quickly and installed it with no problems.  However, when I attempted to restore the system software from the SONY supplied DVD, Windows start up failed.  The new drive had 4K physical sectors with 512 logical and the old had 512 physical.  I was unaware of the issue until I tried the restore.  DriveSolutions has a problem with the compatibility tables for SONY VAIO.  SONY has a problem with restore software.  I was able to install a bare Windows and downloaded the drivers from SONY, one by one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2013-04-18T22:56:04.000Z",
          "Titre": "Great product, slow delivery.",
          "Contenu": "I would recommend this company to anyone who needs a computer part but not in a hurry. Everything was great except for the delivery. It took forever. I didn't need it right away so it wasn't a big deal for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Thayer",
          "Nb_Reviews": 1,
          "Date": "2016-08-15T03:30:35.582Z",
          "Titre": "Drive is in good condition",
          "Contenu": "The website failed to mention after I selected my brand of PC (Dell XPS 8300) that my BIOS cannot utilize more than 2 TB (not even via separate partitions.. believe me. I spent hours trying various methods) on the hard disk from which it boots. Luckily my 1 TB hard drive still works, so now the 4 TB hard disk I ordered from this website is serving as storage for photos/videos, backups, and whatever else I need to move there later (and can use the full 4TB because I'm not booting from it). This is unfortunate because my intention was for the 4 TB one I ordered from this website to become my primary hard disk and for my old 1 TB to only be used for important backups. Oh well. Overall I am still satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 2,
          "Date": "2015-08-13T17:50:09.189Z",
          "Titre": "On time and correct at a reasonable cost.",
          "Contenu": "The SSD and Transfer equipment arrived on time and worked perfectly.\rIt made the installation of the SSD into my HP 110 mini N270 easy and relatively quick. I then upgraded to Windows 10, all in a afternoon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave C",
          "Nb_Reviews": 1,
          "Date": "2014-05-01T11:55:20.000Z",
          "Titre": "Good Value",
          "Contenu": "Reasonable price, quick shipment, & hard drive appears to be running well.\rOnly reason I didn't give 5 stars is that nothing has gone wrong yet so haven't had the opportunity to check out support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2013-09-05T18:41:16.000Z",
          "Titre": "perfect replacement",
          "Contenu": "I ordered a Toshiba drive and received a WD. The new drive was a perfect replacement and was already formatted. Completely satisfied. Would have rated 5 stars if I had received the Toshiba drive I ordered."
        },
        {
          "Note": 4,
          "Lieu": "SX",
          "Pseudo": "German",
          "Nb_Reviews": 1,
          "Date": "2017-02-27T02:42:16.000Z",
          "Titre": "First time experience",
          "Contenu": "I search online and l founded it. At this time my order is on the way. One thing is that drivesolution webpage of battery is not working.  I like how they go in details  with what you want to order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bert",
          "Nb_Reviews": 1,
          "Date": "2015-11-06T00:19:56.919Z",
          "Titre": "had what I needed and delivered as promised",
          "Contenu": "Needed a older style hard drive to reos ir a laptop.  They hsd it. Got it to me as promised.  Was not as expensive as other places but more than I thought given the age of the laptop.  Very pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Williams",
          "Nb_Reviews": 1,
          "Date": "2014-06-30T18:36:48.000Z",
          "Titre": "good support",
          "Contenu": "Bought a laptop hard drive and laptop power adapter.  Laptop power adapter was shipped with incorrect tip.  Hard drive was fine and cheaper than ordering it from HP. Order online was processed incorrectly  for laptop adapter.  Called support and they shipped me the correct  tip at no charge.  The only thing that I really don't like is the fact that replacement parts are cross-reference with other suppliers.  Although that makes it easy to complete orders, I am not a big fan of using parts from other manufacturers.  If they work, that is great, but if they do not then you have to plat return games until you get it right.   A good example was shipping the wrong tip for an HP computer because a toshiba adapter was shipped with a toshiba tip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2017-07-02T04:55:13.000Z",
          "Titre": "Drive Solutions had the exact hybrid …",
          "Contenu": "Drive Solutions had the exact hybrid drive I needed. If I need anything else for my computers, I will check with you first. Great pricing and received the product 2 days ahead of schedule."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-02-19T14:03:06.255Z",
          "Titre": "correct drives",
          "Contenu": "ordered same drives from another company and were actually not the right \"size\" as advertised.\rFound drivesolutions and got the correct drives and quickly for a good price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T10:46:14.000Z",
          "Titre": "The service was quick",
          "Contenu": "I got the drive I ordered quickly, and it works great,  but I wasn't sure about how secure my payment information was...if I was sure about that I would have given 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-12-05T16:37:12.964Z",
          "Titre": "Good customer service",
          "Contenu": "My only issue was not getting an email confirmation and tracking number with my order.  I had to call to get it.  The drive arrived on time and so far has worked great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHNSTON",
          "Nb_Reviews": 1,
          "Date": "2014-08-15T18:27:15.000Z",
          "Titre": "Expensive but dependable.",
          "Contenu": "I use \"Drive Solutions\" because they are dependable, but they need to take care as they are more expensive than what's available on say \"Amazon\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2018-04-21T02:25:46.000Z",
          "Titre": "Delivery was 2 days more then expected…",
          "Contenu": "Delivery was 2 days more then expected 9 days total but product is great just what I ordered ! Ordering is easy and great place for cheap costing hard drives !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-06-12T00:32:41.000Z",
          "Titre": "Two day delivery is more like a four day",
          "Contenu": "I ordered my products a Wednesday night with a two day delivery and didn't receive my stuff until Monday. I could have had a five day delivery and paid less."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2018-05-03T10:13:05.000Z",
          "Titre": "My only issues are:",
          "Contenu": "My only issues are:  1. You are sometimes a bit slow with shipping.  2. I noticed the last two HD's I purchased were      refurbished instead of new."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 2,
          "Date": "2013-05-09T22:34:31.000Z",
          "Titre": "Fast Delivery",
          "Contenu": "The delivery was fast and the hard drive was well packaged. I later found that the price was very high. It was three times the price of Amazon for the same drive."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "alberto orozco-gutierrez",
          "Nb_Reviews": 1,
          "Date": "2013-04-20T00:56:08.000Z",
          "Titre": "excelent service but expensive",
          "Contenu": "I buy a hybrid disk , the servicie is excelente but the price is 50% more expensive comparated with amazon . if you  can not find one item is a excelent choice ,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norm",
          "Nb_Reviews": 2,
          "Date": "2015-04-25T19:54:16.000Z",
          "Titre": "Hard drive",
          "Contenu": "Received my order a day after I placed it. After installing the new hard drive in my computer and reinstalling my windows software everything worked fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 2,
          "Date": "2014-07-11T05:36:18.000Z",
          "Titre": "Good service overall, however, lost track of one order over 4th of July holiday",
          "Contenu": "Good service overall but hard to reach over the phone and did not receive a return email in 48 hours. Customer support reachability needs some attention."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KD",
          "Nb_Reviews": 1,
          "Date": "2015-10-21T17:21:44.733Z",
          "Titre": "Good product, poor packaging",
          "Contenu": "The hard drive works great, but the box arrived half open because it wasn't taped shut. There was very little bubble wrap/cushioning as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2013-11-14T12:21:36.000Z",
          "Titre": "DriveChooser worked great, got an easy to install SSD drive that fit, not totally cheap, but price okay.",
          "Contenu": "DriveChooser worked great, got an easy to install SSD drive to replace my dead Sony Vaio laptop drive that fit, not totally cheap, but price okay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pearl Drum User",
          "Nb_Reviews": 1,
          "Date": "2016-06-08T21:34:25.000Z",
          "Titre": "I have used this company for other products.",
          "Contenu": "I bought a similar product years ago and was happy with the product.I have not used the newer version of the product, so I can't comment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Shepp",
          "Nb_Reviews": 1,
          "Date": "2015-08-29T22:00:13.491Z",
          "Titre": "Wrong shipping method",
          "Contenu": "On the web I selected and paid for US Priority Mail 2 to 3 Business Days but it was shipped Fed Ex Ground which delayed it in getting to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nerd",
          "Nb_Reviews": 1,
          "Date": "2015-01-04T00:02:33.000Z",
          "Titre": "DriveSolutions saved the day",
          "Contenu": "Drive Solutions saved the day and my pocketbook. Had the hard drive i needed for my 4 year old laptop. Thanks for the good work and product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2013-06-06T21:04:04.000Z",
          "Titre": "Very  fast shipping",
          "Contenu": "I enjoy shopping  at drive solution very fast shipping I recomend to all friends\r                                                    Dennis"
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "Dedkovski",
          "Nb_Reviews": 1,
          "Date": "2014-04-18T09:39:32.000Z",
          "Titre": "Quite well and convenient",
          "Contenu": "Still don't get any notification in accordance with my Reference Number DS188582722\rif my order has already shipped during two weeks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 2,
          "Date": "2016-11-27T19:47:42.000Z",
          "Titre": "Great service!",
          "Contenu": "Excellent service. Ordered a new hard drive....website made it very easy to see compatibility and what was available for my computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PEGGY",
          "Nb_Reviews": 1,
          "Date": "2013-10-02T21:19:51.000Z",
          "Titre": "It is easy to install and cave man can do it.",
          "Contenu": "I would fully recommend the drive solutions to fix your computer it is fast and easy to install as easy as 123 and fairly good prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-02-17T14:56:14.294Z",
          "Titre": "IDrive Solutions review",
          "Contenu": "I found Drive Solutions products easy to get and meet my expections .  The product arrive on time and is working well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2018-08-18T22:14:34.000Z",
          "Titre": "Company did not have drive I ordered",
          "Contenu": "Company did not have drive I ordered, so they offered me a better drive at the same price!  I am a happy camper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2018-03-20T19:48:34.000Z",
          "Titre": "I am a regular purchaser and the…",
          "Contenu": "I am a regular purchaser and the products are top notch. What could be improved is the shipping time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyson",
          "Nb_Reviews": 1,
          "Date": "2017-12-01T03:55:38.000Z",
          "Titre": "Very satisfied",
          "Contenu": "The hard drive was exactly what I needed to fix my computer and came in a reasonable amount of time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T16:26:55.000Z",
          "Titre": "hard drive was a perfect match as…",
          "Contenu": "hard drive was a perfect match as described, had it installed in approx. 30 minutes and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2013-08-29T23:42:55.000Z",
          "Titre": "Routine order. What's the big deal?",
          "Contenu": "One swallow, or one order means little. I ordered it, they delivered it. Should be routine, it was."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ted A",
          "Nb_Reviews": 2,
          "Date": "2016-03-05T22:42:03.734Z",
          "Titre": "PRODUCT SERVICE",
          "Contenu": "Had a problem with a hard drive, you came through and sent a\rreplacement quickly,  great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2015-09-16T21:30:01.819Z",
          "Titre": "Great product",
          "Contenu": "I received the product in a timely manner and the product is exactly what I hoped it would be!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2015-07-26T02:09:59.266Z",
          "Titre": "Prompt delivery",
          "Contenu": "Received my harddrive within days. Satisfied with prompt order and delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 4,
          "Date": "2015-08-20T17:09:11.377Z",
          "Titre": "Just what i ordered",
          "Contenu": "Nothing special.  I did get what I ordered and it arrived when promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2014-02-15T15:17:02.000Z",
          "Titre": "Good",
          "Contenu": "A lack of information. Needs to inform the costumer more info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JDWalsh",
          "Nb_Reviews": 7,
          "Date": "2014-09-02T00:57:46.000Z",
          "Titre": "Drive works as expected",
          "Contenu": "The drive arrived in a few days and works as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2016-12-05T17:00:03.000Z",
          "Titre": "Easy sight to navigate.",
          "Contenu": "Everything always works as advertised. Easy upgrade."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 1,
          "Date": "2013-09-08T12:23:07.000Z",
          "Titre": "Excellent",
          "Contenu": "Shipped out fast. No issues with hard drive so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lopez",
          "Nb_Reviews": 1,
          "Date": "2014-09-20T12:45:03.000Z",
          "Titre": "good job",
          "Contenu": "product came on time ,secure and good condicion"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-11-11T22:34:25.000Z",
          "Titre": "received item in good shape but a little longer than the 3-5days",
          "Contenu": "Product is installed and working as it should."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anton",
          "Nb_Reviews": 3,
          "Date": "2013-08-14T00:58:01.000Z",
          "Titre": "Efficient processing with advertised hard drive sent accordingly",
          "Contenu": "Good 2.5 tb hdd purchased with 7200 rpm spec."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roland Starr",
          "Nb_Reviews": 1,
          "Date": "2016-03-27T20:44:02.000Z",
          "Titre": "Recover Problems",
          "Contenu": "I had problems trying to recover my laptop"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ricky",
          "Nb_Reviews": 2,
          "Date": "2015-09-21T09:33:08.154Z",
          "Titre": "Great service",
          "Contenu": "Great service, would definitely recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2016-08-28T01:11:17.000Z",
          "Titre": "i had to send my order back",
          "Contenu": "they no parts that fit my computer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 1,
          "Date": "2018-06-25T14:59:39.000Z",
          "Titre": "Had a wonderful experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2016-03-13T18:48:58.000Z",
          "Titre": "On Time, As Expected, No Problems",
          "Contenu": "See Title for full review"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 2,
          "Date": "2016-02-19T21:40:53.545Z",
          "Titre": "It would be nice if someone could answer or call back",
          "Contenu": "Everything worked alright"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LLauger",
          "Nb_Reviews": 2,
          "Date": "2014-12-08T04:36:25.000Z",
          "Titre": "very good",
          "Contenu": "Great product,satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "billaddress",
          "Nb_Reviews": 1,
          "Date": "2014-03-31T17:16:07.000Z",
          "Titre": "Excellent!!",
          "Contenu": "Its fast and 100% secure"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "bijan",
          "Nb_Reviews": 1,
          "Date": "2017-04-30T11:10:29.000Z",
          "Titre": "good and trusty company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "spartados2042",
          "Nb_Reviews": 1,
          "Date": "2013-12-10T18:20:10.000Z",
          "Titre": "Good",
          "Contenu": "No problems whatsoever."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 3,
          "Date": "2016-06-19T00:56:04.000Z",
          "Titre": "rugged drive",
          "Contenu": "small compact 500GB"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S K",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T07:12:13.000Z",
          "Titre": "Great people, easy to talk to and purchase from.",
          "Contenu": "I had no problem contacting the folks at Drive Solutions with some hard drive application questions. The tech people there are extremely knowledgeable. Prices are very fair as well. Another nice thing, they didn’t push to upsell me, they simply explained my choices. They sold me exactly what I wanted. That made me more prone to make a purchase from them, which I did.Being a business owner of well over 30 years, I can say, especially these days, it’s hard to find companies like this…… I will definitely use them again!Steve K"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:47:11.000Z",
          "Titre": "Was easy to find compatible parts",
          "Contenu": "Was easy to find compatible parts. Quick shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerrit Barrere",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T19:32:53.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Great website showing the compatible drives for my specific laptop, was very reassuring. I ordered a conventional drive when I should have ordered an SSD, though, but DriveSolutions was very helpful and accommodating with the return.  The SSD arrived, I installed it with no problems, and it is working great now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brewer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:13:46.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order. Fast delivery. Suggested transfer cable made replacement easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NEAL FISHER",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:55:42.000Z",
          "Titre": "The company was extremely helpful and…",
          "Contenu": "The company was extremely helpful and knowledgeable.   I have already recommended them to friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian M",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:33:36.000Z",
          "Titre": "Laptop drive replacement.",
          "Contenu": "Shipping and arrival faster than I thought it would be, really speeded up the repair. Very easy remove old and install new.  Small size screws so don't drop any.   Minimal handling in and out and ready to reboot the CPU in about 10 minutes... and it was my first time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T04:59:32.000Z",
          "Titre": "Super impressed with this business.",
          "Contenu": "Not only were the prices very reasonable, but not being very tech savvy was not a problem. The owner took the time to walk me through the entire process to get all my data from the old drive to the new. I would highly recommend DriveSolutions for their prices, their knowledge and their willingness to take the time to really explain things. They’re really good people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Sandall",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T01:43:14.000Z",
          "Titre": "Compatible as stated.",
          "Contenu": "SSDs were compatible as advertised. However, a ROG Strix 17 GL703GE will not just simply boot up after a data transfer/cloned image into a new Gen 4 Samsung 980. Recommend taking in to a PC Shop if upgrading/replacing a C: drive even though ROG Strix are marketed as user upgradable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarge",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T23:03:15.000Z",
          "Titre": "Service after the sale",
          "Contenu": "Great product at a good price. Spoke with a kind, patient and professional representative who led me the way to install and use the device!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grambo",
          "Nb_Reviews": 6,
          "Date": "2023-09-05T17:28:23.000Z",
          "Titre": "Informed of postal progress and quick delivery…",
          "Contenu": "I thought I might have trouble finding an ‘old’ drive but DriveSolutions did have new drives (as opposed to the myriad offerings of refurbished drives from other providers).  The drive was quickly processed and information regarding progress of shipment was readily given, the drive arriving in a few days.  It’s working perfectly in my old G5."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernie Rytlewski",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T23:02:27.000Z",
          "Titre": "Not being a real computer savvy person",
          "Contenu": "Not being a real computer savvy person. I called them before I purchased a hard-drive. I explained my computer use and they walked me through all my options. It made things so much easier. Hard-drive has been installed & every thing works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Hoyles",
          "Nb_Reviews": 4,
          "Date": "2023-10-21T22:53:21.000Z",
          "Titre": "Selection chart wins the day…",
          "Contenu": "Selection chart and questionnaire therein is a lifesaver. Picked out the drive I needed. Instructions were in the listing. Pay and quick delivery and job done. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T22:52:22.000Z",
          "Titre": "Very fast delivery, worked as promised",
          "Contenu": "The hard drive on a 17-year-old Dell Optiplex 745 failed and I needed to replace it.  DriveSolutions gave a list of compatible drives, from which I selected one of the cheapest, not needing much storage capacity.  The drive was delivered two days later.  I installed it, installed a new operating system, and everything worked just fine.  Totally satisfied with this purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T17:46:52.000Z",
          "Titre": "Great advice and service",
          "Contenu": "Great advice and service.  Called for advice and the owner, Gregory answered the phone himself.  I wanted to upgrade my Dell Latitude 5380.  Dell support said my laptop could not be upgraded to a 1TB drive.  Gregory went through his offerings and patiently explained all my options and differences in the system.  I purchased the suggested hard drive and in under an hour cloned and upgraded my laptop with zero issues.  Great service.  Gregory even gave me his direct extension should I have any issues.  Fast shipping also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hal in Tulsa",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T17:19:03.000Z",
          "Titre": "Five stars - very good customer service",
          "Contenu": "The owner was very nice, knowledgeable and very patient with my non technical knowledge.   He spent quite a bit of time answering my questions and as it turns out - made very good suggestions regarding a solid state drive to upgrade my old laptop.   I've since had it installed locally and the tech company that did said it was a very good SSD and a step up what they would have installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Martin",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T21:38:29.000Z",
          "Titre": "Drive Solutions SSD Upgrade from 256 GB to 1TB",
          "Contenu": "The Drive Solutions website offered clean and multi-choice upgrades to the SSD on my HP Laptop 15.  Although, easy to use, I'm not up on the latest technology.  As such it is great to be able to chat with an expert, such as Gregory.  He is extremely knowledgeable, not only on the general technology choices, but has great detail on the various manufacturers and their capabilities.  He was able to guide me to the proper SSD for my laptop.  His suggestion an M.2 Internal Memory, a Samsung 970 EVO Plus 1TB PCIE NVME.  It's running great.  I really appreciate the support given to me by Gregory and Drive Solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Hogan",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T03:54:54.000Z",
          "Titre": "I needed a 2 TB drive for an older PC…",
          "Contenu": "I needed a 2 TB drive for an older PC (w/ Windows 10) to replace my regular PC, which had a firmware problem and which needed a new typecover.  I ordered it on Friday with the Apricorn upgrade suite to copy my older windows 10 boot disk onto the larger disk. The package arrived on Saturday and by 9 PM I had a working and reliable PC so I could teach online on Monday. Everything worked flawlessly. I have relied on drivesolutions in the past for drives, software, and kits to hold drives and have never had one problem.  Excellent company, extremely helpful staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale  Frisk",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T20:21:41.000Z",
          "Titre": "Thanks so much",
          "Contenu": "Connecting with someone who not only knows hard drives inside out, upside down and backwards but is willing and able to share the information needed is invaluable. I’ve been a customer for years and your knowledge base keeps me coming back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Coates",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T16:30:17.000Z",
          "Titre": "Helpful and Quick",
          "Contenu": "I got a quick and accurate response when I asked if I would need any other items (connector, adapter, bracket, etc.) to replace my laptop's failing HDD with one of their SSDs. Nothing else was needed. Gregory included a link to a site that shows how to replace the drive, and provided other helpful information. The drive was shipped promptly and arrived quickly. Replacing the drive was very easy, and now my laptop is back up and running with a drive that's faster than the original. I'm a very satisfied customer, and am glad to recommend DriveSolutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Williamson",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T20:32:54.000Z",
          "Titre": "Unbelievable Customer Service",
          "Contenu": "I bought a hard drive online.  Gregory called me and asked me some questions about my laptop and then did some research and got back to me to let me know the drive I ordered wouldn't work.  He spent over 1/2 an hour turning down a sale.  I would buy from here anytime I need a drive or related products in the future.  Unbelivable customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Goding",
          "Nb_Reviews": 2,
          "Date": "2021-08-28T03:16:11.000Z",
          "Titre": "Great customer support",
          "Contenu": "I can’t say enough good things about drive solutions. First off their web site was spot on for recommendations on a replacement drive for my Toshiba Notebook. I ordered one of the recommended SSD drives and it was shipped and received in less than a week. Then their customer technical support really helped me through some questions on how the clone as a bootable drive to replace my existing one that was going bad. Super experience and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John R",
          "Nb_Reviews": 5,
          "Date": "2023-06-11T02:33:20.000Z",
          "Titre": "Snap to upgrade",
          "Contenu": "I've always been somewhat uneasy about upgrading my computer. Purchasing a compatible hard drive was the primary issue. However, the interactive compatibility selection tool on the DriveSolution website eliminates any concerns. It is SO easy to find precisely the correct hard drive replacement using this tool. Evidence in support of this is simply the fact that I've used DriveSolution hard drives to upgrade two laptops and one desktop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rock Wing",
          "Nb_Reviews": 3,
          "Date": "2022-06-28T17:30:17.000Z",
          "Titre": "This is the Place to Go for HDDs.",
          "Contenu": "If you're a tech gook or computer nerd like me, you're repairing and upgrading equipment, not throwing it in the trash because the marketers are saying, \"It's outdated.\"  You may have trouble finding hard drives.  I did, but this guy had me covered.  He's got any and all the HDDs you could be looking for.  The HHD I was needing was an unusual form factor from 2009 that I couldn't find anywhere else.  Later, I actually got the owner of the company on the phone when I called with a technical question; wasn't expecting that.  He's been specializing in HDDs since 1996 and so naturally he not only knows his stuff, but he bends over backwards to help you -- energetically.  Can't say enough good things about DriveSolutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Hilyard",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T12:10:03.000Z",
          "Titre": "An outstanding company that offers…",
          "Contenu": "An outstanding company that offers superior high-quality computer drives at a great price. I received my drives in no time and my computers could not have been happier! If you are looking for a new hard drive for your computer, then look no further than Drive Solutions! They are the absolute best in the business!"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "José V Rios",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T16:09:11.000Z",
          "Titre": "I’m a 59 years person with a little…",
          "Contenu": "I’m a 59 years person with a little knowledge in PCs. However, Mr. Liam Y. made it so simple for me, and we are taking a replacement of a HDD to SDD which for improvement purposes you should indicate that is required to format the disk using the GUI option in the instructions. Mr. Liam Y. gave me follow up calls so see the progress. That’s service!!! Know I fell I have a new computer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwayne Owen",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T01:36:37.000Z",
          "Titre": "Product received as advertised.  Prompt shipment. uct received as advertised",
          "Contenu": "Product received as advertised.  Prompt shipment.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T00:37:00.000Z",
          "Titre": "Really Great!!!!",
          "Contenu": "If it weren’t for the nice and extremely helpful staff at DriveSutions I would have ordered the wrong drive and SATA Adapter for my PC. The cost was even competitive, I’d id go back to them in the future for similar upgrades for my PC. 🙂"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Lieberman",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T21:17:02.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Fast shipping, great customer service, good prices.  I only made a small order, but I had a question and they got back to me IMMEDIATELY.  Would recommend using this company if you are needing to replace components of your system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William 'Bill\" Yellin",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T19:47:08.000Z",
          "Titre": "Outstanding Support Again",
          "Contenu": "Again, I have the pleasure of writing an exceptionally positive review. I had to wait until the last minute to clone my hard drive into the new drive I purchased before an appointment early the next day to swap the new SSD drive into the laptop. Greg of Drive Solutions bailed me out of a situation with the confusing instructions for the external case, and he did this after regular hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John R",
          "Nb_Reviews": 5,
          "Date": "2023-05-04T18:15:41.000Z",
          "Titre": "I really like this company!!",
          "Contenu": "The drives are competitively priced and the correct model for your application is easy to find. I also find it refreshing that, assuming the drives are in stock, the order is shipped very soon after ordering the drive. This is a great company to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry M",
          "Nb_Reviews": 5,
          "Date": "2023-07-26T00:17:21.000Z",
          "Titre": "Couldn’t be happier",
          "Contenu": "Easy to use guidlines for choosing correct drive replacement.Reasonable prices and fast shipping. Everything a computer nerd needs . Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Lash",
          "Nb_Reviews": 4,
          "Date": "2023-04-25T19:08:39.000Z",
          "Titre": "What drew me to Drive Solutions was how…",
          "Contenu": "What drew me to Drive Solutions was how easy it was to find a drive compatible with my laptop. Beyond that, I appreciated how each product was rated on a consumer to professional scale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Russo",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T03:26:35.000Z",
          "Titre": "This company is amazing",
          "Contenu": "This company is amazing. Using the online tool it is extremely easy to select the exact replacement hard drive for your computer, regardless of the model. Once ordered, assuming it is in stock, the order is fulfilled almost the same day. But it doesn't stop there. If there is a problem, writing or calling customer services will provide a no-hassle solution usually the same day. Regarding my own personal experience, I ordered an entry-level hard drive and later changed my mind and wanted to replace it with a pro-level drive. I wrote an email requesting how I should proceed. They called me within a couple of hours and provided an answer. It just so happened that they did not have in stock the entry-level hard drive in stock so they UPGRADED the order to a pro-level AT THE SAME PRICE. The amazing aspect of this is they resolved the issue the same day. I only wish that other mail-order companies would learn from this fantastic example of really outstanding service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Art",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T22:03:52.000Z",
          "Titre": "1TB hard drive",
          "Contenu": "Reasonable delivery time, packaged well, received what was ordered, and priced right"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Havach",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T03:44:49.000Z",
          "Titre": "What I must say is…",
          "Contenu": "What I must say is that I have thoroughly enjoyed the personal conversation with your staff over my difficulty with finding an HDD suitable for restoring my TiVo Bolt 3TB to working condition. I was certainly unhappy that I was initially shipped an upgraded (4TB) alternative that, even after much online research efforts to adapt to my needs, failed to live up to expectations. But having settled on the new 3TB WD Blue HDD that you finally shipped (after I made up for the price difference), I am now fully satisfied with the outcome of my (and your) efforts and can happily assign a full FIVE STAR rating to my overall transaction. THANKS, GUYS 'N' GALS! ☺☺☺☺☺"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "for your order",
          "Nb_Reviews": 2,
          "Date": "2020-12-02T16:27:38.000Z",
          "Titre": "Replacement Hard Drive purchase was a good choice.",
          "Contenu": "I recently purchased a replacement hard drive (part no. 778192-005) for my HP laptop from DriveSolutions.com.  The hard drive was delivered on time and was exactly what I had ordered.  The drive worked perfectly after installation.  No problems encountered during extended diagnostic testing or with Operating System installation.  Replacement of the hard drive resolved my laptop problem."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tim Cornah",
          "Nb_Reviews": 10,
          "Date": "2023-09-08T19:46:37.000Z",
          "Titre": "Great people to deal with",
          "Contenu": "Great people to deal with - product is superb for the price.Just beware of the customs charges at the US / Canadian border - not their fault It cost me an extra $28(CAD)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THOMAS MABE",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T21:51:04.000Z",
          "Titre": "I ordered the Samsung 512GB SSD Pro…",
          "Contenu": "I ordered the Samsung 512GB SSD Pro only to find that they had been back ordered and my order could not be filled and was offered the Samsung 500GB SSD EVO instead to fulfill my order and I agreed.  My order was delivered on time.  As a returning customer you take for granted that they will have what you're looking for and they usually do, and order turn around is usually on time. I'm sure I'll be ordering again soon. Cheers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rajiv Nayar",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:30:50.000Z",
          "Titre": "Thought the wrong drive was send BUT IT WAS THE RIGHT ONE",
          "Contenu": "I thought the wrong drive was sent.  Their customer service guided me through the installation process and IT WAS THE RIGHT DRIVE.  Now my computer is up and running.  The service and followup to resolve my issue was outstanding !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2021-09-18T23:19:43.000Z",
          "Titre": "We didn’t initially receive a sales…",
          "Contenu": "We didn’t initially receive a sales confirmation or that the hard drive shipped. The absence of correct phone numbers didn’t help either. Eventually everything was straightened out, the drive was delivered and installed.  All is well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PER",
          "Nb_Reviews": 3,
          "Date": "2022-04-28T22:55:22.837Z",
          "Titre": "Excellent products and prices, fast shipping",
          "Contenu": "Excellent products, prices and fast shipping. Very helpful if you call for any kind of question. I have ordered from this company for years, never disappointed once. All great experiences!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David E",
          "Nb_Reviews": 2,
          "Date": "2021-08-17T20:11:37.000Z",
          "Titre": "My go to for drives",
          "Contenu": "I’ve used drive solutions before and their parts and advice are very good.  This time the computer I needed a drive for was not listed for some reason so I asked customer service.  They got back to me with the drive I needed, ordered, delivered quick and just installed yesterday.  Reloaded windows and it works perfectly.  No problems at all, saved an old unit I use for games.  Excellent service, excellent parts.  Thanks, guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Christy",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T18:17:21.000Z",
          "Titre": "The best help ever!!!",
          "Contenu": "The gentleman that helped us was very kind, professional and even went beyond our needs in answering questions concerning our computer that helped us greatly in getting it fixed.  Thanks so much!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Brust",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T00:20:50.000Z",
          "Titre": "The hard drive on my laptop fried",
          "Contenu": "The hard drive on my laptop fried. I was told by several computer repair shops the cost to fix it would be in excess of $300.00. I did some research on line and read some reviews and chose Drive solutions for a new hard drive. Good pricing and fast delivery. Had my laptop back up. The hardest part of it all was downloading a new operating system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas  Bartron",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T23:54:25.000Z",
          "Titre": "The service and products were excellent…",
          "Contenu": "The service and products were excellent and improved my computers performance to like new condition. Very quick service thank you. The drives and storage increase  has made things much easier to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tatiana  Fon",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T08:02:43.000Z",
          "Titre": "Contacted them with an issue",
          "Contenu": "Contacted them with an issue, they handled it a immediately and professionally.I will use their service and products with complete trust and refer them to otherswithout concern of blowback.Richard Reil ,, Tatiana Fon Reil"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francis Grisdale",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:13:26.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, reasonable price, fast delivery. Would definitely purchase from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Russel",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T03:15:25.000Z",
          "Titre": "My computer was out dated and I thought…",
          "Contenu": "My computer was out dated and I thought I just needed a hard drive due to an error code I received. Drive solutions sent me the right hard drive but then I had problem's with boot disc that I could not resolve. Customer service was amazing. Gave me several other options to help but in the end trashed the computer and they took the hard drive back. Would be happy to work with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:54:40.000Z",
          "Titre": "Order my SSD drive online",
          "Contenu": "Order my SSD drive online. Process was easy. I put my make and model of my computer in the online tool and it tells you which drive is compatible with your computer.  There is enough information on what each drive is and which one is good for you. I upgraded my computer and its like brand new again.  I will be back to buy another SSD for my laptop.  I recommend you purchase all your drives and rams here.  Thanks you all for your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John S",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:20:30.000Z",
          "Titre": "SSD upgrade",
          "Contenu": "The drive description and fitment were perfect. I am extremely happy with the results and strongly recommend DriveSolutions to anyone who is looking to upgrade their computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T23:39:23.000Z",
          "Titre": "Helpful, Accurate and Quick",
          "Contenu": "Easy to locate the item I needed on the website. Information on system I was looking to upgrade was accurate and complete. Ordering was easy and shipment was fast. Item received worked great. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Rasmussen",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T18:18:35.000Z",
          "Titre": "Bob Rasmussen great job you sent too.",
          "Contenu": "Hi   You did a great job on my order,  and thanks for the bio resetting my administration password  on my computer, and going to youtube and getting information from YouTube and the website bio-pw.org, and putting your error message number to get a new administration number,  Bob Rasmussen."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jeremy Hickman",
          "Nb_Reviews": 2,
          "Date": "2020-08-20T16:04:24.000Z",
          "Titre": "Greg was awesome to deal with and…",
          "Contenu": "Greg was awesome to deal with and helped me expedite my order. This was a huge weight lifted off of my shoulders as I needed this part to get my computer up and running so my child can start online school in a few days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Jagger",
          "Nb_Reviews": 2,
          "Date": "2021-11-14T01:21:42.000Z",
          "Titre": "I ordered a 512 GB SSD drive",
          "Contenu": "I ordered a 512 GB SSD drive, and because of the website, I was able to confidently select a compatible drive from a list of several choices.   The shopping experience was seamless, and the drive was compatible.  Thank you, Drive Solutions.   Also the delivery was very efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:21:58.000Z",
          "Titre": "Gregory was extremely helpful and made…",
          "Contenu": "Gregory was extremely helpful and made sure I ordered the correct SSD for my old Toshiba Satellite.  It is so fast now, that it is BETTER than it was new.I highly recommend using this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2021-11-12T19:10:25.000Z",
          "Titre": "Upgraded SSD drive in a Dell laptop",
          "Contenu": "The SSD drive was specific to this laptop and fit and worked perfectly.  The Samsung software (not really a DriveSolutions solution) also performed perfectly.  The replacement was easy and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Brenneman",
          "Nb_Reviews": 2,
          "Date": "2022-02-14T20:39:37.000Z",
          "Titre": "Needed an additional HDD for my HP x360…",
          "Contenu": "Needed an additional HDD for my HP x360 Envy.  Drive Solutions had exactly what I needed.  Only bummer was that it didn't come with the mounting bracket, but was able to pick that easily.  Wanted a good name HDD and Seagate 7200rpm was the what they offered.  Would purchase from Drive Solutions again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Montgomery",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T04:17:29.000Z",
          "Titre": "New harddrive is awesome",
          "Contenu": "My new harddrive arrived very quickly and I immediately installed it.  The drive performed flawlessly.  I highly recommend Drive Solutions for all your hard drive needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Las Vegas",
          "Nb_Reviews": 2,
          "Date": "2021-12-17T17:20:44.000Z",
          "Titre": "Quick to answer my questions on the…",
          "Contenu": "Quick to answer my questions on the right type of drive, compatibility, etc. Easy to order website. Was kept up-to-date on the shipping.  Drive arrived and works perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meagan H",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T00:29:33.000Z",
          "Titre": "So glad I found this place",
          "Contenu": "So glad I found this place! I had never replaced a hard drive before, learning how to do it as a last ditch effort to avoid buying a new pc. The tool to find the right drive for your computer was such a massive help to me and then the shipping was so quick. Definitely will come back next time I’m in need of things for my pc!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alain",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T20:41:34.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Just enter your PC part number in  the compatibility section and you will have a list of what is available for your PC. No mistake, no headache."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Option",
          "Nb_Reviews": 4,
          "Date": "2021-01-11T23:23:18.000Z",
          "Titre": "I've ordered 4 or more times from…",
          "Contenu": "I've ordered 4 or more times from DriveSolutions and have always been totally satisfied with their service and the promptness of the delivery time.FG"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Dallman",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T20:52:21.000Z",
          "Titre": "The hard drive perfectly replaced the…",
          "Contenu": "The hard drive perfectly replaced the original that was beginning to fail. It is also faster and of larger capacity. I'm very pleased with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Miller",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T22:12:30.000Z",
          "Titre": "They verified that I was getting the…",
          "Contenu": "They verified that I was getting the correct SSD for my PC and told me about going to the manufactures web page for their free clone software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Miksis",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T21:08:31.000Z",
          "Titre": "Very satisfied customer",
          "Contenu": "Very satisfied customer. Fast shipping, great product...very pleased to have done business with DriveSolutions. If I'm ever in need again, I will be in touch with DriveSolutions. Thanks very much, Glenn A"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T20:41:50.000Z",
          "Titre": "had drive",
          "Contenu": "excellent service great two buy from"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T02:36:57.000Z",
          "Titre": "Drive Solutions exceeded my expectations",
          "Contenu": "Drive Solutions exceeded my expectations and delivered to me a replacement hard drive that exactly matched the product I was replacing. Installation was easy and the product works perfectly. Placing the order was easy and delivery was on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T21:57:48.000Z",
          "Titre": "Replacement SSD for HP Laptop.",
          "Contenu": "I ordered replacement SSD for my HP laptop. The owner was very helpful on the telephone. The SSD came professionally and safely packaged. All worked great!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN PERRI",
          "Nb_Reviews": 3,
          "Date": "2023-04-16T01:16:38.000Z",
          "Titre": "Response was very fast and informative…",
          "Contenu": "Response was very fast and informative and helpful about my problem. They were able to help me get my laptop fixed and I thank them so much. I would recommend them."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "John Fairfield",
          "Nb_Reviews": 3,
          "Date": "2021-12-23T01:42:08.000Z",
          "Titre": "Drive was shipped and arrived very…",
          "Contenu": "Drive was shipped and arrived very quickly.  I the packaging was excellent. It was. Shipped in a sturdy box and well protected.  I appreciate that attentiveness of protection"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Peter Whitefield",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T22:00:09.000Z",
          "Titre": "Excellent service.",
          "Contenu": "I received my package todayThe packaging was incredible.The product is pristine. INCREDIBLE service.I will patronize this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Mclemore",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T23:29:21.000Z",
          "Titre": "Awesome price, Family run business",
          "Contenu": "Awesome price, quick shipping, I understand family run business, good combination, we need to bring back more family run businesses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Farmerdave",
          "Nb_Reviews": 3,
          "Date": "2022-07-10T16:31:10.000Z",
          "Titre": "drive came quickly from CA to MO",
          "Contenu": "The drive arrived fairly quickly from CA to MO. I used Acronis to clone my 750 Gigabyte drive to the 2 terabyte drive which fit perfectly. Now I have plenty of room on drive C and D. I'm letting the drive burn in for 72 hours and so far so good. I'll revise the review if anything changes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2021-09-07T12:34:21.000Z",
          "Titre": "The SSD was delivered as promised!",
          "Contenu": "The SSD was delivered as promised and is working perfectly.  Would highly recommend this company for all of your computer drive needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Udochukwu Nkemakolam",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T04:27:54.000Z",
          "Titre": "Got exactly what I ordered",
          "Contenu": "Got exactly what I ordered, delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dane Satterlee",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T17:17:49.847Z",
          "Titre": "Thanks!",
          "Contenu": "Thanks, searched everywhere and Drive Solutions had just what I needed. Comprehensive website to find your perfect hard drive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Trumpis",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T17:46:53.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! I called because when I installed my drive the laptop didn't recognize it. I called Customer service and they were very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "richard c",
          "Nb_Reviews": 4,
          "Date": "2021-10-23T14:13:44.000Z",
          "Titre": "SSD arrived on time",
          "Contenu": "SSD arrived on time, well packaged. PassMark has the performance of this SSD as in the 88th percentile.  I think this was all wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TSL",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T01:48:10.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service,  got the SSD I ordered within a couple of days and was able to breath new life into a laptop who's hard drive had died"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Canada",
          "Nb_Reviews": 2,
          "Date": "2021-08-14T18:01:35.000Z",
          "Titre": "This upgrade was just what my Toshiba…",
          "Contenu": "This upgrade was just what my Toshiba Satellite C655D laptop needed now have plenty of storage for this older machine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VICKY BREWER",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T17:08:01.000Z",
          "Titre": "My order was returned by postal service…",
          "Contenu": "My order was returned by postal service due to a mix- up, these guys were on top of it and I still got my merchandise.  Way to go !! Would recommend ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori W",
          "Nb_Reviews": 5,
          "Date": "2021-12-31T16:45:51.000Z",
          "Titre": "Invoice #000000645",
          "Contenu": "The support from Greg McDonald was excellent, the original HW was damaged in shipping and he got me a replacement very quickly.JW"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Milbourn",
          "Nb_Reviews": 2,
          "Date": "2021-08-14T18:57:25.000Z",
          "Titre": "Great Product",
          "Contenu": "Great Product, delivered as promptly as mail would allow. Recommend their usage to all. Price very reasonable as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William 'Bill\" Yellin",
          "Nb_Reviews": 2,
          "Date": "2022-08-13T02:57:00.000Z",
          "Titre": "Going the extra mile",
          "Contenu": "I want to thank you for all the extra time and effort you put into 1) helping me select the best SSD  2) helping me learn how to transfer my current SSD's contents 3) helping me choose the best transfer device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W. Hudson",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T03:36:30.268Z",
          "Titre": "The drive is installed and working",
          "Contenu": "The drive is installed and working. The website was easy to use and helped me find what I needed and the follow up contact kept me reassured."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine  L.",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T22:35:56.000Z",
          "Titre": "Thankful",
          "Contenu": "So thankful that you had this drive in stock and ready to go.  I ordered it on Thursday, and was surprised that it did not get put in the mail until Monday.  Once it was in the mail, it did not take long for it to get up to Alaska.  All looks well….thank you for packing it so nice.  No way the post office could damage it…even if they tried.  Getting ready to install it now.  Will be so happy to have my surveillance system back up and recording.  You all are the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Name here",
          "Nb_Reviews": 1,
          "Date": "2021-02-28T20:33:23.000Z",
          "Titre": "The files on the other drive were…",
          "Contenu": "The files on the other drive were corrupted after transfer, so I couldn't get the drive to work. Turns out I touched the cable and all I had to do was to wipe the drive and start again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Drysdale",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T01:29:39.000Z",
          "Titre": "Resurrected 10 yo Toshiba Notebook…",
          "Contenu": "Resurrected a 10 yo Toshiba Notebook by replacing original SSD. Product delivered timely and notebook runs like a charm."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Ballone",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T11:26:57.000Z",
          "Titre": "Quick processing of my order and…",
          "Contenu": "Quick processing of my order and shipment. I did not get an email saying my order shipped, I had to contact sales. But it did ship quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T14:34:16.000Z",
          "Titre": "Very helpful on the phone,",
          "Contenu": "Very helpful on the phone,Good easy to navigate websiteDelivered ontime"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank H",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T18:56:58.000Z",
          "Titre": "Gregory and DriveSolutions were great",
          "Contenu": "Gregory and DriveSolutions were great.  Very helpful ! Great advice, suggestions, and support.  Delivery on time and carefully packaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toriano ObaShango-El",
          "Nb_Reviews": 4,
          "Date": "2020-11-22T23:06:37.000Z",
          "Titre": "The turnaround time from purchase to…",
          "Contenu": "The turnaround time from purchase to arrival was very fast. The product is very sound, works excellent, and the price was very reasonable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-02-05T01:51:53.000Z",
          "Titre": "I received a great \"new\" hardrive and…",
          "Contenu": "I received a great \"new\" hardrive and great follow-up support. You don't see this level of service or support much these days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Van der Bloemen",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T23:15:47.000Z",
          "Titre": "Personal service for unique address",
          "Contenu": "Personal service for unique address, shipping and handling. Great website with a great inventory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T05:30:07.000Z",
          "Titre": "Items were delivered super fast",
          "Contenu": "Items were delivered super fast, then worked in my system as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott in Idaho",
          "Nb_Reviews": 8,
          "Date": "2020-12-05T02:29:57.000Z",
          "Titre": "I really do love the interface of just…",
          "Contenu": "I really do love the interface of just adding in your information and it automatically gives you what's available for your computer that is known to work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Guinn",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T00:23:29.000Z",
          "Titre": "BarraCuda",
          "Contenu": "This is a super place to get a HDD. I paid next to nothing for a Seagate BarraCuda 2TB HDD for an older laptop. Amazing.I will for sure be going back to them for any HDD I may need in the future."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "NEVILLE TOMS",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T10:33:36.000Z",
          "Titre": "You responded promply to",
          "Contenu": "You responded promply torequest for information on delivery of my order which proved correct."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ken",
          "Nb_Reviews": 3,
          "Date": "2022-07-08T21:32:49.000Z",
          "Titre": "Windows 98 lives again.",
          "Contenu": "Arrived in a box that was light on the bubble wrap but still looks undamaged. I was able to get the Win 98 HP 6360 working again without the new hard drive, but now have a back up if needed. Fast shipping. Thank You."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John R",
          "Nb_Reviews": 5,
          "Date": "2023-05-02T22:06:31.000Z",
          "Titre": "Really a great company to do business with,",
          "Contenu": "Finding the correct hard drive for my computer was a cinch. The order was shipped the same day. When it arrived and installed, it worked like a charm. What's not to like?"
        }
      ]
    }
  ]
}