{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.sugarsweeps.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T08:05:28.000Z",
          "Titre": "A friend of mine accidentally deposited…",
          "Contenu": "A friend of mine accidentally deposited $325 instead $35. She asked for a refund since it was a mistake. She has spoken to customer service and management. They said she can do a withdrawal and receive a bc payout. It's been a couple several days now and nothing. She even asked if it was possible to see a web receipt so she could follow the block chain. Anything as proof of payout on their end. So far nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WILLIAM RAY HARP JR",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T17:14:58.000Z",
          "Titre": "They don't load deposits and have very…",
          "Contenu": "They don't load deposits and have very rude service well not really service they don't fix nothing By far worst agent service I've ever had. And the money was not deposited that's lie"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa Jean Hamilton",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T22:49:02.000Z",
          "Titre": "This place sucks I've put over 200…",
          "Contenu": "This place sucks I've put over 200 dollars in today and can't win anything on any bet been playing couple months and spent over 600 dollars and not won anything my biggest cash out was 125. Can't believe these people rig the games and site to just take from you pretty much also no free play ever should have listened to my friend who they rob from too.. !!! Smdh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robb Brorman",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T10:23:36.000Z",
          "Titre": "PLAYER BEWARE",
          "Contenu": "I followed a link from their website to make a deposit and they never added it to my account. I reached out to them in chat support on their website and they told me that that was their old cash app tag and there was nothing they could do for me as far as a refund and I would have to speak with cash app to get the money back. I spoke with cash app and cash app said it was still their account and if it was not active anymore they would not have allowed me to send money to that tag. Do not trust these people"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Her King",
          "Nb_Reviews": 3,
          "Date": "2023-07-22T05:15:46.000Z",
          "Titre": "they log into your account when you…",
          "Contenu": "they log into your account when you start going up and play you down or all out. then block you from being able to contact customer support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonboy",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T09:05:26.000Z",
          "Titre": "Your money disappears!!",
          "Contenu": "Your money disappears!!!  sucks and then they close there messanger down if you want to just give your money away play with sugarsweepsYou suck that's some donkey d!#k"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-06-08T04:49:40.000Z",
          "Titre": "Worrying you not to play at sugarsweeps",
          "Contenu": "This is one of the worst sites I’ve every played at. Been playing all these platforms for over a year now and they don’t play like they do at sugarsweeps, rigged games. These people are thieves, I’m worrying you, don’t play here cause you will not win anything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Sitton",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T01:37:53.000Z",
          "Titre": "This place robbed me they directed me…",
          "Contenu": "This place robbed me they directed me with there new cash app then said that's not there cash app even know its the same cash app, there thieves not to be trusted"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-04-20T19:06:58.000Z",
          "Titre": "Biggest scam",
          "Contenu": "Bestest scam out there and the other site skills and slots will will take everything. Just letting everyone know don’t play at these two sites."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robb Brorman",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T08:48:34.000Z",
          "Titre": "You better like losing",
          "Contenu": "You will win at first maybe.. but after that every time you log in your account will be in just redeemed status which means you will not hit on any amounts over what your deposit was. Huge scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natasha Blackard",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T02:06:31.000Z",
          "Titre": "They steal from then take ur ability to…",
          "Contenu": "They steal from then take ur ability to chat with them away it's unreal I have screen shots and everything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R Bul",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T09:31:51.000Z",
          "Titre": "Scammers",
          "Contenu": "Awful, just awful. You might as well throw your money down a garbage disposal. These people have the game is rigged you will not win 100% scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T12:47:25.000Z",
          "Titre": "Has a one star rating for a reason",
          "Contenu": "Played at the suggestion of some people in my neighborhood, who hosts similar games and hosts this one at times..this is by far the worst platform. In researchinh it I found it is ran by Samantha Mansker of Rogers, Arkansas...in my research I found a length criminal record...this is just another scam by her.  Good luck... there's so many out here I'd try any but stay away from this one!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trang Ly",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:19:41.000Z",
          "Titre": "Their service very good ,anyway i have to question their answers and help me",
          "Contenu": "I never win when I play games, always lose and call them to ask why.. They immediately answer, comfort me and wish me good luck and there are many things I don't know, they help and advise me.  step by step instructions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcos Phillip Baca",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T11:24:44.000Z",
          "Titre": "Sugar sweeps is the absolute best way…",
          "Contenu": "Sugar sweeps is the absolute best way to play your favorite fish and slots games. They offer some of the best names in the industry such as Fire Kirin, Orion Stars, game vault, juwa and river sweeps. The control they give you is mind-blowing and the withdrawal amounts surpass any other hosts I've ever played with.So register and start playing today..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kamarae Martus",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:07:47.000Z",
          "Titre": "Sugarsweeps is the best site I love…",
          "Contenu": "Sugarsweeps is the best site I love playing and it fash cash outs everytime and if you have any problems you just use the messenger on the site and they get back to you asap totally love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "I B",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:28:50.000Z",
          "Titre": "A Gamer's Oasis: Trustworthy and Swift Customer Service",
          "Contenu": "I recently had the pleasure of experiencing the exceptional service provided by SugarSweeps, and I must say, their commitment to the trustworthiness and rapid resolution of customer service issues has left me thoroughly impressed.First off, the website is super easy to use. Everything is straightforward. It's clear they take privacy seriously, which is a big deal for me.Now, let's talk customer service. I ran into a small problem with a transfer I did, so I reached out to their support. To my surprise, they got back to me in no time. The support team was friendly, knew their stuff, and helped me fix the issue hassle-free. What blew me away was how fast they sorted everything out. It's like they're on a mission to make sure gamers are happy.In a world where you sometimes worry about online transactions, SugarSweeps is a breath of fresh air. They don't just talk the talk; they walk the walk when it comes to taking care of their customers. I'm sticking with them, and I think you should too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yolanda Duhonl",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:50:16.000Z",
          "Titre": "Sugarsweeps is #1",
          "Contenu": "Sugar sweeps is the best! Like today, for example, I redeemed my winnings and got them within a few minutes.  They have a large selection of games including some of my favorites like Mermaid Pearl on Vblink, lots of fish shooter games, and superball keno. Anytime I need customer service they are very fast and friendly.  I always get help quickly. If you're looking for a good place to online gamble, this is the best one for real."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kanan tunners",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T15:19:14.000Z",
          "Titre": "You are cheating yourself if you play anywhere else .",
          "Contenu": "You are cheating yourself if you play anywhere else .This is the only place I can find that actually has no cash out limits and is always available 24/7.Not like other sites where they are so slow to respond .These guys have it together."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gemini Admin",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T20:36:42.000Z",
          "Titre": "Amazing Only place to play fish games .Operates with integrity and professionalism",
          "Contenu": "I don’t know what’s up with all the negative reviews these guys are the real deal and always pay and always load your money and are probably the only legit operators out there for fish games .If you want to play game vault or Orion this is the only safe place to do so .Anyways I won $800 bucks and it’s not life changing money or anything but they paid me as fast as it took to deposit and I had no problems.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine barker",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T21:11:40.000Z",
          "Titre": "Quick with payouts",
          "Contenu": "Quick with payouts ! Never had such a good experience as I have had with this one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruben jr Riojas",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T12:54:38.000Z",
          "Titre": "The best casino online",
          "Contenu": "Customer service is very helpful and respond so far 100%. I love this website! It’s very easy to maneuver around the website anybody can do it! I love cashing out whenever I want to! 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaylee Marchant",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:41:26.000Z",
          "Titre": "Doesn't get much better then Sugarsweeps",
          "Contenu": "Okay so after reading some of these reviews I'd like to set some things straight. It seems a lot like people are basically losing all their money and then blaming sugar sweeps. When like they have said now in response to every bad review - they do not own the gaming softwares they just give you a way to shuffle your money through these different softwares and redeem if you happen to win. I have seriously been using them for a year or so now and they are fantastic! They are 24/7, fast as hell deposits/redeems/withdrawls, 24/7 chat support, easy to use site w pretty straightforward features (I.E deposit, redeem, withdrawal, transactions etc), not too complicated. They are not perfect -obviously but they're pretty much always trying to improve one thing or another. I get frustrated sometimes when they remove the cash app option since Bitcoin fees are so outrageous right now, and also bc the cash app option allows for deposits of any amount such as $1, $2, 5, etc whereas depositing via Bitcoin is $10 minimum but they keep bringing it back so I'm happy 👍Oh and they don't steal anyone's money or block the chat feature lmao. Sometimes their chat system glitches I've noticed or they have to reboot etc etc like I said they aren't perfect but it's always resolved quickly and it doesn't happen often. Thanks sugarsweeps!!!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Andrea Rodson",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T12:50:53.000Z",
          "Titre": "Didn’t expect how fast this casino pays…",
          "Contenu": "Didn’t expect how fast this casino pays out!! Also had an issue with my deposit since I sent to the old cashtag that they have but was really impressed how they were able to fix it when I provided my deposit details.. They also offer unique games which others doesnt offer. Such a great sweeps!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Anderson",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T09:18:21.000Z",
          "Titre": "This platform is absolutely phenomenal",
          "Contenu": "This platform is absolutely phenomenal. I have accounts with multiple platforms like this and these guys are no-contest my favorite. Always super friendly and the payouts, even in large quantities are incredibly fast. I would (and have) recommend(ed) this platform as a first choice to anybody. The current 2.4 stars is so incredibly inaccurate and completely undeserved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Atheana Day",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T12:03:05.000Z",
          "Titre": "The fact it was quick..",
          "Contenu": "The fact it was quick... Any questions I had someone there to answer them. I guess the only thing is I wish they would do cash outs to regular cash app instead of crypto. The games are smooth and the daily free spin is amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Clay",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T19:18:56.000Z",
          "Titre": "I like how..",
          "Contenu": "I've never had any issues with cashing out in the games are usually pretty balanced I would recommend to my friends probably because there's a lot of websites out there that want to take your money and they don't care about player but these guys seem to care"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine barker",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T00:13:46.000Z",
          "Titre": "Awesome to work with",
          "Contenu": "Awesome to work with. Never had any problems."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Wensley Preston",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T09:25:00.000Z",
          "Titre": "By far the best casino I played",
          "Contenu": "By far the best casino I played! My deposits were added on time and they pays out winnings in just a few mins. 😊 This casino is a must try! Also, their customer service is great!! 👏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PlanetD",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T10:51:24.000Z",
          "Titre": "Sugarsweeps... A Fun place to play",
          "Contenu": "Sugarsweeps is a FUN and EXCITING GAMING PLATFORM ! There is something for eveyone 😊🙃😊🙃😊🙃🙂🙂🙂😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris malmquist",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:16:10.000Z",
          "Titre": "Quick response always pay out never…",
          "Contenu": "Quick response always pay out never have any problems great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Connell",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:31:49.000Z",
          "Titre": "Very good costumer service",
          "Contenu": "Very good costumer service. Fast easy very straight forward"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Schausten",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T09:46:54.000Z",
          "Titre": "Awesome platform",
          "Contenu": "Awesome platform, quick redeems and easy to use interface."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Starr",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T09:28:53.000Z",
          "Titre": "If you play anywhere else your cheating yourself",
          "Contenu": "I recently had the pleasure of exploring Sugarsweeps.com, an online casino that left me truly impressed. If you're a fan of Orion Stars and enjoy fast account loading, look no further. Sugarsweeps.com is hands down the best place to play.One of the standout features of Sugarsweeps.com is its unrivaled collection of Orion Stars games. As an avid player, I was thrilled to find an extensive selection of Orion Stars titles, ranging from classic favorites to the latest releases. The variety ensures that there's always something new and exciting to indulge in.What sets Sugarsweeps.com apart from other online casinos is the lightning-fast account loading process. Depositing funds into my account was an absolute breeze, allowing me to dive straight into the action without any delays. This seamless experience truly enhances the overall gameplay and keeps the excitement levels high.Moreover, Sugarsweeps.com provides a top-notch gaming environment. The user interface is sleek, intuitive, and user-friendly, making navigation effortless. From signing up to browsing through the game library, everything is designed to ensure a smooth and enjoyable experience.Another aspect that impressed me about Sugarsweeps.com is their commitment to player satisfaction. The site boasts excellent customer support, promptly addressing any queries or concerns that may arise. This level of dedication to their players further solidifies Sugarsweeps.com as a reliable and trustworthy platform.Lastly, Sugarsweeps.com goes above and beyond to ensure a safe and secure gaming environment. With robust encryption and stringent privacy measures in place, I felt confident and at ease while enjoying the Orion Stars games. This level of attention to security is commendable and adds an extra layer of peace of mind for players.In conclusion, Sugarsweeps.com has proven to be the ultimate online casino destination for Orion Stars enthusiasts. With its vast selection of games, lightning-fast account loading, and exceptional user experience, it sets the bar high for other platforms. I highly recommend Sugarsweeps.com to anyone seeking an unforgettable gaming experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mermaidmom",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T06:04:17.000Z",
          "Titre": "Fast payouts",
          "Contenu": "Fast payouts. Great live support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthias Black",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T06:13:20.000Z",
          "Titre": "Great service quick load and fast redeem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wahab Mojaddidi",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:09:13.000Z",
          "Titre": "Fast easy convenient on point all the…",
          "Contenu": "Fast easy convenient on point all the time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Marek",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:49:06.000Z",
          "Titre": "Helpful",
          "Contenu": "Helpful, prompt and friendly; as always!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Fischer",
          "Nb_Reviews": 4,
          "Date": "2023-05-10T08:59:23.000Z",
          "Titre": "I have played with MANY other sweeps…",
          "Contenu": "I have played with MANY other sweeps casinos and sugarsweeps is by far my favorite. They ALWAYS  respond to every question concerning ANYTHING I need help with, they are quick to load as well as cashout, and they always seem to be making positive changes to accommodate and keep the people happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaily Craib",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:57:27.000Z",
          "Titre": "Absolutely love it,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jadensrh",
          "Nb_Reviews": 10,
          "Date": "2023-04-19T00:00:01.000Z",
          "Titre": "Seriously the best provider to play…",
          "Contenu": "Seriously the best provider to play sweeps games at. Literally hooked me up with $5 free play and I cashed out for $50. They always have my cash loaded and deposited quick. Thanks for the excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsey Bunn",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T04:57:21.000Z",
          "Titre": "By far the best sweeps site",
          "Contenu": "By far the best sweeps site. Fast and easy and total payouts. Customer service is friendly and helpful. I've been using this site for a couple of months. Not one complaint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Stone",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T09:00:55.000Z",
          "Titre": "I love this place",
          "Contenu": "I love this place. Its so quick and easy to load."
        }
      ]
    }
  ]
}