{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.skybygramophone.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Gonzalez",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T15:10:51.000Z",
          "Titre": "Won’t deliver package. BUY FROM ELSEWHERE",
          "Contenu": "Had a 4 package order, one of the packages was not received. Told me to contact USPS which I did but they told me they couldn’t do anything about it and sent me home with a delivery report saying they didn’t have the package and for me to contact the shipper (skybygramophone). I contacted support and they were useless. They told me they couldn’t help because the tracking info says delivered even though USPS literally provided a delivery report saying they don’t have the item. They refused an official document (nor did they even ask for it), and once I brought up the notion of filing a suit for small claims court and asked who to address it to, they completely stopped responding. HORRIBLE service. Take your business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Schneider",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T20:37:51.000Z",
          "Titre": "Ordered on May 28th and just got it…",
          "Contenu": "Ordered on May 28th and just got it today June 12th. It took way longer to ship than the 3 to 4 days printed on your website and horrible communication without my having to reach out to you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Dragun",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T17:40:35.000Z",
          "Titre": "Purchased Bose Sleep buds",
          "Contenu": "Purchased Bose Sleep buds.  They would not charge.  Returned them for a refund day after receiving them and being refused a refund because they say serial numbers don't match up.  Had to file a dispute with credit card company.  Total fraudsters ... would never shop from again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Zahner",
          "Nb_Reviews": 1,
          "Date": "2019-01-24T16:52:03.000Z",
          "Titre": "Hassle free returns?  Maybe, if support will answer you.",
          "Contenu": "Received a product that did not function as advertised.  Emailed support requesting an RMA and shipping instructions.  Four days later and now on the third email to support, I still do not have the information to make the return.  This is unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Westley",
          "Nb_Reviews": 3,
          "Date": "2019-05-13T13:44:17.000Z",
          "Titre": "Cannot get the headphone to work",
          "Contenu": "Cannot get the headphone to work.  It has a \"click on\" button; but you'd have to hold it down to keep it working. When you release the button, nothing!  Unless I am overlooking something, this product is a fail.  Please feel free to contact me to assist and I may upgrade my rating for Customer Service, if asked to do a revised one.Thank you....Daniel E. Westley"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ray g",
          "Nb_Reviews": 4,
          "Date": "2022-03-09T11:55:19.000Z",
          "Titre": "Chat customer service was very good…",
          "Contenu": "Chat customer service was very good when I utilized. Not only have I been charged but my credit card cycle has had me already paid for a product that hasn’t shipped nor have I gotten ANY updates"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Washburn",
          "Nb_Reviews": 1,
          "Date": "2020-01-18T02:45:47.000Z",
          "Titre": "Think I ran into a Scam",
          "Contenu": "Tried (repeat that) Tried to purchase a reciever from them. After giving them all info as well as joing there site and answering a email from a third party company about the purchase (which I never authorized my info to be given to) Later that same day I get a email my order was canceled and I will get a refund. No explanation whatsoever. Ended up calling the (what I was told was) the store and they couldn't help. Poor service. Have to wonder if this is a scam to collect private info from people.Did finally get a call. The caller ID said (wireless caller) and the person said to call back but left no name or number. Called back the number I had and they didn't know anything about the call.Wireless Call on the caller ID? This is more and more sounding like a scam company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S P K",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T14:23:43.000Z",
          "Titre": "Never received cable",
          "Contenu": "Never received cable. Refunded $100 but it still cost me $10 and 2 weeks of my time. Thanks for nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHERYL COOPER",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T23:42:16.000Z",
          "Titre": "The purchase made was fradulent and my…",
          "Contenu": "The purchase made was fradulent and my money should be returned.  Tried notifying you all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse McCoy",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T14:28:36.000Z",
          "Titre": "I special ordered 2 MASS surround sound…",
          "Contenu": "I special ordered 2 MASS surround sound speakers and 2 stands to go with them. They dropped shipped 2 complete surround sound systems to me (5 surrounds and 1 subwoofer x 2) I called to let them know the of the mistake. They said they would resend the 2 speakers and order a ups pickup for the 2 systems they sent in error. Six days later they sent me shipping labels and instructions. I contacted ups on line to order a pickup and was informed the shipping labels they provided would require me to pay a fee. I called Gramophone and asked to speak with a supervisor and got Will. No apologies, no thanking me for being honest and saving them about $2000, just an attitude that I shouldn't be upset. He said it was normal for them to require the customer to take returns back to UPS and not be picked up and that he would make an exception in my case. His attitude was that he was doing me a favor by ordering a pick up. I gave him an earful ( no cursing just facts) They would have never known they sent out $2000 worth of equipment instead of my $500 order unless I called to let them know as it was dropped shipped from a distributor. Will is not appreciate of his customers and thinks they don't have a right to express their anger after 6 days of runaround when the customer is trying to do the right thing for them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Hill",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T16:09:47.000Z",
          "Titre": "I have an integrated amp that I thought…",
          "Contenu": "I have an integrated amp that I thought you had in stock. I was called and told that it was not in stock but would be available the first of April. I said to proceed with order. I was surprised that my Visa was charged at that time Usually I would expect to be charged when the order is fulfilled. If I don't receive by first of April I will be very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HR in Nashville TN",
          "Nb_Reviews": 5,
          "Date": "2023-05-29T18:10:28.000Z",
          "Titre": "fix your Klarna interface",
          "Contenu": "fix your Klarna interface.  It's a MESS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Beltran",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T18:37:26.000Z",
          "Titre": "Not helpful experience",
          "Contenu": "Not helpful experience, tried to purchase something"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "José",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T04:03:01.000Z",
          "Titre": "Shipping took weeks because wrong item shipped.",
          "Contenu": "Originally ordered specific product on Jan. 6. They sent me wrong item. Had to contact & made return on Jan. 13. Got refunded & had to repurchase again on Jan. 23.  Anxiously waited almost a month for correct item that i finally received on Jan 27th.  Could have given me a small discount just to compensate for the inconvenience of a wrong item shipped. Customer rep. Was helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark F.",
          "Nb_Reviews": 4,
          "Date": "2019-11-26T19:46:11.000Z",
          "Titre": "Poor initial experience...",
          "Contenu": "Poor initial experience as product (power conditioner) received was not as advertised (Like New) and in fact was defective (later described as refurbished but I have my doubts).  SKY did respond to my disappointment quickly and we reached an acceptable resolution but experience was overwhelmingly jaded by the defective product.  Even the power cord was mismatched with the product - it didn't fit (2-prong instead of 3-prong) and clearly wasn't even the original."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Nettle",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T00:36:10.000Z",
          "Titre": "The ease of purchase on the website was…",
          "Contenu": "The ease of purchase on the website was good.  However, it took a full week for the order to be shipped, which was disappointing."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Tuncer Yilmaz",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T11:01:12.000Z",
          "Titre": "Good seler.Comunication not enough",
          "Contenu": "They forget to put an invoice to my product i bought.After my call it was sent by email.Otherwise comunication is so insincere.Please don’t use a template.Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William L",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T22:37:12.000Z",
          "Titre": "My order was broken into two packages…",
          "Contenu": "My order was broken into two packages without any notice causing stress.  I had no idea when I would get my entire order and spent timing emailing for an update."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T00:33:14.000Z",
          "Titre": "Out of stock",
          "Contenu": "Why ask me?  The item I ordered is back ordered for 60-90 days.  The online sales experience was fine, but I wish that an out of stock notice had been shown BEFORE I purchased. I understand that it’s due to chip shortages, which is really nobody’s fault."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Blair",
          "Nb_Reviews": 2,
          "Date": "2022-07-25T01:16:53.000Z",
          "Titre": "Poor online experience.",
          "Contenu": "I pre-ordered a newly released television from the website.  I called and spoke to a salesperson before I placed the order.  I clearly made some kind of mistake and the transaction happened as a guest instead of under a new account.  Now I read from Sony website that some people may not be getting their pre-order.  There is no web portal for me to review the current status of my order and phonecalls do not get theough.  I've called a half a dozen times.  I often speak to people on the sales floor of their local store, but they can't help with online orders.  They name the person \"upstairs\" who takes care of the online stuff.  They even say he can attach the order to my account for me.   But when they transfer me, it either goes to an answering machine or I am on hold for a few minutes before their system hard disconnects me.Am I getting the TV any time soon?  Am I on the list of first pre-orders? Do I have to wait longer? Am I being ghosted?  No idea unfortunately.   It's like a black hole after order.  The only follow up email I've got since order confirmation is asking for a review.  Two weeks without any other communication  :("
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Archie Santana",
          "Nb_Reviews": 2,
          "Date": "2022-04-15T07:32:48.000Z",
          "Titre": "I ordered for sumiko cartridge",
          "Contenu": "I ordered for sumiko cartridge, but was not advised it is backordered. Placed order early April, and when i asked for status, thats when i was advised that item will ship in July!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark H",
          "Nb_Reviews": 1,
          "Date": "2018-12-13T18:14:05.000Z",
          "Titre": "Had to send several emails and made 2…",
          "Contenu": "Had to send several emails and made 2 phone calls to find status of order. No accurate information. Was told sometime this week or next week I would receive my order. They could not give me a ship date. Took 2 weeks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cody  Compton",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T22:05:06.000Z",
          "Titre": "Great delivery just requiring 21 or…",
          "Contenu": "Great delivery just requiring 21 or older UPS signature, in order for delivery of Sony WH1000XM5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JACK L WINEBRENNER",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T04:34:19.000Z",
          "Titre": "Received exactly what I purchased for a…",
          "Contenu": "Received exactly what I purchased for a good price. My only complaint was speed of delivery. Took four days before the “in stock” item shipped, and another 4 days to receive after shipped."
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Bhupendra Jain",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T23:52:48.000Z",
          "Titre": "My first purchase",
          "Contenu": "After I placed my order, there was no acknowledgement email. I sent an email a couple of weeks later inquiring about my order, to which I received an auto reply from SKY promising a reply to my query. No further response ever came. The McIntosh cable ordered by me arrived almost a month after I placed the order! Subsequently, SKY clarified that all this was due to a system glitch which has since been rectified. They refunded me $15 as a goodwill gesture. I am happy that they have acknowledged and fixed the underlying issue. Hopefully my next purchase will go through smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ncarolinarn7",
          "Nb_Reviews": 1,
          "Date": "2019-09-19T13:04:47.000Z",
          "Titre": "After initially being treated like a…",
          "Contenu": "After initially being treated like a thug or hood rat having to PROVE 3 times with you that I was a person of integrity you FINALLY shipped me a wonderful product.  I hear you customer protection, security blah blah blah but really guys you take that to the obnoxious level. It was ridiculous. \"If\" I EVER try to purchase an item from you again and have to endure that I will cancel my order immediately and make other arrangements.  As you can tell I'm still bothered with how you treated me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geary Heine",
          "Nb_Reviews": 1,
          "Date": "2018-11-10T23:56:49.000Z",
          "Titre": "Product arrived well backed and…",
          "Contenu": "Product arrived well packed  and flawless. Took quite a while for it to arrive. They did have the whole house denon amp the man who is upgrading the house system recommended. Very hard to find, locally or online. So thanks Graphone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr. Ken Adams",
          "Nb_Reviews": 3,
          "Date": "2022-04-03T00:04:59.000Z",
          "Titre": "Ordering was easy, shipping just OK.",
          "Contenu": "Ordering was very easy, and shipping was efficient.  My only complaint is that the product ordered, a Zen Dac v2 by iFi, was shipped in a padded envelope rather than a shipping carton with appropriate packing materials.  Considering that the unit contains relatively delicate electronic components, I think the packing should have been more protective.  I'm having some issues with the unit and wonder whether the problems are the result of damage that might have occurred from rough handling during shipping.  I'm trying to sort out the problems with iFi, but their technical support has not been very responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARIO RAMIREZ",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T02:10:03.000Z",
          "Titre": "I would had given 4 stars but need to…",
          "Contenu": "I would had given 4 stars but need to communicate that due to the value of the shipment signature will be required upon delivery so the customer can plan accordingly.  Even when i requested help, the “solution” was me to contact ups directly to rearrange delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronnie Jones",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T23:31:09.000Z",
          "Titre": "Overall Great Experience",
          "Contenu": "I had an overall very good experience with SKY by Gramophone. I had been looking for the Denon AVR-4700H for months and couldn't find one anywhere. Somehow I came across SKY and the website said they had some in stock. I was lury and decided to call. I mistakenly called a store and the only two they had in stock was already sold and a demo. After mentioning I was an online buyer he looked at a different inventory and confirmed there were a few available. I went back online and placed my order. Said I would receive in 4 or 5 days. By days 5 I hadn't heard anything from them and decided to write and they very quickly responded and told me it would be shipped the next day. It was shipped out as they stated and I received it a day later. The only negative I could say about them is they really should double box their items to offer better protection than the original box the merchandise came in. I was really nervous opening the box but luckily everything was in tact with the exception of a couple broken Styrofoam pieces. Otherwise I would have given it 5 stars. The price was good,  being ex-military I received a discount and even better I wasn't taxed since I'm not a resident of MD or DC. I would definitely buy from them again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christian reising",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T15:59:21.000Z",
          "Titre": "Even though they did not have the…",
          "Contenu": "Even though they did not have the product I was looking for both Manuel  and Warren  went out of their way to find the product I was interested in ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ChopperChief",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T20:56:46.000Z",
          "Titre": "Never got a confirmation email on my…",
          "Contenu": "Never got a confirmation email on my order, but other than that, pretty good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Rea",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T18:52:37.000Z",
          "Titre": "great customer support after a delay…",
          "Contenu": "great customer support after a delay with delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Knittel",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T04:43:00.544Z",
          "Titre": "No issues everything went well",
          "Contenu": "No issues everything went well, item was delivered and works properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PR",
          "Nb_Reviews": 1,
          "Date": "2019-11-14T17:36:55.000Z",
          "Titre": "The free shipping was great",
          "Contenu": "The free shipping was great, as was the price. I would have appreciated a prompter shipping notification."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Novel Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T19:53:29.000Z",
          "Titre": "Everything was delivered in one piece…",
          "Contenu": "Everything was delivered in one piece and undamaged"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Nelson",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T19:26:52.000Z",
          "Titre": "I was able to process my order efficiently",
          "Contenu": "The ease of using the web site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hollie Hurner",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T23:56:28.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "This is my second order with Sky by Gramophone. They have the best customer service and quality products. Manuel contacted me twice, once to confirm the details of the order and again to update me on my order delivery.  I LOVE my BDI cabinet!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Johnson",
          "Nb_Reviews": 5,
          "Date": "2023-08-01T15:53:23.000Z",
          "Titre": "He Said It Was Perfect",
          "Contenu": "placed the order for my son was not given many details he said it is perfecti’m 71 and computer illiterate but your site was doable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Teamaker",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T15:24:39.000Z",
          "Titre": "No Fuss No Muss!",
          "Contenu": "I really liked how smooth and easy my purchase was. And that what I needed was readily available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T20:14:24.000Z",
          "Titre": "Great product, great service!",
          "Contenu": "The product was outstanding and really helped pull together our new home theater setup in a crisp and simple manner. The company was very helpful when I contacted customer service about shipping. The whole experience was great! Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anie B",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T14:08:55.000Z",
          "Titre": "Sound quality is amazing",
          "Contenu": "The sound quality on our new Sonos Era 300 is amazing. I have enjoyed listening to music and find myself listening more to music than watching mind-numbing television. It’s definitely worth the hefty price tag for one speaker. The volume set at 50% fills the entire space with beautiful music. We love it!Our new Sonos Era 300 speaker arrived within 4 days of placing our order. The business took great care with the packaging and provided a tracking number via UPS. We’re very happy with the care that was taken in packaging our new speaker. We recommend Sky by Gramophone to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Botond Kopacz",
          "Nb_Reviews": 5,
          "Date": "2023-07-06T21:41:38.000Z",
          "Titre": "Took about a mo to recieve the speakers…",
          "Contenu": "Took about a mo to recieve the speakers but well worth it, great price, amazing customer support and fool proof packaging. Can’t be more happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DD",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T22:02:32.000Z",
          "Titre": "Nice product JBL CLIP 4",
          "Contenu": "Nice product, good price, Received on time. The real deal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Wolfe",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T20:02:53.000Z",
          "Titre": "Love love IT👍 received on time works…",
          "Contenu": "Love love IT👍 received on time works great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Schivek",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T16:54:51.000Z",
          "Titre": "I had a difficult purchase with some…",
          "Contenu": "I had a difficult purchase with some issues, Manuel from Sky by Gramophone was right there all along the way to correct and resolve my problems and took back my purchase and sent me the correct product I wanted and needed!Manuel did a great job and his communication was excellent the whole way through!Thank you Manuel!Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven G",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T18:00:33.000Z",
          "Titre": "Great purchase!",
          "Contenu": "Very happy with my purchase! Shipped fast, and great communication! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aeryn Greenfield",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T20:13:11.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! They were quick to catch a mistake and made sure to fix it and call to make changes not just cancel the order like most people would! Fast shipping!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank DiMauro",
          "Nb_Reviews": 4,
          "Date": "2022-06-11T18:43:45.000Z",
          "Titre": "First Time SKY buyer and very pleased",
          "Contenu": "I had never purchased anything from SKY Gramophone and only found out about them through a Google search for Cyrus audio components. I had some questions about Cyrus and they responded in short order. After doing more research, I purchased the Cyrus One bookshelf speakers, which were delivered promptly. I then ordered the Cyrus One amp and that arrived soon after. very pleased with Sky staff and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PABLO ARVELO",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T02:27:03.000Z",
          "Titre": "Great shopping experience.",
          "Contenu": "I bought some outdoor speakers because they were priced very reasonably. They shipped it right away and provided l tracking. Before my transaction, I never knew of them, but now I may check their website occasionally to see any good deals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wjk",
          "Nb_Reviews": 6,
          "Date": "2022-02-01T00:36:32.000Z",
          "Titre": "Happy to Do Business with Gramophone...",
          "Contenu": "Gramophone is an excellent local audio dealer.  It's great to have showroom to audition gear - it's really the only way to buy, IMO.  Due to supply chain issues, my purchase is on back order and I am hoping to take delivery in the next week or two.  I came back to update this review based on the response below from Gramophone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob F.",
          "Nb_Reviews": 6,
          "Date": "2022-08-26T19:08:59.000Z",
          "Titre": "Awesome customer service and pricing",
          "Contenu": "Awesome customer service. My item (Chord Huei) arrived without a grounding plate and they contacted THEIR supplier and had them reach out to me. Couple days later, I was up and running. EXCELLENT PRICES. Their supplier is The Sound Organization, and they are great too. That makes a world of difference when the wholesaler and the retailer are both class-acts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Gion",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T23:04:39.000Z",
          "Titre": "This is my update for my previous 1…",
          "Contenu": "This is my update for my previous 1 star review of Sky Gramophone. I'm humbled by their response to my previous review and I must apologize for it because they made it right! I'm very impressed by their determination of making me satisfied. Thank you for treating me like a true human being. I will always buy from this company. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam S",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T23:12:36.245Z",
          "Titre": "Great Customer Service",
          "Contenu": "I recently purchased a Technics SL-1200GR turntable. This was my first purchase from Sky by Gramophone. The purchasing process was easy and shipping was fast, as expected for a major retailer. Where Gramophone excelled was when I unboxed the turntable to find a cracked dust cover, likely from shipping. I called Customer Service/Manuel. He worked with me and Technics to have a new dust cover shipped to my home in about a week. Thanks Manuel and Gramophone, job well done! You’ve earned my business for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsey",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T18:13:55.000Z",
          "Titre": "Incredible Customer Service!",
          "Contenu": "The attentiveness from customer service was absolutely unmatched. They called me to make sure that the address was correct given it was such an expensive item, they made sure to cover any Sonos markings on the package so my boyfriend wouldn't see (it was a gift) and they shipped it incredibly quick! My friend ordered the same item directly from Sonos the day before I ordered mine and is still waiting for hers to arrive. Mine arrived in two days. Will absolutely only ever order from here moving forward!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BluChange",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T03:03:51.000Z",
          "Titre": "Fantastic Customer Service!",
          "Contenu": "I bought a set of Meze 99 Classics through Gramophone, and needed to call in the warranty. I spoke with one of their representatives, and he was extremely helpful! He was prompt and concise, I never waited more than 24 hours. I had an excellent experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DanielP",
          "Nb_Reviews": 1,
          "Date": "2018-09-30T06:01:18.000Z",
          "Titre": "We love their offerings",
          "Contenu": "We love their offerings: unique, classy, high quality.SKY by Gramophone handled our order very well. They were transparent about costs, shipping, and installation logistics.Good products, good service, nothing to complain about."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brazil Uluwita",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T21:51:04.000Z",
          "Titre": "Great Personalities | An Excellent Customer Service",
          "Contenu": "I have experience very good customer service by everyone at Sky By Gramophone that I have been in contact with. And definitely I shall shop with Sky By Gramophone when needed and I very highly recommend them  to all with the experience that I have had. I bought an Technics SU-G700M2-K and a Pro-Ject Record Player from Sky By Gramophone. Thank you and sending my best to Sky By Gramophone.Best RegardsBrazil."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NC Subie",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T22:35:18.000Z",
          "Titre": "Authorized dealer with peace of mind",
          "Contenu": "Fast shipping after the order was placed. Received well protected packages from SKY Gramophone in quick timely manner. Able to enjoy the Sonos system before the holiday."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nishant",
          "Nb_Reviews": 3,
          "Date": "2022-03-28T20:39:49.000Z",
          "Titre": "Extremely satisfied and happy with Sky…",
          "Contenu": "Extremely satisfied and happy with Sky by Gramophone. Great products, competitive pricing, timely service and professional & responsive staff. Got product - Yamaha RX A8A AVR on time and as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Stanley",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T23:16:23.000Z",
          "Titre": "Phenomenal service",
          "Contenu": "Phenomenal service!  I had ordered two of a particular item and received a phone call a few days later stating that a box had been damaged on one of them and they wanted to let me know that the product was fine inside but the box was damaged and asked if I still wanted it or not as it was their last one. What a wonderful proactive reach out.  Bravo!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A very satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-23T15:11:21.000Z",
          "Titre": "Delivered on discontinued item I sought",
          "Contenu": "I was looking for a piece of office furniture - a discontinued item to match something I already had. SKY was able to provide it when others could not, and also deliver it within my tight time constraints. Will was especially helpful in making this happen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Kate Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T23:55:32.000Z",
          "Titre": "Excellent Customer Service!!",
          "Contenu": "They have great customer service. I placed an order for a Sonos speaker holder and upon receiving my order they called me to ensure that I was ordering the correct one. Thankfully they called because I had placed the order for the older model! I was very grateful for the call to get my order corrected! Will definitely order more from them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jillian Johnston",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T17:04:08.000Z",
          "Titre": "When Amazon was unwilling to help me…",
          "Contenu": "When Amazon was unwilling to help me receive a package asap after sending the wrong item, Gramophone stepped up to the plate. The expedited shipping for me for free and got me the correct item. Great customer service, would recommend and purchase from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David In Savannah",
          "Nb_Reviews": 6,
          "Date": "2023-04-06T19:13:24.000Z",
          "Titre": "I had to return the unit I bought",
          "Contenu": "I had to return the unit I bought, but customer service was excellent. My fault. I didn't realize that the model in question lacked analog inputs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Gadowski",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T19:42:13.000Z",
          "Titre": "Excellent, fast shipping too!",
          "Contenu": "I received a call from the company telling me there would be a delay in shipping due to the chip shortage. It would not be available to be shipped until sometime in August. I got a email on Aug 1 stating my receiver was shipped and received on the 2nd. Thank you for keeping me informed and the fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T01:17:09.000Z",
          "Titre": "High end products at excellent prices !",
          "Contenu": "High end products at nearly impossible to beat prices.  Authorized retailer and distributor of products so no worries on warrantees and fast shipping. I will always check SKY  for product availability before making any electronics purchases. A++++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theodore Reid",
          "Nb_Reviews": 1,
          "Date": "2018-12-30T19:00:37.000Z",
          "Titre": "I had nothing short of outstanding…",
          "Contenu": "I had nothing short of outstanding service from SKY by Gramophone.  The staff is so helpful, courteous, and professional.   I definitely must give a shout out to Ms/Mrs. Hasti.   Thank you so much for helping me with my last purchase (Focal Utopia Headphones).   Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reginald",
          "Nb_Reviews": 3,
          "Date": "2022-07-08T23:23:52.000Z",
          "Titre": "Great Costumer Service!!!!!!!",
          "Contenu": "Great Costumer Service!!!!!!!Shipment was fast. Prompt notifications were provided.They even provided assistance with helping me set up my sound system!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 2,
          "Date": "2022-04-26T03:21:06.143Z",
          "Titre": "Outstanding first experience with SKY…",
          "Contenu": "Outstanding first experience with SKY by Gramophone. Not only did SKY help secure a backordered DAP but I exchanged correspondences with an awesome, dedicated rep (gratitude, Mark), who updated me periodically about my order. I felt genuine passion and enthusiasm from customer service to be of great help. Received package much sooner than anticipated, followed by excellent after sale support too. SKY pulled through for me before, during and after my purchase. Am very grateful, can't recommend this company enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor R Andrango",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T18:35:34.000Z",
          "Titre": "Very nice piece",
          "Contenu": "Very nice piece, only drawback was I had to put the the entertainment center together like a puzzle. I expected one solid piece of furniture I still give it five stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert H Towson",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T17:28:00.000Z",
          "Titre": "I'm an online / Internet customer and…",
          "Contenu": "I'm an online / Internet customer and worked with Dan and the office guys on my purchase and shipping details.Very professional and responsive, everything went exactly as they stated it would."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rocky D",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T23:56:51.000Z",
          "Titre": "JBL Charge 5 speaker",
          "Contenu": "This company had the best price for this product and it arrived quickly. No issues with the item. Thanks for the great deal and sending the equipment promptly. I am very satisfied and will continue to do business with Gramophone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Healey",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T21:25:37.000Z",
          "Titre": "The service I received was very good",
          "Contenu": "The service I received was very good.  My only feedback would be to have a clearer set of expectations communicated when an order is placed.  Once I reached out to them for more information, everything was spot on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Wallis",
          "Nb_Reviews": 4,
          "Date": "2023-04-08T12:52:57.000Z",
          "Titre": "Great selection on high end audio…",
          "Contenu": "Great selection on high end audio equipment.  Excellent prices and quick shipping.  Would definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lacy Jr",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T18:25:12.000Z",
          "Titre": "Your company’s service was excellent",
          "Contenu": "Your company’s service was excellent, however the speakers I ordered are on backorder until mid March. I sold the Cornwalls I had, so here I sit no speak."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Zeleny",
          "Nb_Reviews": 1,
          "Date": "2019-11-27T17:20:11.000Z",
          "Titre": "Was very pleased on the Sonos Player…",
          "Contenu": "Was very pleased on the Sonos Player One speaker brackets. Was a little concerned on what to expect based on the price. I was not disappointed. Brackets work great and exactly what I was looking for. They had machined steel components and quality was top notch. Worth the cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeannine",
          "Nb_Reviews": 2,
          "Date": "2019-04-23T20:13:20.000Z",
          "Titre": "The speakers arrived promptly",
          "Contenu": "The speakers arrived promptly. By mistake, a second pair was sent as well, and SKY politely asked me to return them. The website had good information and helped me make my choice for desktop speakers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RobE.",
          "Nb_Reviews": 1,
          "Date": "2019-03-19T00:09:02.000Z",
          "Titre": "Naim Muso-so purchase...",
          "Contenu": "Nice, professional communication throughout purchase. Perfect transaction all the way around with Sky by Gramophone. And the Naim mu-so is exactly what I was after in an all-in-one music streamer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T16:16:18.000Z",
          "Titre": "Great service!",
          "Contenu": "Easy online ordering, great customer service, super responsive and packaged delivered with care! First time buying high-end audio equipment through them but they've earned a repeat customer with how well this first order went."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ashok Pal Singh",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T05:12:42.000Z",
          "Titre": "Gramaphone gave us the best price",
          "Contenu": "Gramaphone gave us the best price, quickest delivery and friendly after sales service for the Naim MuSU 2 we bought"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 3,
          "Date": "2022-11-24T20:05:37.000Z",
          "Titre": "Success after frustration",
          "Contenu": "Matthew Kist did a great job of helping me through some initial delivery issues with the supplier and subsequently completing an order modification so that after those frustrating times, I am now completely satisfied with my special purchase. Great job all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Reeser",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T03:29:21.000Z",
          "Titre": "McIntosh MB20",
          "Contenu": "Love this new unit, I have it hooked up on the balanced output on the MB20. Great addition to my MAC7200, McIntosh needs to make this option standard on the MAC7200."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Palmer Lai",
          "Nb_Reviews": 2,
          "Date": "2022-07-24T22:16:47.000Z",
          "Titre": "Great purchase decision",
          "Contenu": "Gramophone provid very useful product reviews easy for me to do the comparison between products and price, So I believed that I made the best purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-12-16T15:44:37.000Z",
          "Titre": "Really Great Console",
          "Contenu": "The cabinet is one of the most solid and well designed pieces of furniture I’ve ever purchased. Extremely efficient and adaptable for audio and video components. Well constructed with top notch materials."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Daniel M.",
          "Nb_Reviews": 3,
          "Date": "2020-02-11T19:52:01.000Z",
          "Titre": "Excellent!",
          "Contenu": "Very good service, well packaged order and extremely satisfied with the product. It arrived on time. I recommend it to everyone! Thanks SKY by Gramophone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T15:55:48.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Very responsive customer service. I had an issue with a product I ordered and they went above and beyond to make it right.  I will definitely order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denzy Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T15:16:17.000Z",
          "Titre": "The product is very well made",
          "Contenu": "The product is very well made. Great price!!! Awesome sound!!! Perfect size!!!! The light show is amazing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TW",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T20:06:52.000Z",
          "Titre": "Straight forward",
          "Contenu": "Straight forward, good pricing.  Fast response times. Quality product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat D",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T16:48:00.000Z",
          "Titre": "Would use again!",
          "Contenu": "No complaints! I did have to return my order because I ordered the wrong item (my mistake) and they refunded me with no problems. Everything went smooth. Would order from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T21:40:09.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. I had a slightly tweaky order that no other dealer wanted to deal with.Matthew was great and got me what I needed and was very communicative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TAG",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T19:08:47.000Z",
          "Titre": "Sonos Amp Purchase",
          "Contenu": "Availability and price of product met and exceeded my expectations. I would gladly use them again for my electronics needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Farren Perera",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T20:36:54.000Z",
          "Titre": "Great Experience",
          "Contenu": "Great shopping experience overall. Product arrived well packaged and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Ransom",
          "Nb_Reviews": 1,
          "Date": "2020-01-20T13:26:25.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service. Thank you Gramophone. I recommend you pay one of their retail locations a visit when in the Baltimore/Washington area."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. NEWTON",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T22:56:16.000Z",
          "Titre": "The customer service at Gramophone is…",
          "Contenu": "The customer service at Gramophone is top notch. The team went the extra mile to make sure I got the item I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T15:53:44.000Z",
          "Titre": "Shipped like a scene from Back to the Future",
          "Contenu": "Superlative product, of course. But it was shipped remarkably fast. And isn't that what we're looking for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Konstantin Tsykun",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:34:27.000Z",
          "Titre": "Item came as described",
          "Contenu": "Item came as described. Fast shipping. Very happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alim",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T15:53:49.000Z",
          "Titre": "Very responsive to my queries",
          "Contenu": "Very responsive to my queries. Manuel cared about my questions and followed up with me throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Gronan",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T23:01:48.000Z",
          "Titre": "1st timer",
          "Contenu": "Well, not much I can say about Sky other than they got the unit to me pretty quick. Better price than most. Will visit site in future for additional gear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Fracasso",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T21:24:08.000Z",
          "Titre": "panasonic ub820",
          "Contenu": "excellent fast service. product arrived very fast!! will for sure buy again in future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "fortunate son",
          "Nb_Reviews": 1,
          "Date": "2018-11-16T17:45:41.000Z",
          "Titre": "Very pleased.",
          "Contenu": "Best experience with an audio purchase ever. Shipped fast and well packaged. I could not be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Arter",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T08:26:08.000Z",
          "Titre": "Took a chance and bought speakers online",
          "Contenu": "I bought a pair of speakers online without listening to them. I did do a lot of research. Everything went very well. I am one pleased music listener."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GUY DEZARN",
          "Nb_Reviews": 4,
          "Date": "2022-04-28T16:09:55.000Z",
          "Titre": "I ordered the $449 Sumiko Wellfleet…",
          "Contenu": "Long ago, I came to understand how easy it can be to fall short of others' expectations, both personally and professionally.  For that reason, I think being able to give a second chance to companies that admit an error and look to correct it, is in order.  The professional and timely response of Sky by Gramophone to the experience detailed below, has required me to take a second look at the company.  I've been contacted by the CEO of the company and called with follow up inquiries, all in an effort to ensure my issues were addressed.  Sky has worked hard to earn my future business and, for that reason, I will consider them for my future audio needs.I ordered the $449 Sumiko Wellfleet cartridge. Normally, my choice in audio stores is Crutchfield. In this case, Sky Gramophone was the only merchant with the Wellfleet in stock. When it arrived, I mounted it on the tone arm of my Pro-ject X-2 while wearing silk gloves and exercising extreme caution. Once on, the initial sound was less than ideal...not horrible,but nearly as good as my Moonstones or Amethyst.    I have a great deal of experience installing cartridges. I use an electronic balance, an azimuth tool, I keep the stylus protector on and I maintain a dust free environment. I examined the stylus with 1000x powered microscope.  When I informed Sky Gramophone of the defective product, they informed that it would need to be returned at my expense, with a 20% charge, a restocking fee, and that I would need to insure the return package. All of this added up to my losing $150 because Sky Gramophone sent a defective cartridge. But wait, it gets worse!  Days after receiving the Wellfleet, Sky Gramophone calls to tell me that I am responsible for the damaged cartridge. At this point, I am beginning my campaign to alert consumers about this company and its treatment of customers. I am also investigating what legal remedies I have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ohio audiophile",
          "Nb_Reviews": 1,
          "Date": "2019-03-18T21:00:17.000Z",
          "Titre": "Got off to a bit of a rough start",
          "Contenu": "Got off to a bit of a rough start, but nothing due to SKY by Gramophone.  They really turned the situation around and more than delivered.  Highly recommended!!  A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2019-12-17T16:15:32.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Perfectly shipped.  Great customer service. Great price. Will buy from you guys again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Becker",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T14:01:43.000Z",
          "Titre": "Quick and responsive service item came…",
          "Contenu": "Quick and responsive service item came as described and were very helpful with some questions I had"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-12-04T22:14:53.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Fast shipping. Would do business with them again without hesitation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Lookatch",
          "Nb_Reviews": 4,
          "Date": "2022-08-06T15:50:12.000Z",
          "Titre": "Great price and fast service",
          "Contenu": "Great price and fast service.  Personal account rep walked me through the whole process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe F",
          "Nb_Reviews": 9,
          "Date": "2022-07-31T21:21:53.000Z",
          "Titre": "Great Experience-",
          "Contenu": "I have had multiple online purchase experiences with Sky by Gramophone.  This is a solid company that prides itself on the quality of their products and providing superior customer experience - they deliver across the board!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 2,
          "Date": "2021-12-16T15:23:55.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, item new in factory-sealed box as described, received in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Gion",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T23:07:48.000Z",
          "Titre": "How can something be verified, in stock and ready to ship but the next day be on back order?",
          "Contenu": "When I purchased the receiver online, it stated that it was in stock. I called and they said that it was in stock and ready to ship. The next day, I received an email stating that the receiver was on backorder, so I immediately called again. The customer service representative told me that it was in stock but it was being shipped to another customer. I was shocked to hear of this. The representative told me that they are expecting another shipment to arrive 30 days later and it's company policy to charge for the item that is not in stock. My credit card was charged for the entire amount but I am waiting until the item returns in stock. I have never heard of that before. I have a sick feeling that the receiver will be discontinued, as it's a limited edition. Currently, it's sold out everywhere or being sold for double the MSRP. I feel like I was cheating out of my receiver for financial gain or it was being held for an employee. Either way I'm unhappy with this company and how they do business. If my receiver actually arrives to me, I will update my comments here with the status. Bottom line is everyone makes mistakes and I'm patient but don't tell me that I'm going to receive something and charge my credit card and I took an extra step to call and verify it, only to send me an email the next day saying that it's not in stock and I'm now waiting on backorder. Not good business practices and horrible customer service. Almost $6000 I have already paid for an item that I may not even receive. No updates have been received since I placed the order.Update! Sky Gramophone made it right between us and I am very proud of their customer support! Thank you for your kindness and understanding! I'm a customer for life! Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg G.",
          "Nb_Reviews": 4,
          "Date": "2020-04-25T23:38:20.000Z",
          "Titre": "Gramophone Great Company To Do Business With!!!!",
          "Contenu": "I sent them an email about the item the BDI Arena 9971. They responded quickly and I decided to purchase the item. The item was shipped that day and arrived quickly. Will do more business with them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Rittenhouse",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T00:30:56.000Z",
          "Titre": "Great company",
          "Contenu": "Great company. Had inventory. Delivered in great shape. Prices were as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Patterson",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T21:04:19.000Z",
          "Titre": "Fast and friendly service",
          "Contenu": "Fast and friendly service.  The guy who called to confirm the order was very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T06:55:23.000Z",
          "Titre": "You had the product I wanted and…",
          "Contenu": "You had the product I wanted and everything with the purchase and shipping went through smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Juneau",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T05:35:39.000Z",
          "Titre": "Great fast shipping",
          "Contenu": "Great fast shipping. Great overall experience and would order from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GEORGE Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T02:15:25.000Z",
          "Titre": "Everything went smoothly and I'm happy…",
          "Contenu": "Everything went smoothly and I'm happy with the jbl speaker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yong Zhi",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T02:18:20.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Bought Cyrus Audio CD T recently, Matt was extremely  helpful in following up my order, really appreciated, will buy in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramon P.",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T05:03:46.000Z",
          "Titre": "New TV",
          "Contenu": "Looking for a specific TV for a few weeks. Only back orders. Spoke with someone, told me they would ordered for me and they will shipped in around 2 weeks.2 weeks later my new TV was shipped :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelley Beach",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T12:21:04.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised. Shipping was super fast and item was packaged well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lia Tan",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T18:22:54.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping, my headphones got here within 2 days of my ordering"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Bolling",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T21:25:01.000Z",
          "Titre": "Great Service and Great staff",
          "Contenu": "Great Service and Great staff. Pleasure to do business with. Highly Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pauline Babinski",
          "Nb_Reviews": 1,
          "Date": "2019-04-05T00:45:56.000Z",
          "Titre": "Buy with confidence from this company",
          "Contenu": "Buy with confidence from this company! Great products, great prices, fast shipping!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J-disel",
          "Nb_Reviews": 3,
          "Date": "2022-10-02T01:43:57.000Z",
          "Titre": "100%",
          "Contenu": "Purchase made in error. Made contact with gramophone. Problem was  solved immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-31T03:22:06.000Z",
          "Titre": "The associate that helped me was super…",
          "Contenu": "The associate that helped me was super supportive and helpful.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Hunt",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T17:21:28.000Z",
          "Titre": "My speaker is everything ...",
          "Contenu": "My speaker is everything it was described to be.  Delivery was quick.  I was excited to try it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JULIUS CGLICKSTEIN",
          "Nb_Reviews": 2,
          "Date": "2019-01-15T23:52:52.000Z",
          "Titre": "fast free shipping for brand new…",
          "Contenu": "fast free shipping for brand new Mcintosh power control cable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Montalvo",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T17:09:08.000Z",
          "Titre": "Very quick in getting my orders…",
          "Contenu": "Very quick in getting my orders together and shipped. Very good price on the Klipsch 150 RM"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quang Tonthat",
          "Nb_Reviews": 1,
          "Date": "2020-04-20T16:48:01.000Z",
          "Titre": "AQ series banana plugs",
          "Contenu": "As good as Amazon service, if not better. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Chow",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T01:19:55.000Z",
          "Titre": "Great shopping experience",
          "Contenu": "Great shopping experience.  Fast shipping and brand new headphones arrived in perfect condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Champany",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T06:14:17.000Z",
          "Titre": "Great service",
          "Contenu": "Great service including delivery. Very pleased with the whole experience. Great staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rui Silva",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T15:58:14.000Z",
          "Titre": "Super nice experience buying from Sky…",
          "Contenu": "Super nice experience buying from Sky by Gramophone. Fast shipment too.Will definitely recommend 100%"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John La",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T22:39:15.000Z",
          "Titre": "Best prices and best customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K R",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T19:18:45.000Z",
          "Titre": "Painless transaction",
          "Contenu": "Order shipped quickly and arrived in good condition"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Hancock",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T01:52:43.000Z",
          "Titre": "Shipment on time and as advertised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT IVY",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T18:01:56.000Z",
          "Titre": "Very helpful before and after sale…as…",
          "Contenu": "Very helpful before and after sale…as always on previous procurements"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Wilkinson",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T15:42:00.000Z",
          "Titre": "Item arrived quickly and is exactly as…",
          "Contenu": "Item arrived quickly and is exactly as advertised"
        }
      ]
    }
  ]
}