{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.lanshack.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Murtaza S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T02:03:29.000Z",
          "Titre": "Extremely bad customer service",
          "Contenu": "Extremely bad customer service. Email the sales team and no reply for 5 days and counting. Called the main number and talked to sales rep and she just told me that she update me after talking to manager. That was 4 days ago. No call back and still counting Product has missing component when shipped."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T08:44:22.000Z",
          "Titre": "Very poor sales team,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T15:05:17.000Z",
          "Titre": "I had no real answer about my issue…",
          "Contenu": "I had no real answer about my issue with a shipping date."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SP",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T17:30:42.000Z",
          "Titre": "Canceled my order",
          "Contenu": "Canceled my order even though you had the product in stock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AP",
          "Nb_Reviews": 5,
          "Date": "2021-07-14T13:54:09.000Z",
          "Titre": "Customer service is rude when calling",
          "Contenu": "Customer service is rude when calling, worst attitude I've ever encountered when calling. Even people in the room when it was on speaker phone thought it was super rude. I had to hang up before I went off. Definitely will not order from this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T21:37:35.000Z",
          "Titre": "NO INFO",
          "Contenu": "Order receipt, shipping and tracking info feedback is severely lacking....I had to go through many logins to find that my order had actually shipped.I rec'd no direct email that the order had been rec'd, was being processed, etc.... will think twice before ordering from your company again.Next time....AMAZON!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2018-12-07T16:20:23.000Z",
          "Titre": "Ordered 30 OM4 jumpers",
          "Contenu": "Ordered 30 OM4 jumpers, 10 each of 3 different jumpers. After installing for 10GB mpls links in cable trays & in loom, found 4 or 5 jumpers with bad connectors. Could not pass light in 1 direction with Noyes OLS kit. Had to remove bad jumpers from loom (pita) and install spares I had ordered, also from LanShack. Tech support request I send in bad jumpers which I did in September, have heard NOTHING in 3 months. Will never order from or recommend LanShack again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2019-07-06T02:21:53.000Z",
          "Titre": "Good quality cable however it came with…",
          "Contenu": "Good quality cable however it came with the incorrect connectors installed. This is an annoyance especially when you find out after the cable has been ran. Currently waiting on a reply from sales and will update this review once resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T23:13:39.000Z",
          "Titre": "Slow Shippers",
          "Contenu": "It's been over a week and I still do not have my order.  It's only coming from NY - 2 days tops to Indiana.  At this point, I have no idea when it will arrive,  Very disappointed with Lanshack."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-30T13:20:28.000Z",
          "Titre": "Poor Fulfillment Speed",
          "Contenu": "We purchased a cable and selected next day air for delivery. This was completely negated by the fact it took a week to ship the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "fiberman",
          "Nb_Reviews": 1,
          "Date": "2019-04-26T17:51:26.000Z",
          "Titre": "never answer emails",
          "Contenu": "never answer emails - email server kicks back errors - bad follow up from sales reps"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T22:18:24.000Z",
          "Titre": "Shipping delayed without notification."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "acc",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T17:33:58.000Z",
          "Titre": "Took to long to get equipment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edward J Neumann",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T19:51:06.000Z",
          "Titre": "Do not send discounts you are not going to honor.",
          "Contenu": "I had 2 items in my cart and was sent a (cart10) 10% discount. I  noticed my fiber was missing from my cart so I added it , processed my payment and realized my discount had not been applied to my order , so I thought that was deceiving . Removing my fiber order from my cart and then sending me a discount for the less expensive item and then not even giving me the discount on that item was not good business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T13:22:21.000Z",
          "Titre": "Shipping is an issue with Lanshack",
          "Contenu": "Shipping is an issue with Lanshack. They make a promise and it usually falls through. I pay extra for expedited shipping and it never makes it in two days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T18:53:42.000Z",
          "Titre": "We placed the order on 11/6/2019 and we…",
          "Contenu": "We placed the order on 11/6/2019 and we selected UPS 2nd Day Air as the shipping method, very disappointed that this hasn’t arrived yet. We needed this cable on Friday."
        },
        {
          "Note": 2,
          "Lieu": "LK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-23T01:20:56.000Z",
          "Titre": "We can do a payment through credit card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karl",
          "Nb_Reviews": 3,
          "Date": "2019-08-01T10:59:39.000Z",
          "Titre": "Good product selection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:29:56.000Z",
          "Titre": "Eleven days from order to receiving on…",
          "Contenu": "Eleven days from order to receiving on in stock items??"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beenard",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:04:34.000Z",
          "Titre": "Shipping miscommunication",
          "Contenu": "I ordered and then called to see how long it normally takes to ship. The lady said that my product would be shipping on Friday and I should get it Monday or Tuesday. I called on Monday to see if I can get a tracking because my client needed by the Thursday, the lady on the phone said that there was some kind of miscommunication and it wasn’t even out that she would do next day shipping and I should get it by Wednesday. I received tracking on Tuesday and I didn’t get my product until Thursday. Luckily the client was OK that we push the project off until Friday .----response to reply. We had a 5 Hour drive to customer so getting it Thursdays would not have been onsite on time from the time it was delivered. When placed i called to correct address and asked if it would get to me by then and was assured. I did not mind paying extra to get to me when i needed it, but no reason to pay extra to get to me earlier earlier and pass that charge to client when when everyone gets paid and would have been here on time as told over phone. It's ok things happen just wish would have been accurate information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T22:33:16.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great.   Website is great. However, as we got started, noticed the pulling eye assembly was already disconnected from the fiber assembly. Appears the shrink wrap wasn’t started far enough down the assembly and I had Kevlar showing within 20’ of a 500’ pull.   No returns and no refunds on custom orders.  It pulled ok but had us concerned."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T19:17:02.000Z",
          "Titre": "Poor coordination of processing orders (updated review)",
          "Contenu": "Took longer much than expected to ship me the wrong items. My whole project was delayed due to the unacceptable performance of order processing and shipping.Update:  After posting my review I was promptly contacted by a LANshack representative.  While it is disappointing that my order did not go as smooth as anticipated, I do appreciate the follow-up by the LANshack team. To be fair, they did ship the correct items without too much hassle once I contacted them regarding the error.  Therefore, I am raising my review from one star to three due to the follow-up effort."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-04-06T23:05:17.000Z",
          "Titre": "Just eh",
          "Contenu": "Just eh. Actually these overpriced pieces of plastic are far less effective than simply using a small flathead screwdriver to straighten the pairs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SB IT Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T21:20:11.000Z",
          "Titre": "Slow Shipping",
          "Contenu": "I ordered a 12-strand multimode fiber optic cable on a Thursday morning and paid for 1-day air shipping. The cable arrived one week later. I just spent $75 dollars for nothing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ernest Grogg",
          "Nb_Reviews": 2,
          "Date": "2022-06-27T01:14:42.000Z",
          "Titre": "the product was good and was as…",
          "Contenu": "the product was good and was as expected.  the reason for the 3 stars is the shipping time. It took 4 days to leave their warehouse after I ordered it and took another 6 days to arrive once it shipped.  I even had to call to check on the product.  Customer service was great though!  I do appreciate that.  the box upon arrival was not even sealed. thank goodness I didn't loose any product along the way"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer :(",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T22:27:31.000Z",
          "Titre": "Out of Stock :(",
          "Contenu": "Ordered some cable for a fast remodel that was in flight.  Once I ordered the cable I received \"an out of stock notice.  The LANShack people reached out to me and stated the product page showed it out of stock.  I do not remember seeing that on the product.  It would have saved me a ton of grief had the check-out cart also flagged it as out of stock and forced acknowledgement prior to accepting my order. My mistake for not seeing it on the product page.  I would not have placed my order had it.  Now I have to look for other solutions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "arghh...customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-25T20:37:10.000Z",
          "Titre": "Cat6 patch cables were a little short",
          "Contenu": "Cat6 patch cables were a little short, order 3 ft, arrived with 2.5 ft, 24 port patch panel on the other hand...complete junk, no screws, no wire support, cheap plastic, very thin rack panel, had to trash that, customer was not pleased, sorry but wont be back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sadly Disappointed",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T14:57:19.000Z",
          "Titre": "Good equipment. Bad service.",
          "Contenu": "There is a problem in the ordering process which I cannot be sure was at my fault or a design flaw. But I received all of my packages in good timing. Two out of six of them were damaged due to improper packaging but not so badly as not be useable. I had to reach out to customer service due to the issue with the ordering process. I spoke to someone who claimed to be the owner who was incredibly rude. I was admittedly rude back. And we both agreed to never do business with each other again. Also when I reported the issue with the packing and the damaged equipment I never received a reply, an apology, or anything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Double-e",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T01:47:03.000Z",
          "Titre": "I found the products to be Good…But getting the right things is not obvious/easy if you’re a DIY type",
          "Contenu": "I found the products to be Good quality. My frustration in the experience was getting all the right products to work together properly in the installation. I read a good amount on the site and thought i picked the right cable, plugs and wall jacks. I’m not a pro but I know how the wire for data works very well. I got shielded riser rated cable and bought ends that I thought would fit based on the description. The bag of connectors was $56. They don’t fit the cable at all because of the shielding. Now I’m stuck with them. I bought boots for ca6 as well that looked to be right. They don’t fit shielded cable at all. Wasted money. The plugs that do fit shielded riser rated cat6 are over $100 for a 50pk. In cannot find anything this expensive anywhere online as I’ve searched lanshack and elsewhere trying to figure out why the plugs are so expensive. Frustrating. It would be helpful if the site helped check compatibility of items as you added them to your cart. I wasted over $70 on items I purchased and I am frustrated by this because I believe I looked carefully in selecting the cables and items that I did for my installation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2018-12-05T15:31:46.000Z",
          "Titre": "Enough with the survey requests",
          "Contenu": "The product was great but the harassment to complete a survey was ridiculous.  Ask me once and leave it at that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant (JJ) Gallagher",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T12:45:26.000Z",
          "Titre": "I can not give a review for a product…",
          "Contenu": "I can not give a review for a product that I just received yesterday and have not installed yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T03:28:23.000Z",
          "Titre": "Paid for urgent shipment but received…",
          "Contenu": "Paid for urgent shipment but received late-disappointed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-19T12:31:00.000Z",
          "Titre": "saving time",
          "Contenu": "saving time and testing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Brown, Liberty Solutions",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:16:34.000Z",
          "Titre": "The fiber cable arrived on time and…",
          "Contenu": "The fiber cable arrived on time and very well packaged. I would have preferred a document with the test report. The test results were merely hand written on a sticker on the side of the fiber cable spool and cannot be passed along in that manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "curtisWorks",
          "Nb_Reviews": 4,
          "Date": "2021-12-10T16:03:02.000Z",
          "Titre": "OM! 35' and 75' patch cables",
          "Contenu": "The two long (35' and 75') OM1 fiber patch cables we purchased worked flawlessly.  I liked the distribution sheath that provides a little extra protection.  Cable and ends were well-protected for shipping, and the mesh covering protected connectors during installation.  I did notice what looked like some minor sheath melting where heat-shrink tubing for the pulling eye attachment point had been installed, but it didn't appear to be a problem.The Velocity media converter worked out of the box, though we did need to disable Link Fault Pass through.I did make the mistake of reaching for the reel after opening the shipping box, and felt something sharp.  I found a piece of tape stuck to the reel to which fiber scraps were also adhered.  Those should have been more carefully kept track of and disposed of in the shop.  Luckily I don't think any glass stuck in my hand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T18:09:36.000Z",
          "Titre": "Pre-terminate micro armored cable",
          "Contenu": "Please improve communication Ordered cable over the phoneTook 10 daysNo order confirmation showing ETASince it was pre terminated I would have like a certification and data sheet provided not just a statement on packing list stating:It met industry requirements”"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T01:57:49.000Z",
          "Titre": "Packaging could be a little more careful.",
          "Contenu": "The packing for my order was somewhat loose. I felt unsure of the safety of the fiber during shipping because the patch cords were not protected from the heavier objects in the box. Otherwise, I am very happy with the quick turnaround on my pre-term cable.  The online ordering was straightforward and made me feel comfortable that the pre-term specifics would be correct.  Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-01T18:22:15.000Z",
          "Titre": "Better options for jacket color",
          "Contenu": "The product is good, but the options for ordering could be better.  I order armored custom cable and the options for the outer jacket are either black or aqua/ black which ever ships faster.  I would like aqua only to be an option.  Having a jacket color other than black would be nice when the fiber is in hand holds with other black cables to make the fiber stand out."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-20T20:43:22.000Z",
          "Titre": "Order completed swiftly.",
          "Contenu": "Order completed and shipped *very* quickly.Great communication and service with the Team afterwards.One of the cable was not the color I ordered and I got credited for.Shipping outside USA could be more flexible and affordable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "August",
          "Nb_Reviews": 4,
          "Date": "2022-03-31T22:58:18.000Z",
          "Titre": "The product is just as described",
          "Contenu": "The product is just as described.  Slim, flexible, and feels very high quality.  I have yet to have any problems with any product I have bought from them. Still waiting for a response from an email I sent a week and a half ago, and the frustrating cost of shipping are the total of a star. The products and efficiency getting them to you are top notch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Vining",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T22:08:22.000Z",
          "Titre": "So far a great company to work with",
          "Contenu": "So far a great company to work with, timely, knowledgeable, helpful and reasonably priced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2022-01-14T19:50:40.000Z",
          "Titre": "Customer service department understaffed?",
          "Contenu": "I will happily edit this review if the situation clarifies, but so far it's been a disappointing experience.  On 12/31/21 I ordered a pair of 7ft CAT 8 and a single 10ft CAT 8 ethernet cable, all three in black.  I received a package from LANshack on 1/10/22 which contained 5 10ft CAT 6 cables in white.  I called the customer service department to inform them of the mix-up.  The service representative requested I email them some pictures to document what I received, which I did.  I did not receive any communication from LANshack after sending them the requested email.  On 1/12/22 I called customer service again hoping for an update of some sort.  I spoke with a different service representative, but I provided the name of the party I spoke with originally.  I was told by the second service representative that she would follow up on getting my order fulfilled correctly.  As of 1/14/22 I have not been updated regarding a resolution, and I'm ready to write the situation off.  The items I actually ordered may or may not arrive.  At this point I don't care.  I'm aware things can take time to get corrected, but the total lack of effort to keep the customer informed of any progress is a sticking point for me.  I'll shop elsewhere next time.Update:Within 30 minutes of my admittedly rather negative initial review going live I was contacted by a third representative, and he seemed quite eager and capable of rectifying the situation. I trust that individual will also read the edits I'm making here, and I wish to express my gratitude for his involvement.  I can't justify a 5-star review in this instance given totality of my experience, but I will certainly amend my previous statement regarding purchasing elsewhere in the future.  When problems arise, rest assured there's at least one person at LANshack that cares deeply about getting them resolved."
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Guillermo Dunaway",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T14:16:31.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service! I was amazed at the way I was treated and the knowledge that was shared with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T18:32:26.000Z",
          "Titre": "Seems like a solid product",
          "Contenu": "Product arrived quickly and worked as described."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T17:46:23.000Z",
          "Titre": "I have purchased several spools of…",
          "Contenu": "I have purchased several spools of pre-terminated fiber from LANshack. it is always terminated nicely with a nice pull sock installed but the problem is that they leave to muck length at the tail end of the fiber that is terminated and wrapped over on top of the front end of the fiber. makes it hard to pull without the tail end of the fiber wanting to come off the spool and making a mess and hard to pull and possibly damaging the fiber if someone is not standing at the spool constantly watching to make sure it spools off ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 5,
          "Date": "2021-04-09T16:59:13.000Z",
          "Titre": "Easy as pi",
          "Contenu": "Easy as pi.  Straightforward and easy to select product. Configure what you need and click to purchase.  Updates on processing and shipping was fast. Ordered custom pre-terminated fiber assemblies. They were ready in less than 2 days and out the door. Will certainly be ordering again !"
        },
        {
          "Note": 4,
          "Lieu": "VI",
          "Pseudo": "Fred Chinea",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T13:39:16.000Z",
          "Titre": "Made the ordering process very simple.",
          "Contenu": "During the online ordering process I got stuck with the patch specs and decide to call customer service. Customer service team guided me through the process on how to choose our necessary assemblies. Not only that but when they had a doubt on the order base on our phone conversation, we received an immediately email to assure we understand what was being order an corrected the order. Really was impress with their customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick B",
          "Nb_Reviews": 1,
          "Date": "2019-04-03T20:18:54.000Z",
          "Titre": "Item arrived on schedule",
          "Contenu": "While my item did arrive on time, the status had shown that hit had not yet shipped. I called customer service and they were not sure if it had shipped and were going to contact me about getting it shipped as soon as possible. So that was a little frustrating, however a few hours later the item showed up at my house. I guess if they were a little more organized with the shipping side of things it would have been a full five star review"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Central Florida Communications",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T22:58:23.000Z",
          "Titre": "lengthy shipment delays",
          "Contenu": "Initially wrote bad due to poor communication about shipment delay(9days). However had communication from ops manager and was advised that those issues that talked about in my 1st review will be corrected and he refunded full amount of purchase. Thank you Tom."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew D",
          "Nb_Reviews": 2,
          "Date": "2019-07-11T22:27:16.000Z",
          "Titre": "Custom fiber lengths exactly like we needed.",
          "Contenu": "Our last purchase was built according to schedule however was shipped with a slower shipping speed than requested (not sure what happened as it should have shipped 2nd day air and shipped ground).  Lanshack did promptly refund the shipping though and once it was on it's way there wasn't much more they could do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "August",
          "Nb_Reviews": 4,
          "Date": "2021-10-23T17:08:59.000Z",
          "Titre": "High quality and quick shipping",
          "Contenu": "The order was made quickly and efficiently.  The time to make the custom cable was well within the time quoted. The product shipped and arrived quickly. No muss, no fuss. When I got the cable, it was supple, and maneuverable, unlike many crap cables you get online. The connectors attached smoothly, with no wiggle or falling our.No hassle, no frills, I can't verify these are pure copper, as i am not cutting a $50.00 cable to look, but speeds are just as high as when the router was 30\" from the modem while it is now 70' away. I took a star for cost of shipping. I know it costs money to ship, but $15.00 is pretty high now a days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pinnacle Solutions",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T16:53:50.000Z",
          "Titre": "Recovery",
          "Contenu": "I have been procuring equipment and materials for a while since they are our preferred vendor, however, this particular order has been problematic. First, I was not notified that a fiber enclosure was back-ordered until I reviewed the shipping label with (B/O) next to the equipment. Second, I ordered a 1000ft of blue CAT6e cable only to receive 1000ft of orange cable. I expressed my disappointment to the LanShack representatives and will view this as a hiccup.Update: My review has been update after a call from Lanshack leadership to personally apologize and recover from the hiccup. For this reason I have changed my rating from 2 stars to 4 stars and I look forward to doing future business with Lanshack."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T21:03:00.000Z",
          "Titre": "I’ve used this twice now",
          "Contenu": "I’ve used this twice now.  One was a short run through some difficult in wall garbage (75feet) in an old building and the other was 850 feet through exterior conduits, man holes, hand offs, etc.  they both went very well.  The fiber was terminated nicely.   No problems.  The only reason not 5 stars was a minor but potentially bad thing.  The spook of 850 feet had LC on one side and ST on the other.   So which was the leading side?   You can’t take it apart to view it.  Just needed a simple label.  We figured it out with an educational guess.   Besides that. Bomber stuff."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Peterson",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T12:17:53.000Z",
          "Titre": "Their site has excellent resources to…",
          "Contenu": "Their site has excellent resources to help you decide specific configurations, cable types, etc..  Their prices are excellent and, in my previous experience, the product comes in a timely fashion and in excellent condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-18T15:37:49.000Z",
          "Titre": "Cable is great",
          "Contenu": "Cable is great. Sleeve for fiber isnt too strong. Some rocks in conduit messed it up and possibly damaged fiber end. If you have ricks in conduit wrap the sleeve with electrical tape"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-27T00:44:12.000Z",
          "Titre": "Generally great service and…",
          "Contenu": "Generally great service and communication, but this time didn't tell until the last minute that the shipping was delayed. Still, it did arrive, well packed and looking good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-11-05T02:22:47.000Z",
          "Titre": "I rarely purchase cable",
          "Contenu": "I rarely purchase cable. I thought LanShack did a good job on their website making it easy to see all my options and making it easy to select the cable that I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B Lawson",
          "Nb_Reviews": 1,
          "Date": "2020-02-23T14:02:26.000Z",
          "Titre": "Shipping was slower than in the past…",
          "Contenu": "Shipping was slower than in the past and the tracking info about what was coming in each shipment was not complete. Sorry to be whiny but you asked, , , twice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mitchell",
          "Nb_Reviews": 1,
          "Date": "2020-07-26T22:04:28.000Z",
          "Titre": "Nice fiber",
          "Contenu": "It had more than one pull eye which I did not order. Better too much than not enoughLoved the the armor jacket made it super easy to pull"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PBESystems",
          "Nb_Reviews": 1,
          "Date": "2018-08-28T17:53:11.000Z",
          "Titre": "The tool case surpasses my expectations…",
          "Contenu": "The tool case surpasses my expectations I had a little difficulty applying my coupon code and completing my purchase, therefore 4 stars not 5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TIFFANY",
          "Nb_Reviews": 1,
          "Date": "2018-11-28T15:15:14.000Z",
          "Titre": "Satisfied",
          "Contenu": "I purchased a heavy duty cart for my uncle.  He was specific in what he wanted.  I could only find it at LANshack.com.  Thanks LANshack!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-23T17:28:58.000Z",
          "Titre": "Customer help support was spot on",
          "Contenu": "Customer help support was spot on. the engineers asked to see some pictures and gave us exactly what products we needed for the job!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge Boardman",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T17:09:12.000Z",
          "Titre": "Very good service, excellent support.",
          "Contenu": "Very good service, excellent support. Little longer than desired on the shipping other than that all excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAMES GRIGGS",
          "Nb_Reviews": 3,
          "Date": "2019-01-13T23:53:49.000Z",
          "Titre": "Great products but expensive shipping",
          "Contenu": "Great quality products but shipping was about double what I would have expected for 6 - 14” patch cables."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Marchese",
          "Nb_Reviews": 2,
          "Date": "2018-08-23T11:55:01.000Z",
          "Titre": "order arrived in a timely fashion",
          "Contenu": "order arrived in a timely fashion.  Just wished communication was better.  I had to call to get tracking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kbradley",
          "Nb_Reviews": 1,
          "Date": "2020-04-25T10:01:08.000Z",
          "Titre": "It was convenient online ordering and…",
          "Contenu": "It was convenient online ordering and my order arrived earlier that expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-26T14:16:13.000Z",
          "Titre": "Fast shipping and item arrived earlier…",
          "Contenu": "Fast shipping and item arrived earlier than expected."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "RADIANT CORPORATION PVT. LTD.",
          "Nb_Reviews": 1,
          "Date": "2018-12-01T12:19:50.000Z",
          "Titre": "good",
          "Contenu": "good nice product, if tc provides nice to working."
        },
        {
          "Note": 4,
          "Lieu": "BW",
          "Pseudo": "Tshepo Raymond Kalasi",
          "Nb_Reviews": 1,
          "Date": "2019-11-22T14:54:54.000Z",
          "Titre": "but your telephone lines dont go through"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Karel",
          "Nb_Reviews": 2,
          "Date": "2019-08-09T19:19:34.000Z",
          "Titre": "Easy to work with and quick turnaround."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T17:43:42.000Z",
          "Titre": "Lots of great information on the site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-31T21:44:25.000Z",
          "Titre": "Great service no problem ordering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T21:22:33.000Z",
          "Titre": "They had what we needed."
        },
        {
          "Note": 4,
          "Lieu": "AW",
          "Pseudo": "Microhard Systems N.V.",
          "Nb_Reviews": 4,
          "Date": "2018-09-21T16:18:19.000Z",
          "Titre": "good products and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T14:59:28.000Z",
          "Titre": "We needed to add to the length of one…",
          "Contenu": "We needed to add to the length of one cable (48 strands) and I called one day later after we recognized our mistake and a real person answered!!!!!!! I was able to resolve the issue, no problem and it was a wonderful experience. Great company. We use them a lot!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kar V",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:42:52.000Z",
          "Titre": "Everyone was very helpful.",
          "Contenu": "Everyone was very helpful when i called in to place my order and to get shipping info."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kyle Bentley",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T08:01:42.000Z",
          "Titre": "Best cabling on the market. Awesome Customer Service",
          "Contenu": "CAT8 custom cabling was made with high durability and is excellent quality. Tom, the VP of the company reached out after a supply issue occurred. He rush shipped new cabling to the production facility, then immediately shipped to the customer. It arrived earlier than the anticipated shipping date. Will return for future projects that require high quality materials."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Chris Boland",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:59:24.000Z",
          "Titre": "Fiber cable was easy to order and…",
          "Contenu": "Fiber cable was easy to order and showed up to me in the amount of time I was told it should be here.Armored cable was easy to pull."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:52:53.000Z",
          "Titre": "LANshack time and time again delivers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Boudrie",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T20:58:15.000Z",
          "Titre": "5/5 on Delivery, Quality and Service",
          "Contenu": "Prompt delivery; never had a failure with Lanshack fiber or equipment; great staff to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Herterich",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T11:42:02.000Z",
          "Titre": "The sales team was extremely helpful in…",
          "Contenu": "The sales team was extremely helpful in us getting what we required and for me to place the order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:05:13.000Z",
          "Titre": "just what i needed",
          "Contenu": "just what i needed, fast delivery.  High quality products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A.Marchand",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T20:37:05.000Z",
          "Titre": "Customer Service is Fantastic",
          "Contenu": "Customer Service is Fantastic! Accidently ordered wrong part and they got us the new correct part in time for our scheduled install. Whole process was fast and easy. All involved were friendly and efficient. Cannot say enough great things about them!"
        },
        {
          "Note": 5,
          "Lieu": "BM",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T20:36:57.000Z",
          "Titre": "My custom orders are made reliably",
          "Contenu": "My custom orders are made reliably, I even needed to make a change to this order that they accommodated. Just got the Cable today, packaged nicely, strands labeled, and clips included. Continues to be my go to for fiber at a fair price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harl Adams.",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T19:47:21.000Z",
          "Titre": "Product information is readily available.",
          "Contenu": "Product information is readily available...I needed one piece of information that I could not find on the website. I just asked for it and it was email within seconds. Friendly, professional staff. We were amazed when we opened the package to see the quality in both materials and workmanship. You seem to care about our order as much as we do...We honestly did not expect to be this impressed, even though we shopped for weeks prior to placing our order. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Statewide Communications",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T14:59:04.000Z",
          "Titre": "Order Verification with a live person",
          "Contenu": "When building my quote, they are always available on the telephone to validate with me  that my order has everything I need to do the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:37:41.000Z",
          "Titre": "Super impressed with LANshack",
          "Contenu": "Super impressed with LANshack. Great communication about the progress of my custom cables and fast shipping. The cables I ordered are exceptional!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T20:31:04.000Z",
          "Titre": "Great products and fast delivery",
          "Contenu": "LANShack has a wide variety of quality products and fast/accurate delivery. I have ordered from them numerous times, and have been very satisfied with all of my orders; they are my go-to company for my infrastructure and calling needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IT for Frank",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T03:33:49.000Z",
          "Titre": "Good alternative options",
          "Contenu": "Great to find a place that had a 2 fiber cable available instead of having to buy (waste) 6 fiber for those runs.  Also like their micro armor cable as an option in between regular plenum cable and heavy duty interlocking armored.  Fulfillment and shipping speeds faster than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GREG",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T04:10:23.000Z",
          "Titre": "easy to build",
          "Contenu": "easy to build , price then order the fiber I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger T",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:47:57.000Z",
          "Titre": "Very patient with me and helped me to…",
          "Contenu": "Very patient with me and helped me to understand what we needed. Everything arrived undamaged in a reasonable amount of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:01:45.000Z",
          "Titre": "Great",
          "Contenu": "I Will Definitely order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan-CCS",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T17:27:00.000Z",
          "Titre": "Terrific Sales and Tech Expertise",
          "Contenu": "From my first fiber install until now, any time I needed a technical question answered, I could reach a tech at LANShack with my questions and get them answered.  The sales team is terrific, and I look forward to additional projects going forward where I can source my needs from LANShack."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T15:17:16.000Z",
          "Titre": "Easy way for small school district to get premade fiber",
          "Contenu": "It was a easy experience to get the premade fiber I needed to get a project done, They even helped make sure that our Tax Exempt status has been honored."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason -Lamar Community College",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T22:00:27.000Z",
          "Titre": "Great website / Great Selection",
          "Contenu": "I was recently put in charge of a large project involving the need for many different types of fiber jumpers including single mode, multimode, UPC, APC, with ST, SC, and LC ends. I normally feel like I need to talk to a real person for detailed orders like this, but the LanShack website is top notch. It was very easy to find what I was looking for. The pictures were helpful, and the prices were excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ampol Group",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T04:24:21.000Z",
          "Titre": "LanShack #1 on mylist install",
          "Contenu": "Be doing communication work for 41 years.LanShack been # 1 on my list for all my communication / network installs. LanShack web suite easy to use for fiber and parts.Been order equipment from LanShack for some time now. Never had any issues of any kind. LanShack takes extreme pride and craftsmanship with fiber orders. No other company comes close. Thumbs up all the way....."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Another satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:21:51.000Z",
          "Titre": "Ordered specialty fiber run with rush",
          "Contenu": "Ordered specialty fiber run with rush, completed and delivered in record time!  Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Cohee",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T23:11:38.000Z",
          "Titre": "Website is very easy to use and no long…",
          "Contenu": "Website is very easy to use and no long lead times with a quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Komline-Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:15:23.000Z",
          "Titre": "Another perfect order.",
          "Contenu": "Very quick delivery on stock items.  Custom items delivered on time.  This is my 2nd order and everything is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Ham",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T23:41:24.000Z",
          "Titre": "LANshack - Fantastic Service",
          "Contenu": "LANshack has a fantastic website which is easily navigated to find all of your low voltage cabling needs.  They always seem to have what I need in stock and it has shipped out with amazing speed.  Thank you LANshack!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Dudley",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T12:29:50.000Z",
          "Titre": "Order shipped as expected and on time",
          "Contenu": "We ordered our fiber on a Tuesday, paid for 2 day shipping and once the order processed, which was 2 days, shipment was received as requested 2 days later.  Order was correct and complete, with test info about fiber specs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tylan R",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T15:23:48.000Z",
          "Titre": "Beautiful fiber cable assemblies!",
          "Contenu": "I've ordered the fiber cable assemblies a few times, and they are amazing. They obviously work from a technical standpoint. However, they are also beautifully made and labeled well. I love how they are made in a way that you could pull them through a muddy water-filled conduit and still be confident that your connections are clean and ready to use when you install. All the other product are great quality too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Epic Technology Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T23:30:32.000Z",
          "Titre": "Andrea the President immediately…",
          "Contenu": "Andrea the President immediately reached out to me and apologized for the error in the weight that was charged and refunded me the full amount. I have to say she turned my negative into a positive! This gesture goes a long way with our company and we will use them again since I can trust the support they are willing to provide!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver Mak",
          "Nb_Reviews": 5,
          "Date": "2022-10-02T14:32:01.000Z",
          "Titre": "Delivered quickly",
          "Contenu": "Delivered quickly and the product was as described.Cables arrived professionally assembled and packaged, and at a price I would consider very competitive and very reasonable.  So far I haven't had any problems with the cable. LanShack worked with me to make sure I had the right equipment.The process of placing an order on the website was quick and efficient. Would recommend lanshack to others looking to purchase large pre-elemented fiber!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 4,
          "Date": "2022-12-07T06:28:43.000Z",
          "Titre": "Great Custom Fiber runs at a fair price",
          "Contenu": "I have used LanShack for custom pre-terminated fiber assemblies for a couple of years now.  The quality of the product is top notch.  i have called with questions about the products before a couple of orders and got the answers I needed the same day.  I have ordered Multimode and Single mode runs, MTP/MPO and LC terminations, ranging from 150 feet to 800 feet in length.  Indoor and outdoor cable.  I can highly recommend them.  I will continue using them for my custom fiber needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T19:25:02.000Z",
          "Titre": "delivered promptly and product was as…",
          "Contenu": "delivered promptly and product was as described. has only been in place, but have encountered no issues with the cable thus far. website ordering process was quick and efficient. would recommend lanshack to others looking to purchase large preterminated fiber runs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monocle",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T19:25:08.000Z",
          "Titre": "First time customer",
          "Contenu": "First time customer, very impressed. Accidently placed two separate orders instead of a single one. Asked to combine shipping they just refunded shipping on the second. They didn't have to do that but they did. Thanks, I will be coming back. Very high quality cables too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Transmission&Delivery Utility",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:11:36.000Z",
          "Titre": "Very simple configuration and selection…",
          "Contenu": "Very simple configuration and selection process using the fiber optic cable wizard.  Quick delivery and on-time.  Good prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dane",
          "Nb_Reviews": 2,
          "Date": "2022-11-23T03:26:56.000Z",
          "Titre": "Superior Armored Direct Burial Fiber Cable",
          "Contenu": "The quality of construction of my 6-strand armored direct burial fiber cable far exceeded my expectations! The outer sheath was extremely thick and hard, as it needs to be. It was far superior to what my internet provider used for their direct burial fiber. Build and shipping time was very reasonable. I would recommend LANshack’s product to anyone seeking the absolute best of quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Bird",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T21:14:39.000Z",
          "Titre": "Lanshack communicates with their…",
          "Contenu": "Lanshack communicates with their customers very well. They send out orders status updates promptly. Inquiries are responded to quickly. They're overall very good to deal with. They ship fast too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T21:25:09.000Z",
          "Titre": "Pre-terminated Fiber",
          "Contenu": "This is the 2nd order we have placed with LANshack for pre-terminated fiber cable and media convertors.It's for network connections between buildings.We couldn't be more pleased with the shopping experience, products and speed of delivery. Details were provided for all stages of the order when placed to help with installation planning.Will definitely order again from LANshack when network components are needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Channel Communications",
          "Nb_Reviews": 2,
          "Date": "2022-08-20T20:16:57.000Z",
          "Titre": "Fast customized shipment",
          "Contenu": "Ordered 1,000' of Pre-terminated fiber (6-strand) asked for expedited and the product shipped in two days. Had it on-site and installed by weeks end. Called Customer service twice to check on the delivery and their patience staff reassured me of an on time delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Boudrie",
          "Nb_Reviews": 6,
          "Date": "2023-10-17T19:07:34.000Z",
          "Titre": "I regret I have but 5 stars to give",
          "Contenu": "Lanshack was great to deal with, and I have always had 100% success on installs using their preconfigured fiber cables."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T18:34:59.000Z",
          "Titre": "Revised review.",
          "Contenu": "Great service!I was initially not happy with the service i received on a recent order. My product arrived @ our billing address and not the intended shipping address. When questioning our procurement team, I was told it was LANshacks error. On a deeper investigation it was determined that LANshack had, Infact shipped to exactly where they were requested to ship and the error was on our end. In the past LANshack has done a stellar job in fulfilling our needs and I'm sure they will continue their outstanding commitment to client satisfaction, and I will be using them on many projects in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott P",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T20:26:34.000Z",
          "Titre": "Great experience with LANshack",
          "Contenu": "Great experience with LANshak.com. Ordered some custom length fiber and rack mount modular fiber panels. One panel got damaged in shipping, and my first thought was this is going to be a hassle. But, I contacted them via the web form and received a quick response, quick replacement and satisfactory resolution from their customer service. Overall, I would highly recommend them based on my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T01:24:18.000Z",
          "Titre": "LANshack always delivers!",
          "Contenu": "LANshack always delivers.  I've bought about 6 pre-terminated fiber assemblies, all have worked perfectly and pulled in conduit like a dream."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Grillot",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:54:34.000Z",
          "Titre": "Quick turn around on the order",
          "Contenu": "Quick turn around on the order, pulled in perfectly. Pre-terminated all fibers passed certification."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T01:39:27.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience. Supplies were shipped fast and prices were completely reasonable. Everything seems to be of high quality. Installed nicely.Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:26:44.000Z",
          "Titre": "Found my new favorite site for ordering fiber",
          "Contenu": "Great website setup to order from, fast turn around, and quality cables at a decent price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:56:10.000Z",
          "Titre": "Good Products and sipped sooner than expected",
          "Contenu": "custom spool of fiber shipped very fast and over a week early product seems to be good quality so far very happy with porches"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T02:42:51.000Z",
          "Titre": "Sophia did an awesome job correcting an…",
          "Contenu": "Sophia did an awesome job correcting an error I made and I really want to take a moment to reach out and show my appreciation.  Thank you Sophia for your help, you are totally AWESOME!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lionel Exinia",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T17:59:23.000Z",
          "Titre": "Great prices and alot of products…",
          "Contenu": "Great prices and alot of products available needed for any types of projects. The delivery of the product that I ordered was rather fast and I will be buying other products from this great company due to their competitive low prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T00:04:55.000Z",
          "Titre": "Look No Further",
          "Contenu": "Stop searching Amazon. LANshack is the place for superior quality, USA MADE cables! Shipped fast, precisely as ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob H",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T16:02:08.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Quality product. Completed and delivered in a timely manner.  We would recommend going with LANshack for ALL of your network and cabling needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Data Technician",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T06:06:03.000Z",
          "Titre": "Labor Savor For installing and Terminating Fiber",
          "Contenu": "The website was easy and the materials were quality when delivered.  Way better than having to purchase all the equipment necessary to terminate and test fiber.  It was easy to install and use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 6,
          "Date": "2022-11-18T18:42:06.000Z",
          "Titre": "LANShack is the BEST!",
          "Contenu": "I've been ordering from LANshack for years and have never had an issue with speed or quality. Their fiber ALWAYS certifies with a Level3 so the quality is top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T03:30:26.000Z",
          "Titre": "This product was exactly what the…",
          "Contenu": "This product was exactly what the description said it would be. All terminations work. It shipped when they said it would. Only wished I found them sooner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T18:17:32.000Z",
          "Titre": "Great quality fiber assembly with…",
          "Contenu": "Great quality fiber assembly with pulling hooks on both ends. Made installation easy and with less chance of damage during installation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Tucker",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T17:52:53.000Z",
          "Titre": "LANshack always comes through with…",
          "Contenu": "LANshack always comes through with quick shipping and quality products at a fair price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean L",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T18:00:41.000Z",
          "Titre": "Always Above and Beyond",
          "Contenu": "Leslie and the crew at LANshack are top-notch.  They have come through for me multiple times and always deliver high-quality and reliable products.  I will keep coming back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ric Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T15:35:00.000Z",
          "Titre": "Painless ordering process.",
          "Contenu": "I've only ordered fiber cable from them twice but I did not have any issues with getting exactly what I ordered in a timely manner.  I was able to order the length I needed as the cables I ordered are custom made.  The pull loops on both ends are a must if you order."
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T15:14:45.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Customer Service was incredibly helpfu.  LanShack worked with me to ensure I had the right equipment.   When the package arrived open and the coupler was missing they sent a new one right away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T03:26:35.000Z",
          "Titre": "Easy to order and I get the fiber fast",
          "Contenu": "Easy to order and I get the fiber fast! We have had several orders from LanShack over the last few years and it’s always exactly what I ordered! Please keep up the good work and don’t change a thing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donk Cabling Inc",
          "Nb_Reviews": 5,
          "Date": "2022-08-03T00:05:51.000Z",
          "Titre": "Great company",
          "Contenu": "Exactly what I ordered, did have an issue with shipping but called and talked to Leslie and it was taken care of, great customer care!!!!Will keep ordering from LanShack!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Homa",
          "Nb_Reviews": 5,
          "Date": "2022-12-22T20:55:18.000Z",
          "Titre": "I confirm this review is about my own…I confirm this review is about my own genuine experience",
          "Contenu": "I confirm this review is about my own genuine experience. I am eligible to leave this review,and have not been offered any incentive or payment to leave a review for this company."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:51:18.000Z",
          "Titre": "All around great experience",
          "Contenu": "All around great experience. Price, shipping and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RHONDA MYERS",
          "Nb_Reviews": 3,
          "Date": "2023-06-08T18:44:12.000Z",
          "Titre": "Great customer service",
          "Contenu": "Ordering was simple. I forgot to send my tax-exempt certificate, but once I did, I was refunded without asking. That is great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bluesono USA Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:50:59.000Z",
          "Titre": "Items, Communication, Update",
          "Contenu": "Items are good to use,comfort communication,fast update"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:49:57.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, business credit app was a tad lengthy but service and the product are great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Person",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T17:02:35.000Z",
          "Titre": "Highly Recommended",
          "Contenu": "Consistently pleased with the results we get working with LANshack.  Helpful staff and quick production every time we've worked with them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 5,
          "Date": "2023-09-21T17:59:19.000Z",
          "Titre": "Wow - Great!",
          "Contenu": "Wow. the timeliness was excellent! I expected to wait between 1 and 2 weeks, but I received the items in a few days. Great Quality! Very happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T12:59:23.000Z",
          "Titre": "Great pricing and fast shipping",
          "Contenu": "Nothing but great experience ordering. Easy to use website. Great pricing and fast shipping. LANshack 2 Wins 0 Losses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott A",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T02:30:12.000Z",
          "Titre": "Arrived on nice reel in a timely…",
          "Contenu": "Arrived on nice reel in a timely manner. Updates on cut and shipping were appreciated. Updates help to schedule job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "allntechsales",
          "Nb_Reviews": 2,
          "Date": "2022-11-27T02:07:58.000Z",
          "Titre": "I had an issue with my order online",
          "Contenu": "I had an issue with my order online. I was able to add notes to the order and the sales team had it corrected immediately. These folks are top notch. They’ll get my business again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mercy P.",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T22:49:04.000Z",
          "Titre": "Quick delivery and great friendly…",
          "Contenu": "Quick delivery and great friendly staff.  Awesome company.  Keep it up you make my job as a installer a enjoyable one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ACN",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T22:59:21.000Z",
          "Titre": "950 feet of om4 armor …",
          "Contenu": "We installed 950 feet of om4 armor  with lc connector installed.we had pulling heads installed at each end. Fiber pulled in very nicely. And Tested very closely to the test number provided. We were very happy with there product and will order from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Torch Networks",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T16:35:46.000Z",
          "Titre": "Great first experience",
          "Contenu": "Everything was prepared and shipped according to the expectation set at the time of purchase. Spools of pre-terminated fiber were neatly packed and secure, proper lengths, and terminated correctly. Overall excellent first experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Murphy",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T22:29:56.000Z",
          "Titre": "Quality product at a good price",
          "Contenu": "Quality product at a good price. Great service and quick delivery. A happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnathan Lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:21:45.000Z",
          "Titre": "had everything I need",
          "Contenu": "had everything I need. when I emailed my questions got answered right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T15:02:53.000Z",
          "Titre": "Everything worked as advertised",
          "Contenu": "Everything worked as advertised.  No issues encountered on this order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T16:47:46.000Z",
          "Titre": "Knowledgeable Pre-Sales Info",
          "Contenu": "I contacted their sales department prior to ordering for information on pulling their assembly through conduit. After ordering and doing the pull, their advice was perfect to allow the pull without any binding or catching."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T02:14:35.000Z",
          "Titre": "Excellent products",
          "Contenu": "Excellent products. Didn't think anyone even made armored ethernet cable. Allways arrive promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy L",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T08:40:35.000Z",
          "Titre": "Perfectly manufactured fiber cables…",
          "Contenu": "Perfectly manufactured fiber cables everytime. Makes us look great when we install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AGE Integrated Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:20:53.000Z",
          "Titre": "Simple and exactly what we needed to…",
          "Contenu": "Simple and exactly what we needed to complete the job fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T05:01:02.000Z",
          "Titre": "Lanshack stepped up and expedited our…",
          "Contenu": "Lanshack stepped up and expedited our fiber order for an end user with a deadline."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt in Seattle.",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T18:02:03.000Z",
          "Titre": "Great experience",
          "Contenu": "The packaging, the line, and the pull attachment were great! Such a slick job and made things super easy. Will buy from these folks again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "don",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T13:26:44.000Z",
          "Titre": "Direct Burial",
          "Contenu": "I received my order of direct burial 5e either-net wire in short order and was not disappointed in the quality of the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T18:20:09.000Z",
          "Titre": "We always buy our patch cables from…",
          "Contenu": "We always buy our patch cables from LanShack.  Get price and great quality, plus quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Laegeler",
          "Nb_Reviews": 3,
          "Date": "2022-12-06T15:40:49.000Z",
          "Titre": "Very easy to place an order for 3…",
          "Contenu": "Very easy to place an order for 3 lengths of pre terminated OM4 armored fiber. Fast assembly and shipping. This is the place to order fiber"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOUG SHADE",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T23:26:56.000Z",
          "Titre": "Guys are off the hook. A team",
          "Contenu": "Awesome team. Got my parts and the info on questions I had. System up and running. Simple. Fast . Looking forward to the next one. Awesome staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T20:05:48.000Z",
          "Titre": "New to fiber cable",
          "Contenu": "My first time dealing w fiber cable.  I chose gel filled for a run from my house approx 130' to a garage.  cable looked well made, well packaged.   the pull hooks were strong.  everything pulled through my conduit without any issues.  Have run tests.  all good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T01:46:16.000Z",
          "Titre": "Excellent shop for networking needs",
          "Contenu": "Great selection of highly specific networking gear. Hassle-free shopping, quick service. Seems high quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:32:48.000Z",
          "Titre": "Great response times and very fast…",
          "Contenu": "Great response times and very fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Education Customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T20:41:22.000Z",
          "Titre": "Super Team",
          "Contenu": "Super TeamLeslie was wonderful to work with and was able to help our district get set up for Net30 and help me through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon L",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T19:43:23.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. Timely shipping and very accurate tracking. Couldn’t be happier. It’s great to work with true professionals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T22:03:35.000Z",
          "Titre": "Would use again.",
          "Contenu": "I can not review the product as I it was ordered early on for a project to insure I had it in time and it has not been installed yet.  I was very impressed to receive my order quite quickly!   Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barker Systems",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T15:36:04.000Z",
          "Titre": "Seamless Transaction",
          "Contenu": "As a repeat customer, I am always satisfied with the level of service provided by LANshack...........very efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Hayes",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T18:51:16.000Z",
          "Titre": "Had a great experience from the time…",
          "Contenu": "Had a great experience from the time that I placed the order to delivery. The wires came early and were exactly to spec."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Team Burkhart LLC.",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T14:02:41.000Z",
          "Titre": "Good quality, prompt, and clear communications!",
          "Contenu": "Good quality materials, and good turn around time on shipping! Everything was as expected and communications were clear. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron MacDonald",
          "Nb_Reviews": 15,
          "Date": "2023-03-17T00:58:15.000Z",
          "Titre": "Great service fast delivery",
          "Contenu": "Easy to find what I was looking for , great pricing and fast shipping. The ideal experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T19:07:16.000Z",
          "Titre": "Website is easy to navigate",
          "Contenu": "Website is easy to navigate, easy to design pre terminated cable, and order is fulfilled quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T22:53:04.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support. First time I’ve purchased from LANshack. Will buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T23:23:38.000Z",
          "Titre": "Appreciate the product",
          "Contenu": "Appreciate the product, the delivery and the costumer service. They reach out and answer any questions and concerns !! Greatly appreciated!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T19:50:24.000Z",
          "Titre": "Exceptional Quality",
          "Contenu": "The cat8 cables I ordered exceeded my expectations."
        }
      ]
    }
  ]
}