{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.turtlebeach.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marcus",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:45:17.000Z",
          "Titre": "i bought headphones for my son",
          "Contenu": "i bought headphones for my son.  2 or 3 weeks in they stopped working. spoke to Ed in customer service. they sent a new pair.  didn’t work.  model number was the same as the first set.    Ed sent another. they worked for again about a month or so.  and the replacement set crapped out. i will do my feet to avoid your products at all cost and have shared my experience with family and friends."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ken Richardson",
          "Nb_Reviews": 10,
          "Date": "2023-10-31T16:27:22.000Z",
          "Titre": "Defect after 10m, no replacement offered.",
          "Contenu": "Son’s headset split just shy of 10m of having the product.  I took them back to GAME who said that TB don’t class this damage as a warranty claim, only issues like the mic not working you can claim, so I told them to recycle them.  I then contacted TB, who to be fair did get back to me, but said they can’t replace unless I have the headset, which I don’t and told them I didn’t, a pic and receipt is not good enough apparently.  These cost £100.  Bad customer service, go for another brand if you want a quality product.After the reply from TB, maybe they should educate the retailers of their products that damage like this IS covered therefore would be able to send the item back.TB- He’s purchased a much better set from a better brand with better costumer service than you."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andy Connolly",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:17:00.000Z",
          "Titre": "Headset failed after a couple of months…",
          "Contenu": "Headset failed after a couple of months with minor use, it was replaced but this one also failed at the same place. Cleated design fault as I have seen numerous headsets online of the same model all fail at the same point. I have been in touch with customer service and wish to escalate the issue to a higher level which has been ignored. They will replace with the same headset again which will just break .....again for a third time.  Customer service is extremely slow, and only through email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T20:23:36.000Z",
          "Titre": "No one cared.",
          "Contenu": "No one ever called or emailed me back from my inquiry about my broken headphones. Since they were recently purchased I am highly disappointed as they were bought during Christmas and haven’t even made it through the first quarter of the year. poor quality on behalf of the company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Brannan",
          "Nb_Reviews": 4,
          "Date": "2015-02-10T11:52:00.000Z",
          "Titre": "Terrible experience",
          "Contenu": "I purchased a rather expensive Turtlebeach headset for my Xbox One console, after about 2 months the wire with the headphone jack attached came off making the headset non-functional. \r I was  completely unable to find any working UK contact numbers online for this company. I came across 2 numbers (one of them rang through and the other did not connect). The only way to have the item repaired is to submit a form online which I did roughly 2 weeks ago, it took them 6 days to reply to my E-Mail asking for further information. Over a week later I have still not heard anything back from them after trying my hardest to speak to someone concerning this. \r My 3 month warranty is about to run out and I fear I will not be able to have my headset replaced. \r I certainly will never buy a Turtlebeach product again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Low",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T03:06:16.000Z",
          "Titre": "My new headphones broke and you sent me…",
          "Contenu": "My new headphones broke and you sent me a refurbished pair. They work but not great volume adjustments is off and turning it on is extremely loud."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "connor boden",
          "Nb_Reviews": 2,
          "Date": "2020-10-11T20:27:23.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Worst customer service ever won't even let me buy a product that I need. They said if I still had warranty they would replace it which I don't.Now I'm currently looking for the product elsewhere and I saw I could buy it in America but can't get it shipped to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T23:44:14.000Z",
          "Titre": "Sent a controller to get warranted out…",
          "Contenu": "Sent a controller to get warranted out and they wont do anything then when i asked them to ship it back they won't do that either lol"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T18:29:45.000Z",
          "Titre": "Worst customer service ever!",
          "Contenu": "Worst customer service ever!! Purchased 2 stealth 600 gen2 max multiplatform xbox headsets. 1 worked. The other just static. Contacted to have replaced, they make you jump through hoops. Piecemeal questions. - what is serial number- do all of these tests and send us resultsFinally said okay, it needs to be returned. I boxed it all up, attached return label they sent and mailed it out. All within return holiday period. Only after they receive return do they start sending replacement.Finally got replacement. IT WAS DEFECTIVE! This one had a broken microphone right out of box.Contacted them again. Despite this is 2nd defective item, they still make you jump through hoops.- what is serial number- send us picturesThen you need to ship back.When asked to speak to superviser,  rep actually said that was not necessary. Like what? Who responds with that when a customer asks for a superviser.Rep says will expedite return, and will go out as soon as return is scanned as dropped off at UPS.Needless to say, item was dropped off, and 4 days later still nothing mailed out to me. Completely lied about expediting.  Still have not received product paid for for Christmas for my son.Also now rep said superviser will call me. And got no call. Also called Turtle Beach last week and was told superviser Malcolm would call me.Got no call.This is the worst company I have ever dealt with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T19:23:12.000Z",
          "Titre": "Your controllers suck",
          "Contenu": "I've been through 4 controllers in 6 months. Each replacement you send me breaks in under a month."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Devin",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T21:31:15.000Z",
          "Titre": "I am disappointed that the headphones I…",
          "Contenu": "I am disappointed that the headphones I had bought didn’t last long, and that the replacement I got from your warranty was only refurbished quality. Very disappointing for the price of what the headphones were."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T20:45:16.000Z",
          "Titre": "Dongle stopped working",
          "Contenu": "Dongle stopped working. Couldn’t use head set. Got sent another and it lasted one month and is not working again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Benson",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T00:51:55.000Z",
          "Titre": "Turtle beach headsets are garbage",
          "Contenu": "Turtle beach headsets are the absolute worst on the market. I can’t play for longer than 30 minutes without static. Once they begin to static they automatically disconnect my controller in the middle of the game. I will never purchase another set of turtle beaches. Absolute garbage"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Purplebutterfly",
          "Nb_Reviews": 10,
          "Date": "2022-10-11T07:18:44.000Z",
          "Titre": "Turtle beach 600 gen 2",
          "Contenu": "I brought the Turtlebeach 600 gen 2 from Smyths toy store. The Headset connects to the Ps4 with ease. However, I tried connecting them to a Samsung tablet and was not able too. The headsets were roughly £130 at time of purchase. I also brought an X rocker adrenaline V3 from argos. I tried to pair the headset and chair together and would not work. The headsets come with a usb device that connects to the ps4. I put this in the chair and it still did not work.After, the comment from Turtle beach I can confirm, that I am unable to find the Receipt from Smyths Toy Store."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul  Smith",
          "Nb_Reviews": 13,
          "Date": "2022-09-14T11:00:06.000Z",
          "Titre": "Clueless customer service",
          "Contenu": "Bought an Atlas Pro headset and 10 months later the sound was distorted or gone completely. The fault was around the jack connector so loose or broken wiring most likely. Contacted Turtle Beach who sent me a link to an article for microphone faults, I couldn’t open the link as it required sign in details. I replied to say that the microphone was not the problem and got a lengthy reply explaining how to fix my microphone problem. Contacted Amazon who agreed to issue me with a refund for the headset. The Atlas Pro has a detachable jack connector, if they had just sent a replacement for this I’d still be using the headset. Hopeless customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Colin Clements",
          "Nb_Reviews": 8,
          "Date": "2023-03-06T17:23:02.000Z",
          "Titre": "would not recommend anyone to spend…",
          "Contenu": "would not recommend anyone to spend money on a turtle beach headset spent a good amount of money buying one for it to break and to give it to them they replaced it but then the replacement headset broke again with the exact same issue to then be sent another replacement that was faulty with a audio issue to then be basically told they wont help i even offered to send the headset back to be repaired as it was sent to me faulty so now im left with a faulty headset that wont work so i will have to find a more reliable company to buy a new headset will 100% never be spending my money with turtle beach again"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Amritpal",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T20:36:48.000Z",
          "Titre": "There some defects in the new headset…",
          "Contenu": "There some defects in the new headset too"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Slick Willy",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T22:37:59.000Z",
          "Titre": "Paid $100 for my first set of turtle…",
          "Contenu": "Paid $100 for my first set of turtle beach headphones because I heard they were good. Within 30 days had to send them back. They were replaced under warranty which was nice however I continue to have problems with my new set of headphones and it’s been maybe 60 days since I got them.. they just don’t seem to be a reliable brand in my experience."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "William Van Meer",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T19:42:29.000Z",
          "Titre": "Terrible respect to customers",
          "Contenu": "So I bought a brand new pair of Stealth 600 Gen 2 headphones of theirs, and they have had nothing but issues since the start. Yes the support is polite, but when you try and tell them that their steps for fixing the problems dont work, they just up and ignore any further emails.   If you guys want to keep all values customers, you guys should really work with your customers alot better."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Keri",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T13:34:23.000Z",
          "Titre": "Absolutely terrible customer service",
          "Contenu": "Absolutely terrible customer service, ordered my son a headset that has been lost in transit by hermes. they sent me out a disclaimer form which I’ve returned on Friday, emailed 4 times now for an update and just being ignored! I’ve been waiting over 3 weeks. Never used them before and never will again"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anonym",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T09:50:54.000Z",
          "Titre": "DO NOT BUY FROM TURTLE BEACH / ROCCAT",
          "Contenu": "Worst customer service ever. I ordered 4 weeks ago, didn't receive anything not even a simple info that the delivery is delayed. When I proactively asked them what the f*** is going on with my order, they didn't seem to care about my problem. They still got my money but don't deliver anything and don't know about anything. --> DO NOT ORDER FROM ROCCAT / TURTLE BEACH (unless you want to pay and then don't get any products)"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Brandon Lee",
          "Nb_Reviews": 2,
          "Date": "2021-05-06T23:14:27.000Z",
          "Titre": "Turtle Beach are w*nkers",
          "Contenu": "If you're gonna get a headset don't bother going with Turtle Beach. But if youre gonna order one of their headsets just get it off amazon, \"3-6 business days\" turned into a 3 week delay because of a \"fault in their system\" and after a few weeks the headset isnt even working properly anymore"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather Kirk",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T14:52:52.000Z",
          "Titre": "Terrible company to deal with!!!",
          "Contenu": "If I could give a zero star for the customer service at this company I would. I have been waiting nearly a month now for a replacement headset for my son. It was under manufacturer warranty, and it was supposed to be sent out nearly 2 weeks ago and I have yet to see this replacement headset. Everyone you talk to you in customer service gives you the runaround never giving you a shipping number or tracking number for your product or replacement."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jessica Appleton",
          "Nb_Reviews": 4,
          "Date": "2020-09-11T14:39:17.000Z",
          "Titre": "Terrible!!",
          "Contenu": "Terrible!!! I paid for insurance they said they would replace the headset, but arnt instead I keep getting the same email saying please send a pic of the headset, cut the wire and send us a pic with the cut wire!! I've done this over and over and over yet I still keep getting the same reply!!! Theres no telephone number to call I'm so so so angry right now, I want the new headset I paid for !!!!! Thieves!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tony Steel",
          "Nb_Reviews": 3,
          "Date": "2020-09-28T11:09:11.000Z",
          "Titre": "Terrible wont buy again",
          "Contenu": "Bought the stealth 600 for my son. 2 years later the transmitter stopped working. Impossible to get a replacement. So now left with unusable headphones. I have contacted customer support twice. Not heard back from them. But all of a sudden I am being inundated with e mails frome them trying to get me to buy some new ones. Lost me as a customer for life"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T13:44:01.000Z",
          "Titre": "Waste of money dont buy them",
          "Contenu": "Please please please dont buy a headset from these scammers they are a wast of money i have spent 60 pound in the last week because i bought one and it broke and then i bought another one and it has just broke now. As you can probably tell this ha really annoyed me and i just want to say that they are a well known company so people buy heasets from them thinking that they are good. But they actually last for a few days and they then stop working. I want my money back"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Michael Harlingten",
          "Nb_Reviews": 3,
          "Date": "2020-10-27T21:58:23.000Z",
          "Titre": "Customer service and warranty",
          "Contenu": "Headphone was not working on the right side, they offered to replace them as they were still under warranty but I have to cut the cable....this is absolute idiocy.I have never heard of a company asking their product to be damaged further in order to honor their warranty.DO NOT BUY Turtle Beach!!...terrible customer service and warranty👎👎👎👎Spend your money on a gaming headset like Logitech who will replace them under warranty without question."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Richardson",
          "Nb_Reviews": 4,
          "Date": "2020-04-11T11:17:49.000Z",
          "Titre": "Only support was “turn it off and on again”",
          "Contenu": "The product was ok did the job however the customer service is very poor. After asking for advice and support on the product on what to do to fix the volume as it was perminatly set a on high. The only response was have I tried turning it off and on again and the Xbox on and off? Very poor and advice people not to buy from this brand as they are unwilling to support its customers."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carrie Esopenko",
          "Nb_Reviews": 2,
          "Date": "2020-04-15T15:22:02.000Z",
          "Titre": "Terrible service",
          "Contenu": "Terrible service, completed a warranty claim and nearly 3 weeks in the replacement item has not been shipped. Now saying must come the USA (which will take even longer for it to arrive) had to inquire as no updates. NO offer for a similar product. NO updates provided to me on their delays,  left in the dark. TERRIBLE SERVICE! and I have one very sad child"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Fidler",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T03:52:26.000Z",
          "Titre": "The tutle beach 70X is trash and a…",
          "Contenu": "The tutle beach 70X is trash and a complete waste of money!!! Its mic does not work,plus you can't use it on PC. I play on xbox and PC. Or on Nintendo switch.😡😡😡 i got for Christmas and i am mad i guess i should have specified not to get this headset.and it makes your ears hurt really bad.👎👎😡😡😡"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kaleb",
          "Nb_Reviews": 1,
          "Date": "2020-02-16T22:52:24.000Z",
          "Titre": "150$ headset broke in 1 month",
          "Contenu": "I paid 150$ for a new stealth 700 wireless headset and it broke in one month! Every time I try to turn it on it just says power on and then turns off it won’t connect to anything. I paid 7 $ for cheap ear buds and they lasted longer and a 150$ headset, Turtle beach is terrible if you’re thinking of buying it don’t for the safety of your bank account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "UpsetCustomer",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T20:18:12.000Z",
          "Titre": "No physical customer support",
          "Contenu": "Turtle beach has no physical customer support. Everything is handled electronically through email and you have to wait to get responses and support back. Don’t buy because they will experience some sort of issue or malfunction and you won’t be able to get support back fast enough."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joel Tonkel",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T15:53:57.000Z",
          "Titre": "If you like spending $100 every 6…",
          "Contenu": "If you like spending $100 every 6 months on new headphones than turtle beach is for you. Headphones work fine for a little bit then turn into a massive dumpster fire. First the 600 broke, the headset is so poorly put together with cheap plastic that if you don’t set it down on a cloud it snaps. After taping the ear piece back on a few months later it stopped working and  wouldn’t charge anymore. Upgraded to the 700 and after 6 months it won’t hold a charge. Don’t waste the money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Davey",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T10:10:30.000Z",
          "Titre": "Inferior products and poor customer service",
          "Contenu": "I bought a headset online from turtle beach .  After a few weeks one side stopped working .  I contacted turtle beach for a refund . they took so long to contact me regarding the return process that it was over the 30 days so I could not get a refund.  then they sent out a replacement to the billing address not the delivery address so I didnt receive ...beware of this company.... inferior products and 30 day refund policy applies from the day you order NOT the day you receive your goods !"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mart",
          "Nb_Reviews": 8,
          "Date": "2019-05-26T10:57:13.000Z",
          "Titre": "DONT BUY 600 STEALTH very poorly made…",
          "Contenu": "DONT BUY 600 STEALTH very poorly made the only thing that’s holds them together is a tiny bit of plastic and 2 tiny screws were you extend them so after a lot of movement putting them on taking them off I guarantee they will break both sides have broken tried taping them numerous times but still fall apart so decided to try out Razer brand with a lot more sturdy ness we’re they adjust and move for head size"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "liam",
          "Nb_Reviews": 10,
          "Date": "2020-04-17T02:11:33.000Z",
          "Titre": "Bought the 800X for Xbox in September…",
          "Contenu": "Bought the 800X for Xbox in September had the occasional but never major problem with audio drops now barely 6 months gone the audio drops are constant there's a high pitch noise coming through from and electronic devices 10 ft from the transmitter and batteries are already losing charge quicker. The pandemic basically means customer service is non-existent and I will never purchase another one of these over priced headsets. At least with Astro's you get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Toyama",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T15:06:53.000Z",
          "Titre": "Absolute s*** came out of the box brand…",
          "Contenu": "Absolute s*** came out of the box brand new with a defective battery that says it's fully charged but won't turn on unless it's plugged into a power charger this is a f****** s*** products Turtle Beach are scammers my first and last time buying a product from them and do not buy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vitaliy Grinberg",
          "Nb_Reviews": 2,
          "Date": "2019-12-27T21:21:25.000Z",
          "Titre": "Should have looked at reviews before…",
          "Contenu": "Should have looked at reviews before spending money on their product as a Christmas present...In short, just bough a brand new headset that didn't work properly out of the box. After a usual back and forth with their support, was told to just send it back \"to be replaced with a New or Refurbished product\". And not a single \"sorry\" for such a lack of QA. Not touching anything Turtle Beach - related ever again with a thirty-nine-and-a-half foot pole!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "M Carroll",
          "Nb_Reviews": 4,
          "Date": "2020-08-06T14:21:49.000Z",
          "Titre": "Did not want to give 1 star!",
          "Contenu": "Did not want to give 1 star!After many many many emails back and forth I finally received replacement headset but I am now waiting to be refunded for UPS delivery (no reply from my emails sent again) as I had to pay the £31 shocking to be treated so badly after spending £100 on the headset."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andy Mimnagh",
          "Nb_Reviews": 2,
          "Date": "2020-04-28T12:55:01.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service, they don’t reply to emails promptly, and when they do they don’t even read it. I bought a £70 headset and they sent me the complete wrong thing, then stated if I was unhappy with the purchase I need to return it, however shipping costs I could incur. All I asked them is to send me the thing I ordered. 2 weeks later I still have no headset. I am now having to go through PayPal to get my money back. Worst experience of purchasing online. DO NOT BUY FROM TURTLE BEACH."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Wigen",
          "Nb_Reviews": 1,
          "Date": "2019-11-29T18:56:46.000Z",
          "Titre": "TERRIBLE CUSTOMER SERVICE",
          "Contenu": "Stealth 600 for Xbox One stopped taking a charge. I have a Warranty. Been going back and forth with Customer Service for weeks via email, which is the only way they will speak with me regarding this issue. They keep telling me to repeat the same suggestions that I've already tried over and over.  Takes a few days to hear back from them each time. Been without headset for weeks, I just want it fixed or replaced in a timely manner, is that too much to ask? POOR CUSTOMER SERVICE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aero",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T19:27:40.000Z",
          "Titre": "I got a turtle Beach headset for my…",
          "Contenu": "I got a turtle Beach headset for my birthday a month after receiving it it no longer worked my controllers so I go to Turtlebeach.com to see if I can get refunded but it asked me for where and how I bought it and I do not know because I got for my birthday so I couldn’t get a refund I also go and email Turtlebeach and text one of their supports and no reply. They make a good headsets but it’s almost impossible to get your money back or a new headset if it breaks which apparently they do quite often and quite quickly."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Karen Holland",
          "Nb_Reviews": 2,
          "Date": "2018-07-25T13:57:05.000Z",
          "Titre": "I have never received such POOR…",
          "Contenu": "I have never received such POOR customer service EVER.  Returned a headset for replacement and still haven't received it after nearly six weeks, yes SIX WEEKS.  I've since read other reviews and other people have been waiting months for a replacement. Shocking.It takes days for them to answer an email, if they respond, and it's normally to fob you off.Don't bother buying anything from Turtle Beach."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T14:58:55.000Z",
          "Titre": "Turtle Beach Recon 200 broke 5 days",
          "Contenu": "Turtle Beach Recon 200 broke 5 days after I got it. The cord that connects the headset to the controller broke off in the controller making it a pain to get out. DO NOT RECOMMEND THIS COMPANY. They make cheap products and are stingy on their replacements. 1/10"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Timson",
          "Nb_Reviews": 4,
          "Date": "2019-07-22T19:17:21.000Z",
          "Titre": "Really terrible service",
          "Contenu": "Really terrible service. Missing an optical cable from my elite pro 2 headset and they’ve still not managed to send me one out and I’ve been talking to them for around a month now. They keep you waiting and waiting with the hope that you give up. I won’t give up, I want what I paid for!  Don’t ever use them, they are trash."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nathan Platt",
          "Nb_Reviews": 7,
          "Date": "2017-10-22T15:19:17.000Z",
          "Titre": "Awful Aftercare",
          "Contenu": "I've had an issue with my Headset, i returned it and they agreed to replace it. Fred advised it'll be sent back and gave me a UPS number. Once i received the UPS number i checked it and saw that it'll been sent to the wrong address. I emailed them and they corrected the address but I'm still to receive the headset.Its a great headset when it worked but the aftercare is awful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cristian gonzalez",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T19:25:52.000Z",
          "Titre": "Placed 2 orders online both orders got…",
          "Contenu": "Placed 2 orders online both orders got cancelled due to \"Fraud Prevention\". I asked them to clarify and their response was this \"You received that email because your payment method did not pass the security checks set by our Fraud Prevention Team. I would suggest trying to purchase from Amazon or a local store as we are not able to fulfill your order.\"Sincerely, JohnHorrible customer service, I used 2 different cards and checked with my bank to make sure there weren't any holds or fraudulent activity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 19,
          "Date": "2020-07-30T03:35:47.000Z",
          "Titre": "I bought the Stealth 700 headset for…",
          "Contenu": "I bought the Stealth 700 headset for Xbox which is supposedly the cream of the crop, on Jun 5th. It said battery life was 10 hours. Less than 2 months later the battery doesn't last 5 minutes on an overnight charge. Submitted a warranty request 6 days ago, and have yet to get a reply."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Craig gilbert",
          "Nb_Reviews": 1,
          "Date": "2019-01-08T13:52:25.000Z",
          "Titre": "Turtle beach customer service none existent",
          "Contenu": "Average products at best, the main problem is for me that you buy a £200 headset and if it doesn’t work there isn’t even a phone number to ring and ask a question regarding setup etc.... what other company makes top of the line products without any customer service at all. Please read the reviews before buying terrible company selling overpriced cheap goods.... no instructionsNo help number Headset won’t pair my 8yr old son still hasn’t used his Christmas present and I still can’t get hold of anyone. Please help me"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Thomas Williams",
          "Nb_Reviews": 1,
          "Date": "2017-08-04T11:45:13.000Z",
          "Titre": "Unacceptable",
          "Contenu": "Waiting 3-4 days per reply, get a reply with some automated/pre-written soulution,which looks like its been copy and pasted, surely it does not take 3/4 days to do that. now we are on the 4th day waiting for a reply on why they need my address, its been 4 weeks and headphones are still not working....Great."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victoria Pawlicki",
          "Nb_Reviews": 1,
          "Date": "2018-10-26T01:09:45.000Z",
          "Titre": "My $150 stealth 700s are a piece of…",
          "Contenu": "My $150 stealth 700s are a piece of trash. I had to get 2 pairs because my first one kept breaking and disconnecting for no reason. I then heard static and it started heating up. Didn’t even last me a year. They are so cheap. Never buying from this piece of trash scam company ever again"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2018-01-13T10:40:00.000Z",
          "Titre": "Fred",
          "Contenu": "Wish there was half a star because they don't even deserve a one star. Sent my XO SEVENS off for replacement in November. Fred told me that it will be with me the following week it is now January and no sign of them. Every time try to contact Turtle Beach support or Fred I get no reply."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Luke H",
          "Nb_Reviews": 2,
          "Date": "2020-05-13T09:41:15.000Z",
          "Titre": "Worst customer service and headset",
          "Contenu": "Worst customer service I've experienced, product is awful, it's clearly had an issue for 5 months, if they had any idea on their media I.e youtube or Facebook adverts they might actually realise. I'll never ever go for a turtle beach product again"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2020-01-10T08:49:23.000Z",
          "Titre": "Never had such a bad experience with a…",
          "Contenu": "Never had such a bad experience with a customer support in my life. They wont respond until you get to them trough Paypal or Klarna. And than u need to pay 20€ shipping because they wont send u a shipping label. Took me about 2 Months to send back a Headset..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "AI",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T10:00:34.000Z",
          "Titre": "Absolute joke customer service",
          "Contenu": "Didn’t deliver what I ordered, and waited days for reply to emails to then ignore the question in the first place. Would never order from these ever again. Waiting for my money back but I know I will be fighting for that for ever!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RedPill 79",
          "Nb_Reviews": 3,
          "Date": "2018-11-29T22:32:52.000Z",
          "Titre": "Bought two Stealth 300's at the same…",
          "Contenu": "Bought two Stealth 300's at the same time (one for me and one for my daughter) and not even 3 weeks later one became extremely statically at all times and the other the mic completely crapped out. For 75 dollars each for 2 pairs to have issues all within 3 weeks of purchase is insane. They are cheaply made to begin with and when you use them you instantly notice the cheapness quality to them. The sound when they did work was decent but not what I would expect from a 75 dollar headset. I'll never purchase a product from Turtle beach again. These things should never see the Light outside of China!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Scott",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T23:32:16.000Z",
          "Titre": "Headsets are cheaply made spent decent…",
          "Contenu": "Headsets are cheaply made spent decent money on these for them to break after a couple months of use. I made the mistake of buying two different models from turtle beach in both of them are dead, One lasted about a month the other one lasted close to three months. Very disappointed with this company you would think they would at least build them better and sturdier but I guess not. Don’t buy these you will be disappointed when they stop working and your kid wants you to buy another headset when you just spent a couple hundred dollars over the past four months.I will definitely be looking at other brands and I suggest if you’re looking for a headset you do the same."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Laia",
          "Nb_Reviews": 3,
          "Date": "2021-01-20T23:54:52.000Z",
          "Titre": "Awful company",
          "Contenu": "Awful company. Placed an order and did not receive confirmation of the delivery so had to chase them. They apologised for the issues with the warehouse and finally was told they would be dispatching the headset. I  asked them if they could amend the address as I was no longer there and they replied they couldn’t change it but cancelled my order and told me to buy the item again  even though all the items were sold out! When I told them they just asked me to keep checking the website for stock. So after all the hassle I was left without the headphones my son really wanted. I complaint expressing my frustrationand they did not even bothered to reply or offer a solution. Shocking"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom b",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T23:30:20.000Z",
          "Titre": "Turtle Beach Stealth 600 Gen 2",
          "Contenu": "Today I bought a new turtle beach headset and I was more than disappointed to find that my BLUETOOTH headphones don't connect without a Xbox Bluetooth connect adapter. I understand that I made a poorly educated buy but in the same respect for the price, I expected them to be able to connect to my PC, with. out. issue... This was clearly not the case. Turtle beach has lost a customer today because of how poor this business decision was and how ridiculous it is to have such a high price for a headset that cant even connect across most Bluetooth supported platforms. A poor attempt to make money with good looks on the outside and nothing short of trash on the inside."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J. Collier",
          "Nb_Reviews": 1,
          "Date": "2018-09-29T02:05:34.000Z",
          "Titre": "Bought $300 dollar pair that would not…",
          "Contenu": "Bought $300 dollar pair that would not charge the x800, called to report workers were very rude. I was sent a refurbished pair that went out after a week, tried sending back and couldn’t not get a reply from the company. Save your time and money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Hedley",
          "Nb_Reviews": 4,
          "Date": "2019-07-24T12:36:55.000Z",
          "Titre": "Very poor - don’t bother",
          "Contenu": "Very poor. Tried to order a cable. Not a difficult order you might think. Got an email saying dispatched. Tracking number not recognised by courier. 3 weeks of poor communication later and nothing having been delivered, I got a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Preston Worthen",
          "Nb_Reviews": 2,
          "Date": "2020-10-08T05:04:35.000Z",
          "Titre": "If you like headsets that fall/slip off…",
          "Contenu": "If you like headsets that fall/slip off your head every time you look down at your phone or something then you could not spend your money on a better headset for that. other than that these are some crap for headphones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Montalvo",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T23:34:41.000Z",
          "Titre": "Stealth 700s break every month",
          "Contenu": "Stealth 700s break every month, they stopped fixing them for me. Most useless headphones ever, literally don’t see how they are still in business with all these reviews, everyone says the same thing about them. #garbagecompany"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Guill",
          "Nb_Reviews": 1,
          "Date": "2020-12-26T16:53:02.000Z",
          "Titre": "DO NOT BUY!!!",
          "Contenu": "I recently bought the stealth 300 headphones and they don't even work. I followed every instruction, even the Spanish instructions. It wont even work. Whatever you do, NEVER EVER buy these headphones"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenny Tayla",
          "Nb_Reviews": 31,
          "Date": "2015-12-29T23:59:15.096Z",
          "Titre": "POOR",
          "Contenu": "Bought a headset for Christmas at the end of November, purchased wrong one. Waited till all bank holidays were over to notify them if I could exchange or refund and they refused saying it was after 28 days.  Shame on you TurtleBeach!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tim Stretton",
          "Nb_Reviews": 9,
          "Date": "2019-01-18T19:43:32.000Z",
          "Titre": "Purchased a Stealth headset 600 from…",
          "Contenu": "Purchased a Stealth headset 600 from turtle beach via Ao.com. Item was faulty so contacted Ao and was told to chasetroubleshooter/ refund through Turtlebeach. This is when the fun started.  I got some person called Fred (no surname)emailing me back and forth ref the refund i initially emailed them about. After 3 weeks and about ten emails asking my name 3 times ,address twice,serial numbers,invoice numbers,screen shot this send me this and everything else except my dogs name he finally said we dont do refunds. What a joke. Turtlebeach you are the most unprofessional company ive EVER dealt with and you employ some --well i will let you work it out. Still no refund NEVER again!!!."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jay Harris",
          "Nb_Reviews": 3,
          "Date": "2020-05-26T10:58:49.000Z",
          "Titre": "They just send generic Emails and don't…",
          "Contenu": "They just send generic Emails and don't bother with aftercare support, soon as you purchase something that's it, see you later.Their Sales emails are responded to timely though.Figures, stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T21:49:34.000Z",
          "Titre": "Headset came Broken/with Terrible Quality",
          "Contenu": "I bought the Stealth 300 headset for Xbox One and it came with terrible mic quality. Friends complained about constant static and my voice being too quiet regardless of the changes I made to settings."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2019-11-17T00:45:30.000Z",
          "Titre": "Absolutely terrible",
          "Contenu": "Absolutely terrible, I’ve had two sets of turtle beach headsets( stealth 600 & 700) and both of them started defaulting and breaking after at least a month, do not ever buy turtle beaches, you’ll regret it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Roman and Nolan Team",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T18:22:48.000Z",
          "Titre": "Turtle Beach is a garbage company",
          "Contenu": "I was exited got a Reacon 50 headset for my birthday it was working fine for about a month then that's when the sound was cutting in and out I was using it on my laptop and whenever I wanted to listen to my music I would have to turn the headphone jack connector for me to get semi clear sound shortly after that (about 2 weeks) I couldn't hear anything coming out that garbage headset. A month later I tried my luck again so I got a Reacon chat the one with one muff again it worked for about a month on my PS4 controller then just today I was jumping into a zoom class then I plug it in and I can't hear anything then I try it on my PS4 controller and the mic isn't working i'm never buying anything from this stupid company ever again."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Andreas Dalsaa",
          "Nb_Reviews": 11,
          "Date": "2017-10-05T13:02:40.000Z",
          "Titre": "Last year i brought a headset stealth …",
          "Contenu": "Last year i brought a headset stealth 450 from them. (directly at their Eu store). after a year the volume knob stops responding, and the headset always plays at maximum volume. After contacting them a few times, and being sent back and fourth to their supposedly eu devision who said they where only dealing with techincal support, i Got the message that i had had agreed to place an RMA on the headset. I go ahead and provide my full address. and they they started to ignore me. Havent heard anything for 2 weeks now, and nothing seems to be happening. While i love the headset and the quality, i dont think i would consider buying from them again, because i dont need to have an 100€ paper wheight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mataly Victor",
          "Nb_Reviews": 1,
          "Date": "2019-03-02T19:24:05.000Z",
          "Titre": "No costumer service and a non working mic",
          "Contenu": "I bought a headset and after 30 days the mic stopped working, so i called costumer service and they said i had to pay $85 to talk to them, i didn't even get help. now i got a headset that don't work"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Lorenzo Nuyttens",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T17:53:23.000Z",
          "Titre": "Turtle Beach replacement part",
          "Contenu": "UPDATE: After waiting a month for a shipment that normally should take 8-10 days according to their website i still haven't received anything. After contacting them what will happen now, they decided to get me a refund. Don't order online for turtlebeach parts. I have sent 16 emails for this matter, been told something else everytime.. Bad customer service to say the least.. *I ordered a plug in microphone 20 days ago. They've sent it with some unknown parcelservice ( Hermes) and there, for some reason, they decided to send it back to turtle beach. Tried to contact turtle beach, but it's near to impossible to get in touch with them. What company only has an email to send to? Some kind of customer-service would be nice.. I will never buy turtle beach again!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Cuffley",
          "Nb_Reviews": 5,
          "Date": "2019-08-07T09:53:58.000Z",
          "Titre": "don't bother buying turtle beach",
          "Contenu": "Bought a new headset in february, in late july (just 6 months later) it developed a high pitch whistle every now and again, gradually getting worse and more frequent, contacted turtle beach support (support being a VERY lose term) only to be told as i bought it through ebay (even though it was brand new when purchased from a shop rather than a private seller) i was told, essentially, tough, we wont help you, buy a new one! good old fred at turtle beach support! i shall be buying a new one, however, it won't have turtle beach written on it anywhere!they won't even entertain customer satisfaction, they could of just asked me to return the faulty one, and send me a replacement, but no, why should they, they already have my money"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T15:00:40.000Z",
          "Titre": "Stealth_600X_Gen2_Black bad choice for Xbox Series X",
          "Contenu": "Your Stealth_600X_Gen2_Black has a problem with distortions with the Xbox Series X (it skips sounds, music, and adding distortions). I did everything that was suggested by the tech support and including I got a replacement from you, and it is the same issue. I looked on your website and nothing regarding that is mentioned anywhere, I had to go to Reddit and other forums and find out that is a common problem with your equipment.  My mistake was not returned to the headphone to store the same day and I believed that It will be fixed in the future but no, 4 months later the problem persists, despite all the firmware update. I will not recommend your equipment to anybody, sorry for that but I found that a cheap wireless Chinese headphone ($40) works much much better than your Stealth_600X_Gen2_Black with the Xbox Series X, and that is not acceptable."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "George Doucette",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T15:14:46.000Z",
          "Titre": "Took 2 months to get headset replaced",
          "Contenu": "Took 2 months to get headset replaced.  Communication was very poor, slow and non responsive at times.  When I asked them to follow up on order as it was stuck in a city due to import fees, I got no response other then a request to fill out this customer survey????They need to improve on communication a lot for better customer service.In the end it took so long i had to purchased a new headset, and it was not a turtle beach........  I have used this product for over 10 years and spent $1000's with turtle beach.   I could never claim warranty on previous product cause i ususally alsted a month past warranty.......In the end due to poor customer service and reading other reviews on their product and other competitor products, I will be moving on and recommending other products to friends."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Will",
          "Nb_Reviews": 8,
          "Date": "2018-05-11T11:18:37.000Z",
          "Titre": "Literally worst customer services ever",
          "Contenu": "I have never experienced such bad customer services than with Turtle Beach! Brought new wireless set from amazon. They would not pair so nearly sent back to amazon for replacement would have taken matter of days to do return. For some stupid reason decided to go down warrenty route. Now nearly two months later still waiting for set to be sent.If you ever speak to a rowan on sutomer support shoot yourself will be easier. Every time chased told will be dispatched in 10/14 days even when over that time. Finally sent strong wondered email shall we say. Suddenly response changes to currently out of stock and waiting delivery. Still waiting. Still waiting.Will deffo never buy any turtle beach again, second rate product to match no rate customer service.They don’t even have a complaint email"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pauline Lawrence",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T18:06:35.000Z",
          "Titre": "Their customer service is an absolute…",
          "Contenu": "Their customer service is an absolute joke. They keep giving me the run around about refunding a product I NEVER RECIEVED. Dont know how they have any customers left"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "One Lucky B",
          "Nb_Reviews": 1,
          "Date": "2020-12-13T06:25:42.000Z",
          "Titre": "Xbox One Stealth 600",
          "Contenu": "Xbox One Stealth 600. I will never purchase another Turtle Beach headset again. Constant sound crackling and disconnects. The sound is also randomly warped like it is slowing down. I play with several friends on Xbox and they also have the same problems with theirs but mine seem to do it more consistently. Try playing CoD while this is happening... Also, the right side ear muff broke off while taking the headset off one day. I have never been one to be rough on my equipment. The headset broke where it is supposed to extend or retract to help fit your head. Only a wire remains keeping it together. It's plastic, I get it but c'mon man...I had a set of Afterglow AG9s for 2 years prior to these. They had their own minor problems but I wish I would have purchased those again instead of these. Hindsight is 2020.Beyond disappointed with TurtleBeach."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roachdog",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T00:25:05.000Z",
          "Titre": "HORRIBLE HEADSET",
          "Contenu": "HORRIBLE HEADSET! Worst company I’ve ever had to work with made returning my pos headset a F***ING NIGHTMARE. At the end of it was was wishing I was F***ING DEAD!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fishfood",
          "Nb_Reviews": 4,
          "Date": "2019-10-07T14:27:44.000Z",
          "Titre": "The lowest quality headphones I've ever…",
          "Contenu": "The lowest quality headphones I've ever tried. They fall apart within months, and the sound quality is crap. Sincerely, don't ever give them your money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 16,
          "Date": "2017-03-30T16:45:36.000Z",
          "Titre": "The products and return policy are insanely bad",
          "Contenu": "The products are now absolute rubbish, a complete waste of money.They know how bad their products are so to keep your money their return policy is that you can't return it, unless it is completely brand new. In other words, if you even take it out of the box to try it and find it isn't what you wanted or doesn't fit (in my case), then tough you can't give it back. Pathetic return policy.The Stealth 500P is a £90 headset, I paid £60 and was still disappointed. It is like a vice on your head, the fake leather on the ear cups is disgusting and hard, adding to the discomfort.Turtle Beach have my money and that's fine but hopefully this review makes sure enough people don't buy their awful products that they lose out on more than the money they conned me out of.Avoid if you want to save time and money, cheers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zexses _-",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T12:48:28.000Z",
          "Titre": "i probably went through 4 turtle beach…",
          "Contenu": "i probably went through 4 turtle beach headphones there so easy to break and not durable i will not be using another headset from turtle beach again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natsu",
          "Nb_Reviews": 2,
          "Date": "2020-11-21T02:51:08.000Z",
          "Titre": "Trash headphones don't ever buy them!",
          "Contenu": "Trash headphones don't ever buy them!! Always cutting in and out no matter what. Never again will I buy these terrible headphones."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Wayne Wright",
          "Nb_Reviews": 2,
          "Date": "2019-04-07T19:27:57.000Z",
          "Titre": "I got a set of stealth 300 for my son",
          "Contenu": "I got a set of stealth 300 for my son. Lasted 2 a weeks and the microphone went. This isn't the first time either. Worst headphones ever"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T LEE",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T01:34:50.000Z",
          "Titre": "ABSOLUTE TRASH!!!",
          "Contenu": "ABSOLUTE TRASH!!!! volume wheel went lose within 3 months, hurts ears after playing longer than 1 hour.... I dealt with all that.  149.99 plus tax for the stealth 700 for x box one i paid and right at 2 years later, require an update that can't even update because since the update release MY SH!T WONT STAY ON!!!  Customer support is a joke! Don't hold your breath for a response other than there automated response. They'll turn on but off again immediately after 5 seconds.... even when plugged into charger... I work hard and game hard and now I can't run squads of PVP because this TRASH won't even turn on or let alone update...!!!!! It is November 18th, 2020 and ever since the update rolled out, nothing!! Before then at least they actually WORKED! The craftsmanship is cheap and get a little uncomfortable but we play through that.... now, I cant even play! SPINELESS TACTIC TO TRY TO GET FOLKS TO BUY NEW ONES!!!  Guess what though, THEY DAMNED SURE WON'T BE THIS TRASH A$$ PRODUCT EVER AGAIN!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MC",
          "Nb_Reviews": 1,
          "Date": "2020-04-25T21:19:18.000Z",
          "Titre": "The quality of the headset is horrible",
          "Contenu": "The quality of the headset is horrible. Sound is great but that is it. The headset broke and I haven’t even had it for a year."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Ely",
          "Nb_Reviews": 9,
          "Date": "2018-09-02T18:03:30.000Z",
          "Titre": "No customer service",
          "Contenu": "Contacted their customer service since their support for their products is very poor and even after few months still no answer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "J Wallace",
          "Nb_Reviews": 91,
          "Date": "2018-01-16T14:29:16.000Z",
          "Titre": "These people are dishonest thieves",
          "Contenu": "These people are dishonest thieves with appauling customer service. They are selling £200 Elite Pro Headsets in the UK but if your £15 breakaway cable breaks, then bye bye £200 headset as they refuse to help or supply a replacement unless you live in the US. So your entire £200 investment on a headset is dependant on a cheap cable not breaking, If it does then you lose your headset like i did. Customer Serivce on twitter and on email just repeat, sorry we do not sell those to customers in europe. BE FORE WARNED AND DO NOT BUY THESE HEADSETS as they do not offer spares or repairs unless in warranty. Once warranty is up your headset is worthless, Id reccomend avoiding these lowlife. I offered to pay any amount for one or for repair all at my cost and was told no were not interested we wont sell you one or fix it. They should not be allowed to sell expsive headsets in the UK when they are discriminating aginst the UK market and not selling spare cables but they will sell them to you if your american, thieves"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Calvin Smith",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T06:30:39.000Z",
          "Titre": "Honestly complicated for zero reason",
          "Contenu": "Honestly complicated for zero reason. Do not buy these headphones. They should be taken off the shelves and burned."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2017-07-29T15:08:12.000Z",
          "Titre": "No service what so ever no replies no …",
          "Contenu": "No service what so ever no replies no matter where i contact them regarding a issue i have with my headset i bought from them."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T20:15:08.000Z",
          "Titre": "What the hell",
          "Contenu": "What the hell. The inner band of my Elite 800X broke last Christmas. Contacted their customer support, they got back quickly and send me an RMA to get it replaced. Over the next couple of month they kept making excuses about EU stock that had to be replenished, and when they said that had happened, the new headset would be sent out any day now. Halfway trough May they stopped communicating at all... I've logged a new complaint and send them a new email on their company address after that, but no response so far... I've been selling their headset during my previous job as a gamestore manager, and always thought of them as the highest quality products someone could get. But this is ridiculous... Very disappointed. At this point I'd even settle for getting the broken one back (even suggested so in my last couple of messages that I got no response to) and try to fix it myself. If anyone has any suggestions how to put some pressure on them? I'm even considering creating a Twitter account just for this, as someone below mentioned that seemed to get their attention..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dallas Sousek",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T02:57:44.000Z",
          "Titre": "Would give 0 stars",
          "Contenu": "Would give 0 stars.  3rd pair of headsets.  Literally bought them two days ago and they are already defective."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Kitchen",
          "Nb_Reviews": 5,
          "Date": "2019-09-04T08:31:39.000Z",
          "Titre": "To anyone thinking of buying Turtle…",
          "Contenu": "To anyone thinking of buying Turtle Beach I have one word - don't. The reason being is simple - they're very cheaply made with cheap materials. I had my elite pro headphones little over six months before they started falling apart and I've had to return them to be replaced. Fortunately, they offer a two year manufacturer warranty but that warranty doesn't reset when I receive my new headphones. I play online and have plenty of friends that also have the elite pro headphones and have also had the same problem. Also, if you search for Turtle Beach on Twitter you'll see many others with the same problem. I wouldn't be so bothered if it was a £30 product, but it's a £150 product and you expect more for your money. Clearly, it's a cheaply made product. While I'm happy TB are replacing my headphones for a new pair, I've already made my mind up that I'll never be buying from this brand again. I'll probably buy Sennheisers in future, as it's a brand I trust that's been making headphones for a lot longer than Turtle Beach. I made a mistake buying these headphones, don't make the same mistake I did."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joel Wingrove",
          "Nb_Reviews": 4,
          "Date": "2021-04-18T14:50:14.000Z",
          "Titre": "Terrible headsets",
          "Contenu": "Terrible headsets, audio stopped coming out of one of the sides after 1 month, very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Bernhard Widmer",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T06:59:35.000Z",
          "Titre": "Had 2 Elite pro",
          "Contenu": "Had 2 Elite pro, both cracked near the earpieces after just a few months. Very bad quality!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gamer Turtle",
          "Nb_Reviews": 1,
          "Date": "2018-07-28T05:55:22.000Z",
          "Titre": "bad customer service",
          "Contenu": "My Turtle Beach Ear Force XO ONE Xbox one headphones were only playing audio out of the left side so my mom called TB and said what the problem was. Then 5 days later a real person called back and said some BS of why it took so long. So she told them the details again and they said they would respond within 2-3 days. Again its after July 4th and they still havent responded. I cant really remember what happened next because it was more than a month ago. I think it was 5 or 6 days after they said they were going to call back and she called them again and said dont email me or call me just call this person which was my dad. They continued to email her 3 times in a row. He said he was going to deal with it himself. He was on his trip with bad reception so he was going to come home which was going to be 1 week and talk to TB. He got home and talked to them and I sent the headphones and the serial number in a box and shipped it to TB somewhere like missouri or maine whatever MS is. So still havent heard back from them. Shipped it like 4 weeks ago and first called them 1.3 months ago. Just dont buy turtle beach. im going to just buy some other brand thats not going to break within 3 months."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dan Dwyer",
          "Nb_Reviews": 18,
          "Date": "2014-12-15T20:33:46.000Z",
          "Titre": "no response",
          "Contenu": "I'm a elite customer and I have no reply from customer service! what chance do normal customers have!?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 10,
          "Date": "2019-12-12T13:08:49.000Z",
          "Titre": "Rubbish enough said will be buying Sony…",
          "Contenu": "Rubbish enough said will be buying Sony next for my console much better quality and value for money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mc_grrr",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T19:13:27.000Z",
          "Titre": "completely unreliable",
          "Contenu": "Just don’t buy turtle beach headphones, that are not reliable at all, mine broke in just 3 months"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:41:09.000Z",
          "Titre": "Poor construction",
          "Contenu": "This is the 3rd Turtle beach 700 gen 2 head set I've had first one I bought, the other two have both been warranty replacement for exactly the same issue. Snapping along the line between the band and ear phones. Better construction materials would be nice for a headset that cost £200 when new.Also the software from Turtle beach is shocking to say the least. Put the headset down for more then 4 minutes and you end up having to unplug the dongle and pluging back in to get it to reconnect.On the plus side and the only reason I haven't rated it one star is that the customer service is good and quick to respond and replace faulty head set."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:56:30.000Z",
          "Titre": "Software issues and this is the third…",
          "Contenu": "Software issues and this is the third one I received"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sophia",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T19:29:44.000Z",
          "Titre": "Great customer support bad quality product",
          "Contenu": "The support team was great about getting back to me in regards to turning in a product on warranty. However, I have had two xbox controllers develop stick drift in less than a month. I thought Turtle Beach was supposed to have quality products, but I have been utterly disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Ramirez",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T19:44:28.000Z",
          "Titre": "New issue has arisen after replacement",
          "Contenu": "The replacement process is fair and they shipped in a timely matter. I appreciate them replacing my headset after the left ear cup cracked from the hinge but the replacement had a new issue: I have to now restart my xbox every time I want turn on the headset because the dongle doesn't read my headset unless I restart for some reason. This was after I performed the firmware update"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 7,
          "Date": "2023-04-26T09:16:59.000Z",
          "Titre": "Poorly Made and Break to Easy",
          "Contenu": "Well, after my 2nd set of Elite Atlas Aero Wireless PC gaming headsets.. I am done with the Turtle Beach Brand. My 1st pair was in 2020, and then I got the same pair in June of 2022. The reason is because BOTH headsets broke in the same spot. Just above the left speaker. It's because everything is made out of plastic and poorly made. If you are looking to get a set of these, I would move on to a different brand or something made better. Don't get me wrong, the sound is pretty good, but not going to keep buying something that seems to break after 1 year of use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony Tinge",
          "Nb_Reviews": 6,
          "Date": "2022-12-20T22:11:40.000Z",
          "Titre": "The mic broke off my first headset…",
          "Contenu": "The mic broke off my first headset within a year. The warranty claim was handled quick and painless but the new headset has issues with the volume control roller. At times the volume will be at max when the roller is almost all the way down. I've found if you max the volume roller then turn it down all the way, then back up it'll work, for now. Overall the quality of the headset is just not there."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T18:47:07.000Z",
          "Titre": "Failing to appropriate resolve issues…",
          "Contenu": "Failing to appropriate resolve issues withe Velocity One product line in a timely manner; lack of transparency in the status of these fixes. Inadequate customer service - why do I have to go to Discord to find anything out, from other unhappy customers no less."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T00:04:43.000Z",
          "Titre": "I love the products but",
          "Contenu": "I love the products and the customer service with replacing my original headset that broke but I’m having problems with the mic on this replacement headset and I’m not very satisfied with how I was given a broken one to replace a broken one"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gun_gale_ Online",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T03:21:57.000Z",
          "Titre": "Stealth 600 gen 2 wont work!",
          "Contenu": "I use the stealth 600 gen 2. It worked great for 2 days at least. Then, after that, it quit working. I plugged it into my ps4 and the usb turns solid red, then flashed blue. Same with the headset. After that, they both blink blue forever. It wont stop blinking blue. And they never pair. I tried factory resetting the headset, didn't work. Tried resetting the ps4, didnt work. Charged the headset, still didnt work! The headset just will be stuck on blue blinking. Then, the headset just turns off."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Philippe Magiera",
          "Nb_Reviews": 14,
          "Date": "2020-08-29T20:23:38.000Z",
          "Titre": "Very disapointed at these headsets…",
          "Contenu": "Very disapointed at these headsets (Stealth 700 PS4 wireless, using them on my PC). The range the USB reaches the headsets is less than 5 meters and the active noicecancelling is not working at all...I so regret buying these ($180 wasted) :(Stay far far away from Turtle Beach and their lousy overprised products."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deven Davies",
          "Nb_Reviews": 3,
          "Date": "2018-04-29T19:29:28.000Z",
          "Titre": "Headphones Fell Apart After 1 Month",
          "Contenu": "Headphones started to fall apart after the second month. Admittedly this was only a 30 dollar pair but the quality as a whole was lacking. An uncomfortable design and while the voice quality was ok, it started to fade in and out around the second month as well. Would advise looking up reviews specific to the device you want to purchase, but overall this left a sour taste in my mouth towards their products as a whole and probably won't be even considering their more expensive sets."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dynamic Dominic",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T13:18:14.000Z",
          "Titre": "The Headset worked for about 3 months…",
          "Contenu": "The Headset worked for about 3 months but then it just wouldnt plug in to my xbox controller. I know its not a problem with my xbox controller becasue it stopped working for both on the same day but it still works for my phone"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "gordon",
          "Nb_Reviews": 12,
          "Date": "2011-12-17T11:36:38.000Z",
          "Titre": "Bad customer service",
          "Contenu": "This company refused to repair my broken headphones and instead offered to give me somebody else's pair that were already broken, and on top of that i had to pay for the refurbished pair they were offering. im definitely going to buy trittons next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "O.D.",
          "Nb_Reviews": 2,
          "Date": "2020-07-18T21:24:59.000Z",
          "Titre": "Junk",
          "Contenu": "Why do these plastic headphones cost $100? There are major design flaws here. After 9 months both sides of the headphones have snapped (cause you pull on them to put them on your head...) and the usb port is breaking and they're a pain to charge.Add a way to power these things with a cable as well. The low battery notification comes about 1 minute before they shut down and when you're in a raid and cant plug them in you're screwed. I have to plug them in every night or they die from about 2 hours of game play. Battery does not last 8 hours.Sound quality isn't anything special. They are uncomfortable on the ear after an hour. Thankfully these were a gift. Not a recommended buy."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Fame",
          "Nb_Reviews": 16,
          "Date": "2021-12-31T12:19:18.000Z",
          "Titre": "Stealth 700 Gen 2 Headset",
          "Contenu": "These are my genuine thoughts as someone who has excellent knowledge and experience in audio in general and who has tried and tested so many gaming headsets. GOOD:The headset is somewhat comfortable with plush memory foam ear pads. But it does have some clamping force, so if you’re someone who has a large head don’t even bother as it will literally give you headaches. MEDIOCRE:Turtle Beach Audio App is ok when it works and there seems to be a lot of bugs with it. Bluetooth disconnects randomly and the options you have in the app is not anything great. BAD:Whilst the sound quality in general is just ok, all this marketing about competitive headset is definitely rubbish. This headset is nothing like their old Elite Pro 2. Although that headset is wired, but the sound quality and superhuman hearing was great. With the 700 Gen 2 headset it’s awful and I do not recommend it to anyone who cares about critical sounds like footsteps and any other subtle sounds in FPS games, especially Warzone. This headset would be worth it at £80 and there are much better wireless headsets out there. I really hope they’ll make an Elite Pro 2 wireless version someday, but they really need stop with this app support and maybe introduce a desktop dac option like SteelSeries."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "chris b",
          "Nb_Reviews": 9,
          "Date": "2020-09-18T12:39:14.000Z",
          "Titre": "Let downs.",
          "Contenu": "Pay through PayPal, at least then you're protected."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Fehim Akindji",
          "Nb_Reviews": 3,
          "Date": "2020-06-07T16:27:04.000Z",
          "Titre": "Customer support is appalling.",
          "Contenu": "First time buyer directly from Turtle Beach website. Customer support takes a very long time to reply to emails. I appreciate the Covid-19 outbreak has affected lots of operations in most businesses. However, I can't see the number of emails received by Turtle Beach to be that much to cause delays like a whole 10 days or more to address customer issues. The other problem I experienced was whoever read my emails and I'm guessing a different person each time, was not reading properly and replied with requests that was already in my emails. Then another issue was lack of communication between their depot and customer service. I mean after all it's a retail company that sells products aimed at one particular market, so how hard could it be and it's not like it's the biggest company in the world with 100 different departments. You get the picture. Of course this was my experience as someone who purchased from TB for the first time and I value experience therefore, I would not purchase from their website again. The only reason I didn't give just one star is, I can recommend their Elite Pro 2 headset with amp easily to anyone. It's awesome and with the superhuman hearing it's ridiculously accurate with imaging, especially when playing FPS games. Only 2 downsides for me were lots of wires running across my living room floor, which was a death trap and the Bluetooth connection was quite unreliable. So if you're a desk gamer and TB makes their Bluetooth connection with the TB hub app more reliable then I can easily recommend. If you're a living room gamer then go for one of TB wireless options. But I would highly recommend to purchase from somewhere like Amazon as they usually price products cheaper than official sites and their return process is amazingly easy or simply if you haven't got a budget and ok with spending around £250-£300 then go for the SteelSeries Arctis Pro with game DAC or Pro Wireless. Omg they're simply the best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:20:55.000Z",
          "Titre": "Costumer service was really good,my…",
          "Contenu": "Costumer service was really good,my headset stopped working,I received optima to try and fix them with a reset,when that didn’t work I sent them in for another refurbished pair which worked for a little while till it happened again…I received the same options,kind of wish they’d sent me a new pair,but they did not,unfortunately I don’t use turtle beach anymore.i do like the product but I’m not going to buy another headset from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zane",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T17:37:41.000Z",
          "Titre": "It's all about the experience",
          "Contenu": "I feel like the sound quality  is unmatched. The problem is if I spend premium money I expect a premium experience. I've had 4 head sets over the years and with out fail within the first 6 months I've got burn my one warranty claim. Also would like to get battery level via light or through the app. I have really enjoyed my product but they don't last. Build quality (for headphones and transmitters) should be included in the premium experience"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:02:30.000Z",
          "Titre": "The Bluetooth Turtle Beach Stealth 700…",
          "Contenu": "The Bluetooth Turtle Beach Stealth 700 Max Gen 2 Headset had a weak bluetooth USB signal, easily having crackles during gameplay. Other than that, beautiful 3d audio and mic quality!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T18:30:35.000Z",
          "Titre": "Their warranty situation kind of sucks",
          "Contenu": "Their warranty situation kind of sucks, I paid all the money for a headset that broke after like 6months and odds are the replacement is a “factory refurbished version”"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rodney",
          "Nb_Reviews": 4,
          "Date": "2022-11-16T21:58:46.000Z",
          "Titre": "Great customer service, faulty product",
          "Contenu": "Great customer service, quickly replaced headsets.  Unfortunately this is obviously a very common problem and it doesn’t appear the company has taken any action to fix it.  I specifically asked if anything had been done to address the same breakages on many of the same headsets, I got no answer.  This was the second pair to snap for me in less than a year and I’m guessing when this pair breaks I will be out of luck since it will be more than a year since my original purchase.  I will not be spending more money on Turtle Beach if nothing has been done to address these issues, even though I love the headsets."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Myles",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T22:04:23.000Z",
          "Titre": "Still having mic volume issues",
          "Contenu": "Still having mic volume issues. Have to speak alot louder into the mic compared to when it was plugged into my elite"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lance",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T02:24:02.000Z",
          "Titre": "I am pleased with the sound quality of…",
          "Contenu": "I am pleased with the sound quality of the headset. I have had trouble with the connectivity and settings. If I don't connect to anything the volume is satisfactory. Once it's connected volume drops out. I have had a replacement with the same problem. I'm waiting on delivery of the third headset. Turtle Beach customer service has been awesome. They have not fought me about replacing the defective device. I have used Turtle Beach headsets exclusively for twelve years. This is the only time I have ever had any defects. I still recommend getting turtle Beach products."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JASON S",
          "Nb_Reviews": 2,
          "Date": "2022-09-21T23:35:30.000Z",
          "Titre": "The sound quality is awesome, BUT…",
          "Contenu": "The sound quality is awesome, but I have yet to own a pair (out of 3) that didn’t break within a year from gentle use. Usually it’s a failure from the ear extension stems or some piece of plastic that breaks-off rendering the earpiece useless. Put some metal in there!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 7,
          "Date": "2022-06-11T18:21:25.000Z",
          "Titre": "Elite Atlas Aero Wireless PC Gaming…",
          "Contenu": "Elite Atlas Aero Wireless PC Gaming Headset PC. I have had mine for about a year and I will say they sound good but after a year of use.. The Right ear pod has broke off the swivel to where it hooks up to the arch. I had to glue it back together. Some times the head set has a hard time hooking up with my computer and I have to turn it off and on a few times before it connects. To make these better, they need to relook at how the ear buds hook up to the arch and make it stronger. I did order a new set to give the headset 1 more shot before I go to something else and I hope the next ones last longer than a year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Spencer",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T21:32:59.000Z",
          "Titre": "Love the sound quality and the sound…",
          "Contenu": "Love the sound quality and the sound adjustments on the headset. Had to warranty a headset and customer service chat was amazingly fast to respond and quick to get all info needed and a new one shipped. However I’m going with 3 stars because I have the stealth 600 and it’s my 4th pair. They always break where the ear slides down. If it were metal or a different design I’d go 5 star"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DUGG",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T19:35:32.000Z",
          "Titre": "Good sound quality but...",
          "Contenu": "Good sound quality but the volume wheels for game and chat are not really good quality especially for headphones of this price. And the plastic coating is very fragile! It broke after only a year of use and I'm very careful with it."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Charles Jarman",
          "Nb_Reviews": 2,
          "Date": "2021-07-25T10:31:48.000Z",
          "Titre": "Having used gaming headphones for three…",
          "Contenu": "Having used gaming headphones for three years, the Turtle Beach sets do give me decent sounds, but the plastic they are made from boarders rice paper! They’ve all broken around the swivel junction, mending them with hot glue is the only thing that’s keeping them together. Come on TB, use better quality plastics or at least beef them up."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Tycho Loke",
          "Nb_Reviews": 34,
          "Date": "2018-01-17T20:30:31.000Z",
          "Titre": "My headset brakes to easily,",
          "Contenu": "My headset brakes to easily,I have owned 2 turtle beach px22 which worked great but after a while the audios starts being worse and worse and it just does not sound very well, and my cable broke as well after owning it for 5 months nothing they could do about it, I had about a total of 1,5 year fun with turtle beach but now it is time to switch over.Kind Regards,Tycho LokeCEOTycho Loke Services"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "John Muckian",
          "Nb_Reviews": 4,
          "Date": "2018-02-02T15:16:23.000Z",
          "Titre": "Repair or Replace Forgotten By Company",
          "Contenu": "I sent away my product because it stopped charging randomly. Sent away for repairs to the Birmingham branch and nearly half a year has gone now with no sign of me getting them back. Edit: They finally got back to me and sent me a new headset. It took them months but they got there in the end. An improved score from my original post as I am satisfied with what they sent"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "James Norris",
          "Nb_Reviews": 1,
          "Date": "2018-05-22T20:20:56.000Z",
          "Titre": "Annoying but they pulled through in the end...",
          "Contenu": "Not going to lie. It will be tricky. Don't believe that it will take 2 weeks, it took my replacement 4 months to arrive. Customer service email service (Fred) was less than useful. But in the end, after ramping up the pressure and contacting them on Twitter and talking about how bad of a service I was recieving, the headphones arrived a week later. No idea if this was a coincidence, but I did receive an upgrade from the XO Seven Pro to the Elite Pro, which put a sweet bow on the end of this sour tasting meal. Overall, I'd say hold out and you will be rewarded."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emma D",
          "Nb_Reviews": 11,
          "Date": "2018-03-11T18:47:52.000Z",
          "Titre": "Shocking customer service",
          "Contenu": "Headphones simply stopped working one day. I arranged a replacement quite easily and then the trouble began. Once they received my headphones I had no further updates. I waited 3 weeks and emailed them to be told my replacement had been shipped that day.. nothing came. Each time I emailed to chase up my replacement I would have to wait three days to be given the same reply. Your replacement was shipped today, if it doesn't come by Friday let us know and we will ship another... This went on for three months. Finally I had enough and asked for the details of someone else I could talk to. Waited three days for the reply, this time they said they had shipped my replacement that day but they also provided a tracking number with UPS.I highly doubt I was sent six pairs of headphones that all got lost in the mail. These people lie to you and lead you on for as long as they can get away with it. Will never buy from them again.Update - When I finally received my replacement it was an almost like for like exchange. I just wish they had been straight with me and said it would take a couple of months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dominick",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T22:42:42.000Z",
          "Titre": "Loved the help received but got another…",
          "Contenu": "Loved the help received but got another bonk set of head phones very unsatisfied."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Luke",
          "Nb_Reviews": 3,
          "Date": "2020-06-08T14:30:34.000Z",
          "Titre": "Good headset to start off with!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:19:42.000Z",
          "Titre": "turtle beach quick look",
          "Contenu": "Turtle beach customer support is fantastic and fast at resolving issues. My USB transmitter failed and was diagnosed and replaced quickly. My only real complaint (subject to personal preference) is that the headphones are a bit thin sounding and tinny. When comparing them to my Steel Arctis series headphones I find I lean towards the steel series more often. The microphone setup on the turtle beaches are great though."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "A.Green",
          "Nb_Reviews": 23,
          "Date": "2023-12-14T20:04:21.000Z",
          "Titre": "The headphones lasted less than a year…",
          "Contenu": "The headphones lasted less than a year but they got replaced by the customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony M",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:43:49.000Z",
          "Titre": "Good, could be better",
          "Contenu": "I have the stealth pro’s and they work wonderfully. Everything feels nice and nothing is too complicated. I want to do 5 stars but the issues with the headset are too prominent. This is a higher tier headset worth more money than others and it’s understandable why. But with issues of the sound just turning off. Or cutting in and out are bad. I replaced my previous headset yet this new one seems to have some issues too. Nothing that breaks it but they do stand out. I enjoy the headset but there is some work that needs to be done for this headset other then those issues I still enjoy it due to turtle beach getting back to me and getting me fast and getting me a replacement quickly"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T13:58:15.000Z",
          "Titre": "Great for wireless gaming",
          "Contenu": "Firstly the stealth pro headset is probably one of the best wireless headsets I've used it sounds fantastic you can pinpoint footsteps and even gun reloads, I would advise anyone that uses it on PC to download the audio hub software because it completely changes the sound from fantastic to out of this world you have a customizable EQ mix between game chat and game audio you can save profiles.The mic is good and can be customized via the audio hub to mute the mic just flip it up and you'll get an audio cue to confirm its muted. The noise cancelation isn't great because when you have it maxed out you will get a buzzing noise so I'd advise to not go above 50%. The battery life is what made this a 4 star review because they say 12 hours per battery but in reality it's around 9 hours. So would I  recommend these? Yes I would they're very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KeyPuncher",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T06:26:35.000Z",
          "Titre": "Really great customer service",
          "Contenu": "Really great customer service. Only downside I had was that my replacement headphones had some physical issues. The mic is really loose and wiggles around and the volume control is stiffer than it should be. But a replacement is better than having to buy a new set!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ritiusmaica",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T18:00:04.000Z",
          "Titre": "The sound quality is great however...",
          "Contenu": "The sound quality is great overall. However, the cord is too sensitive to bends overtime and  the damage makes the headphones feels like a waste when the functionality is destroyed. Perhaps making the cords more protected with tougher semi-metallic materials. Personally if your headphones had that the individual $30 price purchase will feel even more worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:43:02.000Z",
          "Titre": "I had to make a return and the whole…",
          "Contenu": "I had to make a return and the whole process was smooth thank you"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John M",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T02:47:16.000Z",
          "Titre": "Incredible customer service experience!",
          "Contenu": "Incredible customer service experience, prompt replies and sorting of any issues. Had a faulty controller and Turtle Beach created a package label straight away with a courier. Sent a replacement promptly also. Only reason I didn’t put five stars was the controller was faulty at the cable end, thus 4! Great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cole",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T03:35:45.000Z",
          "Titre": "Great customer service",
          "Contenu": "I was a bit disapointed the product had broke so quickly from light use but was extremely happy that your team was swift in answering mybquestions and getting me a replacement unit. I still recommend your product when I can."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T01:03:52.000Z",
          "Titre": "The headphones stop charging",
          "Contenu": "The headphones stop charging after 6 months, turtle beach replace them with a new headset. Stealth 600g2x.These expensive headsets should last for many years without any issue, the way I use them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trenton Janes",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T04:04:33.000Z",
          "Titre": "Cheapish USB adapter :(",
          "Contenu": "I purchased the stealth 600 USB Gen 2 not even a year ago and the USB adapter is already fried :( just make sure you buy a Microsoft Xbox USB adapter with it :( On an important note, the headphones themselves are phenomenal! But it just makes not being able to use them that much worse lol"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ciara",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T18:15:22.000Z",
          "Titre": "really great customer service",
          "Contenu": "really great customer service. my headset broke and it was under warranty so they sent me out a new pair. knocking a star off because it did take a few days to get a response which slowed down the process"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Traficanti",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T22:54:24.000Z",
          "Titre": "The V1F is great",
          "Contenu": "The V1F is great! and TB stood behind it when, after a successful attempt to update firmware to 1.4. the unit totally. The operation was a success but the patient died. However after giving me various unsuccessful fixes, the company replaced the V1F under warranty. It  works great but it came with the old 1.0 and I have been spooked about trying the update again, since I read others have had difficulties. Except for that I would have given a five. The software is awesome with so many choices for profiles and configuration. The Bush Trips and other items are the best. Eventually I will get up the nerve to update the firmware. I am just afraid to lose my profiles or total crash again. But I trust TB to help me through if any issues arise. This includes the customer service assistance I got.  Super!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOSEPH",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T03:24:41.000Z",
          "Titre": "Turtle Beach Stealth 600 Gen 2…",
          "Contenu": "Had a Turtle Beach Stealth 600 Gen 2 Wireless headset which cracked and subsequently broke on the headband right above the earmuff.  I contacted Turtle Beach and received a prompt response to my inquiry about a damaged headset.  I was instructed to take a photo of the headset with a reference number and a photo of the serial number on the head band. Once that was submitted a replacement headset would be sent.  My original headset was black and green, but I was informed that I would not receive the same headset, I would receive an artic camo.  Replacement headset was received, and it was a reconditioned headset based upon the paperwork within the packaging.  Currently I have no known issues with the replacement headset.  My only complaint is the color of the replacement headset, white and gray and how long it will remain that color.  I would have rated 5 stars if I would have received the same color headset. Process from start to finish, less than two weeks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theo",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T18:02:28.000Z",
          "Titre": "Great costumer service",
          "Contenu": "The baseline product is great in itself. Unfortunately mine had some issues but the support team hooked me up with helpful instructions on hard resetting the headset and when that failed they replaced my headset entirely. Over all a painless experience and I’m now enjoying the functional product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T00:58:58.000Z",
          "Titre": "Turtle Beach customer satisfied",
          "Contenu": "Turtle Beach was quick to respond and issue a replacement for my headphones even though they were a birthday gift with no receipt. I highly recommend their products and customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T18:36:50.000Z",
          "Titre": "Great Customer Seevice",
          "Contenu": "My teenage son broke a relatively new headset and turtle beach did a great job with customer service. They replaced the product in just about a week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dw maples",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T04:35:45.000Z",
          "Titre": "Dude there's to many questions that's…",
          "Contenu": "Dude there's to many questions that's why u get a 4 not a five it was so long ago I don't remember the date but everything was awesome except this rating system like u know when and what all you need to ask is a star level and that would've been 5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brooke",
          "Nb_Reviews": 3,
          "Date": "2022-12-28T00:47:19.000Z",
          "Titre": "Great quality product",
          "Contenu": "Great quality product! Only thing is it doesn't have mic playback like the old turtle beach headset but sound quality is wayyyyy better!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T02:47:17.000Z",
          "Titre": "Quality control issues",
          "Contenu": "Some quality control issues with the USB transmitter switching between the Xbox and USB modes. Customer service was excellent, very helpful to figure out what the problem was"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:05:51.000Z",
          "Titre": "Great customer service",
          "Contenu": "They were very helpful and sent a new one out"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "saverio",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:37:51.000Z",
          "Titre": "Great quality headphones",
          "Contenu": "Great quality headphones, reliablr and fast support"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T17:41:54.000Z",
          "Titre": "I was very impressed by hos fast",
          "Contenu": "I was very impressed by hos fast, efficient and prompt the service was."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T16:52:40.000Z",
          "Titre": "4.5 stars",
          "Contenu": "4.5 stars, headphones broke (the plastic headband) but TB sent me new ones and made it right. I like the quality of the sound a lot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Landon",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T22:56:38.000Z",
          "Titre": "Im assuming this is talking about my…",
          "Contenu": "Im assuming this is talking about my product. it's an overall good headset but I don't believe it lives up to to it's 40 hour battery life claim, as well as the headsets audio can cut a lot. Ive been told by the people I play with that the headset has bad mic quality which is a big downside if you ask meStealth 700 gen 2 pro max"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Purplebutterfly",
          "Nb_Reviews": 10,
          "Date": "2022-10-11T12:43:57.000Z",
          "Titre": "Turtle Beach 700 Gen 2",
          "Contenu": "Originally I brought, Turtlebeach 600 gen 2. After receiving feedback from turtlebeach, I decided to buy the Turtlebeach 700 Gen 2. The headsets Pair with the PS4, easily.However, I tried pairing them to a Samsung tablet, SM-T590, the tablet said it needed an app. So I downloaded the app. The headsets still would not work with the tablet, even after downloading the app.I tried pairing to another Samsung tablet, SM-T500.The headsets worked straight away via Bluetooth.I tried pairing the headsets to a Chromebook, Model C302C. The Chromebook, wouldn't even find the headsets. So I tried pairing it to an ASUS model F515J, which runs on windows 11. The computer found the headset, but no sound coming out of the headset while playing games. If I put the usb device into the computer, itself. This works.Headsets would not work my X rocker Chairs either."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rene",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T16:45:53.000Z",
          "Titre": "Good very helpful customer service and a great product",
          "Contenu": "Good very helpful customer service an"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T18:31:23.000Z",
          "Titre": "They Made Things Right!",
          "Contenu": "I appreciated the responsiveness of the Turtle Beach rep and their help in getting me a replacement wireless Xbox Series X headset. They acknowledged that the product was faulty and immediately began the process to send me a new one. Excellent service. The only thing that would have made me give 5 stars was if the headset hadn't broken in the first place, but that said, in the end they made things right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cornelius",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T16:35:37.000Z",
          "Titre": "Great Service, Great Product",
          "Contenu": "I was very happy with my headset until it broke. It was about 2 weeks out of warranty but you guys still honored that warranty and sent me a new pair quickly and easily. I also thought your customer success representative that helped me was a really nice guy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grant Hughes",
          "Nb_Reviews": 2,
          "Date": "2021-06-30T16:01:30.000Z",
          "Titre": "Ignore the other reviewers",
          "Contenu": "Stealth 700 Gen 2 are amazing. They are absolutely the best headset I have ever owned. (Keep in mind this is my first $100+ headset) It did have a few issues with wireless connection but it was all sorted out after a software update! Now I am currently dealing with their customer support for an issue with my earcup being a little loose. They stated after they receive my headset that they would send me a new one. (Email support took roughly 2 days) I don’t think the other reviewers here understand that headsets under $100 aren’t really meant to last. But for their higher priced products everything is good."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Javier",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T21:46:31.000Z",
          "Titre": "Perfect customer service",
          "Contenu": "My device provably had a design usual problem but customer service sent me another one to replace mine.Very happy with this solution.  Thanks to the team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Serxio Paz Olmos",
          "Nb_Reviews": 1,
          "Date": "2018-06-15T10:11:33.000Z",
          "Titre": "Excellent producer of gaming headsets",
          "Contenu": "Excellent producer of gaming headsets. In game like Call of Duty you spot enemies via 7.1 surroundsound before you can see them. With this headset you get a huge advantage against your opponents."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ivan",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T18:28:05.000Z",
          "Titre": "The prompt respond"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Turtle",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T10:34:17.000Z",
          "Titre": "Stealth 700 warranty",
          "Contenu": "My Stealth 700 battery died and i contacted turtle beach for warranty, they went for warranty and in 10-15 days i got new ones.Very good customer service,fast and simple."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kennith Kling",
          "Nb_Reviews": 12,
          "Date": "2019-11-19T13:57:37.000Z",
          "Titre": "My turtlebeach headphones were amazing…",
          "Contenu": "My turtlebeach headphones were amazing till the very second that they broke. Sadly they only held up for about 2 years, but the quality for sound was great"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jimmy Samsonite",
          "Nb_Reviews": 35,
          "Date": "2020-05-26T10:37:53.000Z",
          "Titre": "Lack of turtles and beatches",
          "Contenu": "Dont be fooled. There are no turtles or beatches. Very sad but on the plus side I can now hear colours and turn on fools.  4/5."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "K Amber",
          "Nb_Reviews": 3,
          "Date": "2020-10-27T20:32:27.000Z",
          "Titre": "the sound of the stealth 600's are…",
          "Contenu": "the sound of the stealth 600's are great - only downside is that they are a poor fit (slide off my head very easily)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Dude",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T15:40:43.000Z",
          "Titre": "I have emailed turtle beach in regards…",
          "Contenu": "I have emailed turtle beach in regards to honoring my warranty for my headset that has broken, and haven’t heard anything back for weeks. And have made it clear that if I chase them up about it they will simply block my email and never honor the warranty.. and yet they aren’t honoring it anyway?? Besides denouncing the company and never buying their products what else am I supposed to do? Edit: thank you for your response. As I am still waiting for that second email I have replied to the previous automated email. That only asked me to reply if my address was incorrect so I have replied that it is correct. I will gladly send the pictures of the damaged headset as soon as the second email arrives. Thanks again.2nd Edit: 30 min later still haven’t received any new emails.Reply: hi there. I’m unsure as to why I’m not receiving ur emails. As I got the first initial one from weeks ago. I’d love to be able to speak with someone in regards to giving u my email to try and help move things along. Or even speak with someone over the phone. Should I just keep replying to the automated email that asks me not to? Thank you I’m advance from any information you can provide me. I just hope I did it right this time lol"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T20:48:53.000Z",
          "Titre": "Customer service was quick and easy to…",
          "Contenu": "Customer service was quick and easy to deal with.  Very happy with the service"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Dallas",
          "Nb_Reviews": 150,
          "Date": "2021-03-13T08:24:07.000Z",
          "Titre": "I would say the headphones are good!",
          "Contenu": "I would say the headphones are good quality for the price you are paying!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zinidia PvP",
          "Nb_Reviews": 26,
          "Date": "2020-05-02T01:56:16.000Z",
          "Titre": "great headphones",
          "Contenu": "great headphones, my only issue is their very overpriced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T08:07:30.000Z",
          "Titre": "Turtle Beach Warranty is awesome",
          "Contenu": "Turtle Beach Warranty is awesome! Turtle Beach stands behind their products. I purchased the stealth 700 MAX to complement my PS5. Shortly after, they failed to turn on. I reached out to them. They sent me some instructions to follow & a Prepaid shipping label after determining warranty service was needed. I sent them in & got a replacement pair shortly after. Thank you turtle beach. It was hassle free. Im happy buying since they stand behind their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:15:57.000Z",
          "Titre": "Turtle Beach Provided Expeditious and Professional Support",
          "Contenu": "Turtle Beach worked diligently with to resolve the issue I had with one of the lights not working on the Flight Stick.  After being unsuccessful at resolving the issue I had with flight stick, they sent me authorization information to mail it back to them for free and they shipped me a brand new flight stick within a few days.  Excellent support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emilio",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:03:10.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "My headset broke twice within a year but customer service was able to send me a new pair quick and easy. I believe and brand loyalty and for that I will continue to shop here :)"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Duane Padayachi",
          "Nb_Reviews": 6,
          "Date": "2023-12-14T14:27:11.000Z",
          "Titre": "Seamless process",
          "Contenu": "The mic on my headset broke. I reached out to Turtle beach and it was unreal how seamless they made the replacement process. Within 3 or 4 days I received the new headset which works perfectly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Southern",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:25:29.000Z",
          "Titre": "I'm grateful for how fast responsive…",
          "Contenu": "I'm grateful for how fast responsive this experience has been. My new unit works just as it was supposed to be. Thank you for the quick delivery and ease of use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:50:36.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I bought a set of the Turtle Beach Stealth 600 Gen 2 MAX Wireless Gaming Headset, red ones last year and they broke in June, so I contacted the company and their customer service sent a replacement within 5 days, unfortunately that set snapped while on my sons head after 6 weeks so I contacted the company and without any issues replaced that one as well. They stand by their products and make it right when something does go wrong and other than the headband snapping on two of them in the same place they work great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:13:06.000Z",
          "Titre": "Relatively easy warranty process",
          "Contenu": "Bought a pair of turtle beaches in September, the mic went out in November & they exchanged them promptly, after giving them all the info. Turtle Beaches have been my go to for 15+ years."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robin.R",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:27:07.000Z",
          "Titre": "They was willing to help replace the…",
          "Contenu": "They was willing to help replace the headphones with no problems.. very fast on replying and sent out new headphones very quickly.. thank you for the great service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Emma Davies",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T16:13:37.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "Fantastic company. Purchased gaming headphones for my Son for his birthday a few months ago but after only a few weeks one side of the adjustable headphone band had snapped. Contacted Turtle Beach and provided proof of purchase, communication was quick and helpful. They arranged for the headphones to be returned and a brand new replacement set have just arrived under the warranty this morning. My Son is so happy. Thank you Turtle Beach this is excellent customer service and we would t hesitate to buy more products from you in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:07:43.000Z",
          "Titre": "Warranty",
          "Contenu": "The warranty exchange went very smooth and quick! The representative was helpful and explained every step needed.  My replacement headset was in best condition and works great! Thank you Turtle Beach!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:51:58.000Z",
          "Titre": "Customer service like no other",
          "Contenu": "I contacted customer service about how my controller was broken and from that they quickly sent me a return slip and postage to return the controller. I sent back the controller and without a long wait time they sent me a new replacement controller. The fast response to my initial problem was great but what really sealed the great experience was the no wait time on the solution. Thank you for such great service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Naylor",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T14:15:16.000Z",
          "Titre": "Replaced a set of headphones with out…",
          "Contenu": "Replaced a set of headphones with out any problems when i had an issue with the original supplier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosemary",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:24:10.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I bought a headset and after using it for about 3 weeks there began to be a lot of static.  I contacted customer service.  They were very responsive, courteous, and professional.  They ended up sending me a new headset."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Fergal De Paor",
          "Nb_Reviews": 5,
          "Date": "2023-12-07T00:34:40.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "My controller stopped working correctly. Fred from the customer service team dealt with my case quickly and professionally. They replaced the unit with no fuss. It’s a very good controller too."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:44:21.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, easy process to get my replacement.  This was the 2nd time the headrest broke at the mic due to a screw holding flimsy plastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T19:04:11.000Z",
          "Titre": "Turtle Beach Rocks",
          "Contenu": "The product worked well while it worked and when it didn't Turtle Beach made the process of repair or exchange painless and quick."
        },
        {
          "Note": 5,
          "Lieu": "PS",
          "Pseudo": "GARETH TAYLOR",
          "Nb_Reviews": 7,
          "Date": "2023-12-06T17:56:38.000Z",
          "Titre": "Customer service was second to none",
          "Contenu": "Customer service was second to none, I was having real problems with my stealth 700 and Melanie was my hero and sorted it for me . Great company, kept me as a customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T02:08:26.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Made really easy to return product to get service. Was a super fast turnaround had my new headset with in a week."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "louise scott (louise735)",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T16:12:44.000Z",
          "Titre": "Excellent after sales on a pair of…",
          "Contenu": "Excellent after sales on a pair of headphones"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T16:26:16.000Z",
          "Titre": "Exemplary Customer Service",
          "Contenu": "All game controllers will experience stick drift, so I'm glad I bought a Turtle Beach, because the replacement unit was on its way as soon as as the tracking number for the one I returned went active. I had the new on in hand less than a week later. Excellent service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:30:19.000Z",
          "Titre": "Excellent help",
          "Contenu": "Had a pair of stealth headphones malfunction. Help desk took care of everything and had a replacement pair shipped out in just a few days."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian Pike",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T15:24:10.000Z",
          "Titre": "Fred from technical support did his…",
          "Contenu": "Fred from technical support did his utmost to assist me with a problem I was experiencing."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Michael Basile",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T14:11:26.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service.  Warranty replacement for  my son sorted very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:38:51.000Z",
          "Titre": "broken headset",
          "Contenu": "When my headset broke they replaced it.  The new one works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dolores",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:45:56.000Z",
          "Titre": "Good product and great company",
          "Contenu": "Good product and great company. Will continue to buy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:17:35.000Z",
          "Titre": "The customer service and turnaround time were both excellent.",
          "Contenu": "The whole process was simple and straightforward with quick turnaround time to receive a new device."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rahul",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:38:29.000Z",
          "Titre": "Quick and Easy Replacement",
          "Contenu": "The mic wand broke, Turtlebeach sent a replacement hassle-free. Very happy with the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T20:55:40.000Z",
          "Titre": "Best Headsets around!",
          "Contenu": "Everything about the experience was good I bought a couple headsets last year and one of them had a problem they took into account that I had it for a minute but they were still awesome and replaced the unit it wasn't abused, but I expected that maybe get some kind of a credit back. Between the representative I talked to and the product I got they've been an excellent choice and I won't pick another headset provider. Thanks again Turtle Beach you guys are awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francisco",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:50:45.000Z",
          "Titre": "Turtle Beach for life.",
          "Contenu": "Turtle beach headsets are without a doubt the most technologically advanced and highest quality headsets for gaming out there. I cannot speak to their low end sets but as far as their high end gear, they reign supreme. There was a time when you could contact turtle beach support via phone but that is no longer the case. I was hesitant to contact them recently but found the support exceptional and speedy. I've been using turtle beach for 14 years and will continue to purchase their top tier models. If you haven't tried them, I highly suggest you do. Investing in a high quality headset will change your gaming forever. Don't get suckered by some random streamer into buying another brand who's new to the game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:45:09.000Z",
          "Titre": "Thorough and simple repair process",
          "Contenu": "I love my TB HEADSET! It was a gift and when the band unexpectedly snapped I was heart broken, but thankfully the process for inquiring into a repair was simple. Everyone I communicated with was helpful and informative!I was shipped a box, sent off my item, and a few weeks later got the repaired product! My only critique would be: please include instructions on reconnecting the headset to the console via bluetooth usb. 10/10 would recommend and use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "King Wakim",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:35:23.000Z",
          "Titre": "Easy Warranty replacement",
          "Contenu": "Warranty replacement. Fast response time from start to finish! Job well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Davon",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:36:28.000Z",
          "Titre": "great service",
          "Contenu": "great service, straight forward and timely. Thanks a lot team!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Laura Monteith",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T21:29:35.000Z",
          "Titre": "Very quick to sort out refund",
          "Contenu": "Very quick to sort out refund. Amazon had refused to do so and ny issue was sorted very quickly by turtle beach."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eldar",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:09:55.000Z",
          "Titre": "Technician did a great job and didn’t…",
          "Contenu": "Technician did a great job and didn’t give me a run around. Experience was smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Carr",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:54:38.000Z",
          "Titre": "Responded to claim quickly",
          "Contenu": "Responded to claim quickly. Clear instruction on replacement procedure. Friendly emails"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrie Morrow",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T19:15:20.000Z",
          "Titre": "Great company to do business with",
          "Contenu": "Turtle Beach makes great products, however, mine had a problem and I ended up having to use my warranty to get a replacement. They were very clear on the process, responded right away and communicated well. Then the claim was substantiated they were quick to replace the head phones and they are excellent. I would recommend their products and company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rachel Smith",
          "Nb_Reviews": 59,
          "Date": "2023-11-08T18:26:13.000Z",
          "Titre": "Great customer service",
          "Contenu": "Had an issue with my sons headset I bought for Christmas last year, nearly £200 the transmitter stoped working, tried the problem solvers they emailed without success, sent a replacement in no time at all.   How satisfying is it when a company respects you as a customer and does the right thing without question, this is how you get repeat business!!! 👍 well done 5***** service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Savv",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:33:47.000Z",
          "Titre": "Great customer service",
          "Contenu": "Their customer service team replaced a headset I had break in less than 15 days because I provided pictures of the damage. They were nice, fast, and sent me the newest model of the headset I had previously owned. I would recommend turtle beach users contact their customer service if you need anything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittanie",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:07:06.000Z",
          "Titre": "Proactive company!",
          "Contenu": "Quick and friendly responses that got me my new headset fast with no hassle. I’m happy I thought about contacting the company when it came down to my headsets mic breaking. Grateful they took care of it for me especially because I use them for work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:10:46.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Contacted about an issue with a broken part on my headset. Had explained what the situation was, I shipped in my old headset and within a few days had a new headset at my door, fully covered under warranty."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "EMMA",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T11:01:32.000Z",
          "Titre": "the customer service was very helpful",
          "Contenu": "the customer service was very helpful. i had been trying to pair my sons earphones with no joy, but after a few suggestions and emails back and forth with very easy step by steps to follow they sent out a new part."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dwillswill",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:24:03.000Z",
          "Titre": "Turtle Beach Stands By Their Products",
          "Contenu": "Unfortunately my headset broke while putting it on one day. I contacted Turtle Beaches customer service and they sent me out a replacement headset. The whole process took less than 3 weeks. I am completely satisfied."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Reilly",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:25:01.000Z",
          "Titre": "The best customer service…",
          "Contenu": "The best customer service professionals, you can tell a lot about a company on how they deal with you when things go wrong. Turtle Beach has a customer for life in me 👍"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "That dude",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T20:00:23.000Z",
          "Titre": "great customer service and products",
          "Contenu": "im a fan of turtle beach products, and the customer service has been the best I ahve experienced with a company via email. big fan, life long customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MikeMata",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T19:09:55.000Z",
          "Titre": "They’re quick to listen and help!",
          "Contenu": "Had a really good experience with them! I got the turtle beach atlas pro PC headset and when I tried them the audio was all messed up. So I tried an aux cord to see if that was the issue and it was. So I contacted support to get a replacement aux cord but instead they sent me a new headset! I was shocked but also delighted to know that they went above and beyond to help me with my issue. It all got resolved within a week! From filing the complaint to getting the new headset."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:57:43.000Z",
          "Titre": "Quick responses and service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Guy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:52:42.000Z",
          "Titre": "Fast and courteous after-sales service.",
          "Contenu": "I had a breakage on my earphones (wire torn off). After an initial email contact with Turtle Beach, I received a procedure to follow in order to receive a new product. In less than 10 days I had received my new earphones. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T01:03:37.000Z",
          "Titre": "Pretty great RMA service",
          "Contenu": "They were fast to send the labels to send the headset back and I got my headset back in a couple weeks after that.The rep was very cordial and answered my question pretty fast without trying to blame me for anything"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adrian R",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T16:25:30.000Z",
          "Titre": "Fantastic Customer Service",
          "Contenu": "Purchased a pair of Stealth 700 Gen two for my son in July 22. A week ago they broke, so I contacted Turtle Beach as they gave a two year warranty. They looked at the photos and asked me to inform Amazon that they had authorised an exchange under the warranty scheme. I contacted Amazon and thats where it became difficult, as the call centre was in India, it was difficult trying to explain to them. They just kept telling me that the 30 day return window had expired and that they could not exchange. I kept going around the houses with them, making no progress. Frustrated, I contacted Turtle Beach and explained my disappointment. Without hesitation Turtle Beach authorised delivery from their own warehouse of a replacement headset. The headset arrived this morning and is the latest version of the model we purchased last year. This is how customer service should be. Turtle Beach clearly care about their reputation and value their customers. Thank you Turtle Beach Customer Service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jackie",
          "Nb_Reviews": 6,
          "Date": "2023-11-10T10:58:21.000Z",
          "Titre": "Turtle Beach responded quickly",
          "Contenu": "Turtle Beach responded quickly, provided clear instructions on how to identify and resolve the issue. Without delay they replaced the item once the fault was identified. Fantastic customer service and fantastic products."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Fart master",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:42:31.000Z",
          "Titre": "Great customer service",
          "Contenu": "Dispite the first headset not working properly the turtle Beach team helped replace my headset in a timely manner and was very informative on the instructions and steps to replace the headphones. The second set works great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Artie Guzman",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T18:42:07.000Z",
          "Titre": "Happy with experience.",
          "Contenu": "Turtle beach stood behind their product. Would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:31:41.000Z",
          "Titre": "Was pleased with how easy it was to get…",
          "Contenu": "Was pleased with how easy it was to get help with warranty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:51:35.000Z",
          "Titre": "Turtle Beach Customer Service was incredible…",
          "Contenu": "Ron from turtle Beach was extremely helpful with both troubleshooting and eventually getting a replacement for my headset. After the customer service provided I don’t think I’ll ever buy another headset brand."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alice Evans Russell",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T17:45:30.000Z",
          "Titre": "Amazing customer service.",
          "Contenu": "Headphones snapped after 4 months of careful use. Very quick customer service chat led to replacement. Wish every company was this easy and honest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Campbell",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T08:19:54.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "They helped me with the replacement of a headset very professionally and efficiently. And the process was explained clearly and very easy to understand. Their customer service alone sets this company above all the others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T20:19:15.000Z",
          "Titre": "Absolutely top notch customer service",
          "Contenu": "Absolutely top notch customer service! When things go wrong I've had no issues getting a fix or replacement immediately. I wouldn't buy another brand ever again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pierre-Andre",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:51:09.000Z",
          "Titre": "I appreciate",
          "Contenu": "I appreciate the service and the way we solve my headphone problem. They send me a new microphone quickly and whitout any problems. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:36:12.000Z",
          "Titre": "Very fast response time and great…",
          "Contenu": "Very fast response time and great product replacement"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Collin",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:43:34.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Even though I had to return my headset multiple times, I ended up getting a free upgrade and have been satisfied ever since"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "LP",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T17:36:13.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support and sent out replacement parts which was fantastic! Highly recommended product support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:05:50.000Z",
          "Titre": "Turtlebeach stands behind their product.",
          "Contenu": "My sons headphones stopped working.  After a short email exchange i was sent a prepaid shipping label to send them to turtle beach and they sent him back a brand new pair.  Ive been a big fan of your company since the xbox 360 era.  Good to see that you stand behind your product.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:33:40.000Z",
          "Titre": "The emails were consistent",
          "Contenu": "The emails were consistent. Solved my 10 year old problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Risbo",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T07:57:44.000Z",
          "Titre": "Very good experience",
          "Contenu": "Very good experience, they took care of my problem right away, and keep me updated with the process. They keep behind their products."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kevo",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:39:13.000Z",
          "Titre": "Spot on start to finish and sorted my…",
          "Contenu": "Spot on start to finish and sorted my issue out."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Murdoch",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:07:18.000Z",
          "Titre": "Customer support is amazing",
          "Contenu": "During a move, i lost my dongle for my headset.  The part i needed, wasnt available in my region.  TB went far beyond my expectations and got me what i needed.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wade",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T08:22:28.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, very responsive and friendly. Resolved the issue without making us jump thru a million hoops."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JEFFREY DEITZ",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T00:36:09.000Z",
          "Titre": "It was very easy to resolve the…",
          "Contenu": "It was very easy to resolve the problem, the person who was in contact with me, was very helpful and responded very quickly,want to thank the whole process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abe",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:27:08.000Z",
          "Titre": "The amount of detail and thoroughness…",
          "Contenu": "The amount of detail and thoroughness displayed by Ed was outstanding. I truly appreciate the time and effort of him and his team! Thanks a ton!!!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T14:24:12.000Z",
          "Titre": "Excellent costumer support",
          "Contenu": "I had an issue with the headphones and contacted the costumer service. They were very helpful and quickly responded to my request. Excellent costumer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Felix",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T18:08:20.000Z",
          "Titre": "Probably one of the best headsets I've…",
          "Contenu": "Probably one of the best headsets I've owned if not the best headset, turtle beach customer service was even better, they took care of my problems with ease, and replaced a few broken headsets."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:16:51.000Z",
          "Titre": "They tried to help fix a problem with…",
          "Contenu": "They tried to help fix a problem with ne head set and the staff where on point with there questions and how to try and solve it.We couldn't fix them and sent me a new set and free post to send the broken one to them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:01:17.000Z",
          "Titre": "The warranty process is great and easy",
          "Contenu": "The warranty process is great and easy, there must be a defect in the product for it to continuously break in the same locations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:08:27.000Z",
          "Titre": "Amazing easy to work with",
          "Contenu": "Amazing easy to work with.  Backed their products. And everyone was very helpful and nice thoughout the entire process of getting my headset replaced"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:29:14.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, highly recommend them. The person handling my case was on it, I mean quick responses and quick turn around. Definitely recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:34:36.000Z",
          "Titre": "Turtle Beach was fantastic",
          "Contenu": "Turtle Beach was fantastic, they helped me out in a timely manner, and took care of everything I needed, I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:21:56.000Z",
          "Titre": "Turtle beach customer service",
          "Contenu": "Turtle beach customer service is top notch. Idk how else to say it, they're just aiming to please and they succeed every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rachel",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T17:32:55.000Z",
          "Titre": "Warranty on their products is a amazing!",
          "Contenu": "My headphones broke due to a design defect, and they replaced them very quicky and painlessly under their warranty policy. I will forever buy their products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:09:17.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service and work hard at completing the request"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:50:31.000Z",
          "Titre": "My concerns were listened to and fixed",
          "Contenu": "My concerns were listened to and fixed. The problem was solved. I would definitely purchase another turtle beach product with that kind of service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anne G.",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T23:11:54.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great service and warrenty coverage is great. Understanding staff and good explaination of what is needed. Thank you for the great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T18:46:36.000Z",
          "Titre": "I had to go through the RMA process…",
          "Contenu": "I had to go through the RMA process twice for the same headset (the second time being the replacement I got from the first RMA), and both times support was quick to act so I'll definitely be sticking with y'all in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:40:31.000Z",
          "Titre": "It was easy to file a claim and good service it was…",
          "Contenu": "It was easy to file a claim and it was addressed in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:46:29.000Z",
          "Titre": "My headset stopped working I went…",
          "Contenu": "My headset stopped working I went through the steps but it still didn’t work. They then sent me a new headset which I got within two days. I’m very happy with how fast they fixed this wrong!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Howard",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T23:49:07.000Z",
          "Titre": "My USB stick stopped working",
          "Contenu": "My USB stick stopped working. So I emailed Turtle Beach and explained what was going on. They had no problems sending me out a new one. Now I am back up and running thanks to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:40:08.000Z",
          "Titre": "My rep was very patient and very kind",
          "Contenu": "My rep was very patient and very kind. My issue was resolved without jumping through unnecessary hurdles. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BETSY",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:57:11.000Z",
          "Titre": "Great fast way of handelimg",
          "Contenu": "They quickly solved my problem"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sir McClown",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:59:34.000Z",
          "Titre": "Always 100% satisfied!",
          "Contenu": "They are good listeners, take the time to give you good advises, and they sell the best stuff (from my point of view). Always 100% satisfied every time with Turtle Beach."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Guillermo",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:11:30.000Z",
          "Titre": "Great service",
          "Contenu": "The atencion given"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dayna",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:59:39.000Z",
          "Titre": "Very reasonable and timely customer…",
          "Contenu": "Very reasonable and timely customer service experience, as long as a photo is provided they will work with you towards a solution with your product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:57:23.000Z",
          "Titre": "Turtle Beach was able to troubleshoot…",
          "Contenu": "Turtle Beach was able to troubleshoot all possible issues. Leading to an outcome that resolved my issue. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Karen",
          "Nb_Reviews": 20,
          "Date": "2023-12-06T21:08:18.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication. Dealt with problem quickly.Replaced faulty headphones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "oscar Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:09:43.000Z",
          "Titre": "So helpful great job"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Krisztian",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:11:45.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, fast response, proper handling of warranty case"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chaffee",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T03:34:46.000Z",
          "Titre": "Fantastic product, better company.",
          "Contenu": "I really appreciate how streamlined and efficient Turtle Beach's customer service was. I unfortunately did experience a mechanical mishap on an otherwise outstanding product. Turtle Beach paid for everything along the process of getting me a replacement, I am still using that replacement to this day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Graves",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T02:35:25.000Z",
          "Titre": "Very quick response",
          "Contenu": "Very quick response, I needed a part replaced and received it in a few days to get up and running. Great support, thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandan",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:13:14.000Z",
          "Titre": "Super fast!",
          "Contenu": "Got me a replacement headset and actually upgraded me technically. Super helpful and fast replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:31:14.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Excellent customer service and they stand behind their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:09:54.000Z",
          "Titre": "Support was clear and concise with…",
          "Contenu": "Support was clear and concise with directions. Very helpful and matter resolved. Very professional and helpful thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Trenton",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:12:36.000Z",
          "Titre": "My first pair of headphone broke",
          "Contenu": "My first pair of headphone broke, but I made a warrenty claim and they were speedy to reply. And I a newer and more study set of headphone!"
        }
      ]
    }
  ]
}