{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.issuu.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:07:37.000Z",
          "Titre": "Incredibly greedy.",
          "Contenu": "How greedy must you be to lock private uploads behind a subscription payment? Do better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tripp Crtive",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:21:20.000Z",
          "Titre": "Overpriced and Becoming Irrelevant. Embed Your Own PDFs, Stop Paying Their Insane Fees.",
          "Contenu": "Issuu is a UK based publisher of flipbooks, turning PDFs into readable files. So, they're kind of the Youtube of publications. Only thing, they charge ridiculous fees to host your content, unlike Youtube which is free. Issuu USED to a great service, which allowed for small publishers to host their publications, without the severe limits it no imposes without paying ridiculous fees. The free edition of Issu now allows a mere 5 files to be hosted, and limits the number of pages. Which essentially makes it useless unless you pay their ridiculous fees. I would advice anyone feeling equal disappointment with Issuu to look into embedding PDFs directly to their website, using Wordpress plugins. Issuu has made itself a greedy platform, that is becoming irrelevant as tech advances."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andréa paige",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:36:27.000Z",
          "Titre": "Horrible experience, don't use.",
          "Contenu": "Their customer service was nearly impossible to reach, and they charged me $1500 in recurring charges after I'd asked them to cancel. The package I bought years ago was not as promised - they continuously showed ads when they promised the package didn't have ads, etc. etc. Unfortunately, the transactions were direct debited through paypal, so I can't get the money back. Issuu cost me a lot of money and even more hassle. Do whatever you want to do on another program.UPDATE: Issuu commented here below as an attempt to clear their name, They sent me to a useless page, with no actual ability to talk to someone on their support team. A good company would simply leave a number I could call to get a human. This company is a total sham offering a defunct, useless product and making tons from ad money."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Philip Glover",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T13:36:49.000Z",
          "Titre": "Lack of customer service",
          "Contenu": "Lack of customer service, poor quality customer service when it was finally provided, and the theft of funds from my credit card.Basically stay clear of issuu."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Isla Architects",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T11:24:05.000Z",
          "Titre": "Very stupid pricing politic",
          "Contenu": "We have only one file online since the service was free. Not they charge us 28 dollars to keep that single file online. We asked for a special fee, taking into account that they changed the conditions but they said no. We will move to another similar service. I guess many people will do the same. Congrats."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T20:21:48.000Z",
          "Titre": "An absolute disaster",
          "Contenu": "An absolute disaster: the presentation has been indicated with explicit content and even though I changed it on our profile, it seems impossible to change it on something that has already published.Also, people who want to look at it have to register. Result: not so many people are looking at our presentation!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:35:45.000Z",
          "Titre": "I was misinformed about subscription…",
          "Contenu": "I was misinformed about subscription possibilities as there’s only ONE way people could subscribe to our publication. We specifically asked if we would be able to build out subscription tiers for our paying subscribers. Once Issuu took our money, we haven’t heard a word back from the rep for 6 days now after reaching out with this concern. I feel bamboozled/bait n switched. Unprofessional to say the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Silverman",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T01:03:18.000Z",
          "Titre": "Poor support…actually no support",
          "Contenu": "I requested assistance because I was having trouble posting my pdf to LinkedIn. I got zero response so I moved on to flowpaper. They responded to the same issue within minutes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:11:11.000Z",
          "Titre": "I have been trying to delete /…",
          "Contenu": "I have been trying to delete / deactivate my account and customer services has taken days to get back to me and has me going in circles. I've tried to delete account several times and it says \"service unavailable\". Customer service has been offered no help. And I was still charged over $500 for renewal / subscription. I've tried emailing several times, and calling the 800 #, left voicemails and no one has gotten back to me. This company is a scam. Do NOT USE THEM!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ieva",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T17:09:08.000Z",
          "Titre": "I would never trust what I read here",
          "Contenu": "I would never trust what I read here. There was a story published about an immigrant success story, after getting a bachelors degree. Diape Seck. Then there was a news story on a different site (WTOP). Then today this news came about how he has now been convicted and sentenced for participation in a bank fraud scheme while working in a bank in Maryland."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T02:07:20.000Z",
          "Titre": "No warning for flag for inappropriate content",
          "Contenu": "Got flagged for inappropriate content for a roller derby program I made without so much as an email to let me know and/or explain why. Went in circles in the help/support articles to try and figure out how to protest the flag, and finally gave up and used another service."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Said",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T04:40:08.000Z",
          "Titre": "Too little...",
          "Contenu": "The new limitations on the amount of publications and pages really make it hard to keep Issuu as my main portfolio. They used to be great!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andre",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T14:58:37.000Z",
          "Titre": "They will not respond to remove an…",
          "Contenu": "They will not respond to remove an article after I deleted my page that have sensitive information.Someone I use to do my Seo made a mistake and posted a article with my address on it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T19:30:55.000Z",
          "Titre": "Nott Affordable",
          "Contenu": "Its not affordable for someone who ks just showing a few portfolio pieces as flip books. Your LOWEST price point costs as much as Adove Creative Cloud."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "PawP",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T11:53:10.000Z",
          "Titre": "I definitely do not recommend this…",
          "Contenu": "I definitely do not recommend this service - there are better, more reliable alternatives. I wasn't able to publish my documents. I didn't receive any help or response from their support team for weeks. When I complained they told me they do not do refunds on monthly payments so I ended up paying for a useless service and platform that doesn't work. Waste of money - if things go wrong there is no support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T07:22:14.000Z",
          "Titre": "I’ve had no success in getting my name…",
          "Contenu": "I’ve had no success in getting my name off your site and I am furious."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Howard",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T12:34:01.000Z",
          "Titre": "Premium Price Service Not Premium Support...",
          "Contenu": "I have been using Issuu for years, and recommended it to colleagues. We host hundreds of our online catalogues and product guides. Today several working ones have stopped showing giving a lovely message of:We're working on it.This page is unavailable, but it will be back soon — we promise.Well live chat auto responded to email support, I've tried asking for a guideline on response times, no answer not even an apology. I have been waiting over an hour. Already costing me money, losing sales.Don't expect premium support to go along with your premium subscription.BenthamLtd"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T21:34:22.000Z",
          "Titre": "The table of contents (part of the app)…",
          "Contenu": "The table of contents (part of the app) wasn't showing up anymore. The rep went through my document and saw my table of contents which I created and thought it was fixed. Not at all...then she said \"If it was while using the Issuu app we have discontinued it, so at the moment publications can only be seen on web browser for mobile and desktopBut from what I can see the publication is behaving as expected\"This sounds very uncertain.And then, \"If you find a screenshot or if the reader can provide more information please let us know so we can look further into this\"Not helpful at all."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Mandrágora Terapeuta Holística",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T15:46:34.000Z",
          "Titre": "NO REFUNDS FOR MONTLY PLANS AND TOO LONG FOR A REPLY FROM CUSTOMER SERVICE",
          "Contenu": "We didn't know that the plan we've paid wasn't suitable for our needs, and customer service was so bad, we had to wait 2 days for an email reply in order to try to solve your situation, ending up wasting 7 days, which they wanted to add if we upgrade for the next plan.ISSUU told us to upgrade to the next plan if we paid the rest of the money, but due to having to wait so long for the replys, we had to proceed in getting another platform (there are plenty and many of those are free) so we don't lose clients.We wanted the refund and ISSUU does not refund for montly plans, only anuals!!!!!!!??? Losing $20 is as bad as $200 - for a starting company. I DON'T REMOMEND ISSUU TO ANYBODY"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Irish Girl",
          "Nb_Reviews": 2,
          "Date": "2022-02-14T08:29:22.000Z",
          "Titre": "Avoid. Customer advice never suitable",
          "Contenu": "When you contact them and they finally reply they give random answers and the issue is never solved. After 6 months back and forth I actually found that their documents never download full page and, if you simply add your file to your website as a link, it will open full page, without Issuu.Dreadful customer service.Awful advice... In fact the advice is the worst I've ever received.Will be warning others to go elsewhere.Issuu are the worst company I've dealt with. They never ever resolve problems.Awful. Waste of money. Avoid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gilbert",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T06:30:58.000Z",
          "Titre": "Customer service needs improvement",
          "Contenu": "ISSUU only connects with customers through email or messaging. Calling only leads to a non-responsive message. Verbal communications between parties are nearly impossible. Written word is not the best form of communication under some circumstances. It’s not particularly easy to explain through written word and ISSUU doesn’t make it easy to explain things. The site doesn’t have the best user experience. It’s not easy to use and they make opting out of higher services challenging. I do not recommend using ISSUU for digital publications."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Roberta Canepari",
          "Nb_Reviews": 3,
          "Date": "2023-03-03T09:53:08.000Z",
          "Titre": "I paid a premium subscription for five…",
          "Contenu": "I paid a premium subscription for five years in advance to keep my books to be seen to the public for free.  The ISSU sales team got it wrong and extended another account where I have no books and where therefore it is useless to have paid five years of subscription. To solve the problem they are slow in responding to email and not helping. Everything is even more unfortunate because I had to make this five-year subscription because ISSU changed its conditions since the books with the previous conditions should have been accessed even with the free version."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sara Q",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T06:25:01.000Z",
          "Titre": "Purchased the a monthly subscription…",
          "Contenu": "Purchased the a monthly subscription and the next day it was discounted 50% off for Black Friday. I contacted customer service to see if I could get a refund difference from what I paid but they totally denied me and didn't even consider my request. They couldn't make an exception for this one-off type of situation..? really? Didn't appreciate the customer service at all. Won't be renewing my subscription next month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doris V Walker",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T18:52:13.000Z",
          "Titre": "I cannot sell my magazine",
          "Contenu": "I cannot sell my magazine, seems as if your programmers and developers have caused a huge problem. I have an annual paid subscription. I have been told to delete my account and reupload, but how will the payment be made?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine A Gorecki",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T13:50:16.000Z",
          "Titre": "I have emailed three times asking for…",
          "Contenu": "I have emailed three times asking for help only to get emails back asking if there is still a problem.  Yes there is a problem and I do not seem to be getting any answers.  If someone could please call me since emails do not seem to work i would appreciate.My number is 248-691-1800 x 117"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Brock",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T11:15:03.000Z",
          "Titre": "I want a refund.",
          "Contenu": "Upgrade my account I don't have access STILL to the upgraded features. Tried to reach out for support.. TWICE.. this is the only email I've received and it's asking for a review..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon Mobley",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T18:13:47.000Z",
          "Titre": "Absolutely horrified with the way i was…",
          "Contenu": "Absolutely horrified with the way i was treated and over charged for a years subscription was so hard to get hold of anyone only online emails back and forth with silly responses i wanted a refund and my money back as they took money from my account of a renewal i knew nothing about was supposed to be in dollars too and they charged me the amount in British pounds.... keep well away"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Angela Rincón C.",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T00:58:20.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, I am already very sad because I have consulted many times with support and no one solves the problem for me, I need to download a pdf and I can't keep getting the same error"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Luchae",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T22:46:49.000Z",
          "Titre": "The new free version 5 limit has made…",
          "Contenu": "The new free version 5 limit has made me move to a different platform and will probably cause you to lose a lot of potential clients"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T21:29:50.000Z",
          "Titre": "No customer service exists!",
          "Contenu": "I have tried to contact you and can find no help.   I realized within an hour that your product was not what I needed and I’d like to cancel my subscription!  I can find no one to speak with!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eddy",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T23:41:31.000Z",
          "Titre": "Because You do not allow upto 5…",
          "Contenu": "Because You do not allow upto 5 submissions to post please allow us to post content free of cost."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Farhad Eftekhari",
          "Nb_Reviews": 2,
          "Date": "2021-11-13T17:32:50.000Z",
          "Titre": "Got the premium and then the dissapontment",
          "Contenu": "It does not make any sense to advertise your premium service as users can remove issuu brand when embedding, and when we purchase you remove the \"Powered by Issuu\" from the bottom, but keep Issuu brand and link in the embed anyway! We are going to use it for a month or two since we already placed our material, but we will terminate and migrate to another service if it stays like this."
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:03:49.000Z",
          "Titre": "The Issuu App for Wordpress Homepages…",
          "Contenu": "The Issuu App for Wordpress Homepages did not function with the regular Issuu account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T00:42:42.000Z",
          "Titre": "I was not permitted to upload my…",
          "Contenu": "I was not permitted to upload my completed document because the file was too large for the free version."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "alternativesmallbusiness.fund",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T22:33:19.000Z",
          "Titre": "Very Disappointed",
          "Contenu": "There is no visitor traffic from this platform not for my niche anyway,..."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Sergio Ricardo Barbosa Rangel",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T10:02:03.000Z",
          "Titre": "I don't want publish.",
          "Contenu": "I don't want publish in my accounts sergiorbrangel and sergioricardobarbosarangel. The files staying in draft format. I believe than my celular is hachead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T02:31:13.000Z",
          "Titre": "The link to the newspaper wouldn’t work…",
          "Contenu": "The link to the newspaper wouldn’t work even when it has been published."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wiliam Setterlund",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T23:02:42.000Z",
          "Titre": "Unhappy New Customer",
          "Contenu": "07/07/2023I've tried to contact support twice with no response.William SetterlundPresidentAmerican Business CollegeSan Diego California"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T10:30:39.000Z",
          "Titre": "No customer support got back to me",
          "Contenu": "I put in a request about the billing, and no one got back with me."
        },
        {
          "Note": 1,
          "Lieu": "NC",
          "Pseudo": "James Couille",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T00:19:05.000Z",
          "Titre": "Run away from this app",
          "Contenu": "Run away from this app! They are scammers. Instead, use this app, which is a great alternative: Calaméo"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Clare McGillivray",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T01:41:50.000Z",
          "Titre": "Didn't answer my question",
          "Contenu": "Didn't answer my question, was not helpful at all"
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Wanjiku Thuku",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T21:52:11.000Z",
          "Titre": "add more storage space for publications…",
          "Contenu": "add more storage space for publications without having extra charges for several years"
        },
        {
          "Note": 1,
          "Lieu": "DZ",
          "Pseudo": "imad",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T03:19:35.000Z",
          "Titre": "Hello, I did not understand this site exactly. I can learn, if not, is it to make money or what?"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:59:09.000Z",
          "Titre": "Too expensive and difficult to use"
        },
        {
          "Note": 1,
          "Lieu": "PA",
          "Pseudo": "Aury",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T13:27:23.000Z",
          "Titre": "The subscription is too expensive for…",
          "Contenu": "The subscription is too expensive for students"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "roushaun johnson",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T20:51:09.000Z",
          "Titre": "Help needed, 3rd Request",
          "Contenu": "Hello, I have reached out for help. Can you please give me a call. 707-430-1032."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Stolker",
          "Nb_Reviews": 2,
          "Date": "2020-09-29T17:28:38.000Z",
          "Titre": "Unreadable and slow to load",
          "Contenu": "I purchased an Issuu book a few days ago.  Three problems that made reading the book impossible or useless.  First, it only displayed two pages at a time instead of one.  The print was so small it was unreadable.  And while you could zoom it larger, you had to unzoom it to turn the page.  Second, the load speed of each page was extremely slow -- even with really good wifi.  Third, the pages were numbered backwards - the last page in the book was page one.  Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 2,
          "Date": "2020-04-17T05:13:19.000Z",
          "Titre": "You seem to have no way to report a…",
          "Contenu": "You seem to have no way to report a fake account.  I have written several times to let you know that k madin182 is a fake account.  The picture is of me, Kent Madin, and was stolen from my FB account.  The articles are all anonymous treatises on how I am a cyberstalker.  Again.. a guy named Earl de Blonville created the account and wrote and posted the material.  Take a look at it.. all kinds of wild charges, no corroboration and no claim of authorship."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emily",
          "Nb_Reviews": 5,
          "Date": "2019-11-30T12:05:03.000Z",
          "Titre": "Basic tool and unethical practices",
          "Contenu": "Signed up to free trial - the publishing itself is not great, you’re better off uploading a pdf file. The functionality is basic. But worst of all, unethical practice not to notify customers when free trial ends, bill immediately and not offer refund or partial refund if you cancel the subscription before the end of a billing cycle. I’m out of pocket 400USD despite cancelling the first day of the billing cycle. Highly unethical no care for customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sabrina Buchanan",
          "Nb_Reviews": 2,
          "Date": "2018-10-25T22:08:06.000Z",
          "Titre": "The free trial was not free",
          "Contenu": "I tried the 14-day free trial, decided the service wouldn't be financially smart for internal company use and then cancelled it. Regardless, Issuu charge me $420 for an annual subscription. Ludicrous. Complete scam.I have tried to contact their customer service team multiple ways and have had no success. I will continue to fight for my money back. I warn everyone   - do not use issuu."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2019-02-28T01:01:54.000Z",
          "Titre": "Avoid",
          "Contenu": "I have never gone to the web to post poor reviews before - but avoid this site! I had a free trial I thought I had cancelled - I notified the company the day the trial expired but they refused to refund a full year's premium membership at $420US. Any benefit from the tool is vastly outweighed by the 'scamming' customer service practices"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad Kava",
          "Nb_Reviews": 1,
          "Date": "2019-05-27T20:32:16.000Z",
          "Titre": "I signed up for the entry level fee but…",
          "Contenu": "I signed up for the entry level fee but was charged the maximum fee. I let it go and then was charged again the second year. I like the service, not the customer service. So, I tried to lower the fee back to the one I originally signed for and have received NO answer from them, no customer service. I see there is another company doing the same thing and I'm going to have to go there if they won't treat customers well. I wish I'd seen these reviews before I signed up."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Ast",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T09:06:20.000Z",
          "Titre": "We have cancelled the issuu account on…",
          "Contenu": "We have cancelled the issuu account on the 13th March 2019 as we didn't use it anymore. Surprisly we received the new invoice on the 29th September 2019 for new period until September 2020 and the credit card was charged by $420! We couldn't receive any help from issuu and we asked our bank if it's possible to get refund - unfortunately, we did not receive money back. The situation happened once again, today 29th September 2020, we received the invoice again and the card was charged! Stay away from this company and never use your card!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy Pinklove",
          "Nb_Reviews": 1,
          "Date": "2017-10-23T19:28:22.000Z",
          "Titre": "Unresolved Issue",
          "Contenu": "No one was able to resolve my issue.. I pay for this site, and was not able to upload my files. The customer service said, they couldn't find the solution and left it there. They DO NOT resolve their issues and are NOT responsible.. How come several representatives could not help me with my account? .. Fraud company..Closing my account."
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "lunakong",
          "Nb_Reviews": 1,
          "Date": "2019-05-15T13:35:45.000Z",
          "Titre": "Take care of their 14 day trial!!!!",
          "Contenu": "Take care of their 14 day trial!!!!They charged me for $420 at the very day I would like to cancel my trial without any notification. As a design student mainly focus on user experience, I'm quite sure the button and interface they designed is NOT friendly for users to find this scam. You cannot imagine $420 is how important for people have no income like me. And I tried to contact ISSUU to give my money back twice but they just don't make any reply. ISSUU makes me really really disappointed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Maria  Galiullina",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T18:07:12.000Z",
          "Titre": "Same situation as described previously",
          "Contenu": "Same situation as described previously! I signed up for a free trial because I just needed to use it once to apply for a job and ended up with $420 taken out from my bank account as they have automatically put me on the premium service which I had no idea about. Issuu never notified me about the upcoming charge! I tried contacting the customer support and had no response what so ever! Going to contact my bank to issue a dispute to this company as it is a complete SCAM! Shame on you ISSUU, this is not how you treat your customers at all!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy OConnell",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T17:25:52.000Z",
          "Titre": "AVOID AT ALL COSTS",
          "Contenu": "Heads up to everyone on here: do NOT sign up for Issuu free trial. It is apparently impossible to cancel then they charge you $420 and will not respond to any emails. They will not refund and are impossible to get ahold of. I looked online and saw hundreds of others who had the same experience. I wish someone would've given me the heads up of this businesses shady practices so I am going around a few places and leaving reviews so more people have the potential of avoiding this company and their services at all costs."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T15:02:43.000Z",
          "Titre": "Too damn exspensive"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Sonia Sonyeta",
          "Nb_Reviews": 1,
          "Date": "2019-05-24T13:28:11.000Z",
          "Titre": "They've designed an unfriendly…",
          "Contenu": "They've designed an unfriendly interface designed to charge 420 usd after the free trial period without any notification. I'm trying to downgrade my account and get they refund me this charge, and at the moment I only have received a negative reply,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Thao",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T19:36:38.000Z",
          "Titre": "I'm a new customer and trying to do a…",
          "Contenu": "I'm a new customer and trying to do a story. Can't upload all my files in one. I just need one simple help. But can't find any contact or email anywhere. Why is it so complicated to just have a contact number for support?"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Sergio Ricardo Barbosa Rangel",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T08:59:24.000Z",
          "Titre": "I don't get publish and my files are…",
          "Contenu": "I don't get publish and my files are draft."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:00:32.000Z",
          "Titre": "my portfolio has restricted view"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:59:52.000Z",
          "Titre": "very limiting options for publication…",
          "Contenu": "very limiting options for publication and vizualization"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Wood",
          "Nb_Reviews": 4,
          "Date": "2020-08-04T14:38:18.000Z",
          "Titre": "I find that I cannot print out a…",
          "Contenu": "I find that I cannot print out a document from the app, without contacting the company for assistance. Surely this facility should be a glaringly obvious function?"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Joao Vaz",
          "Nb_Reviews": 2,
          "Date": "2019-08-23T11:14:54.000Z",
          "Titre": "Fraud scamming",
          "Contenu": "Be aware that if you sign for the trial, ISSUU Inc. will cash the Premium subscription. ANd , even if you dont use it they will NOT do any refunding."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lucia Pinizotti",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T17:27:43.000Z",
          "Titre": "If I could give zero stars I would",
          "Contenu": "I signed up for a 15 day free trial. They charged my card the day I signed up. Now, I can't get in touch with them, other than by email. I get computer generated responses only. No actual contact to resolve this issue. I can't downgrade through their site as the page to do so won't load???? Unbelievable.Do not use this service unless you're absolutely sure you're going to be using it and never going to downgrade your account.UPDATE: I had to go to my bank to change my card so they couldn't continue to charge me and contacted the Better Business Bureau. Shortly after, I was contacted by their customer service department only to be told that they would not be refunding me. It was only after I advised the customer service agent that both my bank and BBB was involved was he was willing to give me a full refund. Sure, they refunded me, but I had to jump through hoops and go through the hassle of changing over all my autopays to the old card."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 34,
          "Date": "2019-07-07T19:32:52.000Z",
          "Titre": "Excellent choice of international…",
          "Contenu": "Excellent choice of international material, but never ending centre of screen adverts are so annoying and make content difficult to read."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "India Hynes",
          "Nb_Reviews": 2,
          "Date": "2020-04-02T16:24:57.000Z",
          "Titre": "WARNING",
          "Contenu": "WARNING! I like the platform but I don't like their business practice. They do not have an OFF on the auto renew, you have to cancel your account, GOOD luck if you prepaid. I will finish my contract, and go elsewhere. You did explain it but auto renewing without the option to renew or not is bad business practice. People should know that is what you are doing. I wish I knew that. So if people do use your company they should be warned there is no option but to auto renew or remember to cancel a month in advance, unless you have something else in your terms that says you have certain days to cancel before the next term. It sucks that you are so unethical. If you believed in your product, you would give customers the option to renew or not, you would advise them ahead of time that their contract is up for the year. etc.  So I will share my experience and my frustration. I calendared my cancellation a month before the auto renew, do you want to share with me now if you have some other info in your terms that would prohibit this?"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Eric FX Perr",
          "Nb_Reviews": 2,
          "Date": "2019-10-29T16:36:57.000Z",
          "Titre": "No customer support to speak of.",
          "Contenu": "No customer support to speak of.Email responses are usually off-target.Why anyone uses them is beyond comprehension.Eric"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Laura Young",
          "Nb_Reviews": 1,
          "Date": "2020-01-05T05:59:43.000Z",
          "Titre": "ISSUU Complaint",
          "Contenu": "Hi, on January 2nd I was charged 650 CAD for a subscription that I clearly remember downgrading. I signed up for ISSUU's free trial mid December 2019 (which is by default their most expensive premium plan) and after checking out the site immediately downgraded. Unfortunately I had given the system my payment details and it appears that the downgrade hadn't applied properly. ISSUU's website states that refunds can be granted within 30 days of the payment. I do expect a full refund as this is a website that I have found to be very convoluted in its sign up process and is one that I have no use for professionally and merely wanted to explore. I am a student who works part time and absolutely cannot afford such a subscription. I have already submitted two tickets to ISSUU's support system and have yet to hear back. After discovering that I am far from alone in this type of situation with the company I do hope they will make an effort to improve their communication with customers as their reputation is at stake, and do expect that this issue be resolved and a full refund granted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iris Rice",
          "Nb_Reviews": 2,
          "Date": "2018-02-22T17:08:39.000Z",
          "Titre": "This corporation offers a \"basic\" plan…",
          "Contenu": "This corporation offers a \"basic\" plan that does not require a credit card. There are limitations on how you can utilize this plan, but this is fine if you don't have plans to sell your work products. Recently, I was contacted by one of their representatives who suggested I consider upgrading to Premium service. The payment plan seemed rather suspicious and circumspect, so I declined. However, I still uploaded documents to my site. I discovered that this company has taken a manuscript I uploaded almost two years ago, and is selling it for $14.15 per page, WITHOUT MY CONSENT. When I told these Orwellians to terminate my account, they created a new account, WITHOUT MY CONSENT, and added four publications that I deleted! I deleted all of my publications so the crooks would not be able to sell my works illegally WITHOUT MY CONSENT. When you visit the portal to delete the account, the page is inoperable. When you ask them to delete the account, they refuse. Therefore, these bums better pay back every cent they sold my manuscript for. STAY AWAY FROM THESE CROOKED THUGS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TQwade",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T13:42:36.000Z",
          "Titre": "I have the SAME issue with this excuse…",
          "Contenu": "I have the SAME issue with this excuse for a company. You would think with the competition out here as well as a string of bad reviews they would work to improve their customer satisfaction index and quality rating but I guess not. Over the past few years I had referred several clients to them but will not be using them or referring them moving forward. I signed up for one of their subscription packages on behalf of a client who I later found out has a solution in place they were using. On the SAME day I was billed I reached out to issuu per their policy on refunds and notified them that the services were unused and not needed. I also cancelled subscription services to make sure it wouldnt appear we were attempting to use the service otherwise. It took  ten days for me to even get a response first off, and that they wouldnt be offering a refund along with a 'sorry about that' with no explanation or even an offer of credit for future purchases, nothing. I moved forward with a claim using my fulfillment channels so they will be dealing with it one way or another. If this is how you treat customers, you will be out of business if you continue this way."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T15:51:39.000Z",
          "Titre": "limited resources"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Harry parker",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T17:45:25.000Z",
          "Titre": "Make it free",
          "Contenu": "It's not free."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T15:15:16.000Z",
          "Titre": "Unreliable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:52:44.000Z",
          "Titre": "Not too pleased about being charged a…",
          "Contenu": "Not too pleased about being charged a different fee than current customers on the same program are paying $10 less less a month than we are. It’s kind of a punch in the face."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Book hoarder",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T17:45:54.000Z",
          "Titre": "I bought a monthly account to test",
          "Contenu": "I bought a monthly account to test, but realized I have been charged for the second month.Immediately after I realized sent a message to support and they said it is by default on automatic recharge and didn’t refund the $.Acting like grocery shops writing something important in a hidden place to trick people is CHEAP."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:13:53.000Z",
          "Titre": "Customer service is extremely slow",
          "Contenu": "Customer service is extremely slow. It takes a full day for a response and my issue has been dragged out for two weeks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:06:57.000Z",
          "Titre": "Way too expensive",
          "Contenu": "Way too expensiveIt's insane that they are charging around $20/mo just to be able to embed a PDF into a website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "fl",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:56:03.000Z",
          "Titre": "can not reach a person directly",
          "Contenu": "trying to get into account and need to reach a person directly and can't find how to do this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:33:39.000Z",
          "Titre": "Requires monthly fee just to post a single pdf to a webpage"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Merrick Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T00:32:00.000Z",
          "Titre": "I don’t like that my older publications…",
          "Contenu": "I don’t like that my older publications are now restricted. The 5 posts limit is a poor choice for marketing and will cause us to find better places to source our newsletter in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brooke",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T23:01:24.000Z",
          "Titre": "Distorts Square Pages; Not Nearly Enough User Support",
          "Contenu": "Not nearly enough support, I can only get help for sales or the AI replies that don’t meet my needs. The website claims that Issuu can accommodate any dimension page, but my square pages appear stretched on the mobile single-page viewer. I’ve noticed this to be the case with other square publications by other users, so maybe it’s a bug. I resized my entire file to be in a traditional page dimension, and have still been having issues with my pages being distorted in that view. There is no help forum and the pre-filled Q&A are not helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cindy Saltzman",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T23:18:43.000Z",
          "Titre": "Customer service -not responsive",
          "Contenu": "We have been with Issuu for over a decade. This year as we have expanded to national exposure, they convinced us to pay the year up front to save money. Since then, the customer service has been terrible. We had a priority issue that came up and they didn't respond for 10 days and even then it wasn't helpful. They still have not responded to the issue but now it is too late and they keep sending robotic inquiries."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monroe Street Management",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:33:45.000Z",
          "Titre": "Mixed Experience with Issuu's Subscription and Customer Service",
          "Contenu": "I recently had an experience with Issuu that I feel compelled to share. Initially attracted by the platform's promising integration with Adobe InDesign, I was looking forward to exploring its features. However, my enthusiasm waned as I found the tools underwhelming, the APIs non-functional, and the pricing higher compared to other software options.Consequently, I decided to downgrade to the free plan. Unfortunately, this is where my challenges began. Despite my immediate action to cancel the subscription on the same day of creation, I faced difficulties in obtaining a confirmation of the cancellation and a refund. The response from Issuu's support team was prompt but strictly adhered to their policy: no refunds for monthly subscriptions.While I understand the importance of company policies, the lack of flexibility, especially considering the immediate cancellation, was disappointing. The situation escalated to the point where I had to initiate a chargeback through my credit card company, which thankfully resolved in my favor.On a positive note, Issuu’s communication was clear and their response times were quick. However, the rigidity of their refund policy and the ensuing hassle left a sour taste.To potential Issuu customers, I'd advise being very certain about your need for the service before subscribing, as their refund policy is stringent, particularly for monthly plans. My experience serves as a reminder that while digital tools can be beneficial, the customer service aspect plays a crucial role in the overall satisfaction with a service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michelle",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T00:09:30.000Z",
          "Titre": "strange and lengthy breaks…",
          "Contenu": "there were strange and lengthy breaks in conversation. then after I ended the chat and started another one (because the rep was unresponsive) another rep hopped on then without notice, the original rep came into the chat. strange! my issue was ultimately resolved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T22:02:35.000Z",
          "Titre": "The service is great",
          "Contenu": "The service is great, but overpriced.The money from your advertisers should cover ISSUU's operating expenses, there is no need to charge $30/month to upload a 51 page .pdf and have such limitations on features."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-15T03:59:59.000Z",
          "Titre": "Love but too much branding",
          "Contenu": "Love the app for the most part but the fact that it’s so heavily branded and impossible to remove makes it nearly not worth using. I’ll explore alternatives for that fact alone."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Thomas Söderqvist",
          "Nb_Reviews": 30,
          "Date": "2022-08-26T10:19:51.000Z",
          "Titre": "Extremely slow support response",
          "Contenu": "They probably have a good product, since many companies use them. But when I contacted the support team for a simple question about the functionality, it took them seven (!) days to respond, just to say they were forwarding my question to another department. So then I contacted the support team of one of Issuu's competitors on the flipbook market and got a precise answer in less than five minutes. Understandably, I will subscribe to the competitor's product instead. Actually, now I can see that many of the bad reviews Issuu gets is from people who are exasperated by the bad support service level."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T20:21:11.000Z",
          "Titre": "Technical problems when uploading my…",
          "Contenu": "Technical problems when uploading my file and no response from the technical support service (I contacted theAug 1, 11:35 a.m. Still no constructive answer"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T20:25:37.000Z",
          "Titre": "Lame too many ads and confusion around…",
          "Contenu": "Lame too many ads and confusion around the flip book. Too expensive to use. I linked to it for a day or two then decided to just link to the PDF and let people scroll down."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T10:28:10.000Z",
          "Titre": "First time using Issuu for a…",
          "Contenu": "First time using Issuu for a publication, easy to use but website was down consistently or frozen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T21:01:25.000Z",
          "Titre": "I reached out for help with account…",
          "Contenu": "I reached out for help with account recovery and never heard back."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:22:48.000Z",
          "Titre": "I was unable to link my bank account…",
          "Contenu": "I was unable to link my bank account via stripe to your website"
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T11:57:56.000Z",
          "Titre": "displaying 1 page should be easier than…",
          "Contenu": "displaying 1 page should be easier than this."
        },
        {
          "Note": 2,
          "Lieu": "CL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T19:02:39.000Z",
          "Titre": "limit upload is just stupid",
          "Contenu": "limit upload is just stupid. Feels like Cuba"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sue Clough",
          "Nb_Reviews": 3,
          "Date": "2020-08-26T07:35:42.000Z",
          "Titre": "Support is disappointing",
          "Contenu": "I'm really surprised to see all the comments here about great and fast support - I can't get anyone to respond to me at all. We only paid our subscription last week and are considering cancelling it due to the fact it is impossible to contact anyone for support.In response to Trustpilot response:  Nope - I had 2 different enquiries and someone only contacted me about 1 of them, which is not resolved. The other one nobody has contacted me at all. And that is the most important one!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nena Whitfield",
          "Nb_Reviews": 5,
          "Date": "2018-03-20T18:54:40.000Z",
          "Titre": "Unless you don't mind paying $100s -- beware",
          "Contenu": "I had no idea what this was until I realized that Issuu had been charging us $29/month for about 6 months. We only needed it to create one thing, and a former employee was supposed to cancel the recurring payments. According to Issuu, there was no way to undo this or refund our money. I run a very small non-profit as I'm a full-time volunteer, so it was very disappointing to learn that we had to pay so much for a service that I'm not even positive we were able to benefit from in any way."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T09:40:47.000Z",
          "Titre": "can only upload some"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:18:14.000Z",
          "Titre": "The free product is too limited",
          "Contenu": "The free product is too limited. Why gouge small people? Why not let small people begin to trust your product and grow into a paying relationship? All I want is a few great free flipbooks and you'd have a customer for life, but limiting from the start is a web trend I'm sick & tired of. Money, money, money. Was anybody there there in the beginning. What a beautiful place the web used to be."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:55:47.000Z",
          "Titre": "A lot of buttons on the website either…",
          "Contenu": "A lot of buttons on the website either dont work or work very slowly. I want to know why the flipping experience is removed from desktop view."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T13:11:11.000Z",
          "Titre": "Good idea. Pushy sales.",
          "Contenu": "Website is really pushy with its monetisation. I don’t like it when a website insists upon your attention as much as this. More control over how spreads are handled would be nice. It was very confusing when two page spreads became a 4 page spread. I’m sure there’s a good reason that it defaults this way but a toggle seems like it shouldn’t be hard to implement."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Arva",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:53:56.000Z",
          "Titre": "Free version is too limiting",
          "Contenu": "I think the maximum upload size limit is too small, and it's too bad that we have to get a premium to see statistics and allow downloads. The ad placement is kinda annoying too. But it's sufficient enough to display my portofolio."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:33:12.000Z",
          "Titre": "The free tier is disastrous",
          "Contenu": "The free tier is disastrous and when your beautiful work is surrounded by a cacophony of ads, it turns everything visible into junk status."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Nikita",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T14:25:52.000Z",
          "Titre": "Upload time",
          "Contenu": "It took awhile to upload and had to restart the process for it to do it quicker and I have concerns over the link not being able to work"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DAVID WHENHAM",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T10:16:07.000Z",
          "Titre": "Pricing structure excludes some groups",
          "Contenu": "It does what it does very well. From my point of view though the pricing structure excludes small clubs and societies who perhaps put out two or three publications per annum to a readership of less than 75. Some form of pay as you go would be more affordable than a regular monthly subscription"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Janine Gessner",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T07:43:20.000Z",
          "Titre": "I’m general",
          "Contenu": "In general, It’s a good Plattform. But. I habe some issues. The front from a very old and- suddenly cancelled - portfolio shows permanently up on search and not the current one. It’s really annoying because, if people click on it- issuu say s - profile not found - but - it’s there - everything is done right - but the wrong side is showing up"
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Non profit customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T09:44:22.000Z",
          "Titre": "The mobile friendly article just bugged…",
          "Contenu": "The mobile friendly article just bugged out and did not load and sales chat refused to help. Edit: changed my review from 2 to 3 after customer service investigated the issue couple weeks later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:02:31.000Z",
          "Titre": "I love how easy it was to create…",
          "Contenu": "I love how easy it was to create however the amount of ads for the free version was over the top. Some people accidentally clicked on the giant OPEN buttons which were everywhere and got very confused."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Tadeusz",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T10:35:13.000Z",
          "Titre": "I had a problem with making a card…",
          "Contenu": "I had a problem with making a card payment. In the future, I would like to pay you by bank transfer, which is the normal payment method in Europe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T00:46:07.000Z",
          "Titre": "The pricing is far too high in regards…",
          "Contenu": "The pricing is far too high in regards to publishing more than 5 flipbooks. I think there needs to be tier that is not as high as the $20/month."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T18:40:21.000Z",
          "Titre": "Sorry its just that we found a better…",
          "Contenu": "Sorry its just that we found a better alternative in relayto.com free account with 5 pdfs which you can also change the background,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy Richey",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T01:45:44.000Z",
          "Titre": "Full screen viewing is too expensive",
          "Contenu": "Quite annoying that you would have to pay SO much money to view full screen. That especially ruins the experience on a phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:37:25.000Z",
          "Titre": "Help is good",
          "Contenu": "Help is good. But locating Live chat on their website you need to be like Sherlock Holmess!"
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:58:45.000Z",
          "Titre": "Free plan is not good",
          "Contenu": "Limited sharing of publications for people with a link should be free"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T16:15:58.000Z",
          "Titre": "Mobile viewing isn't great",
          "Contenu": "For files that are meant to be viewed on mobile devices, the format makes the document too small."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID S. BRIGHT DDS",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:33:18.000Z",
          "Titre": "WAAAAAAY TOO MANY ADS!",
          "Contenu": "WAAAAAAY TOO MANY ADS!!  I USED ISSUU YEARS AGO WHEN YALL FIRST LAUNCHED.  THAT COMPARED TO THIS IS WAAAAAY TOO MUCH.  I UDERSTAND THE PURPOSE, BUT GEEZE!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alison",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T16:49:19.000Z",
          "Titre": "Customer Service - lack of human contact",
          "Contenu": "I found it very frustrating that there is no one that you can actually speak to either on the phone or on your chat, i did finally get a response the week after from Karen, Customer Service Associate and she was very quick with her responses to me at that point so many thanks Karen for that :-)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura Lyons",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T14:28:40.000Z",
          "Titre": "I spent about $250.00 and then…",
          "Contenu": "I spent about $250.00 and then discovered to get flip books without ads would be even more money!"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Miguel Aguirre",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T17:16:35.000Z",
          "Titre": "no body answered so I had to try many…",
          "Contenu": "no body answered so I had to try many ways to get in touch with someone"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Senthil",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T23:55:46.000Z",
          "Titre": "Good but charge is very high"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marie Wintriss",
          "Nb_Reviews": 2,
          "Date": "2020-07-15T22:23:34.000Z",
          "Titre": "It took 7 BUSINESS days for someone…",
          "Contenu": "It took 7 BUSINESS days for someone from Issuu to contact me. Once I finally found a human to talk to, my issue (no pun intended) was resolved."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T20:37:56.000Z",
          "Titre": "More pages needed"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Agrizen Zhang",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T07:41:49.000Z",
          "Titre": "thanks for your work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "karena",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T08:07:07.000Z",
          "Titre": "Good start!",
          "Contenu": "it's integreated with Canva which I know how to use.  But Issuu is a learning curve.  Tons of components I haven't had the time to explore yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Silver Beech",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:21:02.000Z",
          "Titre": "The process is easy and looks great",
          "Contenu": "The process is easy and looks great. Very easy and great results."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T00:43:08.000Z",
          "Titre": "Ease of upload",
          "Contenu": "It was very easy to upload my book.  However, an undeserved content warning scared off readers; fortunately I was able to have it removed promptly, though only because I had paid for Premium status.  It would be helpful if issuu made an effort to have its publications appear in Google search results."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Latifa el Hachem",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T11:17:00.000Z",
          "Titre": "Satisfaction",
          "Contenu": "I found it helpful to create my catalogue... It's simple, not complicated and I could easily upload my file. The only issue I faced that, as it is a free account, I can only upload 5 files. 😊😊"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:11:26.000Z",
          "Titre": "Simple to use and great way to showcase your work!",
          "Contenu": "Simple to use, even for people who aren’t great with computers like myself. Allows me to display my work, which is great for any journalist/ writer who wishes to publish their articles or any marketers who want to create a professional looking magazine or white paper for their brand. As someone who uses Issuu to create magazines and online flip books, I love how easy it is to upload my document and then send the links to my work to potential employers during job and apprenticeship applications."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "ThatRandomPerson",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T08:49:53.000Z",
          "Titre": "It is easy to use for beginners",
          "Contenu": "It is easy to use for beginners, will highly recommend. I would rate it 5 but most readers of ratings will not believe all 5 stars and read the other comments."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:43:46.000Z",
          "Titre": "I am really happy with the service",
          "Contenu": "I am really happy with the service, but I think the fees are very expensive for people like me (I earn money in Colombian Pesos)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ethan",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:35:05.000Z",
          "Titre": "Unknown Explicit Flag",
          "Contenu": "Ivy checked the link that was flagged explicit and she removed the flag in a matter of a couple of minutes. I'm thankful for her help.I asked her if the algorithm pointed out the content it deemed explicit but she stated it doesn't do that. This particular community newspaper has community events, a car show, an interview with a new pastor for the Methodist Church, high school sports, a tribute to Bob Barker, obituaries and so forth. I have no idea what it could've flagged. I hope that they can go in and make adjustments to properly review material."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Romero",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T23:34:00.000Z",
          "Titre": "Good but…",
          "Contenu": "It is an excellent page for publishing magazines and content, the only problem I had was when editing content on my mobile phone. I think they should focus more on mobile applications."
        },
        {
          "Note": 4,
          "Lieu": "MG",
          "Pseudo": "Lalie",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T12:56:53.000Z",
          "Titre": "High pricing plan but still the best publisher online",
          "Contenu": "What a shame the private feature is not available with the free plan. Also pricing is still high.But ISSUU is still the best option to publish online. Great SEO results, many formats options for publications, high-quality rendering of pics. We love the ISSUU experience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Anistatia Miller",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T21:46:32.000Z",
          "Titre": "The level of follow up was most…",
          "Contenu": "The level of follow up was most commendable since I just joined and had some technical problems which the ISSU tech team fixed rather quickyl."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Warren Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T07:36:27.000Z",
          "Titre": "Publishing Site Worth Visiting",
          "Contenu": "Speedy upload. Clarity in instruction.That's my brief experience with Issuu.comAnd I would recommend the site for authors wanting to publish their work for quick and easy access."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T23:50:28.000Z",
          "Titre": "ISSUU fills a need if you are using it widely.",
          "Contenu": "ISSUU fills a need that can be useful for certain websites. I could see both business and creatives using it. For my occasional use (on a website) I couldn’t afford the subscription right now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Capt. Dave",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T21:50:06.000Z",
          "Titre": "Great features and many options",
          "Contenu": "Great features and many options.  Just wish flip book hosting was less expensive.  Out of my budget for my small business needs.  Every penny counts.  Decided to just offer a downloaded bookmarked pdf"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T17:33:17.000Z",
          "Titre": "Our readers certainly enjoy the reading…",
          "Contenu": "Our readers certainly enjoy the reading feature that looks like a book.We would appreciate a french version of your program as 99 % of our readers are French and probably 90 % cannot read english."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DiGiacomo, Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T19:55:39.000Z",
          "Titre": "Had good experience with Victoria via CHAT. Having a terrible experience with getting response fromISSUU billing dept.",
          "Contenu": "After several weeks of emailing the ISSUU billing department concerning a payment issue with my monthly subscription (I was billed twice in the month of Sept 2023), I finally got assistance with Victoria in the LIVE CHAT today. I had used the CHAT function initially when I realized my account was charged twice and I had questions about the \"annual\" subscription billing period--but did not get very far in those chat sessions. Victoria took the time today to fix my issue after I relayed that I needed to convert my subscription back to monthly payments for my Sept 2023 billing statement."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:10:14.000Z",
          "Titre": "I liked the possibility of publishing…",
          "Contenu": "I liked the possibility of publishing through issuu. I didn't really like the way it was viewed by users. It seems to me that the interface does not look pretty with so many ads."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clare Luzuriaga",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T19:53:47.000Z",
          "Titre": "My issue was quickly resolved",
          "Contenu": "My issue was quickly resolved - but I have to say the new ISSUU on interface made it impossible to figure out how to load in a new publication. Now I know - but I would never have been able to figure it out without help, and I've been using ISSUU for years. But the assistant was great!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:11:17.000Z",
          "Titre": "It was easy to create an account as…",
          "Contenu": "It was easy to create an account as well as upload my document with clear instructions on sharing it"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Anime Sexy",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T10:04:04.000Z",
          "Titre": "Unique and Easy Platform",
          "Contenu": "Its a perfect medium to upload and share your documents to the world. I really love the platform.The downside is the limitation of 5 free uploads, it should be more than that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Ladd",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:03:21.000Z",
          "Titre": "Too expensive but good overall",
          "Contenu": "I love this program but it’s way too expensive for a regular person to justify ever using the paid version of the platform. I’m a student and I want to embed my portfolio in a website I created but I CANNOT afford $44 a month for that."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Barsa",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T15:21:41.000Z",
          "Titre": "Thank you for the help and support",
          "Contenu": "Although I initially received an automated notification advising that there would have been a delay in handling my query, the service was speedy and excellent. I received the information i was looking for. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cathy W",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T20:14:02.000Z",
          "Titre": "Real person and not a bot",
          "Contenu": "It was a real person and not a bot. That gets high marks from me.Fairly quick response and answers were what I asked about - often not the bot experience.Appreciate the service."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Adam",
          "Nb_Reviews": 4,
          "Date": "2022-10-17T15:27:05.000Z",
          "Titre": "Problem solved!",
          "Contenu": "I have been uploading more than 200 publications on Issuu over the years, and for the first time, I recently experienced a technical problem and used the option for support for the first time. I would not call the support team's reaction for speedy, but when it came I was met with patience and understanding, and my problem was solved. Let me take the opportunity to recommend Issuu - but be warned: You may become an addict!"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Shuvra",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T22:27:07.000Z",
          "Titre": "Issue is really user friendly and a…",
          "Contenu": "Issue is really user friendly and a great platform to share your publication."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Evita Irvine",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T23:20:26.000Z",
          "Titre": "Support team are good",
          "Contenu": "Although I have had some problems with uploading, the ISSUU support team are responsive and helpful. They are professional and courteous and I definitely know that I can trust them to do all they can to help if technical issues arise."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T08:58:16.000Z",
          "Titre": "Issuu is Easy"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "john parker",
          "Nb_Reviews": 14,
          "Date": "2022-09-30T11:25:12.000Z",
          "Titre": "Karen was quick",
          "Contenu": "Karen was quick to respond and dealt with my problem as best she could by raising a ticket for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MinnieS",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T15:23:51.000Z",
          "Titre": "Love your service",
          "Contenu": "Love your service. only wish that we can view it bigger."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Charataal",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T07:36:56.000Z",
          "Titre": "Easy and smooth interface of webiste."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Sheena Gibson-Carnie",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T10:33:17.000Z",
          "Titre": "Removal of wrongful flagging",
          "Contenu": "When I notified support that my uploaded digital magazine had been wrongfully flagged as explicit they investigated and 12, hours later the flagging was removed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angie Clement",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T16:46:44.000Z",
          "Titre": "It was difficult to find where I could…",
          "Contenu": "It was difficult to find where I could chat with someone, but when I saw it was everything easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AKA - GLR Tech Help",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T19:15:55.000Z",
          "Titre": "My issue seems to be solved and it was…",
          "Contenu": "My issue seems to be solved and it was easy! I am not sure if it is resolved yet, I will know shortly. That is the only reason why I didn't give 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jessica Weymouth",
          "Nb_Reviews": 11,
          "Date": "2023-01-24T18:08:01.000Z",
          "Titre": "Nicole was very helpful and swift in…",
          "Contenu": "Nicole was very helpful and swift in her responces to me, excellent customer service."
        },
        {
          "Note": 4,
          "Lieu": "EC",
          "Pseudo": "ViniAlejo",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T10:47:54.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. I'm a student of architecture and issuu its a magnificent tool for share works in portafolios like social media"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NW",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T19:50:19.000Z",
          "Titre": "They answered my question great",
          "Contenu": "They answered my question great. It was a few days later than I would’ve liked, but that was due to high volume of inquiries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T19:17:57.000Z",
          "Titre": "I like the software and I’m planning on…",
          "Contenu": "I like the software and I’m planning on upgrading."
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T23:04:43.000Z",
          "Titre": "I dont know yet but am trying to show…",
          "Contenu": "I dont know yet but am trying to show my clothes"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:06:13.000Z",
          "Titre": "Good performance"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Kaveesh",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:44:55.000Z",
          "Titre": "It’s a nice platform to showcase…",
          "Contenu": "It’s a nice platform to showcase portfolios!!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T05:15:52.000Z",
          "Titre": "I have published 3 books now and i find…",
          "Contenu": "I have published 3 books now and i find it very easy to use. So thank you!"
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "customerA",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T06:05:21.000Z",
          "Titre": "Pretty good for posting and viewing…",
          "Contenu": "Pretty good for posting and viewing portfolios."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T19:44:09.000Z",
          "Titre": "Great service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "john parker",
          "Nb_Reviews": 14,
          "Date": "2023-03-06T15:19:32.000Z",
          "Titre": "Rapid response from Chloe",
          "Contenu": "Rapid response from Chloe, with helpful suggestions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mark",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T19:28:44.000Z",
          "Titre": "Helpful",
          "Contenu": "Helpful, kind and human"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Saniul",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T08:34:33.000Z",
          "Titre": "Its a good platform to show your works."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Duncan Brotherton",
          "Nb_Reviews": 1,
          "Date": "2021-01-08T03:07:28.000Z",
          "Titre": "I always worry about feedback forms…",
          "Contenu": "I always worry about feedback forms on sites; when you have a problem you fill them out and the system just eats them. You have no idea who they go to, whether someone got them, what stage of review they're at etc. It was nice to just suddenly get a message from Tim saying it \"was fixed and should be appearing fine now\". I enjoy using issuu.com and it is an important way for me and my students to connect; it's also a relief to know there are people there to help. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sam Jones",
          "Nb_Reviews": 2,
          "Date": "2020-12-23T21:02:42.000Z",
          "Titre": "Good for most uses",
          "Contenu": "Update: After initial frustration with customer support, my issue was resolved and they do seem receptive to feedback. Just a heads up that embed customisation options are limited and even with the premium tier you do not get a “clean” embed (e.g for fitting into web design / artwork).  This may be something they offer as a custom solution but can’t be too sure. One suggestion would be to review the strict no-refund policy and introduce a grace period (even if only a few hours) to ensure customers can use the product for intended purposes"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T21:04:50.000Z",
          "Titre": "Subscribe to my YouTube channel name rifai shorts",
          "Contenu": "👍Super Nice 👌"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Alex Liu",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T03:07:56.000Z",
          "Titre": "Good follow up services after…",
          "Contenu": "Good follow up services after submitting my various technical requests"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Malthe Hartmann",
          "Nb_Reviews": 8,
          "Date": "2019-07-25T17:05:35.000Z",
          "Titre": "Be aware of the subscription system that Issuu utilizes",
          "Contenu": "I've changed my initial 1-star rating to a 4-star rating due to good communication with costumer support (+ a refund)Issuu is a clever company. Almost thievius to say the least. I signed up for a standard free 14-day trial, canceled the same day to avoid the $220 annual billing. I got charged the $220 any way. Received a full refund after writing an email to costumer support. Something doesn't add up in their system and you should definitely be aware of the issue that Issue is having with their system not registrering your cancelation of the annual subscription.I can tell by other reviews on a number of sites that this is a wide problem with Issuu."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Judy Czylok",
          "Nb_Reviews": 14,
          "Date": "2020-12-02T08:49:02.000Z",
          "Titre": "Responsive service",
          "Contenu": "Once I had finally found out how to contact Issuu and sent an email, they were very helpful and responded quickly to me request. It would be good if it was easier to find contact details though please."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T10:12:58.000Z",
          "Titre": "Anna solved a problem I could not solve"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Rachel",
          "Nb_Reviews": 9,
          "Date": "2020-12-11T17:13:43.000Z",
          "Titre": "although the reply took some time",
          "Contenu": "although the reply took some time, the answer was exactly what I needed.  Tim from the help center knew what he was talking about and he solved it promptly in the end!"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "MA",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T15:42:58.000Z",
          "Titre": "Good experience with agent."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T06:10:37.000Z",
          "Titre": "Best",
          "Contenu": "Easy to use and best one"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Felix Lungu",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T10:15:37.000Z",
          "Titre": "A team ready",
          "Contenu": "A team ready, competent and available to help. Thank you. Excellent service."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ris",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T07:39:15.000Z",
          "Titre": "Cool",
          "Contenu": "cool great nice hahaha"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DeEtte Starr",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T17:20:14.000Z",
          "Titre": "Knowledgeable",
          "Contenu": "Knowledgeable, helpful & quick"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "bernard heys",
          "Nb_Reviews": 48,
          "Date": "2023-05-24T07:15:45.000Z",
          "Titre": "Good customer relations."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:33:14.000Z",
          "Titre": "best flipbook service",
          "Contenu": "i have tested with many flipbooks out there but issuu got best service in all aspect for free and premium users i hope i'll continue publishing my projects in upcoming years with issuu"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark R Holland",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:09:46.000Z",
          "Titre": "Had a great intro call with Eduardo…",
          "Contenu": "Had a great intro call with Eduardo last week.  He was knowledgeable, easy to discuss items with and had several suggestions I had not thought of.  The initial upload (I went into the \"non-public\" side first to get used to the process) and the initial look is better than I expected.  I am looking forward to a great overall experience with ISSUU."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Hadia rehan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:29:57.000Z",
          "Titre": "Best site to grow business and to connect with the communities",
          "Contenu": "My experience with issuu is very constructive i am using this platform from the last two years."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:18:06.000Z",
          "Titre": "Simple and easy way to showcase you…",
          "Contenu": "Simple and easy way to showcase you work to the public. Saves a lot of space in google storage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:04:32.000Z",
          "Titre": "I'm very happy with the platform…",
          "Contenu": "I'm very happy with the platform format. And your IT people have been very responsive to our questions."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "iae GLOBAL Pakistan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:40:46.000Z",
          "Titre": "I would say ISSUU is the best platform…",
          "Contenu": "I would say ISSUU is the best platform I have ever used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "universemolding.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:30:45.000Z",
          "Titre": "Very good",
          "Contenu": "Very good，Hope to help more people in the custom plastic industry"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Lillard",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T19:17:59.000Z",
          "Titre": "Nicole in Billing was very fast and…",
          "Contenu": "Nicole in Billing was very fast and professional."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Justice Tyolumum Toom",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:50:38.000Z",
          "Titre": "Business Availability",
          "Contenu": "The fact that my business will appear on all searches, I am grateful for the privilege."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shivawn Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:26:21.000Z",
          "Titre": "The person I was working with went over…",
          "Contenu": "The person I was working with went over and beyond with assisting me. She made sure that she continued to assist until we were able to resolve the issue."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Margaux Cintrano",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:07:45.000Z",
          "Titre": "The caring attitude and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Marcin Maziej",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:47:35.000Z",
          "Titre": "I had problems accessing my account…",
          "Contenu": "I had problems accessing my account after not using it for several years. Issuu provided me with a lot of help and professional support, thanks to which I managed to solve my problem. Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Countess of Prados",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:06:18.000Z",
          "Titre": "Easy to upload and share content",
          "Contenu": "Once uploaded content in pdf and jpg, the magazine was easy to browse and ready to share with my network just by copying the link."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IPTouch Animal Massage",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T11:23:41.000Z",
          "Titre": "The best publication product on the Internet!",
          "Contenu": "This is by far one of the best publishing products ever. It is so clean you can just pop in formats of any kind and ISSUU creates a beautiful product. And ISSUU also markets your publications for sale so professionally with its high end business package.  Worth it!!!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T08:38:27.000Z",
          "Titre": "It is very convenient for sending…",
          "Contenu": "It is very convenient for sending portfolios to firm. It’s easy and does not use up space. The design is great to compose and showcase the relent is presentation. It would be great if we can have free option to restrict access to people who only have link.And a free option to send higher mb file to increase the quality of portfolio"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charis Petty",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:02:54.000Z",
          "Titre": "Great service",
          "Contenu": "Good response time, resolved my issue with very little effort on my end. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lenee",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T18:12:51.000Z",
          "Titre": "Impressed with Issuu Support Team",
          "Contenu": "I was incredibly impressed by Issuu's support team.  They were very responsive and went above and beyond to resolve my issue.  I can't say enough good things about the service I received.  To Karen and Issuu - thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "senior writetr",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:37:23.000Z",
          "Titre": "It helped me to reach good number of…",
          "Contenu": "It helped me to reach good number of people in no time"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:38:01.000Z",
          "Titre": "I didn't know how to have an online…",
          "Contenu": "I didn't know how to have an online portfolio and this platform helped me a lot. I know it is a great effort but sponsors could be sought to provide more free space in the cloud for small entrepreneurs or companies."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "ALPESH BHALANI",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:08:00.000Z",
          "Titre": "Really Good Experience For Content and…",
          "Contenu": "Really Good Experience For Content and very useful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T19:40:07.000Z",
          "Titre": "EXPLICIT problem on ISSUU - FIXED",
          "Contenu": "Had a problem with one of my publications on ISSUU, that was flagged EXPLICIT, and Chloe was very helpful in fixing my problem. And answering my question about something else. It was a quick resolution and response."
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Loucia Isaac",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T20:44:04.000Z",
          "Titre": "Issuu, The all-in-one marketing & visibility box",
          "Contenu": "The all-in-one platform is famous for its clear language use, concise user guideline, publishing and distribution policy. Bonus: Issuu provides adequate details for users to maximize their target audience-exposure. It is safe to use and trustworthy by site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:12:45.000Z",
          "Titre": "Thank you for giving access to our…",
          "Contenu": "Thank you for giving access to our business page!We had an account created by someone else some time ago who we did not have contact. I requested access with my business email and was able to update. Love the service and they helped me in a timely manner! Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "TZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:21:46.000Z",
          "Titre": "Amazing company and that helps clients…",
          "Contenu": "Amazing company and that helps clients from all the world to connect and make a world a better place"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:51:09.000Z",
          "Titre": "Tahnk you",
          "Contenu": "Tahnk you, good expirence"
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Magic Self and Spirit with Ste",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:38:14.000Z",
          "Titre": "Chloe did everything she could to be…",
          "Contenu": "Chloe did everything she could to be supportive and although we couldn't find an immediate solution together she has passed it on to the tech team, we'll get there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Greer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:55:53.000Z",
          "Titre": "Ivy is awesome. While the answer to my question about…",
          "Contenu": "While the answer to my question about organization options for content wasn't what I hoped, you couldn't ask for a better messenger than Ivy. She is a great communicator, knowledgeable, and really conveys care and follow-up. She's a keeper!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T04:11:51.000Z",
          "Titre": "Good so far",
          "Contenu": "Good so far, I haven't run into a thing yet that requires me an immediate payment. For a small thing that I've been doing, it works really well for me. I ever I going to do bigger things, I'll gladly provide support, but for now, It works as it is for me. I hope it continues like this."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Mary Dickson",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T09:42:36.000Z",
          "Titre": "Publishing my WeMompreneurs Magazine",
          "Contenu": "My experience with publishing my magazine on issue has been great so far. The quality of my design has not reduced and I love the fact that you are able flip through the book as though you are holding a physical copy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Telegram WebAdmin",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T19:32:06.000Z",
          "Titre": "Reliable magazine hosting, great customer support.",
          "Contenu": "Customer support chat was very fast to respond.  They helped me input some website feedback / feature requests.  I am happy with the reliable products and services that ISSUU provides."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Google",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T20:46:53.000Z",
          "Titre": "Ivy in Customer Support was very…",
          "Contenu": "Ivy in Customer Support was very helpful and fixed my issue quickly. Thank you Ivy!!Issuu is great for sharing my triennial magazine for work. Super easy to use, beautiful, and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T08:18:07.000Z",
          "Titre": "it do not have the file volume limit",
          "Contenu": "it do not have the file volume limit. i think it is good. i don't need to compress my file."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "carlos gálvez",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T15:43:56.000Z",
          "Titre": "It has great content",
          "Contenu": "It has great content, you can post on okan prenium, highly recommended, their customer support wonderful, very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T15:59:25.000Z",
          "Titre": "Problem with ISSUU",
          "Contenu": "I ran into a problem after upgrading my ISSUU subscription: couldn't change the e-mail address in my profile. Ted, at ISSUU, spent time on a chat, determined that there was some kind of glitch that needed investigating, changed the e-mail on file for me and answered another question."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Henley Santa",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:25:19.000Z",
          "Titre": "Issuu - great for sharing books",
          "Contenu": "The thing that I most liked about putting my draft book on issuu was how easy it was to do and how easily I could replace it with revised versions.I love how easy it makes it for me to share the book and for people to view it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bhavik",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:00:26.000Z",
          "Titre": "Karen helped me through the entire…",
          "Contenu": "Karen helped me through the entire process and it went so smoothly. Thank you for your support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:31:15.000Z",
          "Titre": "My magazine got flagged as explicit…",
          "Contenu": "My magazine got flagged as explicit when there was no content of that nature or breaking any of the content agreement rules and Nicole took care of it right away when I sent in a request for review."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T22:11:23.000Z",
          "Titre": "First time user",
          "Contenu": "First time user, I'm impressed. This company sticks to its values, goals, and amazing expectations. Great Job Issuu"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:34:46.000Z",
          "Titre": "Easy acssess",
          "Contenu": "Its wonderful owing to the fact that i can show my portfolio online .its great"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Franck Kabila",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:04:03.000Z",
          "Titre": "Personal experience",
          "Contenu": "The ability to share the link to my content and allowing viewers to like my content at zero cost is something valuable especially for me as a student"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Production Spooledmagazine",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T16:09:23.000Z",
          "Titre": "Had an issue with the back end of…",
          "Contenu": "Had an issue with the back end of ISSUU, jumped onto the live chat, and Chloe was able to fix the problem in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curt Walton",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T20:47:42.000Z",
          "Titre": "Dealt with an expert Customer Care Rep, Chloe!",
          "Contenu": "Chloe was an expert at handling my questions.  Apparently my publication was larger than the plan I had.  So helpful.  Great company!!!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Mark Pedersen",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T18:26:08.000Z",
          "Titre": "As always this platform overdelever!",
          "Contenu": "As always this platform overdelever!We have used it since 2019.Five big stars from us at My Tattoo Inc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evelyn",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T21:18:06.000Z",
          "Titre": "Correction of Explicit Content",
          "Contenu": "One of my publications said \"Explicit\" and it was not being viewed by my audience. I did not believe my publication had explicit content. Ivy was very helpful. My issue was resolved immediately."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Balidogen",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T22:01:34.000Z",
          "Titre": "Full-Day Customized Amazing Private Tours in Bali",
          "Contenu": "By using the issuu.com website, my articles can be found easily on Google"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T09:17:05.000Z",
          "Titre": "Even as a starter, there is a plan",
          "Contenu": "Even as a starter, there is a zero fee option to use limited services. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "AL",
          "Pseudo": "José Pinto",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T14:43:59.000Z",
          "Titre": "We were answered above our expectances",
          "Contenu": "After waiting almost 72 Hours for an answer we finally got the answer above our expectations. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Marco",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T15:00:02.000Z",
          "Titre": "perfect for sharing my documents online",
          "Contenu": "Easy to use, perfect for sharing my documents online, just what I was looking for"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MT Marketing",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:39:58.000Z",
          "Titre": "Ted was super prompt and knowledgeable",
          "Contenu": "Ted was super prompt and knowledgeable! Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michelle Crowe",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T03:38:13.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "Great features, easy to use and the client side of the platform looks professional and impressive. My main reason for my rating however is the outstanding customer service. I had some technical and account issues, and the prompt replies, thorough communication and even personalised video walk-throughs to get my issue sorted quickly with Katerina from Issuu was not just impressive but also very much appreciated as it has saved my company time & money."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rahul Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T06:21:48.000Z",
          "Titre": "Nice Experience about issuu",
          "Contenu": "Nice Experience about issuu, all PDF indexed and ranked early its good for us. easy to upload the pdf in issuu."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T12:40:24.000Z",
          "Titre": "The website is doing great but if only…",
          "Contenu": "The website is doing great but if only they were free like other sites."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mj",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T15:23:30.000Z",
          "Titre": "Sara did a great job!",
          "Contenu": "Sara linked me to a great article, and gave me further context - solving my small issue in 3 minutes."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 15,
          "Date": "2023-08-14T16:44:56.000Z",
          "Titre": "Ver Efficient",
          "Contenu": "No delay. Chloe found the information on our company and dealt with the query efficiently and courteously."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T20:59:11.000Z",
          "Titre": "Very Helpful",
          "Contenu": "Spent so much time trying to help me get thru some issues. Great customer service experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NaTyshca",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T19:34:41.000Z",
          "Titre": "Issuu Unpublished One of My Magazines",
          "Contenu": "One of my magazines was unpublished for explicit content, although I had no explicit content in my publication. I submitted a dispute via chat and Ted was able to assist me and rectify the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NC Symphony communications",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T20:48:46.000Z",
          "Titre": "Quick & responsive",
          "Contenu": "Quick & responsive, fixed a minor issue while I was pulled away from the chat but came back to confirm for me when I was able to return.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Teff Naranjo M.",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:43:25.000Z",
          "Titre": "Ivy was super helpful with my…",
          "Contenu": "Ivy was super helpful with my questions, helped me with all the process, reviewing invoices, and fact checking data!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Komila",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:00:16.000Z",
          "Titre": "That was great",
          "Contenu": "That was great. Keep on doing good work for value addition."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Laura Bartlett",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T14:58:29.000Z",
          "Titre": "Excellent handling of my enquiry",
          "Contenu": "Excellent handling of my enquiry, swift response and solution"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T04:32:25.000Z",
          "Titre": "It's also a good way for expand your…",
          "Contenu": "It's also a good way for expand your business on Issuu."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha Ludeking",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T17:39:35.000Z",
          "Titre": "Fast response",
          "Contenu": "Issuu support answered my question via live chat in seconds. And resolved the problem just as fast."
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Elena",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T08:27:31.000Z",
          "Titre": "The work was done perfectly",
          "Contenu": "The work was done perfectly, the quality is excellent, the customers are satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T15:17:20.000Z",
          "Titre": "A brilliant product",
          "Contenu": "This is a brilliant product. I enjoy creating and sharing my catalog."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Howren",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T23:44:22.000Z",
          "Titre": "Ivy was very helpful getting my issue…",
          "Contenu": "Ivy was very helpful getting my issue resolved in a timely manner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T03:12:10.000Z",
          "Titre": "Prompt Activation",
          "Contenu": "I was impressed with how quickly Karen, a Customer Success Associate, activated my account and followed up with a confirmation email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zoe C Welsh",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:47:12.000Z",
          "Titre": "The person chatting to me was very helpful",
          "Contenu": "The person chatting to me was very helpful and isolated my problem"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "MyTm",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T07:13:25.000Z",
          "Titre": "I recently had the pleasure of…",
          "Contenu": "I recently had the pleasure of exploring [Website Name], and I must say, it exceeded all my expectations. From its sleek and user-friendly interface to the wealth of valuable content, this website has truly impressed me.First and foremost, the design is modern and intuitive. Navigating through the various sections was a breeze, and I never felt lost or overwhelmed. The layout adapts perfectly to both desktop and mobile devices, ensuring a seamless experience regardless of the platform you're using.The content itself is where [Website Name] shines the brightest. Whether you're a novice or an expert in the subject matter, you'll find something of value here. The articles are well-researched, informative, and presented in a way that's easy to digest. I particularly appreciate the way complex topics are broken down into manageable chunks without sacrificing depth.But what truly sets this website apart is its community aspect. The comment sections foster engaging discussions among users who share similar interests. It's refreshing to see a platform that encourages thoughtful conversations rather than mindless trolling.Additionally, the regular updates keep the content fresh and relevant. I've already learned so much from this website, and I'm excited to see what they'll bring in the future.The only minor improvement I could suggest is to include more multimedia elements such as videos or interactive graphics to complement the written content. However, this is merely a suggestion and doesn't detract from the overall exceptional experience.In conclusion, [Website Name] is a gem for anyone looking to expand their knowledge, engage with a like-minded community, and do so in a visually appealing virtual environment. It has quickly become my go-to resource, and I can't recommend it enough. Kudos to the team behind this outstanding website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T15:54:08.000Z",
          "Titre": "Helpful and fast",
          "Contenu": "Ivy was fast and wonderful in assisting me to get some issues on our account corrected."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "DDG",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T19:13:43.000Z",
          "Titre": "Awsome",
          "Contenu": "My needs were perfectly satisfied with issuu, I send the link to my friends so they could read and view my post like a real thing. That is great!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "EvaMaria Panzer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T16:17:16.000Z",
          "Titre": "Fantastic service!",
          "Contenu": "Fantastic and very fast support/help desk service - solved my problem within seconds - wonderful Chloe!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Signature Homes",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:57:17.000Z",
          "Titre": "Great help!",
          "Contenu": "Victoria was always quick to respond and solved our issues in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T21:30:34.000Z",
          "Titre": "just very nice!",
          "Contenu": "easy ussage, nice free trial options,"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T17:12:43.000Z",
          "Titre": "The ease of use and uploading…",
          "Contenu": "The ease of use and uploading information, very complete and very fast. I liked it."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "mychildname.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:26:32.000Z",
          "Titre": "Best approach for new opportunities of…",
          "Contenu": "Best approach for new opportunities of content."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corrin LaVigne",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:04:40.000Z",
          "Titre": "Quick and Efficient",
          "Contenu": "Victoria and Chloe were super helpful and able to answer my questions quickly and efficiently!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T05:29:10.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use! also there are many book and publications more than other sites."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Denise John",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T10:54:05.000Z",
          "Titre": "professionalism",
          "Contenu": "Thank you issuefor updated my content on google pages."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Andrew Haysom",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T10:15:06.000Z",
          "Titre": "Prompt and efficient response",
          "Contenu": "Prompt and efficient response to my issue that was fixed immediately by Nicole."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:52:58.000Z",
          "Titre": "Fixed my problem",
          "Contenu": "Chloe was able to fix the issue in munites. Very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:34:51.000Z",
          "Titre": "Ted was great",
          "Contenu": "Ted was great!  He helped me right away.  I sent in a customer support ticket and that sat for 3 days. I went to the live chat and there is where the help was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T14:20:29.000Z",
          "Titre": "Absolutely Amazing website!",
          "Contenu": "Great application, easy and fast to apply pictures!!! Amazing"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kelly Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T00:11:29.000Z",
          "Titre": "Tech support was quick to reply",
          "Contenu": "Tech support was quick to reply, efficient to resolve. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:02:23.000Z",
          "Titre": "Easy to upload in good quality",
          "Contenu": "Easy to upload in good quality. Best website to present your work. Loved it !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Myranda",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:08:38.000Z",
          "Titre": "10/10",
          "Contenu": "10/10 - Always a pleasant experience receiving help and support from Ted at Issuu! This individual is one of the reasons that I see superior value in your customer service department!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Marks",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:54:28.000Z",
          "Titre": "Quick Solution!",
          "Contenu": "Ivy was helpful in solving the problem that was occurring with one of my publications."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Foodsmiths",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:06:08.000Z",
          "Titre": "Answered me right away",
          "Contenu": "Answered me right away, and solved the problem in a fingersnap!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jules Fedota",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T19:02:23.000Z",
          "Titre": "Excellent help with a publishing issue",
          "Contenu": "Excellent help with a publishing issue. Thanks Chloe!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Valérie Dana",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T15:44:09.000Z",
          "Titre": "You solved our problem in a matter of…",
          "Contenu": "You solved our problem in a matter of seconds. I'm very grateful."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "AK",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T16:25:26.000Z",
          "Titre": "The Ultimate Digital Content Sharing Hub",
          "Contenu": "A seamless platform for sharing and discovering digital content! This website's user-friendly interface and wide range of content make it a go-to destination for both creators and enthusiasts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Halfpop",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:02:05.000Z",
          "Titre": "Customer service is always quite good",
          "Contenu": "Customer service is always quite good. Appreciate Victoria's assistance with a very annoying problem! Saved my afternoon!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:47:39.000Z",
          "Titre": "Good platform for document publication"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T07:51:22.000Z",
          "Titre": "To feel a book",
          "Contenu": "To feel a book , a page , a form - that's the issuu for me. Thanks for that experience"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:57:41.000Z",
          "Titre": "Good platform for me to share research…",
          "Contenu": "Good platform for me to share research articles."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Izzuddeen",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T06:55:34.000Z",
          "Titre": "A great online reading experience",
          "Contenu": "A great online book experience. Makes viewing the booklet like an actual hardcopy."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:48:45.000Z",
          "Titre": "great experience."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Azad",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T20:17:58.000Z",
          "Titre": "🌟🌟🌟🌟🌟",
          "Contenu": "🌟🌟🌟🌟🌟 best Service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T17:07:04.000Z",
          "Titre": "I like this",
          "Contenu": "I like this! I hadn’t heard of you until someone told me about you. I like that I can post files without the need to put them on my website."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T10:58:23.000Z",
          "Titre": "Your website is very good and amazing…",
          "Contenu": "Your website is very good and amazing experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Scott",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T01:02:04.000Z",
          "Titre": "ISSUU rep (Karen) took care of my…",
          "Contenu": "ISSUU rep (Karen) took care of my concerns immediately. I really appreciate that."
        }
      ]
    }
  ]
}