{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.dashlane.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Amelie van den Brink",
          "Nb_Reviews": 7,
          "Date": "2023-12-18T13:38:17.000Z",
          "Titre": "I have feeling that I was kicked out of…",
          "Contenu": "I have feeling that I was kicked out of the system because I don't have a yearly subscription because for the love of god I have been using the same key password for the past 3 years! Why of all days, have I forgotten it today? It just doesn't make any sense..."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 43,
          "Date": "2023-12-13T14:02:32.000Z",
          "Titre": "dashlane account no longer recieve code…",
          "Contenu": "dashlane account no longer recieve code token on email to logini got new phone locked out errors & no codes recieved after hundreds of attempt two support tickets sent..thinking of cancel my premium plan with paypal[Request received] Untitled ticket 2141004"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "SJ",
          "Nb_Reviews": 43,
          "Date": "2023-12-11T14:52:34.000Z",
          "Titre": "No grace period if it doesn't work for you",
          "Contenu": "I only signed up for this yesterday and have decided to cancel becuase I just couldn't import all my data from a csv file (I have managed to do that easily with 1Password) but they still want to charge me a full year - outrageous! I thought you were supposed to get a grace period when buying online?  Obviously they don't pay any attention to that!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gordon",
          "Nb_Reviews": 10,
          "Date": "2023-12-05T20:07:27.000Z",
          "Titre": "I have been going round in circles",
          "Contenu": "I have been going round in circles. I had not intended to renew my premium subscription but Dashlane renewed it and took payment 2 days early. I have raised customer support requests asking for a refund but no response despite multiple requests. I have tried the chat but the bot doesn’t want to connect me with a person. Not impressed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "scarletarachnoids.org",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:40:55.000Z",
          "Titre": "You never got back to me after over a…",
          "Contenu": "You never got back to me after over a month. I'm looking for a new service. When I do I'll be cancelling"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:39:08.000Z",
          "Titre": "I have paid for my premium membership",
          "Contenu": "I have paid for my premium membership.  I keep getting emails from you saying my premium membership is expiring soon.  And now, I just got an email saying my premium membership has expired. You need a phone number.  When I log into Dashlane. It says my Premium Membership renews in. November 2024.  Can you please correct whatever is going wrong there and give me some kind of message that  y account is secure and paid?  Geeze.  I don’t need this crap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Moe K",
          "Nb_Reviews": 10,
          "Date": "2023-12-05T05:46:55.000Z",
          "Titre": "I have paid for the whole year to…",
          "Contenu": "I have paid for the whole year to Dashlane but they customer keep sending me the emails for payment again, also now is more difficult to use the dashlane"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stretch",
          "Nb_Reviews": 4,
          "Date": "2023-11-07T17:24:56.000Z",
          "Titre": "Lack of response",
          "Contenu": "I installed the Dashlane app briefly a while back while assessing password apps but found a better fit. I just can’t get away from their mailing list no matter how many times I try to unsubscribe though. A little worrying as they manage so much personal data"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 9,
          "Date": "2023-10-27T01:17:59.000Z",
          "Titre": "I was satisfied with Dashlane until…",
          "Contenu": "I was satisfied with Dashlane until about 10 days ago then things really went to pot. I am using a MacBook and was asked to download Sonoma 14.0 After I did that, things went a little bit off with many programs but after a day all things self corrected except Dashlane. All my logins (I have over 100 of them) are randomly placed, not in alphabetical order  any more. I have to hunt one by one looking for the password I want. Made four calls to technical help, all say we are aware of your problem and it is in the queue. We cannot tell you when it will be fixed. I even wrote them yesterday, never heard back. This does not inspire much confidence in the technical capacity of people in a company who are supposedly guarding your access security !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "drfirpi",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T13:08:05.000Z",
          "Titre": "Dashlane is great until you have a…",
          "Contenu": "Dashlane is great until you have a problem.  My phone broke and I got a new one.  The authenticator app does not transfer to new phones for security reasons.  The Dashlane recovery codes did not work( they were very old) or kept registering as having been used which is inaccurate.  I contacted Dashlane.  You would think I was asking for nuclear launch codes.  The questions they asked were impossible to answer. They were intransigent.  They locked my account and refused to send a code to my phone so I could open it.  I will have to reset the passwords for dozens of sites.  I had to cancel my account and will not be opening a new one."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Eduardas Šlutas",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T12:20:05.000Z",
          "Titre": "Annoying marketing",
          "Contenu": "Not a user, but got marketing email from them (not sure how they got my email as it is not public one), then asked how they got my email address and then - radio silent. Day later - another marketing email completely ignoring my first request on how they got my email address. If they do not respond to those simple questions, is it worth using them for those who needs? Rhetorical question"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin Smith",
          "Nb_Reviews": 6,
          "Date": "2023-07-02T17:48:31.000Z",
          "Titre": "Annoying pop ups, terrible support",
          "Contenu": "Annoying, irrelevant login pop ups combined with horrendous customer ‘support’. Install this app with caution. You will waste a minimum of 100 hours per year. The old desktop Dashlane worked perfectly. The Chrome extension makes me want to scream, daily."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Truth Teller",
          "Nb_Reviews": 39,
          "Date": "2023-06-29T18:28:58.000Z",
          "Titre": "Misleading advertising",
          "Contenu": "so apparently, each login on a google chrome browser on the same device counts as a new device. you cannot use their tool on separate windows on the same device even though that's what they advertise on their marketing pages. looks scammy and misleading advertising to me. All to push you to pay annual fees to use the tool they claim you can use for free.Also, was put on a free trial for their premium features without being consulted. Careful. dont give them your CCs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Mayo",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T21:57:06.000Z",
          "Titre": "Don't Ask me Not to Use the Safari Browser",
          "Contenu": "My desktop computer is a new MacBook Air M2, running the OS Ventura 13.2.1 operating system and utilizing the Safari browser. This week, I tried accessing Dashlane which has been working just fine. No longer. Worse, I get a message from Dashlane suggesting I jump through a bunch of hoops for some extension but, better yet, stop using Safari and go with Google Chrome. I am not going to do that and it is drastically altering my opinion on Dashlane which I've been a very satisfied customer of until now."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Saudi Man",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T11:44:54.000Z",
          "Titre": "No respect for privacy",
          "Contenu": "They updated my extention layout and my app to add LGBT colors and i dont have a problem with that in their website or profiles but ever since it started lagging and the search bar in the extension app is not functioning anymore. you can make marketing things all you want but please... not on my app i want it as smooth as it gets as private as it gets. stop. stop failing after your success. im waiting for my annual subscription to finish to switch to open source manager."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G. Lewis Penrose",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T20:07:21.000Z",
          "Titre": "Totally Inefficient Process",
          "Contenu": "The representative was helpful, but the process for a paid subscription was unacceptable in my opinion.  You can only Chat or email, no phone call can be done.  It takes so long for a person who cannot type very well to have ALL COMMUNICAITON back and forth by typing.  It took probably 5 times longer than it should have taken compared to talking on the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stepmhayahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T00:14:20.000Z",
          "Titre": "No access to customer service",
          "Contenu": "No access to customer service.  Text capability hidden.Having problems with Auto Fill for weeks.  I am sure a simple fix but no respond from text messaging to resolve issues They have no problem sending reminders that yearly subscription fees are coming."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Land",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T19:34:57.000Z",
          "Titre": "No customer support",
          "Contenu": "I have been very happy with Dashlane until I encountered a usage problem with the software.  They do not support a live person chat, instead have a bot.  There is no way to call them.  If you text them or get in an email session days go by before a response.  i am looking for an alternative."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Grant",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T00:59:04.000Z",
          "Titre": "Poor service with poor security.",
          "Contenu": "Dashlane has been steadily removing useful features across the board since I subscribed, it's my lasting regret that I purchased an annual plan and am unable to cancel for a partial refund because the service and lack of features of shocking. I attempted to setup the VPN to at least get some use out of the membership, but uBlock Origin prevented the download due to harmful trackers to a data analytics company. Not a great idea for a privacy and security based service. Stay clear, there are so many better solutions out there."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "lago",
          "Nb_Reviews": 9,
          "Date": "2023-06-27T11:15:17.000Z",
          "Titre": "Serious Problems",
          "Contenu": "Dashlane, changing passwords deletes email addressI did already write but no reply?I changed my password for the 3 email accountsAfter not able to login all day yesterday for one.then today for other 2.Something in your software is not functioning? SEE ATTACHED, the 2nd 1 is yesterday.I had to wait 24 hrs to get back my email from .comThis is no joke for me.ticket no. 2025155"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jazmin Harth",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T03:39:15.000Z",
          "Titre": "TERRIBLE CUSTOMER SUPPORT - NO REFUNDS",
          "Contenu": "I pay for the premium subscription, and for the last 3 weeks I have been locked out of the desktop version (stating I have the wrong password) however I have access to the mobile app and my password works on mobile. The customer support team provided redundant solutions that don't work, I've worked several hours trying to fix the issue. Some of the stuff they have asked me to do you can't do on mobile. I gave up after much wasted time and asked for a refund, they said they don't issue refunds despite the fact that I can't use the password manager as is (and trying to troubleshoot for over two weeks)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erin Pietrowski",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T17:39:22.000Z",
          "Titre": "DO NOT USE DASHLANE",
          "Contenu": "If I could give this less than one star, I would. I’m not kidding when I say that between every button I push or letter I type when using the ap I have to wait like 60 seconds at least. It’s soo slow. I finally reached out about it and they told me they fixed it so I need to re-install the ap and if that still doesn’t work to clear my browser history- I did both, and nothing changed. I messaged them back saying it didn’t help and then they just never responded. I’m in the process of trying to switch back to last pass and it’s going to take years to copy and paste these passwords bc dash lane is sooo slow, literally making me go insane. Do NOT use dash lane"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tom Whiter",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:50:26.000Z",
          "Titre": "Unfixable Bugs & Little Help From The Customer Team",
          "Contenu": "I've been really disappointed with Dashlane's product; it doesn't work as advertised and I've been refused a refund.After a successful trial, I purchased 22 seats to roll out Dashlane to the small company I run.As soon as I switched from the free trial to paying member, I discovered a bug where logins and passwords I'd saved in my business space weren't visible/shareable with my team - the whole point of the software.I flagged this to customer support who offered several solutions, none of which worked. I was then told that the engineering team were 'deprioritising' my issue.I've asked for my account to be deleted and to start again, I've offered to switch plans, I've followed every instruction given to me, but to no avail.It's now nearly 5 months later and nothing has been done. Customer support have been friendly on email, but haven't solved the issue - when asking for my membership to be paused until this is sorted out, or my renewal date to be extended, or eventually asking for a refund now that my patience is exhausted, I've been refused and told 'after 30 days, there are no refunds.'Please use another service like 1Password or NordPass instead and save yourself the hassle - I'll be over here in Dashlane purgatory with my unused 21 seats."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kingsley",
          "Nb_Reviews": 4,
          "Date": "2023-03-15T23:18:48.000Z",
          "Titre": "No human support whatsoever",
          "Contenu": "No human support whatsoever!  Can not get desktop application to work!  Spent hours trying and even Apple support could not get to function!  Has for years then went nipples up on me and cannot get to work as did"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ReNae Monette",
          "Nb_Reviews": 8,
          "Date": "2023-05-11T04:44:52.000Z",
          "Titre": "I closed my account with Dashlane as it…",
          "Contenu": "I closed my account with Dashlane as it was more trouble than it was worth.  Had many problems and no customer support.  Now 5 years later they are trying to process payment.  Thank god my credit card has changed."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tomas Vasil",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T09:56:30.000Z",
          "Titre": "Dashlane Customer support, Data and oblivious Web app",
          "Contenu": "So let me start off with how bad the Web client is for dashlane, the fact that you have to log in like 2 times every browser session + dashlane authenticator for that you also have to log in again.Bought the premium subscription last year and it ended like a week ago, now all of my 'data' basically vanished from my accounts, no data was saved or transfered by dashlane online databases and the customer service literallyqouted 'When unlinking your previous device, all your data should be uploaded to the new device. ' saying 'should' meaning they themselves are not sure if the data is transferred. If these statements alone don't convince you to choose otherwiseI guess try it yourself and save hundreads of passwords and after a year find a new alternative like 'Bitwarden', thus cancelling your subscription with them and 'literally' losing all your passwords with no way of getting them back since the support doesn't know either on how to get them back.Let's not forget the web client has a flaw where if you use any other browser apart the ones they support, YOU will have to log in every single time and won't be able to use the feature 'save login info for 14 days' this service is a joke.Forget this app and just get 'bitwarden' or 'keepass' like they're free, offer same or more value for free and have better customer support. Probably even bought their reviews on trustpilot. Serious accusation, its probably true."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Naveen Krishnmurthy",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T01:31:26.000Z",
          "Titre": "All Passwords and notes deleted..",
          "Contenu": "After using this app for 3 yrs, all of a sudden lost all passwords and secure notes.. I have logged  a support ticket but its been 2 days and no response..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Coach",
          "Nb_Reviews": 3,
          "Date": "2023-02-24T20:06:57.000Z",
          "Titre": "PLEASE CANCEL MY SUBSCRIPTION!",
          "Contenu": "Several times for the past month I have tried to cancel my subscription, to no avail. I keep getting robo type responses, that are of no help. PLEASE CANCEL MY SUBSCRIPTION!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Xshk",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T09:25:13.000Z",
          "Titre": "Once i installed this i was forced…",
          "Contenu": "Once i installed this i was forced logged out of all my accounts. Is that suppose to be a smooth transition? it created me a whole load of work. Absolute trash."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kingsley Ellingson",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T22:44:03.000Z",
          "Titre": "Absolutely the worst customer service…",
          "Contenu": "Absolutely the worst customer service I’ve ever dealt with in my life. Can not get application back up and running on my Mac."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Verna",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T01:10:02.000Z",
          "Titre": "I sent two messages to Dashlane 5 and 3…",
          "Contenu": "I sent two messages to Dashlane 5 and 3 days ago. No response and no other way to get in touch with them.  I am missing the D logo and don't know how to get it back.  Terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris-Corpus Christi,TX",
          "Nb_Reviews": 8,
          "Date": "2023-07-27T05:07:47.000Z",
          "Titre": "They do not want anyone to talk…",
          "Contenu": "They do not want anyone to talk directly with a HUMAN BEING, everything is a BOT!No phone number to call !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "scott.boebelgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T03:21:56.000Z",
          "Titre": "Took weeks to get help",
          "Contenu": "Took weeks to get help, no live person, i had to figure it out myself. Dashlane support is the worst in the industry. I will have to leave"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "M.J",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T04:04:31.000Z",
          "Titre": "Horrendous!",
          "Contenu": "Horrendous!Dashlane is a great app when it works! But when it doesn't-My oh My!!!!!!!When I upgraded to a new iPhone I was no longer able to access my Dashlane account or any of my passwords or information! What followed was almost 5 weeks of time-consuming, frustrating, and excruciating email correspondence where I felt myself going around in circles. While not the world's leading tech-savvy person I do regard myself as having basic competency and despite following the instructions given was not able to rectify the problem on m y own and needed assistance. I was expected to respond within 3 hours to verification codes sent to my email. The problem was I am in a different time zone to the Dashlane technicians and they were not able to schedule for the code to be sent to me at what might have been a reasonable time in my time zone!I could not get to talk to a technician by phone to help guide me through the process of trying to resolve the problem (despite making this request several times and providing contact details!!!). While I appreciate the need for strict security and would not want anything other than strict security for my passwords -I was expected to remember the exact date the account was opened which was over 5 years ago, the number of log-ins I had, and the exact date that my last log-in was! I might have been able to answer these security questions if I had been able to access my account!  They would not take into account any other information I tried to provide or the fact that I knew the Master Password!After demanding help from higher management, a second technical assistant finally helped me sort the information out from their side which I appreciated.I am not in the habit of writing bad reviews but this experience was so excruciating that I felt I needed to share my experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jrjrossjones.net",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T14:49:07.000Z",
          "Titre": "Only response was from a robot",
          "Contenu": "Only response was from a robot. Response had nothing to do with the problem."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Birol Aksu",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T12:57:05.000Z",
          "Titre": "Subscription Cancelation Issues",
          "Contenu": "Basically I wanted to cancel my subscription but you have to pay one month extra in order to see cancel subscription buttons. It is not fair that I have paid 1 month extra for a subscription that I will not use at all."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "vincentrankilagmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T18:15:18.000Z",
          "Titre": "bad service i will never use and…",
          "Contenu": "bad service i will never use and recommend again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOE KEEFE",
          "Nb_Reviews": 6,
          "Date": "2023-06-26T01:47:01.000Z",
          "Titre": "Customer service was none existent",
          "Contenu": "Customer service was none existent. They didn't even read my submission when responding."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "brandon.rassthecatalystgroup.c",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T12:19:44.000Z",
          "Titre": "Still waiting on the issue to be resolved"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Breslin",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T12:18:34.000Z",
          "Titre": "Inattentive inconvenient robotic…",
          "Contenu": "Inattentive inconvenient robotic response of no value—-had to pay local tech to solve problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Parnell",
          "Nb_Reviews": 4,
          "Date": "2022-09-15T21:08:56.000Z",
          "Titre": "If you forget the master password you…",
          "Contenu": "If you forget the master password you are screwed. You must start all over again and reset all of your sites. Also, will intercept your every attempt to log on by blocking the log on info. I'm an old man and have a habit of forgetting passwords. Dashlane has declared me as an enemy."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Reda El ghomari",
          "Nb_Reviews": 12,
          "Date": "2022-08-15T14:21:09.000Z",
          "Titre": "Becoming a really bad software…",
          "Contenu": "Becoming a really bad software recently. I sent a message about a bug in their extension, they literally didn't read and pasted a huge template copy paste that basically \"Do what you are already doing and then it should work\", but it doesn't, that's why I reported the bug. Becoming a BS company with corporate copy-paste. Time to switch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "L. A. FELIX",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T03:31:52.000Z",
          "Titre": "CONTINUED INABILITY TO CONSISTENTLY…",
          "Contenu": "CONTINUED INABILITY TO CONSISTENTLY HAVE DASHLANE OPERATE SUCCESSFULLY! AS OF THE LAST THREE DAYS DASHLANE HAS BEEN INACCESSIBLE!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mihai radu pop",
          "Nb_Reviews": 11,
          "Date": "2022-06-30T23:43:36.000Z",
          "Titre": "Useless junk",
          "Contenu": "Every time I want to login to my host gator account this dash lane pop up to offer to save my password. And I click not show again and there it is again. Horrible thing .Fair enough if you try to fix. I use ccleaner browser. Search engine duckduckgo, and the pup up appear every time . I got no account with you, never looked you up, just started to offer to remember my password. I clic never show again and yet it does every time !"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Fran C",
          "Nb_Reviews": 15,
          "Date": "2022-10-01T08:05:30.000Z",
          "Titre": "Dashlane locked me out on two platforms",
          "Contenu": "I'm a Premium member and I've had the same master password for years.  Last Friday, I was unable to access Dashlane (password rejected).  Dashlane support said that I must have forgotten my password but fortunately for me, I could prove I had not as I kept this password on an encrypted file in my safe.  Dashlane could offer no explanation why their software disabled my access (on their windows app and also on their iPhone app), and they stopped responding to me after 24 hours.  I would not renew my subscription.  (AFTER READING THEIR REPLY) STATING: \"it's usually due to an issue with how the extension, or app, was originally installed or how it communicated with a recent update - a reinstall of the extension, or app, resolves this.\"  Please note that this occurred at the same time on two totally different apps so their response has no merit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FiveFiveNine",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T22:40:40.000Z",
          "Titre": "Do NOT enroll in their autopay!",
          "Contenu": "Do NOT enroll in their autopay!I received email from Dashlane stating in 30 days an autopay would occur.  I immediately sent an email to Dashlane support to cancel my autopay and subscription. Having not heard from Dashlane after 2 weeks, I sent another email cancelling subscription and autopay.On day of autopay, I received an email that I had been charged for another year of Dashlane! Included in the email was a link to Paypal to cancel the autopay. These instructions were NOT in the original email.  My Paypal account did show a charge was already made from Dashlane.Oct 6 response to Dashlane reply:* It would have been nice to have received your response after my first email to Dashlane support in early Sept.* The email warning of the impending auto renew charge stated the charge would occur    Oct 18.  My Paypal got charged on Oct 1.  Another devious business practice."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Niall",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T16:24:21.000Z",
          "Titre": "I've historically been an advocate for…",
          "Contenu": "I've historically been an advocate for Dashlane as I found their app to be one of the better password managers in the market but their platform has drastically declined in quality in the past year or so.After years as a paid user, it seems as though technical issues are becoming more frequent and increasingly frustrating.I'm now experiencing the 3rd or 4th time (this year) where I cannot access my passwords due to technical errors on their end - which is unacceptable on a costly premium plan. Unfortunately, I'll be moving on to another password manager."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Morgan",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T13:37:34.000Z",
          "Titre": "HIJACKED",
          "Contenu": "I have tried to contact Dashlane but there is no email address and the only contact form is for business only demanding company details.I recently started getting a dashlane reminder window every time i logged into different websites, a reminder to log into Dashlane password manager. Which i do not have or use, I cannot find any reference on my comp, it is very annoying, i feel HIjacked and disgusted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M Helmy",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T11:36:53.000Z",
          "Titre": "Used to be great but prices sucks",
          "Contenu": "I’ve been using Dashlane for a few years now. It’s really great, very secure and works well. But I started with the premium account for about $23 and it increased till it reached $60. Which almost double the price of all competitors. They restricted the promocodes to only new customers which is such a greedy move. So eventually I had to switch to another brand that is reasonably priced and offers the same. I wish I could stick with Dashlane since I’m already familiar with and liked but the way they are going with the pricing I believe I’m not going to be the last one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Havana Grill Group, Inc.",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T22:47:00.000Z",
          "Titre": "What Happened To These People?",
          "Contenu": "I have used Dashlane for several years and have been satisfied. However, in the last month, they have locked me out of my account, sending me a pop up message that my master password in invalid. Of course, they want me to upgrade to their premium plan for additional money or I will no longer have access to my passwords. The anxiety and stress that this has caused me is unbelievable because now I am unable to access my important accounts because Dashlane is holding my passwords hostage unless I pay up. How can they do this? Isn't there some sort of law that prohibits this type of greedy move by a corporation?"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mr&Mrs Figglewatts",
          "Nb_Reviews": 2,
          "Date": "2022-02-01T22:51:56.000Z",
          "Titre": "The web app is complete rubbish",
          "Contenu": "The web app is complete rubbish. When setting up passwords (temp) for customers it was really easy enough to generate, copy and paste. Now it's an absolute nightmare. Why did they not include a password generator as a separate function within the app without having to generate from within the password field?And that's not the only gripe, it's now clumsy and intrusive.I'm throwing away almost a full year sub just to get rid of this terrible password manager"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T17:17:15.000Z",
          "Titre": "Dashlane progressively gets worse over time and removes features. Don't invest your data with them.",
          "Contenu": "When I first got Dashlane I loved it. This was back when there was a desktop app. Then Dashlane decided to migrate away from a desktop app to a web app only. Since then a number of critical and important features have been lost, and yet the price of Dashlane has not fallen. You can NO LONGER set an EMERGENCY CONTACT. You can NO LONGER easily sign in with 2FA without going through a separate app first.  You can NO LONGER create CUSTOM Categories within the app to organize your data. A company that continues to REMOVE features and worsen their offering will not sustain for long. If I could do it all again I'd set up a KEEPER account. They are very similar, but they have maintained many of the features I describe above that Dashlane decided to stop."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cathy Bucher",
          "Nb_Reviews": 5,
          "Date": "2022-05-21T19:13:31.000Z",
          "Titre": "I cannot find anyone to cancel my subscription",
          "Contenu": "I though I had cancelled my subscription 2 years ago and haven't been able to.  I have never used it.  Then I was billed and gave up trying to reach anyone.  Then I got billed yesterday.  Again, I cannot reach anyone.  I tried logging into my account to delete it, but I discarded my master password thinking ti didn't need it anymore.  Cannot find a phone number or email address.  Nothng on the website.  Customer support does not return my messages.  Yesterday my customer support request bounced back as undeliverable.  I have spent HOURS on this.  Have reported them to the FTC.  I don't know what else to do."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Phil S",
          "Nb_Reviews": 14,
          "Date": "2021-11-12T06:39:08.000Z",
          "Titre": "Really poor service",
          "Contenu": "Really poor service - their process for recovery if you forget your Master password is really poor.  The FaceID function didn't work, so their support team said they had literally no other way of resetting my password - they said I could recreate my account and reenter all my passwords (hundreds and hundreds) - appalling.  Their software doesn't work properly, customer left with no access! Avoid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Former User",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T16:30:21.000Z",
          "Titre": "NO CUSTOMER SUPPORT!!",
          "Contenu": "NO CUSTOMER SUPPORT!!!  I began using Dashlane and the next day I could not access any of the accounts for which I had used Dashlane's password generator.  I went online to see how to contact the company.  YOU CAN'T!  You have to send an e-mail or chat and then wait for them to respond (and hope that they do).  I lost a day's work because of this.  Use anyone else but Dashlane."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2022-08-14T20:38:11.000Z",
          "Titre": "Getting my money back",
          "Contenu": "I have initiated a refund request through the Apple App Store.  You can not say your app is easy to use when it is not.  And of the false advertisement of it being easy is very misleading.To make matters worse, you actually expect customers to read through numerous manuals and written instructions to figure out how to use your non-user-friendly app.  And if that does not work, then you wants customers to reach out to you during their own Mon thru Friday working hours.  Or email you, wait 24 hours for a response and waste their time sending sending screen shots back and forth.No wonder you have so few subscribers.  Good lick with all that.  In my experience good companies, with good products, are able to provide free phone support.  They can do so because they have a good product that really is easy to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T20:41:57.000Z",
          "Titre": "The email address cannot be changed",
          "Contenu": "The email address cannot be changed. Dashlane relies on external email boxes that they don't control. Someone wrongly designed the email as ID and users now have a problem. The only option is to set up a new Dashlane account to a new email address (Changing the contact email address does not solve the problem). Unfortunately, they cannot transfer a paid family license, so you have to buy a new one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KYLE",
          "Nb_Reviews": 2,
          "Date": "2021-07-30T00:01:59.000Z",
          "Titre": "dashlane is a complete piece of crap",
          "Contenu": "dashlane is a complete piece of crap.  it doesn't save your passwords when you replace them, it doesn't let you log in on other devices if you change your master password. it's full of bugs, there's no support, and the basic functionality consistently fails to work leaving you not knowing what your passwords are. avoid at all costs, use anything else, including a piece of paper"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Des",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T01:37:25.000Z",
          "Titre": "Customer service",
          "Contenu": "If you never, I mean never require customer service, it is a good choice. Have been a customer for 6+ years. Their website hiccup upped and I now have 3 tickets and zero assistance going on 3 weeks and am a hostage. Your only hope is there website might answer your question. If not, you can reach a Customer Service rep in a chat, but if your problem is not instantly solvable, they might email you but they then go dark and you are nowhere.  Expensive service for zero, and I mean zero customer service."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Mr Thomas",
          "Nb_Reviews": 7,
          "Date": "2021-12-16T04:00:31.000Z",
          "Titre": "WORST PASSWORD MANAGER EVER.",
          "Contenu": "WORST PASSWORD MANAGER EVER.They FORCE you to install their desktop app to activate 2 FACTOR AUTHENTIFICATION (2FA). THEN they force you to enter your PHONE number to activate 2FA for sms (which is the most INSECURE way). SERIOUSLY ???Instantly uninstalled everything related to dashlane."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 6,
          "Date": "2021-05-12T17:08:46.000Z",
          "Titre": "Dashlane isn't what it claims to be",
          "Contenu": "Dashlane seemed to work good initially.  I have been a customer for 2 years and really dislike it.  One day you have to log in multiple times in the same day other days you don't log in for days at a time.  It has screwed my passwords up with existing companies.  It's a poor app at best, I hope to find something better.  I hate paying for crap that doesn't work right and yet they charge you for it not a one time charge but yearly!!!!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Jan",
          "Nb_Reviews": 12,
          "Date": "2021-07-13T15:42:55.000Z",
          "Titre": "Disappointing and frustrating ....",
          "Contenu": "Disappointing and frustrating ..... after trying for several months to get Dashlane functioning I learn from customer service that my Mac is too old and my IOS El Capitan is obsolete....I cancelled everything (but still struggle to get the Dashlane app removed from my Mac) and am using Norton 360 - easy and no problem."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Kenneth Luplau-Brøgger",
          "Nb_Reviews": 49,
          "Date": "2021-03-15T07:30:52.000Z",
          "Titre": "The product is deteriorating at a rapid…",
          "Contenu": "The product is deteriorating at a rapid pace. The amount of logins to Dashlane itself is astonishing.I switched to 1Password, and asked Dashlane to verify that all my data has been removed from their servers. They reply, over a month later, telling me that I can try to start a chat on their site to get help.Sad to see a former rock star product get to this state."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "JdB",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T18:46:29.000Z",
          "Titre": "Double payment, non-existent customer service",
          "Contenu": "Already several months I have been using Dashlane in the paid version, after good experiences with the free version. I started with a monthly fee and wanted to switch to an annual subscription. Now I have already paid the annual fee twice and they still, also, book my monthly fees. As I saw at other complainers, their customer service is a bot and further non-existing. You just do not get an answer when sending an e-mail."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Iain Hunter-Fennell",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T17:40:36.000Z",
          "Titre": "Atrocious custmer service.",
          "Contenu": "Signed up for Dashlane only to find that my Ipad was too old to be used with it. I therefore asked for a refund but the service has been dismal. I've opened two tickets this week to get it sorted but all I have received is two automated responses and no refund.If you value even basic customer service avoid this company.Assuming Dashlane are listening to this review the ticket numbers are #1403421 and #1408044"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T21:28:20.000Z",
          "Titre": "Features like autofill don't work as…",
          "Contenu": "Features like autofill don't work as advertised on all my devices.The \"priority support\" that I pay for as part of my plan can't even respond within a full business day.Their \"live chat\" is useless and isn't even active during the hours posted on their own website (ex: says it's active until 6 PM, but they're not there at 4 PM)"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steam Iron",
          "Nb_Reviews": 15,
          "Date": "2021-02-04T12:15:45.000Z",
          "Titre": "Used to love Dashlane but I would avoid…",
          "Contenu": "Used to love Dashlane but I would avoid it now, they are focusing on a web only version and stopping support for the desktop app meaning if you are using anything that needs a password that is not in a browser e.g a games platform or other app with a login you have to use a web browser to find a password.  I often have dozens of web tabs open and finding dashlane is a nuisance when it used to be in the tray for immediate access."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Adam Kaczorowski",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T13:19:57.000Z",
          "Titre": "Non-existing Customer Service",
          "Contenu": "I've bought a yearly subscription but apparently Dashlane isn't for me so I've asked for a 30-day refund guaranteed and moved to 1Password.However, it's been over two weeks since I've requested a refund (#1415140) and the ONLY answer I've got was from a bot. Nobody from the \"Customer Service\" cares to resolve my issue..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Wagga Wagga Territory",
          "Nb_Reviews": 2,
          "Date": "2020-12-21T01:26:15.000Z",
          "Titre": "Pay for Dashlane or Dont Touch",
          "Contenu": "Advertised as free website that you can log into with your fingerprint. After a period of time this feature dissapeared. You then had to use password. After period of time it tells you your password is incorrect which had never changed. You have no way to reset password and you lose all your stored passwords(which are only stored on this site). Ordinary support given password has not changed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve Gadd",
          "Nb_Reviews": 7,
          "Date": "2021-05-21T21:24:46.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "I had a problem with a lost master password and contacted customer service via the on-line chat facility. Unfortunately after hours and hours of dialogue with Dashlane - the result was absolutely nothing, couldn’t help me. Very disappointed for a so called premium product - cancelled my account and moved on. Rubbish."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Alyx Buckmann",
          "Nb_Reviews": 5,
          "Date": "2021-02-06T13:37:53.000Z",
          "Titre": "Want to cancel? They screw you over.",
          "Contenu": "I have cancelled Dashlane many months ago. However, they have recently deducted me $40. They have failed to respond to my refund requests. Just sent them a third request, this time, in form of a more legal text email.It is a huge pain trying to cancel with them. Even if you do, they might still take your money.They even went and responded to my Trustpilot review, telling me \"AH YEAH WE CAN HELP\", while failing to do so. Good job!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Young",
          "Nb_Reviews": 6,
          "Date": "2020-12-22T18:49:38.000Z",
          "Titre": "Remove vital features without warning",
          "Contenu": "From my perspective, the only thing that made this more expensive product worth the extra money, was the ability to use Windows Hello fingerprint authentication to autofill passwords on websites. I paid for an annual subscription based on the assumption that feature would continue to be offered. This feature has now been removed without notice mid-subscription. I asked for a refund of my unspent subscription. This was refused."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 22,
          "Date": "2020-11-27T09:32:31.000Z",
          "Titre": "This just doesnt work",
          "Contenu": "This just doesnt work. Waste of money. It doesnt log in automatically on Mac and now on Windows every page has to be reloaded for Dashlane to even recognize the page exists and then it still wont login.There are much cheaper and better password tools with exactly the same functionality available today. If you want to avoid total frustration dont give Dashlane your money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hugo Macey",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T16:05:19.000Z",
          "Titre": "This was awful.  Locked me out of my web-sites.",
          "Contenu": "This was awful. Recommended by a friend.  I installed on my browser and it promptly auto-filled my web-sites with the wrong passwords. When I tried to suspend the autofill using the help instructions, it continued.  The help menus are pretty confusing as well.  A hopeless product. Stay  away from it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T15:25:29.000Z",
          "Titre": "I deleted it from my PC where it had…",
          "Contenu": "I deleted it from my PC where it had worked great and installed it on my iPhone where I could not get it to work. I found the explanations very confusing...so, I prefer not to use any there. Thanks."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Customer",
          "Nb_Reviews": 61,
          "Date": "2020-06-25T05:30:15.000Z",
          "Titre": "NO refund as promised within 30 days and NO replies to emails",
          "Contenu": "While this company makes it easy to take your money when as in my case the product does not work like they say it will and offer a 30 day full refund I have tried numerous times to get my money back - they as others have found will just ignore your emails and are not forthcoming with my refund - and they keep sending me promotional emails for a service I could not use and do not want so AVOID THIS COMPANY"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 5,
          "Date": "2021-01-01T23:56:00.000Z",
          "Titre": "Can’t even get the basics",
          "Contenu": "Tried to create an account using my sky account and it wouldn’t allow it as it was an “invalid email address” which it isn’t. I have also tried my AOL email address and created a new Outlook.com address and all fail with invalid email address. No faith in the product if they can’t get a basic registration process correct"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "It's Fitness",
          "Nb_Reviews": 20,
          "Date": "2021-10-12T05:06:31.000Z",
          "Titre": "Hit or a miss..",
          "Contenu": "I found that both the app and google chrome on my laptop, are at best, a hit or a miss. It will log you in automatically on one site, then the next day it wont work for the same site. It never auto fills my card details, even though I have two registered. The only thing I have found that Dashlane does, is constantly ask for the master password and try to upgrade me from the trial to Pro.  There is absolutely no customer service, you are just passed from one person to the next with no solutions provided.Its a fantastic idea and reasonably priced. But it just doesn't work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Pipington",
          "Nb_Reviews": 8,
          "Date": "2021-02-12T09:09:42.000Z",
          "Titre": "Forced Web App - Horrendous",
          "Contenu": "The new web app, and Chrome Extension are absolutely atrocious. I have been using Dashlane for a number of years as a premium user and been happy. Latest update just makes it unusable. Sad to say I will have to look for an alternative this year. What a stupid idiotic move that will lose you many many customers."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Phillip I. Staker",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T00:20:12.000Z",
          "Titre": "I quickly realised this service wasn't…",
          "Contenu": "I quickly realised this service wasn't for me after they couldn't autofill in the android browser, however things took a turn for the worst when I requested a refund under my 30 day refund window, they refuse the request, and deleted my account. Then I sent a message to support to request it, it has taken them over a month to respond to say that my account doesn't exist (no sh.. sherlock) so they can't process my request. Absolutely incompetent and useless service with a sup par app and horribly slow service."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Martin Lauridsen",
          "Nb_Reviews": 66,
          "Date": "2020-01-13T15:42:58.000Z",
          "Titre": "I wanted to buy, but..",
          "Contenu": "I wanted to buy, but its stupid to be forced a VPN, what about the people that already got a VPN, better one infact, i want a password manager, nothing more, so why pay that huge amount for a Password manager, just because it got a VPN that isent even great, so make a damn optional Dashlane without that s.. VPN plz and you may actually be worth it for many more people, but for now i go with another product, like so many other.."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Bouwens",
          "Nb_Reviews": 4,
          "Date": "2020-07-15T09:56:58.000Z",
          "Titre": "Total frustration, it sucks the life force out of you",
          "Contenu": "'Premium subscription' means wasting half your life trying to manage Dashlane and figuring out how to get to your online accounts. The constant pop-ups are annoying, but not as bad as Dashlane offering to 'generate a strong password\" with which I either can't log in, or when I can actually log in, Dashlane hasn't saved the particular pw in my account. Never have i payed for a service to feel so frustrated. Except maybe at a downtown McDonalds counter."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ralph Hunt",
          "Nb_Reviews": 17,
          "Date": "2021-01-11T14:57:42.000Z",
          "Titre": "Don't bother",
          "Contenu": "Don't botherThis was in my opinion the best password manager - but they have downgraded it from what used to be a fully featured product to a clunky buggy web app which they have introduced pending deprecation of their desktop app. They have even moved to providing useless support via an AI bot."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 14,
          "Date": "2020-09-03T13:00:27.000Z",
          "Titre": "Don't bother with this",
          "Contenu": "Don't bother with this, the software is rubbish.The only, and only plus side is that you can at least copy and paste your saved passwords, if you know where to find and unhide them, when dashlane doesn't fill it in.So glad i didn't bother with the premium version.There has to be something better, surely?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Techadmin",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T11:39:07.000Z",
          "Titre": "This was relatively useful but is useless since the change.",
          "Contenu": "This used to be a relatively useful password manager, however frustrating to use because of the confusing way it kept asking to store a password. I used it because it seemed convenient to store my passwords. The auto fill invariably used to enter an old password which made it tedious to maintain. It is now entirely useless since they updated to the browser version. I will be removing it and use something more reliable and less frustrating. I was willing to give it a try but honestly it's no longer worth the bother."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "JAMd",
          "Nb_Reviews": 4,
          "Date": "2021-03-03T10:18:04.000Z",
          "Titre": "Only automatic replies",
          "Contenu": "This is an update of an earlier review. Already several months I have been using Dashlane in the paid version, after good experiences with the free version. I started with a monthly fee and wanted to switch to an annual subscription. Now I have already paid the annual fee twice and they still, also, book my monthly fees. As I saw at other complainers, their customer service is a bot and further non-existing. You just do not get an answer when sending an e-mail. It is about #1409855 dated 3 February and #1422142 dated 20 February."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Lee Enrolled Agent",
          "Nb_Reviews": 2,
          "Date": "2019-10-23T01:35:12.000Z",
          "Titre": "Software is crap",
          "Contenu": "Software is crap, crap crap. Won’t work on my computer had to fight with them to get a refund. I got it. Now they are going to charge my credit card $5.00 a month for a premium subscription on software that does not work nor is it on my computer. Emailed them and said I had to log in on my account to cancel. Problem is I do not have an account. F@#k me!,"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Hussain Mufti",
          "Nb_Reviews": 1,
          "Date": "2019-07-10T12:55:06.000Z",
          "Titre": "Save yourself the misery, don’t get this app!",
          "Contenu": "If you need to share passwords—- DO NOT GET this app!They make you sign up for free and then if you want to share your password with anyone, they will sign you up to a subscription until you find out the sharing feature does NOT work. Extremely glitcy app on mac. They also failed to refund anything although I complained within 30 days of signing up.I don’t recommend it. Try something else, save yourself the misery."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Bessell",
          "Nb_Reviews": 9,
          "Date": "2019-03-27T17:38:21.000Z",
          "Titre": "Suddenly I don't trust it.",
          "Contenu": "Downloaded Dashlane on my Mac and during set up realised the free app wasn't capable of meeting my needs. So uninstalled the app. However, now, when I go to fill in a password the window still pops open to ask if I want it on Dashlane - in other words, it rather craftily refuses to be totally uninstalled.I would never trust a piece of software that's obviously designed not to be easy to get rid of!Update: Ok - got it now. Thanks."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Edvin",
          "Nb_Reviews": 13,
          "Date": "2021-01-31T00:16:53.000Z",
          "Titre": "The new default web app is a disaster!",
          "Contenu": "The new default web app is a disaster!Many essential features such as credential info and VPN doesn't work on the web app. The web interface is much more prone to scam and illicit interfering by keyloggers and phishing and such. Why did I even pay for this? The desktop app worked fine. It's mindwrecking how you can mess up this bad. I'm moving to Bitwarden, which is a free alternative that works so much better. Also, please flag this review so I can prove that I purchased a 24 months premium service (stupid me, I know). Shame, really."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Les Berman",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T19:26:48.000Z",
          "Titre": "They immediately take your money",
          "Contenu": "They immediately take your money. If you have a Support issue, forget it. You will spend hours with them on chat, because they don't have phone support and they don't use services such as Logmein. They will send you an email and you respond saying that the email doesn't solve the problem. And then a couple of days later, another email that doesn't solve the issue. And so it goes, for days, and weeks or longer. Your money is gone !!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Peter Antony Bebbington",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T13:38:17.000Z",
          "Titre": "Dashlane awful software and customer service",
          "Contenu": "I used Dashlane business for my company, as a password manager it was awful, my entire team had issues with it and wasted countless hours trying to work with it. It would generate passwords and not save them, and when using with Firefox on Linux it would never auto fill. I requested a refund after 3 months in to a 12 month contract and they refused to give the refund even tho we are not going to be using their terrible software. Please do not get Dashlane there are much better and cheaper password managers out there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Toti",
          "Nb_Reviews": 1,
          "Date": "2018-10-03T11:39:45.000Z",
          "Titre": "Dashlane sucks",
          "Contenu": "Purchased Dashlane software based largely on online reviews.  Installed fine, but unfortunately when I went to actually change a password, the menu option to do so was missing.  Worked with Dashlane customer support opening two separate tickets, they had me waste hours uninstalling and reinstalling the software, to no avail. Never worked.  Then when I asked for a refund, they refused.  Worst experience with a software app in years."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Laura Coulson",
          "Nb_Reviews": 6,
          "Date": "2019-11-24T08:33:07.000Z",
          "Titre": "The idea is great and the VPN works…",
          "Contenu": "The idea is great and the VPN works fine but it can't ever give me the right password. Every site that requires a login ends up with at least seven different passwords, each of which are wrong. Nobody can seem to figure out where it's getting this information and I've spent significantly more time going through the lost password process than I did before I used it. The issue is consistent across my Mac, PC and iPhone. Just use Chrome to remember passwords and get a better VPN."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jerry Mallett",
          "Nb_Reviews": 6,
          "Date": "2021-08-18T09:59:59.000Z",
          "Titre": "DashLane not For Me",
          "Contenu": "Introduced to this last year. Even before we deployed it I thought it was overkill for our needs. That thought has not changed.  I see many great reviews on here but I'm not convinced by any of them.  We have a couple hundred employees and only a handful are using it. And I am not one of them! On a number of occasions it has failed and those staff that had installed it found they could no longer get through their daily tasks because they couldn't get access to any of the websites.  I've seen and used a lot of software applications in my 35 years in IT and this one will not get my seal of approval."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Savage",
          "Nb_Reviews": 10,
          "Date": "2020-07-21T09:53:09.000Z",
          "Titre": "SUB STANDARD NO CUSTOMER SUPPORT A FRAUD",
          "Contenu": "Although this program no doubt has value to others, for me it was a total loser. For one thing, they do not have Phone support, which is a major flaw considering the difficulty of its programs. And even though they promote chat rooms as a substitute, their version of a mutual chat room is a farce. I was promised a refund it the program did not work for me, but until now, they have been ignoring me which is a major mistake on their part. I do not intend to relent until they live by their word, unsubscribe me and return my money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 22,
          "Date": "2021-08-25T15:13:38.000Z",
          "Titre": "AVOID LIKE THE PLAGUE.",
          "Contenu": "AVOID LIKE THE PLAGUE.This app is useless and because it is so full of bugs it is now causing me serious issues. Changed a very significant password and now the app wont recognize my password to let me back in.Only use if you like risking your data.As a reply to the Dashlane response - I did raise a ticket with support. It took over 24 hours for a response and then it was boilerplate and totally ignored the issue. Just reinforces my comments.The final comment from Dashlane support is they cannot recover the lost password but hope that doesn’t put me off Dashlane. Lastpass installed and all passwords transferred."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kevin",
          "Nb_Reviews": 5,
          "Date": "2017-11-10T17:35:29.000Z",
          "Titre": "I've had this software for a couple of …",
          "Contenu": "I've had this software for a couple of years now and it was okay. Most of the time, it did not fill in forms correctly and a number of other issues.  Then, Dashlane had me install some sort of one-click function and since it has ceased to function at all.  I have had to resort to pen and paper.  Dashlane's support has been abysmal.  At this point, I'm just trying to install it so that I can export my data to LastPass.Kevin"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jeff Blain",
          "Nb_Reviews": 4,
          "Date": "2020-05-09T23:29:24.000Z",
          "Titre": "Hell on earth",
          "Contenu": "Since i use dashlane, my life turn in Hell.It duplicate site and password, doesn't update password sync. I get lock out and violate site because the sync doesn't work well. On domain, it's terrible, every new sub domain, DL create a new password, within a week you have 20 time the same password entered and when you change your domain password, you have to manually change them all. Don't forget one or you will violate your password.I can't believe people even consider it.  And it's one of the best ????"
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Tere Riera-Carrion",
          "Nb_Reviews": 1,
          "Date": "2017-01-10T15:14:08.000Z",
          "Titre": "HORRIBLE website.  TERRIBLE experience.",
          "Contenu": "I didn't last any time with this application. It's horrible.  It takes over your computer and adds websites indiscriminately.  You have to service the application, rather than the other way around.  Using chat support was useless.  The advice given and followed ended with my not being able to access my own account to delete websites and passwords.  WORST experience ever."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T22:49:15.000Z",
          "Titre": "iOS app no longer functions properly",
          "Contenu": "App no longer functions properly. I contacted their customer service email to report the issue with a video.Rita just gave me the run around, weeks of trying to explain the buttons no longer work on the iOS app to her responding she doesn't understand. For other companies you can go straight to the development team for app issues to be fixed.So Rita is either a bot or imbecile. Either way I can't use the app properly anymore as I can't tap on the buttons.It's great when it works, but when it doesn't you're left paying for an inferior product."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Guillaume",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T11:08:26.000Z",
          "Titre": "Was good, now it is bad.",
          "Contenu": "Recent update to the free tier are hurting paid users.I share password with contractors who use free tier. Due to recent limitation to free tier they are now unable to update the password because of the 25 limit.Absolute madness."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CA Dude",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T20:32:47.000Z",
          "Titre": "Customer service can be slow",
          "Contenu": "Customer service can be slow.  I had a recent technical issue that seemed to resolve itself a few days after I reinstalled the browser extension.  It wasn't immediate that it began working again but by the time customer service responded to me, it was.  If I had the free version I wouldn't mind but since I pay for it, it can be frustrating.  It can also be a little wonky to use.  It is a little nuts sometimes that the way it works."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TBurd",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T17:21:12.000Z",
          "Titre": "While customer support was apologetic…",
          "Contenu": "While customer support was apologetic for my renewal concerns they still did not address the real problem. When you send me an email that says you will be debiting my bank account on Nov. 2nd and then debit it 3 days earlier on Oct. 31st it overdrew my account and cost me a $37.00 overdraft fee. This account is used for internet purchases only and the money goes in on the first of the month. And the only reason I am giving you 2 stars is because even though support was a week responding they did add an extra month to my subscription.  You need to do better."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 19,
          "Date": "2023-11-14T11:42:17.000Z",
          "Titre": "Put my sons data at risk",
          "Contenu": "I am a full family plan owner and have been for a few years now. Until now everything has been great. The service is slick, easy to use and covers everything I and my family need. I would have been happy to promote them to any friends or family members.My son is part of the family plan and uses the service to store many passwords. Recently despite still being part of my paid in advance family plan, his access was removed with no notification, advanced warning or explanation. He had to remove stored passwords in order to comply with Dashlane's demands that he abide by the limits for the free version.I checked all details and he is still registered as part of the family plan so I contacted Dashlane. They have ignored all attempts to contact them and resolve whatever issue they have on their side. It's a disgrace.When you promote your brand as the security home for customer's families, you take responsibility for helping keep them safe. Especially when you take their money to do so.Dashlane you should be ashamed, I will be looking to remove the subscription and claim a refund as you are not protecting my family as described"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tkargmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T00:59:11.000Z",
          "Titre": "I had help chats with 4 different…",
          "Contenu": "I had help chats with 4 different techs.  The first three were no help at all.  Finally the last asked me which operating system I was using and suggested I update it.  Sure enough that worked.  The first 2 hours I spent with the other reps were miserable."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Paul Brady",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T00:49:37.000Z",
          "Titre": "Used to be a great password manager",
          "Contenu": "Used to be a great password manager, but by god it's getting more infuriating to use by the day. Removal of the desktop app was a kick in the backside as the extension isn't the most reliable item out there. Either with delayed prompts so you're not updating the password, or it just clusters itself around and you have duplicates of incorrect passwords. Mobile app isn't much better, doesn't accurately give you prompts to enter your information even after enabling access to do so. Really is just getting worse over time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-06-26T19:47:00.000Z",
          "Titre": "Poor Technical Support",
          "Contenu": "Read the issue that the customer is facing and don't rely on your self-help answers and a Bot to to resolve issues. I was at the point of moving to Nord for my password protection. If I have to go through this again my family and I will drop your service. I spent a week attempting to get a resolution. There is no immediate response for help, it comes hours later. I guess you have a very small operation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KSC Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T15:26:07.000Z",
          "Titre": "Support Could Not Fix My Problem",
          "Contenu": "Support was not able to duplicate or fix my problem. None of the suggested solutions worked so I had to figure out a work around to my problem on my own. A few days went by with no communication and then my issue resolved on it's own. I ultimately reached out to support to let them know I no longer needed assistance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sad",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:16:54.000Z",
          "Titre": "No Group Sharing??",
          "Contenu": "How is there not group sharing on the family plan? The whole idea of a family plan is that I would like there to be sharing with a group of people. That's the service.Unfortunately, the absence of this group-sharing feature, (which does exist for other plans, just not the family plan for whatever reason) means that I can't rate this highly as this was the exact reason I invested in this service."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Astro",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T17:46:27.000Z",
          "Titre": "It was extremely hard to actually find…",
          "Contenu": "It was extremely hard to actually find a place where i could contact some and work on my problem live'I spent almost am hour cycling thru your web pages trying to find a place I could actually contact somebodyAlso i am very angry that i no longer have my passwords available for edit on my computer - i have to go on your website to do it. As my problem was that i could not log onto your website or the edge icon i could not get on the website to even see what my passwords were. I use this program so i don't have to remember them but if i cant access the icon or web page your program is TOTALLY USLESS"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "RUSK",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T15:37:34.000Z",
          "Titre": "I have a new phone..",
          "Contenu": "I have a new phone... passwords are not transferred and I had forgotten the master password.  Dashlane will NOT allow you to reset this password without losing everything.  Even Banks have the possiblity of resetting passwords.  If I wouldn't have found the password it would have been a disaster."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:27:39.000Z",
          "Titre": "Passable at best, if we're being generous.",
          "Contenu": "Passable at best.Lacks extremely basic features such as hardware key 2FA (how? in this day and age?)The autofill functionality is atrocious - sometimes overwrites random fields *and* automatically submits the form; which seems woefully insecure and also extremely frustrating when it happens as it can overwrite and save(!!!) unrelated data - so if it's a critical piece of information you didn't copy beforehand (e.g. a secret key), Dashlane could effectively lose you that key.If you disable the autofill, there's no easy way to trigger a fill of all the relevant fields - instead you need to copy paste each field one at a time.E.g. - you have a login page and you want to select a combination of user / pass from your saved list; you can't just click that saved set of credentials and have Dashlane fill both fields; no, you have to select copy username -> paste, copy password -> paste.It's a *complete* waste of time and makes autofill really necessary which brings us back to the autofill functionality being a disgrace.I guess the best thing I can say about it is that it mostly works. If you don't mind all the ridiculous limitations, the poor UI, if you're not worried about the autofill submitting sensitive data in the wrong places and all that, if Dashlane is the alternative to using the same password all over the internet, sure, Dashlane is better than that.Other than that, I really fail to see any way in which it would be better than literally any other password manager, including free / open source ones."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Steck",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T16:12:59.000Z",
          "Titre": "Easy Question, Poor Response",
          "Contenu": "Long term subscriber, love the product it has been reliable and trouble free.  The two star rating is in reference to a specific customer support response.  Wanted to renew my plan and experienced a payment error issue.  Sent a technical request and received an automated \"Dashy\" reply that did not come close to addressing my issue.  Tried on my own several more times over two days and the payment finally went through.  After I had already resolved the issue, I received an answer via email from a real person.  Very disappointed with the poor response and the apparent issue with your payment portal.Update:  Understand now that an automated response is the standard from Dashlane but when you are experiencing a problem and get an automated response, one can assume that's all you will get until you try again.  My suggestion, I would rather wait a day or so for a response from a real person than to receive one that is not related to the problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Jacobson",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:10:30.000Z",
          "Titre": "The second set of instructions (nothing…",
          "Contenu": "The second set of instructions (nothing said to use these???) where convoluted and difficult to comprehend. In several minutes I fixed the issue."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James Bukowski",
          "Nb_Reviews": 6,
          "Date": "2023-09-14T11:32:54.000Z",
          "Titre": "STAY LOGGED IN",
          "Contenu": "logging in every. single. day. even though I ask it to remember my password for 14 days is getting really really really tedious."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JustAnswer Customer",
          "Nb_Reviews": 4,
          "Date": "2023-08-02T20:07:39.000Z",
          "Titre": "Contact support",
          "Contenu": "I could not contact a human being about a supposed billing error in order to correct it or change it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "buck",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T15:34:38.000Z",
          "Titre": "The inability to speak to helpful live…",
          "Contenu": "The inability to speak to helpful live person and the complexity of your instructions  without regard for the skill of the client to interpret and execute them diminish your otherwise excellent product."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T12:35:27.000Z",
          "Titre": "My SSO wasn't working.",
          "Contenu": "My SSO wasn't working.After using the chat, they escalated the call to the next level of support and advise me that I would be reached soon with help.  The help only came 3 weeks after this.  I had to divert alot of internal ressources to get this critical service back up and running without Dashlanes experienced support staff.  When reached, they were able to point me to an efficient dirrection that I was not able to find in the help section at the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allison Ferraiolo",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T22:54:49.000Z",
          "Titre": "Account creation nightmare, buggy software",
          "Contenu": "This review combines my own experience and my husband’s experience. For me, I found Dashlane’s integration with iOS to be good, but I found its desktop applications (including browser extension) to be buggy from time to time. My husband’s experience on the other hand was a nightmare. He basically was never able to use Dashlane after creating an account and was charged before his free trial was up. I switched to Bitwarden which has been really stable and the UX has been fine once I got used to it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nigel",
          "Nb_Reviews": 8,
          "Date": "2022-01-13T16:15:48.000Z",
          "Titre": "What has happened to what I wrote…",
          "Contenu": "What has happened to what I wrote before I started to read your guidelines for reviewers and looked at the Guidelines for reviewers?  I am finding Dashlane VERY difficult to deal with. When I started with Dashlane I found it quite simple and useable but I now I over 80 I cannot follow the instructions.  However I need to use the internet so must use passwords."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kathy.chirongmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T21:24:09.000Z",
          "Titre": "sorting out renewal was a disaster!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joan L Hobeck",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T18:58:56.000Z",
          "Titre": "If its not broke",
          "Contenu": "There is a saying that if it's not broke don't fix it, well that applies to Dashlane.  It was such a good app when it was on the desktop and so easy to use.  Everytime I need a password I have to go to Dashlane.com and log in and by the time it takes to do that, I could be logged in if I only remembered the stinking password.  Why can't you bring back the old DASHLANE for those of us who prefer it and find it easier to use?  Not sure I will be spending the money I do for another year of frustration!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "anonymous",
          "Nb_Reviews": 28,
          "Date": "2019-11-05T12:39:21.000Z",
          "Titre": "No way of contacting dashlane, they never answer any requests.",
          "Contenu": "Not happy with service, does not work as advertised, does not work on all major websites. Causes issues. Tries to upsell anyone who is using a basic account even if all their passwords are from premium users. But worst of all: THERE IS NO WAY OF CONTACTING THEM, no phone number, no replies to emails. I have been waiting on a support case for 10 days now, nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronal Jordan",
          "Nb_Reviews": 5,
          "Date": "2019-12-18T02:14:59.000Z",
          "Titre": "LOST MY MASTER PASSWORD TWICE IN LESS…",
          "Contenu": "LOST MY MASTER PASSWORD TWICE IN LESS THAN A YEAR AND IT WAS NOT SOMETHING I DID.  I WOULDN'T SUGGESS THIS PASSWORD SAVER TO ANYONE.  GET A FREE ONE AS THEY HAVE THE SAME BENEFITS. I BELIEVE THAT THE LOSS WAS WHEN MICROSFT HAD AN UPDATE, PASSWORD SAVER TO ANY I WAS EVEN PAYING FOR IT.  STUPID MISTAKE ON MY PART.  WHEN YOU DO HAVE A PROBLEM, THERE IS NO ONE TO SPEAK WITH, YOU ARE ON YOUR OWN.  PAYING FOR WHAT?  NOTHING!!  I WAS LOST AND HAD NO ONE TO GO TO"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Robert B",
          "Nb_Reviews": 3,
          "Date": "2020-03-03T17:54:11.000Z",
          "Titre": "Great - when it works.",
          "Contenu": "Great - when it works. Problems: doesn’t always save passwords. Doesn’t always sync between devices. Randomly asks you to save changes when no changes have been made. Saves passwords (again) that have already been saved so that you’re not sure which is the right entry. Auto-fill doesn’t always work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "christopher Brophy",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T22:21:05.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I find the program was very difficult to work with when you had technical difficulty . My company uses Dashlane, our business account got deactivated. According to the Dashlane rep, this was  caused by a bank error. This caused all of our shared passwords to be deleted. Dashlane has no phone number that you can call, and no ware is it made clear what business hours they have to respond to customers. Dashlane took several day to get back to me when I submitted a question. I was very frustrated with the whole process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jo Ann Christy",
          "Nb_Reviews": 2,
          "Date": "2015-11-22T22:10:18.323Z",
          "Titre": "It would be great if it worked all time.",
          "Contenu": "I loved dashlane so I subscribed fir the higher-priced above the free one it never worked I paid for it but when I checked on it when it was due again they said they could not find where I paid. so I told them to just sign ?e up for the free one it has come up about 3 times rest of time I have to enter the password so for me it is not worth the hassle"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 6,
          "Date": "2019-11-21T21:35:54.000Z",
          "Titre": "Completely unreliable",
          "Contenu": "Completely unreliable no matter how many times one uninstalls, reinstalls, updates, etc..  When it works, Dashlane is a good manager, but it either suddenly stops working, won't accept autofills or balks when proper two-step sign-ins are the order.  It simply is NOT a reliable program."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Marc Elle",
          "Nb_Reviews": 2,
          "Date": "2019-09-11T11:59:08.000Z",
          "Titre": "Not a good experience",
          "Contenu": "I have downloaded the free version tonight and tried about 5 sites to test it out. I couldn't get it to consistently enter in the information.Sometimes it stored the Client Id and not the password , sometimes neither and occasionally it worked. No idea why it didnt work every time."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Alexandria Yael Blase",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T07:39:51.000Z",
          "Titre": "Buggy as heck",
          "Contenu": "Never works when you need it to,  generating new strong passwords in the sign in field instead of putting in your actual password, and then not updating your new strong password when you're actually changing a password...headache"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Mikelis",
          "Nb_Reviews": 24,
          "Date": "2020-08-04T01:37:37.000Z",
          "Titre": "Dashlane works okay but leaving is a pain.",
          "Contenu": "Dashlane works okay, but if you choose to leave, it's going to be a nightmare. Not only do modern browsers not import passwords from Dashlane, but Dashlane itself fails to generate valid CSV password files. It doesn't escape characters when exporting to CSV correctly. The CSVs it generates are missing headers in the first line for column names. And there are lines within the same CSV that have different numbers of fields.The RFC 4180 standard for CSV files is whole 6 pages long so it's really marvellous that we're entrusting our security to people who cannot follow through with that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LuckyLouis Gallun",
          "Nb_Reviews": 3,
          "Date": "2021-06-30T22:47:15.000Z",
          "Titre": "As a premium user of 18 mos I was…",
          "Contenu": "As a premium user of 18 mos I was surprised by the ill-prepared roll out of the web app with is flawed losing almost all of the intuitive functionality of the resident applications.  I re-upped for another year, unfortunately, before experiencing the disappointing performance of the web app. Customer service/support is abysmal.  No matter how chronic or real your tech or account related problem is, you will be dealing with an automaton until some entity. in my case \"Peter\" (not sure he's real) comes back with non-answers.  After reading the glowing positive ratings I ask Trustpilot, how do you detect  Dashlane employee's and/or shills?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2017-02-02T14:53:46.000Z",
          "Titre": "Frustrating",
          "Contenu": "When I first started using Dashlane 3 years ago I loved it. I could click on the dashlane icon on the internet and it would enter my user name and password for the appropriate account. However about 6 months ago there was an upgrade and now every time I try to use it online, it will not put in my saved passwords and try to just auto fill my name and address. If I want my user name and password I have to log into the dashlane app and not use the internet dashlane link. I now use my Apple password auto save for my passwords and log into most of my accounts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Howard L",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T03:09:04.000Z",
          "Titre": "I love your program- but when you…",
          "Contenu": "I love your program- but when you upgraded and went to the new system for mac you left me out.  I have legacy software that does not allow me to upgrade.  I understand you have to keep up but should not have let us older system users hanging out to dry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "otis eliot",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T19:34:34.000Z",
          "Titre": "Dashlane needs to improve support…",
          "Contenu": "Dashlane needs to improve support team.....it is lacking big time. I've been dealing with not being able to sign in via iOS for two days now and still no resolution. Shameful. So...make sure to keep a list of passwords before saving on Dashline."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Halstead",
          "Nb_Reviews": 17,
          "Date": "2022-02-16T16:19:00.000Z",
          "Titre": "The support is no good if the programme is crap",
          "Contenu": "I have had a series of problems with Dashlane which fails to open at irregular intervals and has to be deleted and reloaded. The suport is quite good but frankly should not be neccessary."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "David S.",
          "Nb_Reviews": 2,
          "Date": "2018-10-09T20:05:09.000Z",
          "Titre": "Personally I dislike it",
          "Contenu": "We are forced to use it in our company and I only made bad experiences with it so far. -rep: The app does not work on Linux-rep: Not even the web app does work properly on Linux, passwords are arriving delayed or not at all-rep: People share passwords without a possibility do display them. This means you are forced to use and install the app to any possibly device - in my opinion this is not acceptable-rep: way to obtrusive+rep: good customer supportFrom a security point of view they might be quite secure. Though I think there are other good possibilities to store passwords safely."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mackenzie Quiros",
          "Nb_Reviews": 1,
          "Date": "2020-04-05T04:27:42.000Z",
          "Titre": "I have been a Dashlane Business user…",
          "Contenu": "I have been a Dashlane Business user with multiplle employee licenses for over 3-years. Although it takes a little getting use to, it works as intented. HOWEVER, my MAC had a system upgrade which caused me to download the Desktop version and when I did that, it asked for a new password. Well, I have a system and I DO NOT forget, especially when you write it down, Dashlane failed. Now, I cant even get anyone to reply to an email, a call or something. I have to reset all my password and NO HELP from anyone. Their ROBOTS may be sophisticated, but we need human help. Be careful with your MAC updated and don't count on their support, it does not exist."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Uncle Duke",
          "Nb_Reviews": 2,
          "Date": "2021-02-15T23:15:04.000Z",
          "Titre": "Ineffective customer communications",
          "Contenu": "My dissatisfaction with Dashlane concerns the company's incompetent communications and unhelpful support.  Was not always this way; seems to me to have changed in the last year.  Dashlane relies on the \"We're receiving lots of requests for help...back to you as soon as possible\" excuse for not providing its user's timely help.  I expect that it is true that the company is receiving a high volume of help requests - most likely because the company is creating this volume with its poor customer communications, which typically raise more questions than they answer.  Easy problem to solve, imo, but I doubt that Dashlane management will do so.  Effective communications?  What's that?"
        },
        {
          "Note": 2,
          "Lieu": "LT",
          "Pseudo": "fast_tortoise_boi",
          "Nb_Reviews": 5,
          "Date": "2021-01-26T10:08:50.000Z",
          "Titre": "Barely the thing it was before.",
          "Contenu": "Barely the thing it was before.Before 2020, Dashlane was great - easy to navigate, easy to use, overall - good. I used it for a few days, then forgot about it. Now I got tired of remembering passwords and bought Dashlane Premium. Yeah, bad choice. Not only it is absolutely terribly hard to navigate, but it is also extremely inconvenient. And I can't even submit a refund request - I try, and then get an automated email that offers me to fix problems with Dashlane Premium instead. FAQ section is terrible, usage is terrible, quite literally - everything now is barely the barebones of what Dashlane was before.Edit:Here's all support requests that I've submitted so far.138982613923101401705"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul Wakefield",
          "Nb_Reviews": 28,
          "Date": "2021-05-10T12:00:14.000Z",
          "Titre": "Stopped using due to problems.",
          "Contenu": "1. Preferred the offline App. Hate using the online web version.2. It will not except my password anymore.3. Yearly charge too expensive for a password manager.Decided to stop using due to the above."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Burnett",
          "Nb_Reviews": 2,
          "Date": "2018-02-06T05:44:17.000Z",
          "Titre": "The auto-fill and auto-sign-on on …",
          "Contenu": "The auto-fill and auto-sign-on on features are unreliable. They never work for my bank (Chase), and work intermittently for various other sites depending on whether I am on an iPhone or a (Windows-based) computer.  When auto-sign-on won’t work, the copy/paste function for my password works maybe 45% of the time. I have actually changed strong passwords generated by this app to weak ones that I can remember because I can’t count on the app. Which kind of defeats the purpose.  The overall hassle factor is (perhaps, barely) less than without this password-saving  app, but it is still unacceptably high. I am actively looking for a better app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kaz",
          "Nb_Reviews": 3,
          "Date": "2018-08-16T22:16:41.000Z",
          "Titre": "I really want to like it...but",
          "Contenu": "I really wish Dashlane worked.  I switched from RoboForm because I love the idea that if something bad happened to me, my wife could request access to my passwords.  Great feature.  It's the actual filling of passwords that sucks.  it doesn't work for about 1/3 of the sites I visit. I use FF and Chrome on a Mac.  Don't know how well the PC versions work.Just getting the list of potential passwords to popup for a site is a challenge.  About 1/3 of the time, I have to launch the Dashlane client, search for the website, then copy and paste the password.Thinking about going back to RoboForm and jsut putting my master password in my will."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Cochran",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T18:19:48.000Z",
          "Titre": "DO NOT EVER Forget your password",
          "Contenu": "DO NOT EVER Forget your password.  I have, unfortunately and basically have to figure out all my password or create new ones for 200+ accounts.  Help is only online with computer chosen suggestions."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "magn6138",
          "Nb_Reviews": 13,
          "Date": "2021-09-01T04:59:12.000Z",
          "Titre": "Very boorish custommer suport",
          "Contenu": "Very boorish custommer suport. Teaching me how to behave. The only good thing is their money-back guarantee, which I had to use. Which is the reason for the 2 stars, and not 1 star"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Simon A",
          "Nb_Reviews": 11,
          "Date": "2019-06-11T13:54:34.000Z",
          "Titre": "Vastly over rated",
          "Contenu": "I'm instinctively wary of password managers but I finally bite the bullet and decided to install one so I can access my passwords over all devices. Read review after review across multiple sites, Dashlane come highly recommended as one of the best. If this is 1 of the best I dread to think what the others are like because this is awful. I've been fighting with this damn thing for about 8 months. Yes I have browser extensions, yes everything is up to date.It's been getting worse and worse but the final straw is it now doesn't even recognize live.com to log me in to my emails. The only reason it gets 2 stars is because of the extra features but the new VPN is buggy as hell.  DON'T BUY."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 3,
          "Date": "2016-10-24T14:24:27.000Z",
          "Titre": "Doesn't work consistently.",
          "Contenu": "I have a hard time with Dashlane working when I need it.  It is slow, sits there and does nothing.  It's hard to even log back in again.  I needs more work done to it.  It also needs to be compatible with Windows 10."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Mc",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T17:55:29.000Z",
          "Titre": "System functionality and Customer Support",
          "Contenu": "After a month of researching i decided to go with Dashlane. At first set-up was a little confusing (tutorial would have helped). Where I initially had a problem is when i tried to add or edit the on-line ID or password for one on my accounts. Every time I tried the Dashlane app would close.I decided to contact Dashlane help desk (you would think there would be a link in the app but I had to go to their website.  After 20 minutes with the 1st tech support i was disconnected and not contacted (what’s the point of confirming your e-mail if they are not going to follow up).  I followed their instructions to delete and reinstall the app with the assurance the chat help would still be available - NOT.I was excited about the potential of this app and moving from a trial to Family membership.  This decision may have to wait."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Renato Sop",
          "Nb_Reviews": 64,
          "Date": "2017-09-18T15:27:04.000Z",
          "Titre": "- Annoying popups",
          "Contenu": "- Annoying popups- Can't remember when I don't want to save- After Windows login I need to login to dashlane!- Can't save password without email- duplicate billment on paypal, support doies not react"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 3,
          "Date": "2017-11-23T15:11:47.000Z",
          "Titre": "Love/Hate Relationship.  Can't Recommend.",
          "Contenu": "I love DashLane on my MacBook Air,  hate it on my Samsung Galaxy6 phone.  The phone version  is clunky, cumbersome and pretty much unusable.  Chrome is my browser of choice on both devices.  I cannot recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chess Edwards",
          "Nb_Reviews": 2,
          "Date": "2017-08-08T00:02:20.000Z",
          "Titre": "Extremely unreliable",
          "Contenu": "Extremely unreliable.  Seems to get worse with each update.  On more and more sights it simply does not work to autofill passwords.  I spend a lot of time doing workarounds and fixes for this password manager."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nick Gilbert",
          "Nb_Reviews": 32,
          "Date": "2015-07-03T08:29:50.000Z",
          "Titre": "Bugs never seems get fixed",
          "Contenu": "I think the base product is very promising and well designed, however it has a number of issues which just never seem to be fixed (even though dozens of users have written to Dashlane about the problems).  They are more focussed on adding new features than they are getting the product working and at the moment, it's almost unusable for many people due to a set of long standing bugs and problems. Dashlane are fully aware of all the issues, but their response is always the same \"we will look into this\" - but they never actually do. The product has got significantly worse since I first started using it, which is a great shame. I hope one day a change of product manager will mean a change of priorities for the developers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jorge Dickle",
          "Nb_Reviews": 1,
          "Date": "2017-04-28T15:25:28.000Z",
          "Titre": "Good product going downhill",
          "Contenu": "As a \"Premium\" user of Dashlane for a number of years I expect more than a program that works sometimes and sometimes not. For several it was mostly trouble free. I liked it so much that I purchased a multi-year Premium account. Then, sadly, Dashlane stopped performing with Safari, my mail browser with my Mac. Sure I can use Chrome or Firefox but Safari if my browser of choice, It was supposed to work with Safari and once it did. Now is it at best sporadic. For an expense program I am so disappointed that I would advise potential users to wait until ALL of the bugs are worked out. The developers have been working on the problem since February to no avail! I certainly hope that they can fix the problem before I need to jump to another password manager."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jeff",
          "Nb_Reviews": 3,
          "Date": "2021-05-10T15:59:07.000Z",
          "Titre": "Previously I'd have given 4 stars",
          "Contenu": "Previously, I used to largely appreciate and was satisfied with Dashlane, though even while being logged in, I had to mostly copy my login details and paste them where they didn't populate the fields, or did so erroneously.  It did make managing a ridiculous number of passwords easy to manage overall.The problem arises when you need support in a timely and functional fashion.  No telephone support and limited email support and a buggy chat option await you here.  I appreciate the help I did receive from the agents I had, but don't expect your being back up to business in no time!  You might see only a few responses every 24 hours.  In verifying your identity, you'll be asked to upload your passport/license.  If that process doesn't work, don't email your documents!  One of the first rule of Internet is do not email your driver's license!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JMassachusetts",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T02:50:38.000Z",
          "Titre": "Disastrous after the stopped desktop app support",
          "Contenu": "I have been using premium for years. Once they stopped supporting the desktop app and moved to web extension only, it has been a disaster. It works great like 85% of the time, but it's a password keeper! I use it so much, that means it's causing a problem of some sort at least once a day. Autofill is intrusive and tries to fill fields where it doesn't belong. It tries to autologin everywhere immediately as a default, so you miss messages on the login screen or get errors when there is a recaptcha. The iOS app is glitchy and I end up having to do everything manually. But the WORST is that it does not always save new passwords it generates! It has glitched between the time it autogenerates a new password and when it saves. It also has overwritten a one password with a different one on the same domain. None of this happened before. It's a total mess and I am getting out of this service even though I have a lot of prepaid months left."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Rodolfo Cavallari",
          "Nb_Reviews": 2,
          "Date": "2016-09-19T17:33:15.000Z",
          "Titre": "Be careful very bad support",
          "Contenu": "More than 7 days and they don't give me any answer on how to access all my passwords, because the two-factor authentication in the app is broken.I been using Dashlane for more than a year with my time and works OK to save your passwords.  I enabled two-factor authentication, and brought a U2F key and set up and saved my recovery codes, and worked correctly, one day my iPhone broke up and was unable to use the authentication codes from the app, so try to use the U2F key and the app kept asking for the codes from the app, so wanted to use the recover codes provided when setup to factor authentication, but the app don't give you any option to do so, so try to contact support and it's been 7 days, without any answer.  You can image the problem that you put all your passwords in the same place for a year, and then support don't want to help, and they don't care if you can access any of your passwords."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "TC",
          "Nb_Reviews": 4,
          "Date": "2021-03-13T08:01:22.000Z",
          "Titre": "Non Existant Suport",
          "Contenu": "I have been using Dashline as a paying customer for several years. I recently sent a support query and after several days I received a standard reply which did not answer my questions, I replied saying that they had not answered my query and a couple of days after that I got a customer satisfaction email for my closed query! Any company that thinks they can deal with customers in that way deserves to fail and unfortunately, I think Dashlane will soon be in trouble, especially now that they have decided to go for a browser-only solution which a lot of customers are unhappy about.EDIT I have noted the reply from Dashlane which us similar to most of their other replies, I am NOT going to update my report with this information as Dashlane does not seem to report back with any updates themselves. However, I am happy to confirm that I am now using an alternative product that seems as good as Dashlane and that assuming it continues to perform well I will be moving to that soon and abandoning my Dashlane subscription which still has several months to go"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Declan Griffith-Barwell",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T15:28:41.000Z",
          "Titre": "I really want to be positive..",
          "Contenu": "I really want to provide a positive review, because when Dashlane works, its fantastic. But herein lies the problem. It never works properly. I have used this on many devices, Android phones, iPhones, MacBooks & Windows PCs. Not one of these operates as it should.On Mac, the auto login or fingerprint login never works and for every device, the majority of the time it does not recognise and log you into websites. You either have to reload the page and hope it picks it up or you just end up opening the application every time, looking for your password to manually copy the password and into the website. A very temperamental offering. And there is next to no support from the support team. Each time I log an issue I am told that my issues only affect a minority so therefore its not a priority. Great. However I have used Dashlane premium for around 3 years now and not one of these issues has ever been fixed!I definitely will not be renewing and switching to an alternative, like LastPass, which has always worked as intended when I have used for business"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2015-05-22T02:23:35.000Z",
          "Titre": "Frustration",
          "Contenu": "Dash lane keeps filling numbers on new applications. It is impossible to shut it off easily when you are trying to put in new info."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr. Ralph G. Perrino",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T19:49:17.000Z",
          "Titre": "A very mixed review...",
          "Contenu": "Honestly, Mary was very pleasant and she tried to help. However, in the end, and after nearly two months of endless emails and convoluted instructions, I finally was able to resolve the problems myself. I have repeatedly said that what Dashlane lacks and is sorely in need of is telephone support, or the ability to remotely access customer computers to resolve complex problems that the average user cannot resolve. I have a string of emails that has to be in the 30-40 email range since mid-April. It had gotten so long and confusing, I could not even locate a recent email from Mary because it was buried in a barrage of lengthy emails between me, Mary, Roxanne, and I don't know who else. Again, Mary did her best, so this is no reflection on her, but I am extremely dissatisfied with the way in which Dashlane is set up to resolve technical problems. It is just unacceptable, and it is one of the main reasons that I may not renew when my subscription expires next spring. Your employees are not being provided the tools they need to resolve problems. It is simply not their fault that customer service is deficient.Dr. Ralph Perrino"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Waters",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T17:44:16.000Z",
          "Titre": "Dashlane Web Plugin App Is Just Plain Dumb",
          "Contenu": "I loved the Windows App for Dashlane. I could update everything offline when I am flying all over the world, and do it all offline with the Windows App. When I land I can sync and then I am done. But this always-on and connected world we live in is crazy and very hackable. My other complaint with Dashane is they are now heavily dependent on third-party browser developers and their security policies, preferences, and updates. In recent times both Firefox and Chrome made major changes to their APIs that invalidated lots of plugins. Allowing my browser to be part password facilitator and password controlling operator for my passwords makes me feel less safe, there is always a browser backdoor despite the robust security claims Dashlane makes. But with the Dashlane Windows app, which is dead now, you can choose not to integrate Dashlane with your browser for the most ultimate security. Using Dashlane in standalone mode, with an occasional sync is the best way to go.  I am going to 1PASSWORD now at 1password.com just because they have an offline Windows app and web plugin. Getting rid of the Dashlane Windows app is just plain dumb and has killed a once-great program."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Marc Elle",
          "Nb_Reviews": 2,
          "Date": "2019-09-13T00:25:14.000Z",
          "Titre": "Thank you for your reply",
          "Contenu": "Thank you for your reply. i would indeed love to contact your Help centre if you could give me an email address."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JFarietta",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T19:25:14.000Z",
          "Titre": "Did not work consistently across all of my devices.  Failed on Android device.",
          "Contenu": "I'd have to say that if a great amount of my business was not handled through my smartphone, Dashlane would have been a perfect product for me.  Unfortunately, I paid for a year of premium service to have the convenience of having all of my data synced across platforms,  but it constantly failed to work on my android device. At the end of the day what should be a seamless password population process. It would turn into a long troubleshooting session to try and get the mobile app to work.  Ultimately, I had to default to manually log in to the web application to extract the passwords.  Not too much of a convenience anymore... I tried to engage with customer service, who sadly demonstrated that they did not read the case notes.  When I referenced my case number they would engage into a painful process of having me explain to them (in a text chat since there is no phone customer service) everything that was already explained in detail on the notes of the ticket.  Solutions were band aids that always failed and my mobile app never worked consistently. To this day, an L3 still has a ticket open and unresolved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danthemanp",
          "Nb_Reviews": 1,
          "Date": "2016-10-05T03:27:16.000Z",
          "Titre": "I use firefox and haven't been able to use dashlane for 2 months now.",
          "Contenu": "When I can get it to work it's great but I'm unable to use it on firefox as it won't show up."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bill Young",
          "Nb_Reviews": 5,
          "Date": "2020-01-26T18:51:12.000Z",
          "Titre": "I have been locked and I am sure I have…",
          "Contenu": "I have been locked and I am sure I have used the correct password and the back up is dreadful."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "D.B.",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T09:12:24.000Z",
          "Titre": "Poor security, TOO easy to use",
          "Contenu": "Dashlane Chrome extension logs in to sites too easilly without you even noticing or requiring to type your master password! After importing 600+ passwords from CSV-file, the option \"require master password for this site\" is turned off by default and there is no way to turn it on by default for all passwords at once, zo you'll  have to do this for each stored password individually. The Chrome extension doesn't lock after a timeout, so once you're logged on, any site you visit will be automagically logged on to. So if you leave your browser unattended for a short or even a long time, all your accounts are exposed. Even in the premium version, I can't find any way to change 2-factor authentication to anything other than a code sent to your e-mail at every new logon to Dashlane. Google authenticator, Authy, nor verification via text message are not supported. Passwordt can't be grouped into categories, it's just one long list of passwords.Secure notes can be opened without typing your master password, so they're not secure at all.There is no option to add an emergency contact to access your account. PRO's:Importing passwords from CSV went pretty much flawless. Dashlane's VPN on mobile seems to work fine, so Dashlane is cheaper than Lastpass+NordVPN combined, but more expensive than just LastPass. VPN won't work on Chrome OS though."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Barry Macklin",
          "Nb_Reviews": 1,
          "Date": "2016-08-25T17:41:33.000Z",
          "Titre": "not working today",
          "Contenu": "Dashlane not working today,have to type passwords in,has done this every so often lately"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Howard",
          "Nb_Reviews": 2,
          "Date": "2020-09-07T15:16:15.000Z",
          "Titre": "I just started using Dashlane",
          "Contenu": "I just started using Dashlane. Initially I liked it so I signed up for premium. This was before I had a chance to interface with customer support. I was very surprised to find out there was no chat or telephone contact available. Only email. I had a \"minor problem\" regarding a feature missing in Apple's ios. I emailed them and kept getting canned responses. Finally someone answered and said they were aware of the problem and the feature was deliberately missing and they were working on a fix. The next day a different agent emailed me with an entirely opposite answer. Referred me to a web site which explained how to do it. Unfortunately I had already seen that site and that was what made me aware that the feature Reset Master Password on the Ios app was missing. Two response two answers no solution. The problem was not that serious to me but it did give me a taste of their service. I am well within the 30 day cancellation window and emailed them to cancel my account and refund my money. I notice that there agents frequent this board. I have not gotten a response yet and would like to ask the agent how do I find out when these actions will take place. Especially the refund.I am updating this review. I received an excellent response from Helena which has now satisfied me. With regards to the ticket number It is #1296144. Please disregard it as I no longer wish to cancel my subscription."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Roderic Barrett",
          "Nb_Reviews": 11,
          "Date": "2020-10-08T06:25:03.000Z",
          "Titre": "Forgot master password- support non existent",
          "Contenu": "Absolutely bloody useless support. The whole point of my issue was that I’d forgotten the master password for the account and therefore couldn’t log in, so then I’d set up another account and wanted my premium subscription transferring across to my new account. This was done after emailing them identification. I then needed my passwords that I had saved on the account and asked for them to be transferred across. I end up getting an email from IT support asking me to log into the old account with my master password and disable 2factor authentication- the whole point of this exercise was that I’d forgotten my master password on the old account and I just wanted the passwords sent to me. IT support obviously do not read the previous conversations with customer services!Because Dashlane customer services has been so shockingly poor and the application itself still has bugs I’ve resorted to the old fashioned method of writing my passwords in a notebook and keeping that under lock and key.I won’t be renewing my subscription with them and I will not be recommending them to family or friends, however I have informed them that I will be writing an honest review about Dashlane on Trustpilot especially the poor customer service the experience and lack of IT support who fail to acknowledge the original source of the queryUpdate: Since posting this review, I have now received a full refund outside the 30 days redemption policy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mgrossberg (I'm not hiding behind \"anonymous.\")",
          "Nb_Reviews": 1,
          "Date": "2019-02-09T20:26:50.000Z",
          "Titre": "Terrible customer service (with a positive update)",
          "Contenu": "About a week ago, I did a Windows Update on my computer. Since then, I have lost the ability to use Dashlane. I have contacted Dashlane customer service 3 times since, the first of which caused me to lose all of my Dashlane saved passwords, and still have no service. I have been promised contact with \"Level 2 support,\" and told this would be labeled \"Urgent,\" but I think this is just a blow-off. I couldn't be told how soon I would have contact, just that \"Lever 2\" would send me an email which, several days later, still hasn't happened. Some urgency! Dashlane worked great up until this happened, which is the only reason I'm still waiting, but not much longer. There has to be some other comparable service out there.UPDATE (a few days later):A day or two after posting the critical review above, I received emails from a couple of people at Dashlane customer service. I don't know if it was just my point in the queue, or the criticism caused someone to notice my issues, but regardless, I was promised that my service request would finally be considered by Level 2 support. After a couple more days and a few emails back and forth, my problems with Dashlane were solved.I want to thank those people at Dashlane who worked out the bugs in the system and returned by password vault complete and in working condition.As of now, I am back to being a satisfied Dashlane customer."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Seadog",
          "Nb_Reviews": 25,
          "Date": "2019-08-27T09:58:27.000Z",
          "Titre": "Deteriorating software:   > 60% unreliable",
          "Contenu": "Have had Dashlane (for Mac), Premium (paid), for some years. It has never been great but now is deteriorating quite rapidly. The main – and worsening – problem with the system is its instability and unreliability in auto-filling login page fields. This feature was one of the main reasons I purchased Dashlane. I estimate that on average to begin with, and until about 6-9 months ago, auto-filling fields was performed successfully in about 70% of instances. That rate has now fallen to less than 40% and now I pretty much expect auto-filling will NOT be performed at any attempt to access my sites.The DL support group are quick to help, offering trouble-shooting advice, but that cannot win against software which is defective. I get fed up with having to do support-troubleshooting every few weeks and am getting increasingly annoyed at the inability of Dashlane to perform properly – or, actually, perform at all – in auto-filling access details at login pages.A second niggle is that despite promises a long time ago that two-factor logins would be offered through the Dashlane system, it still is not possible as far as I can tell to get Dashlane to log in to my banks and other high security sites which have two-factor access systems.I am now investigating alternative Password/login systems, despite having a long period remaining on my Dashlane premium subscription.Message to Dashlane:  I'm not interested in bells and whistles when the basic, crucial parts of the software don't work properly. Stop adding unnecessary gizmos and focus on the basics."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2021-07-20T09:42:20.000Z",
          "Titre": "I dont like the new version were you…",
          "Contenu": "I dont like the new version were you cant download it"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Gary5779",
          "Nb_Reviews": 56,
          "Date": "2018-09-07T12:30:03.000Z",
          "Titre": "I have been using Dashlane for 6 months…",
          "Contenu": "I have been using Dashlane for 6 months now and I am not impressed.  Firstly, the only option given to subscribe for a year and not monthly is indefensible and is purely to tie customers in.Secondly, after 6 months of trying everything I can think of, and with largely useless help from Dashlane support, the Android app on my mobile simply does not work.  Not once in 6 months has it either populated any login field or taken me to the relevant password when I tap the Dashlane logo that appears next to a login field.  Not once. Ever.  I have to login in Dashlane using the Master Password every single time, even within a few minutes, look up the password, and copy and paste it.Thirdly, although Dashlane works on my laptop using Windows 10, it only works some of the time.  Often it does not recognise a website, ebay for instance seems to fool it for some reason, email browser is another.  I then have to copy and paste the login details, then Dashlane asks if I want to save the details, it does and I get a duplicate entry.  Same thing next time I log in.Also there are really annoying missing features.  No facility to 'click and copy' anything other than the password is one.  Bank sites often ask for a customer number, etc, with no Dashlane field to enter this other than in 'notes' which has no option to copy.  Another, the 'secondary login' field has never worked for me.And I have paid £70 a year for this.  Clearly Dashlane know that if they offered a month subscription users would cancel.I have now installed LastPass on my mobile which works every time without issue.  As soon as my annual subscription is up I am jumping ship."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "thenekkidtruth",
          "Nb_Reviews": 4,
          "Date": "2020-01-10T14:20:04.000Z",
          "Titre": "I Terminated the Session Early",
          "Contenu": "First, let me state that I've managed technical helpdesks for over twenty years, so I know what I'm talking about. Also know that the issue still exists - there was no change in status which resulted from this chat session.Communication skills: Low. More accurate to say very low. Descriptions were imprecise - often (exclusively?) limited to \"it\". I was left wondering what \"it\" was with almost every sentence. And those sentences seldom made grammatical sense, although they were full of technical jargon. Having worked for Microsoft and Intel, among several other Fortune 100s, and having taught adult-level technical classes as a trained educator, I can tell you that even this tech's jargon was misapplied. This led me to wonder if this tech knew what he was talking about at a technical level. Desire to fix the problem: Low. I wasn't guided through a single activity step, even though I asked for such. Any sort of interrogation with regards to the nature of what I was experiencing was not once performed. It felt like this tech just wanted to meander through this session with no desire to attain any real results, and it felt like I was being talked at, rather than being co-engaged in any useful exploratory process. Incomprehensible jargon-strewn word salad finally led me to draw the session to a premature close.Baiting the ref: In the tens of thousands of technical calls I've personally handled throughout my career, I never once asked for a good review, nor did I ever have to. That sort of thing never leaves me with a good feeling - fortunately, I seldom see it occur.Lastly, this was my second attempt to find an answer to this situation. The first attempt, some months ago, also ended in a patently unsatisfying dead end."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WPK",
          "Nb_Reviews": 3,
          "Date": "2020-04-03T19:35:57.000Z",
          "Titre": "Exasperated!!",
          "Contenu": "I actually like the product and the concept.  I find the help function, compatibility with IOS and ease of understanding how to get things done exasperating.  For example, I received a notice from Intralinks that I needed to change my password.  I set it months ago with Dashlane (after much exasperation!) and now cannot figure out how to get the “password changer” to work and change my password.  Is it even possible to do so with IOS?   Of course there are no customer service people to call for help so I will now wander around until I find a fix or simply not use Dashlane for this website.  I like the concept of a VPN but have yet to figure out “how” to turn it on and determine if it is working.  Does it stay on all the time?  If not, how should I use it? How do I know if it is on? My wife has also signed up for Dashlane.  I am pretty sure we do not need to both sign up but cannot figure out how to discontinue her account and make certain we are not losing anything.  I am a Premium member.  Between the two of us we probably have only been able to use Dashlane to protect 10-15 passwords.  Again, no one to call.  I have used the chat function and the people are helpful but it is difficult to explain problems and get useful answers.  To be honest, I have spent many hours trying to make Dashlane work for me and will probably invest more time but I wish I had never started this project.4/3/20. Dashlane followed up my initial review, told me the site where I wanted to change passwords was not supported and that I would have to go on the site, change the password myself, go to Dashlane, type in the new password and then save it.  As I initially said, this entire exercise was exasperating!  Although the tech personnel who correspond with me via their “online only, written, help desk” always seem cordial, Dashlane over promises and under delivers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Whitey",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T18:01:01.000Z",
          "Titre": "Canned answers",
          "Contenu": "Canned answers. No individual attention."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Mateusz Bronk",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T11:18:05.000Z",
          "Titre": "Good feature set and security, POOR quality on desktop",
          "Contenu": "Feature-wise, it is a proper password manager with rich feature set and what seems to be a sound threat model with modern cryptography. Works very well on mobile.However - the desktop (Windows) version is just BAD. It is *horribly slow* and hangs often (in my case, I have to kill it from taskman circa every 5 days - sometimes multiple times during a single session). On my non-SGX-enabled PC this is somewhat better, but still painful. Even on a pretty powerful PC with 32gigs of RAM, this is still very noticeable. Not to mention the penalty the web extension incurs on the web browser...This is NOT what I would expect from a paid, professional product, especially since the desktop app performance is something easy to optimize one would think... After spending over 2 years with Dashlane and hoping that a new version will improve, I am slowly giving up – It starts to look as if only a full app rewrite could help here (again – mobile version is pretty decent) :(---Extra features I am missing:- Ability to adapt rules/tag 'missing' fields as sth to be filled (e.g. credit card input routinely fails to recognize expiry date or CVV)- A handy \"dismiss autofill\" option next to autofill, so that if one wants the form gone - they do not need to cxl it each time they navigate between fields- Localization (or at least full country list). It is ridiculous, that each time I enter a bank account, I need to go back and edit the country to 'Poland' (global preferences do not acknowledge its existence)- Ability to use multiple domains/URLs for a single password entry (or to link them together). Currently, for the autofill to work, I need to have 2 entries for: amazon.com and amazon.de, for example... though they're using a *single* Amazon account. Password health dashboard recognizes this as password reuse... which makes it impractical (I have about 30 accounts like this, so I need to manually check what is legitimate reuse and what is not)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Pennington",
          "Nb_Reviews": 1,
          "Date": "2017-01-01T07:33:15.000Z",
          "Titre": "Don't understand"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "SSP",
          "Nb_Reviews": 33,
          "Date": "2021-03-11T14:12:20.000Z",
          "Titre": "It was good... until Dashlane stopped innovating",
          "Contenu": "Today on 11th Mar 2021, I switched from Dashlane to 1Password after my 3-year contract with Dashlane expired. I managed to get a $99 USD / 3Y deal in Sep 2017 and also managed to get several months added on for free by Dashlane when I recommended it to a friend and he signed up too.I started to look for a Password Manager back in 2017 because managing so many passwords in an Excel spreadsheet, which sat inside a TrueCrypt container, which sat in my Dropbox, just became too much! So the switch over was a massive relief. However, since 2020 onwards, Dashlane became more and more frustrating to use because it seemed as if the company stopped innovating. The tool didn’t keep up with how websites have evolved, which in turns affects it’s performance in day to day use. I will give a few examples.1. Password Browser Extension[Speed] - The extension became too slow and didn’t work around 30% of the time (my estimation as I don’t have the data). This was one of the most maddening things because if the Dashlane suggestions don’t appear quickly enough, you have to manually go to the app and copy and paste them both. This is the same as using a spreadsheet or free local password manager! [Multiple IDs] - Another problem was that I have multiple IDs for some websites for business and personal use. These would also cause problems in appearing quickly which was very frustrating.2. Synchronization Speed between App, Extension and iOS AppWhen updating or changing a username or password in the Dashlane Desktop App, the web extension would not instantly sync about 70% of the time. It was weird because you know the sync has worked when the indicator spins around, but the only way it seems to appear in the password suggestion box in the browser was if you either log out and log back into the extension, or if you wait for a few hours the extension somehow starts to work. I could never figure out why this happened because I have never lost any data after hitting the sync button in this scenario. However, autosync never guaranteed that the data would instantly be updated in the extension either. Once again, this drove me crazy as each month of my contract went by. (My contract started to feel like Shawshank Redemption, just waiting for the day I could escape). 3. No Tags or FoldersAs I signed up for more software and services over the years, Dashlane’s ‘Categories’ for managing passwords became next to useless. You could never see a nice list of the categories on the left hand side of the App. Towards the end, I never bothered to use the categories function because it was useless. On top of that, as my parents are getting older, some kind of folder or tag functionality became critical because their email and other accounts got bundled in with mine too. 1Password has taken a much better approach by providing not only Tags, but also different Vaults as well, so you can keep Work, Parents, Personal data separate, as a few examples. 4. VPN was uselessOne of the features which was touted by Dashlane back in 2017 when I signed up was the integrated VPN. However, on the few occasions I tried to use it when I was overseas, it was too slow and you also cannot decide the location of the VPN. The location of the VPN is one of the most important features so that you can use services that are geo-blocked. [The Positive part of my experience]Wherever there is bad, there is also good, so here are the list of things that I liked about Dashlane in the 3 years I have been a customer:- Dashlane NEVER lost any data. That is absolutely fundamental with any piece of software that is looking after the crown jewels of your data. They have also not had any security incidents that I am aware of. Even though their sync is slow and terrible, I always knew that if I entered data into one of the apps and manually hit sync, it would show up eventually on all my devices, even if it took an hour or two. - Being able to select the colours of my payment cards stored in the app was fantastic as I am a very visual person. Dashlane also automatically selects the colour of your passport which is also fantastic as I am a dual citizen and need to get the right passport details quickly when I am booking travel. - The overall UI design for the desktop and iOS apps were nice. (The extension is terrible though).[Summary]In 2021, I would not recommend choosing Dashlane because it has seen zero innovation over the past few years. There are better solutions like 1Password on the market. Dashlane was good when it launched, but I would not recommend it today."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "OLDBMWGUY",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T20:47:13.000Z",
          "Titre": "Good, but lacking lately",
          "Contenu": "Was absolutely terrific several years back but has gone downhill lately.  The constant reminder about quality of your Master Password is annoying.  Does not work reliably with my iPhone browsers about 50 % of the time. And the current failure of the ability to organize your list of passwords by \"last used\" indicates a lack of testing for upgrades.  Help desk is fairly responsive."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "soozshaw.ca",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T02:22:39.000Z",
          "Titre": "I do not like that Dashlane keeps…",
          "Contenu": "I do not like that Dashlane keeps asking me to change my password and I just changed it. I am the only one using this computer, it does not need to be changed as often as you want me to change it. I do not like that the autofill for certain online credit card transactions gets in the way when I am using a different credit card. I do not like that every single time I have to restart or reboot my computer, Dashlane asks me the same questions about the browser extension, which I already have, opening an account, which I already have, and getting a new version of Dashlane, which I already have. Stop already!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ian barlow",
          "Nb_Reviews": 9,
          "Date": "2023-11-21T19:08:05.000Z",
          "Titre": "Response to messaged query was slow",
          "Contenu": "Response to messaged query was slow. I had already found the answer to my query before receiving customer services response. The information regarding details of my plan were not easily findable, and I would expect to be able to find details such as name of plan,premium, cover,renewal date without much effort."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T05:06:11.000Z",
          "Titre": "Customer Support - Lacking",
          "Contenu": "The biggest issue with this service is customer support.  Live chat works only for basics and there is no phone support. I've had the service for three years and at every renewal, there is a problem (likely because the emails you receive don't directly align to your plan). For a service handling your most private/secure information, you would expect better."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T10:50:34.000Z",
          "Titre": "Customer service way too slow",
          "Contenu": "My phone was stolen and I lost access to my Dashlane account because I activated 2FA and the authentication app was on the stolen phone. It took 2 weeks to recover my account. I like the fact that you guys take security seriously but customer service reaction time is way too slow. For something as important as the password manager, 2 weeks is not acceptable. By the end of 2 weeks, I have just about manually changed most of the passwords that I need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "wthinesbellsouth.net",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:46:57.000Z",
          "Titre": "Typic",
          "Contenu": "Typically, I find much of the support to be what I call “Poke and Hope” as some of the representatives just provide a link that “explains” the process. What I have learned through over fifty years of education work, not ALL people absorb and/or retain written direction when they initially do not have the depth of knowledge, skill and ability to do the process. I readily accept and admit to being well within that group. The support staff needs to recognize that the user needs to DEMONSTRATE the ability to follow the directions rather than simply thinking they do know how to perform the tasks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dv",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T21:25:30.000Z",
          "Titre": "Lack of phone support; Safari issues",
          "Contenu": "Biggest problem for me is customer support...only available via email.  Lack of phone support is really an issue as problems aren't fixed quickly.Also be aware that Safari browser is not as well supported as other browsers.  I've been told by Dashlane support that autofill functionality on Safari will not be supported to extent that it is on other browsers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jgallovichcuefinancial.com",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:51:14.000Z",
          "Titre": "I was able to finally able to resolve…",
          "Contenu": "I was able to finally able to resolve my issues. However, it could likely have been done with a 5 minute phone call as opposed to multiple days of back and forth via email.  That was super frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "psdwyernyc.rr.com",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T09:55:28.000Z",
          "Titre": "I didn’t like all the obstacles you impose to getting effective customer service",
          "Contenu": "I didn’t like that I couldn’t find what I needed in your support section and that, when I engaged your AI chat bot, it kept referring me back to the information I just read that wasn’t responsive to my situation! When I finally connected with a real person, it required several back and forth emails before they understood what my problem was and were able to provide meaningful guidance. It took way too much time and effort to get a simple issue addressed!"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Manuel Rasinger",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T11:04:51.000Z",
          "Titre": "Good Password Manager with its deficits",
          "Contenu": "+ Good Password Manager+ Support is very responsive and helpful- had many issues with the payment to extend the family abonement. First was not working at all, than we accidently bought new premium abonements. However they have been refunded.- Dashlane become pretty eypensive. We consider to move after the abonement expires."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nickie",
          "Nb_Reviews": 6,
          "Date": "2023-08-10T21:59:18.000Z",
          "Titre": "I like the app and find it very useful however……",
          "Contenu": "I like the app and find it very useful. However, I am not as technical as some of the language used when searching help topics. Developers need to understand that users have an extremely broad range of experience and need to explain terminology better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T23:11:35.000Z",
          "Titre": "Customer Service > The Actual Product...",
          "Contenu": "While Mike in customer service did a good job following up, this issue shouldn't have reached that point in the first place.  Like other sites/software, Dashlane should enable you to download and store back-up codes in the event you forget your MPW.  That would save everyone a ton of time."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Miguel Angel Sanz",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:13:58.000Z",
          "Titre": "Technical support to fix an important issue",
          "Contenu": "The macOS application has been working so good until a couple of weeks ago. Now it crashes before starting, so I can't use it to store and use the credentials saved in the web. The solution provided was to upgrade the OS, which it's not possible anymore. So, I'm waiting for a suitable solution to continue using the application. I hope technical support can help me to keep on using this app"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "plaistowegmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T12:26:03.000Z",
          "Titre": "Extremely helpful",
          "Contenu": "Extremely helpful. But on follow up got the impression he was under pressure, I understood I was being advised to do what he initially had said not to do. Anyway all seems ok now..Inital help quick and excellent. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Walter Merkle",
          "Nb_Reviews": 3,
          "Date": "2023-06-22T16:13:28.000Z",
          "Titre": "For a customer to come it is essential",
          "Contenu": "For a customer to come it is essential, to know ALL standard programs to work smoothly together with your product. I've got the answer, but only after insisting for it. That's not the ideal way. And important: a customer is NOT automatically an IT expert, thus it is not sufficient to answer with \"termini technici\", but with daily used words. Therefore a living human beeing is far better in understanding and service than a dummy AI which is NOT intelligent, but just reproductive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "abedev",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T15:41:26.000Z",
          "Titre": "Email support is slow in a pinch",
          "Contenu": "We use Dashlane business and heavily rely on it to be there when we need passwords.  I logged in yesterday and the password for our ERP server was gone on Chrome and my iOS device.  Luckily I tried Edge and it was there, so probably a caching issue.  I'm glad id did not have to wait on support because the server I was trying to get into was down!Anyhow, this experience is making me second guess a few things about Dashlane.  1. Email support is slow in a pinch.  2.Have you considered snapshots so we could go back in case something like this happens.Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "f.g.roskamgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T19:16:17.000Z",
          "Titre": "Average support",
          "Contenu": "It looks like, like other Support Desks, that they expect from you having plenty of time for figuring out all the details yourself. You raise a question but get a link to an articles as “solution”.In my case, it wasn’t."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:13:59.000Z",
          "Titre": "This product is a bit expensive",
          "Contenu": "This product is a bit expensive.  They do not offer Military discounts or any discounts. Some of the documents on file do not autofill."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Andrew Wood",
          "Nb_Reviews": 7,
          "Date": "2023-02-28T11:17:17.000Z",
          "Titre": "Hits and miss - the vendor needs to listen",
          "Contenu": "Pro's- problem was solved- professional and calmCon's- Support by email/chat only goes so far, and is extremely time intensive for the customer and the vendor. Vendor support process should flip to phone/zoom support much earlier without needing the customer to push- I have a high IQ, but the use of two apps (dashlane and authenticator) and confusing authenticator onboarding is unnecessary and confusing"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Travis",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T00:50:56.000Z",
          "Titre": "I was unable to access my account for…",
          "Contenu": "I was unable to access my account for 2.5 days. I had multiple attempts at contacting support staff with no response other than an auto-generated email. The troubleshooting links were not useful."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "streamsfellowshipoutlook.com",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T15:16:49.000Z",
          "Titre": "I thought there was rather a long delay…",
          "Contenu": "I thought there was rather a long delay in response and 24 hours later it seemed to have resolved, so I can't say I got assistance really.  Perhaps it is the time difference between countries and the fact that it was on Friday."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T18:18:22.000Z",
          "Titre": "Misgivings",
          "Contenu": "Will disappear from the computer after logging onCannot talk with cust. serv directlyCumbersome at times"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "katiesweeneybride.com",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T18:38:48.000Z",
          "Titre": "Autofill issue",
          "Contenu": "The person that helped me (Jorge) was polite and truly tried to be helpful. However, none of the suggestions fixed the issue of my Autofill working and then not working on certain sites."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Gert",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T08:42:33.000Z",
          "Titre": "Support from DL is not at the right level nor 24/7 :(",
          "Contenu": "We use DL for our company and when it works it works fine, but when encountering issues we are not happy! they dont have a \"follow the sun\" support desk so in the EU you get only response after 15:00. then they give you a single option  for try (why not all the relevant options  at once?) and don't take the effort to ask what has been tried so far.   if current issues dont get solved soon we have to switch AND start a claim for the damage caused...On req of DL: #2010007"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Bradley Marchant",
          "Nb_Reviews": 9,
          "Date": "2023-07-27T04:00:44.000Z",
          "Titre": "Poor knowledge of first line Customer Support",
          "Contenu": "I raised a simple question about a dark web alert and got a timely response from Dashlane Customer Support. The support person seemed to struggle with answering my question and, after 6 email rounds, I requested to speak to a supervisor who immediately provided a clear response to my question."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jandmpacbell.net",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T21:04:13.000Z",
          "Titre": "DASHLANE OkayOn many websites it fills in…",
          "Contenu": "On many websites it fills in immediately, but there webs that it won’t save the PWAlso if you are working on a desk top there is no fast way to retrieve a PW. You’ll need to open a browser to go to your PWs or Payment inforj"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marvin Kirchner",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T00:03:33.000Z",
          "Titre": "I have trouble signing in to some…",
          "Contenu": "I have trouble signing in to some things when dashlane gets involved and makes it difficult for me to insert information.  I would prefer to ask for this to happen rather than what is happening."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "patti.gabelmangmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T02:33:20.000Z",
          "Titre": "It was very difficult to get my…",
          "Contenu": "It was very difficult to get my husband's Dashlane account off my computer.  I have a Mac and it was almost impossible to use Safari ~ Finally got the app to work on Firefox."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tarek",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T17:36:56.000Z",
          "Titre": "Support is slow to respond and the program is glitchy",
          "Contenu": "The program always has something not working quite right and it takes a few days to get to the bottom of it with support. Looking for alternatives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T20:52:04.000Z",
          "Titre": "Trial of service",
          "Contenu": "Customer service was very courteous, professional, helpful and relatively timely (within 1-2 day response times).  Product user experience was not as intuitive as I had hoped.  Frustrating to find features, controls and settings necessary to have the service meet my firm's needs.  Self help online often didn't quite synch or match with the current product / service which led to dead ends in self service problem solving which was frustrating and time consuming.  Maintaining synchronization there could save customers quite a bit of time and drive down Dashlane's support costs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T14:00:25.000Z",
          "Titre": "I am generally very pleased with…",
          "Contenu": "I am generally very pleased with Dashlane.  However, your lack of human customer support is shameful.  I’m having issues that I cannot resolve without technical support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Schimoler",
          "Nb_Reviews": 11,
          "Date": "2023-03-22T16:24:59.000Z",
          "Titre": "Multiple tries to get fixed.",
          "Contenu": "It took multiple tries to get the solution.  Initially my problem was misdiagnosed by a BOT. It took a human to understand the real issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheldon Holson",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T19:56:34.000Z",
          "Titre": "Had problems turning off self…",
          "Contenu": "Had problems turning off self generating passwords."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T10:45:58.000Z",
          "Titre": "Good support only after a layer of…",
          "Contenu": "Good support only after a layer of automatic replies that were not helpful."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 7,
          "Date": "2023-09-19T09:00:19.000Z",
          "Titre": "Dashlane has gone slow",
          "Contenu": "The iPad Dashlane app has become very slow to load and react. Has there been an update?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bill.dillonmedicalsolutions.co",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T13:51:15.000Z",
          "Titre": "I would prefer phone support that is…",
          "Contenu": "I would prefer phone support that is immediate. Email support takes way too much time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cindyholidaytour-travel.com",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T19:58:52.000Z",
          "Titre": "Help",
          "Contenu": "I am  travel agent. I don't understand computers. I wanted someone to walk me through it. That didn't happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr.Sheldon Strominger",
          "Nb_Reviews": 5,
          "Date": "2023-04-07T17:46:10.000Z",
          "Titre": "No phone contact number with easy…",
          "Contenu": "No phone contact number with easy access to a live person."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Evans",
          "Nb_Reviews": 3,
          "Date": "2023-06-18T15:46:08.000Z",
          "Titre": "There is NO excuse for the poor…",
          "Contenu": "There is NO excuse for the poor performance on Safari!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "George Brown",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T03:17:52.000Z",
          "Titre": "Unhelpful links.",
          "Contenu": "As I have the programme installed, an links you give only opens the Vault's Web App"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Ronald Urlus",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T17:58:46.000Z",
          "Titre": "Dashlane requested me to open a…",
          "Contenu": "Dashlane requested me to open a secondary payment method. This brought me problems, because I was not allowed by Dashlane to use my standard login.Please make it more clear! I had cost me now days to resolve."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "MJ, Aerdenhout",
          "Nb_Reviews": 15,
          "Date": "2023-05-18T19:21:57.000Z",
          "Titre": "The helpdesk did a great job",
          "Contenu": "The helpdesk did a great job, but I had difficulty transferring my existing self invented passwords to Dashlane, probably my lack of computer litteracy🙃"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "guyvanclevesbcglobal.net",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T22:49:02.000Z",
          "Titre": "Getting live help is difficult",
          "Contenu": "Once I spoke with a live tech, problem was Fairly easily solved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert C Warren",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T05:01:12.000Z",
          "Titre": "I really liked Dashlane when the…",
          "Contenu": "I really liked Dashlane when the database was on local computers. I see some benefits that is current but I have mixed feelings about that. I liked the password generator that came with the original Dashlane program."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Simbo",
          "Nb_Reviews": 49,
          "Date": "2023-10-20T19:42:15.000Z",
          "Titre": "Poor memory",
          "Contenu": "Good place to store the words but support is poor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T23:58:25.000Z",
          "Titre": "There is plenty of room for error",
          "Contenu": "There is plenty of room for error. Don’t ask me now. I don’t like surveys"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "melvin glazer",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T00:08:25.000Z",
          "Titre": "Li was very helpful on chat and really…",
          "Contenu": "Li was very helpful on chat and really tried to solve the problems.The main problem with some ot the suggestions is tha I do not know enught to do some of the actions that may help solve the problems. If I have pc problem then I call my source and he takes over my PC and solves or removes the problems. this is easy and requires little input from ME."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry C",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T23:23:37.000Z",
          "Titre": "Good, but could and should be better",
          "Contenu": "In general, I like Dashlane for its features and security reviews.  What I don't like is the reliability of the mobile applications for Iphone and Ipad.  I have experienced three separate issues over the course of the five years I have been using Dashlane, to include the last several years as a Premium customer.  When I report the issue, I am usually treated like someone who has absolutely no technical knowledge or savvy, and in the most recent case, was told my problem could not be duplicated by Dashlane technical reps until my issue was elevated, which is when I received an apologetic email.  I also don't like that I cannot speak to a human being when I am paying $60 a year.  I have spend WAY too much time trading emails and taking screen shots and having my questions and comments misinterpreted when I could be discussing this with someone on the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Isamu",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T19:10:03.000Z",
          "Titre": "GO BACK TO OLD FOMAT",
          "Contenu": "I am very disappointed andd at times frustrated with your new \"roll-out:.  Maybe because of the many years I have used the old format.  Two things that immediately come to mind, no alphabet index to search for passwords. No password generator if there is it is very well hidden.  Have trouble logging in at times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn Magill",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T17:18:41.000Z",
          "Titre": "Cannot enter new categories in web app",
          "Contenu": "I generally like Dashlane but I'm only giving three stars because they eliminated the desktop app without having the ability to add or edit categories in the web app. They also can't provide a date when this will be available, so the web app is less functional than the old desktop app, which worked great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GW",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T18:19:27.000Z",
          "Titre": "The support specialist was helpful once…",
          "Contenu": "The support specialist was helpful once I could get to her. It is irritating that it requires an email and waiting a day to speak to a person because the automated solutions are never helpful, and searching through FAQs never turns over the exact problem that I’m facing. It’s just a needless delay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T15:47:11.000Z",
          "Titre": "Displeased with upgrade to Premium",
          "Contenu": "After several years of using Dashlane Free and being happy with it, I upgraded to Dashlane Premium, primarily to get the included VPN.  I am not at all impressed with the Hotspot Shield VPN.  It is very limited in the time it can be used each day.  It wants me to upgrade and pay the Hotspot company for the upgrade!!  What kind of a scheme is this?  Is Dashlane TRYING to displease their customers who upgrade?  Why do you insult your customers with a third-party VPN that can be used only an hour or two each day?"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Mitchell van Honk",
          "Nb_Reviews": 2,
          "Date": "2021-09-26T22:44:15.000Z",
          "Titre": "The business app works great. The management portal needs a better overview.",
          "Contenu": "The business app works great. The management portal needs a better overview.Made a ticket for the support desk to provide feedback on the use of the management portal. Finding invoices and settings is harder for the app keeps sending you to the wrong admin portal. But the support desk just send standard answers with explanation. A shame to see that the app works great but the support doesnt take time to read your complaint/question."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Baker",
          "Nb_Reviews": 2,
          "Date": "2021-06-18T13:40:07.000Z",
          "Titre": "Opinion: nStill have problems getting dashlane to",
          "Contenu": "Still have problems getting dashlane to come up when in a site when I need to change or create a new password. Some sites it will not come up at all. Apo still has growing pains. When it works it the best thing since sliced bread. Problem is it still doesn't do as it should more than half the time. Discouraging because I love the app. Have used others but like this one the most."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T01:13:29.000Z",
          "Titre": "And if the internet goes down...?",
          "Contenu": "Recent updates seem designed to make things easier for Dashlane than the end user. Like no more desktop app - but what happens to my notes if the Internet goes down? But this seems to be a trend, and all PW managers are migrating to cloud only for desktop. Lower dev costs, I guess.App is working correctly, after an update done since my original review. Dashlane is great about keeping their product up to date!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2021-06-21T13:07:57.000Z",
          "Titre": "Perfect for iOS but not so much on the Mac",
          "Contenu": "I think everything is fine on iOS but on the Mac, for safari at least the browser plug-in is quite buggy so think removing the desktop app is unfortunately going to make me need to reconsider using Dashlane. I’ll see how it goes as I’ve said everything else seems perfect but the plug-in experience is so poor it drags everything else down. Anyone that needs an iOS solution should go ahead. If you need a Mac solution proceed with caution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Coe Huddleston",
          "Nb_Reviews": 2,
          "Date": "2021-06-09T19:58:12.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, but would be vastly better if they had live phone support.  Especially for us Seniors who have trouble navigating through all the closing and opening of web pages.  I disconnected from them twice while trying to solve an issue.  The computer bots are absolutely worthless at customer service, ditch them and put in some phone lines…really!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Gerstman",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T16:51:46.000Z",
          "Titre": "I thought it took more back and forth…",
          "Contenu": "I thought it took more back and forth to resolve my issue.  It seems to me you could have people answer personal questions instead of or in addition to the two you asked -- name of computer & date started Dashlane.  I never could come up with the second one.  I appreciate the high security -- that's why I use it, but when emails come and go, there must be an easier way for people to prove they are who they are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike D",
          "Nb_Reviews": 2,
          "Date": "2021-03-06T14:32:01.000Z",
          "Titre": "Problems With New Version, Support Lacking",
          "Contenu": "I had very few issues with Dashlane until I recently updated my Mac IOS and installed a new version. I've had bizarre behavior since then. I'm a Premium member and reached out to Dashlane support twice, but have received no responses. I'd give you one star today, but averaged that with the 5 stars I would have given a month ago prior to these problems."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "C G",
          "Nb_Reviews": 11,
          "Date": "2021-07-14T20:26:19.000Z",
          "Titre": "Web App is Terrible",
          "Contenu": "The Desktop App was great, slick great UI, The web app is clunky, impossible to use and a general disaster, doesn't auto log out and to find or amend password is clunky and complicated. If they don't sort it soon I'm off to something else been with it for 6 years but the new web app is dreadful"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Daniele",
          "Nb_Reviews": 24,
          "Date": "2021-02-21T06:46:26.000Z",
          "Titre": "like others",
          "Contenu": "like others, I also don't like the new built-in mode in the browser. For example, I don't always have automatic compilation. Then I have to open the app, search for the site, copy the login. Then reopen the app, search for the site again, copy the password. And some other problems like writing notes. I also thought about changing the password manager but there is no possibility to export the stored passwords (better in json format) neither in Windows nor on the smartphone."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jeremy Cockroft",
          "Nb_Reviews": 17,
          "Date": "2021-06-26T10:31:34.000Z",
          "Titre": "Excellent password manager, with a few niggles.",
          "Contenu": "I preferred the old application based Dashlane to the current browser version.  It made it easy to see security data whilst viewing a website form.  Now I have to switch back and forth between two tabs. I can't see what problem this change was supposed to solve.I have never managed to get the mobile autofill to work.Otherwise I think Dashlane is excellent, keeping all my passwords secure.  I have now changed all my old \"memorable\" passwords, many of which were duplicated.  Autofill, when it works, is very useful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay Boudreau",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T21:02:29.000Z",
          "Titre": "After a loss of all data subsequent to…",
          "Contenu": "After a loss of all data subsequent to a PC internal cleaning, I was unable to recover 100 or so of passwords that had been generated by Dashlane.The support team helped me to recover the data but once again it appears to be lost.  I shall go back and follow the support recommendations once again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer Jerry H",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T13:22:51.000Z",
          "Titre": "Not intuitive",
          "Contenu": "Not intuitive.  Wish they had a user's manual.  Have had this program for many years and still do not know how to use 90% of it's capabilities.  Customer service does not exist.  When I run into a program I have to live with it.  Current changes have only made it more difficult to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-14T13:29:12.000Z",
          "Titre": "overall a good service",
          "Contenu": "overall a good service. Passwords have been secure and accessible in other platforms. Integration with iPhone is ok, but browser add ons are erratic and inconsistent. For example, Dashlane will recognize some sites, and offer to generate passwords. Other (many) times it will not and info has to be recorded manually. Dashlane can also be very stubborn and get in the way of filling forms."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T00:25:49.000Z",
          "Titre": "It's not always consistent",
          "Contenu": "It's not always consistent.  I just tried to register a product and opened Dashlane and it wouldn't populate the registration page with a password.  I couldn't even copy and paste successfully.  This occurs fairly often.  I don't know the fix.  I do have apple keychain and even though I tell it not to populate the password, Dashlane lays over and dies.  Don't know why?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARY OSTERBROCK",
          "Nb_Reviews": 2,
          "Date": "2019-12-14T13:55:38.000Z",
          "Titre": "I was glad to use Dashlane",
          "Contenu": "I was glad to use Dashlane, following a recommendation by The NY Times. I stuck with it for years, but it never was what I think of as easy to use. I’m actually transitioning to another manager, 1Password. It seems to be a lot more user friendly. Price was one factor. Dashlane seems to be one of the more expensive out there. But when it comes down to it, ease of use won the day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T16:05:53.000Z",
          "Titre": "Dashlane doesn't always update my…",
          "Contenu": "Dashlane doesn't always update my passwords.  I started with the free Dashlane quite sometime ago and upgraded to premium which was good for awhile then it wasn't updating changes in passwords.  I cancelled premium for awhile, then decided to try again, but still don't see that it updates new passwords so think I'll not renew again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T15:47:52.000Z",
          "Titre": "wait and see.",
          "Contenu": "I'm not happy with the new web based system. I am very worried about it's security. The PC based system no longer working at all is very troubling. Auto fill works sporadically and auto save for new websites never works. I loved the old system. I'll wait and see if this one improves."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cisco AtLunch",
          "Nb_Reviews": 1,
          "Date": "2020-08-09T17:01:03.000Z",
          "Titre": "I have been using Dashlane paid version…",
          "Contenu": "I have been using Dashlane paid version for about 6 months. Overall not a bad product but I have issues with the sync between the app and the web based interface. It works but it’s too slow and not realisable so I have ended up resetting my passwords many times. The interface really needs more work and improvement."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brian",
          "Nb_Reviews": 3,
          "Date": "2020-03-30T12:14:18.000Z",
          "Titre": "Often doesn't work",
          "Contenu": "Often doesn't work. Takes too long to load on startup. Ignores requests to stop working on a page. Forgets accounts. Ignores requests to not show their logo in input fields. And tops it off by introducing a new ugly logo. The only thing that keeps me using it is my reluctance to take on the grief of migrating to something else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "diannasolmes",
          "Nb_Reviews": 4,
          "Date": "2019-06-01T23:14:01.000Z",
          "Titre": "Need and love the concept",
          "Contenu": "Need and love the concept.  But sometimes it works and sometimes it does not.  I love it when I open my webpages and Dashlane immediately comes up and opens it for me.  So why does it NOT open my Visa account but it does my bank account?  Also the created passwords are so outrageous, I can barely type them much less remember them.  If I have to look it up and type it in, it will take me minutes instead of seconds to do it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 4,
          "Date": "2019-10-29T20:21:19.000Z",
          "Titre": "So so",
          "Contenu": "It is very convenient to be able to have many passwords and to not have to memorize or note each one.  Dashlane stores my logins and passwords for me.  The downside:  Frequently Dashlane does not auto fill the login/pw fields on my pc or my mobile device and I have to go the Dashlane app and copy and paste them myself notwithstanding I have paid for a premium membership for the past 2 years.  I am considering not continuing my Dashlane account when it comes due for renewal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T18:30:05.000Z",
          "Titre": "Dashlane works o.k",
          "Contenu": "Dashlane works o.k. But a lot of features don't work on many web pages. I find that I have to do a lot of manual work to get it right. The one important feature missing in Dashlane is a password generator on demand by the user. That's for passwords for sites where Dashlane's automatics don't work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T20:55:58.000Z",
          "Titre": "Dashlane is a great product, BUT ...…",
          "Contenu": "Dashlane is a great product and service, however, the cost for keeping passwords synced across all platforms and devices is too expensive. I would like to see pricing based on the number of devices synced. Now I just keep my top passwords on each device and any new ones or less used ones, I keep in a journal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 3,
          "Date": "2020-04-21T16:49:05.000Z",
          "Titre": "I really like Dashlane but there are…",
          "Contenu": "I really like Dashlane but there are web sites that try to login to and and the name and password won't populate. So I have to go into the details in my Dashlane website and get the password etc and sign i manually. I have checked the help section in Dashland and it didn't help. This used to work flawlessly but not any more. I am sure there is an answer to fix this but I can't find it. I am keeping Dashland and hoping the issues can be solved. I am hoping that a Dashland tech see's this and offers a solution."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 2,
          "Date": "2020-02-26T16:16:03.000Z",
          "Titre": "I would have rated Dashlane much higher…",
          "Contenu": "I would have rated Dashlane much higher except for the volume of fumbles. By this I mean the times Dashlane won’t fill in the required information, seems to disappear completely and won’t work with some websites. This is irritating to depend on a password manager that works about 80% of the time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "grahamnewton",
          "Nb_Reviews": 3,
          "Date": "2015-11-22T20:48:44.711Z",
          "Titre": "Confuses User Names and Passwords",
          "Contenu": "Too often, Dashlane confuses User Names and Passwords and it seems it wants to save User Names as Passwords.\r I confess I don't let it generate passwords. I prefer to come up with my own which it generally accepts as Strong and which I list in code, e.g. lamb means the reg. no. of a Lambretta scooter I once had, and 63 address is the number and road where I lived in 1963"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "gregoryyankelovich",
          "Nb_Reviews": 7,
          "Date": "2019-12-20T23:48:31.000Z",
          "Titre": "Reliably secure",
          "Contenu": "Reliably secureI have been a user for a few years. First of a free version then of the paid one. The Chrome extension is not as consistent in populating credentials at log on, as I would like it see. Since it uses 2 way verification, I found myself in a very difficult situation when my phone got broken while traveling. Tech support could not figure out how to verify my identity without my phone and that left me in a very precarious position. I wish they had some secure, but practical alternatives that rely less on technology."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Roberto Lira",
          "Nb_Reviews": 54,
          "Date": "2018-12-13T22:10:02.000Z",
          "Titre": "Good but some limitations compared to Keeper",
          "Contenu": "I have download the app with a view to change from Keeper . installation and getting setup is a brise, Unfortunately it fails on 2 accounts compared to Keeper. 1) one cannot add a file to a financial record - only to Notes.B) you cannot view the attachment on the fly, has to be downloaded to a file on your phone and then view from the file it has been downloaded to. very long winded. Also reading some reviews on the web it appears not be be as secured as Keeper. Shame otherwise I would have jumped ship."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Steven Wilson",
          "Nb_Reviews": 9,
          "Date": "2019-03-28T12:37:51.000Z",
          "Titre": "Quite buggy",
          "Contenu": "Have been using Dashlane for over a year now we find it quite buggy. Having said this reading the reviews of other password managers it seems as if all this type of software is only good for very basic use. In our experience we find that Dashlane fails to sync, log in correctly or update passwords correctly about 20% of the time the other 80% it works correctly.Use the free version but consider very carefully before you pay out as in our experience, it is not yet the robust password manager it may one day be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T23:11:33.000Z",
          "Titre": "Make that 3.5 stars",
          "Contenu": "Make that 3.5 stars. because it is finally staying on my computer without my having to re-boot all the time.But, up until now if I added a password on my computer it would show up in my phone app., on my iPad app.,and on my other computer. Now I have to add it to each one separately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "vonrickstr",
          "Nb_Reviews": 6,
          "Date": "2016-05-10T18:04:58.000Z",
          "Titre": "Great untill screensaver turns it off",
          "Contenu": "Dashlane positively works wonderfully....until I am logged off by not using my computer for a half hour. Even thou Daslane settings have me logged in for up to 10 hours, I get logged off often when screen saver pops on.\rTo log back on I must close Dashlane (only accomplished by control/alt/delete) and restart and relog into program."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 2,
          "Date": "2019-12-16T00:05:29.000Z",
          "Titre": "sometimes fills in passwords…",
          "Contenu": "sometimes fills in passwords automatically and sometimes it doesn't.  I can go to the program, copy the password and paste it and it works, but I shouldn't have to do that.  Also, most of the time when I tell the program to go to the website, it fails to log me in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M.",
          "Nb_Reviews": 3,
          "Date": "2015-09-26T10:18:33.586Z",
          "Titre": "Great....but",
          "Contenu": "Love the presentation, the portability of passwords across devices, and the security.  BUT, when I try to use the auto login feature with the web pages from the password section, either in safari or with the dashlane browser on my iphone or ipad, it does not work.  This feature working would get you to five stars."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T13:10:12.000Z",
          "Titre": "After 50 words it is the end of the…",
          "Contenu": "After 50 words it is the end of the line. I am not even a bussiness person. If I upgrade the price is rathe expensive for a retired person. Not happy that I can not continue without paying anrather high price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wilfred Johnson",
          "Nb_Reviews": 2,
          "Date": "2017-11-26T15:37:31.000Z",
          "Titre": "I've tried unsuccessfully to find my passwords through enrollment in Dashlane.",
          "Contenu": "I've tried unsuccessfully to find my old passwords through what I thought I had with Dashlane. After several times of entering a wrong P.W., I have to get another. When I've gone to my trusted Dashlane, I'm not able to locate them. Now, I must confess it has to be me, because I have been able to locate some of them, and I do have faith that Dashlane will help me resolve my issues here. I've even tried to reach a live help server through Dashlane, in order to get tutoring. I know I'll receive service through YOU!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Lorenz",
          "Nb_Reviews": 2,
          "Date": "2020-03-03T00:01:47.000Z",
          "Titre": "Needs better customer support.",
          "Contenu": "Product is very good, but customer support is not.  Have problem with tablet and only correspondence is email.  It takes 2 days for each response and i am constantly referred to documentation - the same one multiple times.  Working in my next response. #1174741"
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Tero Ojala",
          "Nb_Reviews": 2,
          "Date": "2021-03-09T08:18:02.000Z",
          "Titre": "Good product with modern UI but big issues",
          "Contenu": "Good product with modern UI. Works in Android and Chrome, but there are big issues with couple of things.1. Autologin is horrible idea and you cannot turn it off globally. And because bug, not even per site. Why is it a horrible idea? Because it sometimes submit wrong forms, not the login form. And that makes some sites basically unusable: you autofill the login form with Dashlane and it automatically submits wrong form. Thus you cannot login at all.2. Saving passwords from Android is nonexistent. When you create new account for a new app, or new website Dashlane doesn't understand to save it. Instead you have to do it manually."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "marcus alexander",
          "Nb_Reviews": 1,
          "Date": "2017-05-03T14:54:55.000Z",
          "Titre": "use to work great but now will not open …",
          "Contenu": "use to work great but now will not open up or work at all.have been working with help dept for over a week & they still have not fixed problem. have not heard back from they in 2 days. hope they get it fixed soon. wish you could talk to a person instead of working over internet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "drglh66",
          "Nb_Reviews": 1,
          "Date": "2018-09-30T18:25:54.000Z",
          "Titre": "Some worrisome problems but easy to…",
          "Contenu": "Some worrisome problems but easy to use. Very worrisome, password to login to dashlane stored in database and appears stored with all the other passwords. Seems easy for hack and login. Problems generating new passwords for a company and adding them correctly to database."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dave Greenbrown",
          "Nb_Reviews": 4,
          "Date": "2019-09-16T14:42:14.000Z",
          "Titre": "Awful customer service via online…",
          "Contenu": "Awful customer service via online support, refused to believe I had a problem logging into their trial system (due to conflict between 2 different versions of their system I was trialling). This was despite extensive screenshots proving the issue existed.Then, when the trial period ended (I hadn't been able to trial the software due to the issue), they refused to extend the trial period.Shocking, because I could have had 100 users on the system if they had bothered to show some respect to a genuine error.**** EDIT ****Was sorted out after this review was picked up, so all fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2019-12-19T15:54:51.000Z",
          "Titre": "Dashlane could benefit from some revisions",
          "Contenu": "Dashlane fills a very important need to remember passwords.  Unfortunately, It is slow to load and fails to do basic things, such as enquiring of the user if they are writing a new entry without calling your intention to a duplicate already in your file."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Piero Mattirolo",
          "Nb_Reviews": 21,
          "Date": "2019-05-29T20:33:38.000Z",
          "Titre": "Presumably safe, but highly inconvenient",
          "Contenu": "I was hoping to share my passwords across multiplatform devices. On my iPad, as well as on my Android, I would be satisfied by the level of security provided by my fingerprint recognition.  However this convenient technology is not taken advantage of, in favour of an obnoxious and tricky password system.  I don't think I'll renew my yearly subscription. I realise now after Dashlane’s prompt reply to my review that I had overlooked the possibility of enabling biometric security on my portable devices. However I think this should be proposed as the default setting for mobile devices"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Leigh",
          "Nb_Reviews": 49,
          "Date": "2020-10-08T08:37:04.000Z",
          "Titre": "Good product fair price however not…",
          "Contenu": "Good product fair price however not much customer service and also the app on desktop seems to go really slow now and again forcing me to uninstall and re-install I think i will be using something different after my subscription ends"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Missy Neitzel",
          "Nb_Reviews": 2,
          "Date": "2017-11-26T16:44:08.000Z",
          "Titre": "I actually love the app and looked into …",
          "Contenu": "I actually love the app and looked into subscription but the price is too steep for me.  I have shared my love of this app with others but many stated they get similar services for free.  I will stay with Dashlane and hope I get a subscription for Christmas."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Toy",
          "Nb_Reviews": 1,
          "Date": "2017-02-03T17:03:53.000Z",
          "Titre": "Has quit working...again",
          "Contenu": "For the longest time Dashlane worked fine filling in my data on internet forms.  Then it suddenly quit.  I deleted the program and re-downloaded it, worked fine for a short while, then it quit again.  When it works it's an excellent tool.Regards ~~Joe Toy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DOMINGO' Stern",
          "Nb_Reviews": 1,
          "Date": "2017-02-20T03:26:53.000Z",
          "Titre": "DOMINGO'S REVIEW",
          "Contenu": "The software is useful but it is less efficient than a few months ago in that it is not opening some sites automatically , it is not sincronizing and or prompting password changes. As a result, many tasks that were automatically done now require manual work"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T09:06:29.000Z",
          "Titre": "Problem not fixed",
          "Contenu": "Problem now fixed!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T14:58:17.000Z",
          "Titre": "Keep A Close Eye...",
          "Contenu": "I find that sometimes i have to turn it off, espescially if it's trying to generate its own passwords when not needed.Sometimes puts in its own user name...etc so have to keep a close eye on that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dashlaneml.glorifiedsimplelogi",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:26:20.000Z",
          "Titre": "Help for a permission request",
          "Contenu": "I requested help with regards to using some of their literature to disseminate to a group of prospective consumer clients. My request was not urgent.The response time was a bit long, but I was explained this was due to heavy assistance requirements subsequent to an update.Once, responded to, the assistance was clear and thorough."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T11:45:30.000Z",
          "Titre": "Easy and clear use.",
          "Contenu": "Easy and clear use.It's an easy to use app, clear structured.Good offer for the premium, that has extra advantages, like premium VPN included.Issues with the autofill, where you need to go a lot of times in the app and manually search for the password you need. More an inconvenience, but needs mentioning.Will probably go back as premium at some point."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:54:30.000Z",
          "Titre": "Overall good. Room for improvement.",
          "Contenu": "Great browser extension, great mobile app, very friendly and helpful support desk (once you get there).Areas that could use improvement: Payment processing, overly fast automated actions and e-mails in relation to subscriptions and deleting business accounts, user experience / flow dead ends (not in relation to the browser extension or mobile apps; those are fine), missing 24 hours support (you might need to wait until midnight before able to start a live chat).I think if they start with 24 hour technical support, a lot of problems can already be countered before they can become real problems, and it would then be safer for non-American companies to use their services."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Harper",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T16:41:26.000Z",
          "Titre": "Dash Prime Customer",
          "Contenu": "I am only giving 4 stars which may be a little harsh however there was a large gap between my initial request for help and a response from Dash Team.However, once the team picked up my query, the response was terrific and my problem was solved!!"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "eleonoremargueriteetcie.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T10:22:32.000Z",
          "Titre": "Responses from the support team were…",
          "Contenu": "Responses from the support team were not always answering to my questions in a straightforward manner. Unclarity about invoicing process, I had to ask several times the same question to get a clear answer.Other than that, very nice and friendly contact with the support person and pretty responsive."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Frank Zintel",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T15:27:38.000Z",
          "Titre": "good advice",
          "Contenu": "it took a couple of days but the problem could be solved"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alain",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T15:38:56.000Z",
          "Titre": "Pro:",
          "Contenu": "Pro:Great to store passwords, perso info like passports, license, etc. If accident, just go to a computer center and log in. Cons: Does not always fill data properly, using the password generator not always easy, distinction between categories not obvious, making or editing certain files not easy. Too many services like vpn. In short:Very useful, easy, portable, works great with cell phones. Does password great but auto password change not obvious."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sevincil",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:05:20.000Z",
          "Titre": "Good app for passwords",
          "Contenu": "I like the Dashlane app and having been using for many years.  I decided to upgrade to premium due to changes in their \"free\" offering.  I didn't give a 5 star because the support was slow to respond to my account issue.  But when they did, they handled it smoothly and all was well.  Hopefully changes to their free version will incentivize others like me to move to premium, thus increasing their revenue and they can hire more peeps to do support!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lcostickgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T17:50:54.000Z",
          "Titre": "I wouldn't say great but I appreciate…",
          "Contenu": "I wouldn't say great but I appreciate Peter's taking time to help. Your online ads get really confusing as they are not linked to you customers status. I'm for Premium but you're inundating me with ads and comments about free account. It is really annoying."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Agatha",
          "Nb_Reviews": 7,
          "Date": "2023-11-15T22:41:23.000Z",
          "Titre": "It wasn't easy",
          "Contenu": "Because I'm from the Netherlands and the Dutch language is not supported it is difficult to explain the problems and also it wasn't easy to understand what the supporter Peter wrote to me. All together Peter succeeded to explain what I had to do."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dylan",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T20:03:42.000Z",
          "Titre": "The experience of the agents was great.",
          "Contenu": "The experience of the agents was great.My only, suggestion regarding was 4 stars was the delay between contact. Which would have been fine, however, when you log an issue online, you get a \"we have your request\" - it would be nice to get an email confirmation also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ghamlermalisko.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:18:03.000Z",
          "Titre": "I was contacted by a technical support…",
          "Contenu": "I was contacted by a technical support member quickly and they were able to escalate my ticket to the correct resources in a timely manner. Again, thanks for the help with my Dashlane questions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Bluffield",
          "Nb_Reviews": 23,
          "Date": "2023-09-28T19:26:53.000Z",
          "Titre": "Friendly, efficient service by email and live chat",
          "Contenu": "Prompt and efficient dealing with an issue. For some reason, after re-installing Firefox I was unable to get Dashlane to operate because I needed a code number. Despite the system repeatedly saying a code had been sent, I was not receiving them. After taking part in an online chat, and later in emails, the problem was rectified by an operative called Rita."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Igor",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T20:10:33.000Z",
          "Titre": "A great password manager",
          "Contenu": "I've used LastPass for ages but after its security issue last year, I looked for an alternative and chose Dashlane. It logs me into sites more smoothly on PC, iphone and Android mobile. Their dedicated 2FA app works well and allows other sites to be added. Their customer support is very responsive and knowledgeable."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Shaw",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T20:58:56.000Z",
          "Titre": "Great product but support needs improvement",
          "Contenu": "UPDATE II: #2093584 < Gus was amazing so please give him some praise for resolving my issues. It turned out it was;t just one thing that had gone wrong but a multitude of issues, some of which were caused by me.UPDATE: Since leaving this review a really helpful person from Dashlane's support contacted me and resolved my issues. I'm now back to using a fantastic product that is easily the best on the market BUT they need to improve their support processes. Waiting 48 hours for a response when you can't access any passwords is not great. Fortunately, I had access via my laptop but others might not have that option.Great product but terrible support. I can access my account on my phone but it's not working on Chrome or via their site. I've tried resetting 2FA but it keeps saying there's an error and then if I try and use a recovery code, which I have saved on 2 computers, none of them work. Something is broken and all I can do is fill out a contact form, even though I'm a paying customer."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "LC Chong",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T05:24:42.000Z",
          "Titre": "Great Customer Support Service",
          "Contenu": "Clara from the customer support team has been most helpful when I was caught between Google Pay and Dashlane due to some billing issue. She provided great advice and was quick in making decision to shorten my ordeal to resolve the issue. Thank you Clara for your help and going the extra mile !"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lynn",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T18:26:09.000Z",
          "Titre": "Changing from 2 accounts to one…",
          "Contenu": "This rate is more due to Elma's help after spending many days emailing back and forth with the Dashlane team.  Elma helped me change from one email to another, exporting my files to my current account (Family).  It was a frustrating process in the beginning but with Elma's help it went very smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T05:34:48.000Z",
          "Titre": "Support is excellent.",
          "Contenu": "Support is excellent.I could not find information anywhere on how to delete multiple account logins instead of one at a time.  The reply from support was detailed and thorough and prompt.I have had no problems with operation of the app.  It coordinates well from desktop to phone and tablet, and its secure password sharing when required is perfect.4 stars.  Mainly because I just don't give 5."
        },
        {
          "Note": 4,
          "Lieu": "VE",
          "Pseudo": "glexy",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T15:12:04.000Z",
          "Titre": "Their support team was helpful and patient…",
          "Contenu": "Their support team was incredibly helpful and patient. We had problems with our accounts because the main account changed from personal to business and unfortunately, you have to create another account and pass all your data to the new one. this also is required to the friends and Fam plan people. Part of the Friends & Fam group, us, from the old account, had to delete or reset their accounts and create a new one to have access to the new Friends & Fam plan or incorporate into the business team of the new account.It was kind of nightmarish but Nathália, Dashlane Suppport Rep, was incredibly helpful and patient with all of us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bdraecatl.com",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:23:36.000Z",
          "Titre": "It was quite difficult at first, but all worked in the end",
          "Contenu": "It was quite difficult at first.  But once Serg got involved and understood my problem it went much more smoothly to resolve my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jfhsrsbcglobal.net",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T01:53:10.000Z",
          "Titre": "I am so glad to have Dashlane",
          "Contenu": "I am so glad to have Dashlane.  Dashlane makes life so much easier, for storing/creating passwords.  Without Dashlane, I would have to remember so many passwords.  So helps me not use the same password over and over!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T20:54:02.000Z",
          "Titre": "Forgot master password",
          "Contenu": "Forgot master password. Was able to reset following directions on web site. The only negative is that once the app on iPad accepted new master password, I could not open the app on iPhone. Finally support answered my email and provide a solution. But it took over 24 hours to respond. This could be avoided if same recovery instructions for a second device would be added to the reset instructions in the help articles."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Ash n Dave",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T01:53:42.000Z",
          "Titre": "Dashlane is a great service",
          "Contenu": "Dashlane is a great service. I have thoroughly enjoyed it since first starting with the service two years ago and recently upgraded to the family subscription so everyone in my house can take advantage of it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gwen",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T21:32:39.000Z",
          "Titre": "Adventures in Auto Renewals",
          "Contenu": "I always hate the process for auto-renewal of subscriptions--there always seems to be some trickery involved to auto-deduct your account before you've had a chance to confirm the renewal/change your plan. Such was the case with Dashlane, though when I emailed support they did fix the issue, with a courteous reply within a few hours of my request. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jonwestergaardverizon.net",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T00:25:27.000Z",
          "Titre": "Great and Less-than-great",
          "Contenu": "The \"great\" part was that Dashlane was able to successfully resolve the problem with my payment. The less-than-great part was that in order to do so, I had to disable my VPN - contrary to best security practices. I sent Dashlane Support a message about the VPN disabling requirement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ Hanush",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:01:23.000Z",
          "Titre": "Dashlane is nice when it works",
          "Contenu": "Dashlane is nice when it works. It autofills everything for me, generates great passwords, and eliminates the need for me to remember passwords.  However, when it doesn't work right... very slow response from support, and then you're stuck doing the for gotten password thing at every website you go to for days while they get around to getting back to you. My last support request took a day and a half before they even got back to me - let alone resolved the problem. On top of that, Dashlane pretty much just doesn't work on mobile. It's no good on any app, and most of the time it fails to autofill in my Chrome browser, too. Oh, and one last thing, when I go to use a credit card, it won't let you even once without reentering your master password... It's shorter and easier to just type the card number in, so Dashlane is no solution for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Mederich",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T16:42:50.000Z",
          "Titre": "The resolution was accurate and helped",
          "Contenu": "The resolution was accurate and helped. Yet ultimately, not needing to require a resolution for something very clearly is an issue with Dashlane's system would be better. The issue was, out of the blue, my master password stopped working to log into my accounts anywhere. Whether an app or browser. I did not change my master password either. So definitely something Dashlane was doing on their side system-wide. Regardless, once Dashlane customer support exchanged the solution email, it was easy to remedy."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "M Schrepfer",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T22:55:59.000Z",
          "Titre": "Great product support",
          "Contenu": "Im new to Dashlane, although Android phone app still not 100% seamless (still quite good, just not as good as the now less trusted competitor), it is very refreshing that this product has good tech support (unlike the competitor LP). Support was great, timely email reply and specific to issue raised, with follow up emails giving updates on progress - very impressed. Well done Dashlane - enough for me to stay onboard as my now preferred."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 7,
          "Date": "2023-04-24T14:19:10.000Z",
          "Titre": "Works across Apple Devices",
          "Contenu": "I like that Dashlane works across all of my Apple devices. I never have to worry about forgetting a password. I would give Dashlane a perfect 5 stars, but I recently had a technical issue, which tech support did not correct for me. I had to figure the fix out myself."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Valerie",
          "Nb_Reviews": 4,
          "Date": "2023-11-20T21:35:58.000Z",
          "Titre": "Good advice.",
          "Contenu": "Good advice.But help centre obviously overloaded. Took a few days to reply"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T20:44:01.000Z",
          "Titre": "Most of what you provide me is…",
          "Contenu": "Most of what you provide me is excellent. The following are the problems I run into now and then: 1. Setting up a new website username and password, Dashlane does not allow me to save the information occasionally. 2. I use Dashlane to sign in to all my accounts, but the website occasionally tells me the password or username is incorrect. I suspect the website does this to make me change my password.3. At least one site will take just twelve password caricatures. I have the ability to change this on   Dashlane, but I would like to set the number of caricatures as default.4. Giving a date of experiences is impossible because it happens multiple times each month."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "sirokuma",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T03:45:26.000Z",
          "Titre": "異国のカスタマー",
          "Contenu": "★I use google translate.★I am a Japanese who is not good at English.The staff was very understanding and supportive of customers from other countries.If possible, it would be to the benefit of both Dashlane and our customers if you could create a support page with case studies, etc. in Japanese!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam Scott",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T18:54:02.000Z",
          "Titre": "...are NOT for the masses",
          "Contenu": "It would have been nice to be able to speak with a live agent, rather than a back/forth QnA or a survey.  I hope Dashlane realizes that their solution [except for default iOS \"Passwords\"] is NOT for the masses.  It can be confusing and cumbersome.  I have many clients (for whom I've turned onto Dashlane) that are continually confused by how Dashlane operates.  As a  simple example.... To get help with my tech-related issue, I had to create a NEW HELP ticket by answering what Rev/Ver software I was using... annd most lay-users would have NO clue.  I'm not saying I have the answers.  Just noticing the areas of opportunity for improvement. Ps. I'm a tech consultant.  I've been using Dashlane for 5+ years.  I reached out to Dashlane for help due to issues with Dashlane working with my Chrome Browser.  All other  web browsers have been working fine."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 8,
          "Date": "2023-05-25T01:52:56.000Z",
          "Titre": "Had everything covered for all problems",
          "Contenu": "They had everything covered and set out for just about any problem.  The only drawback was that I felt I would have liked to be speaking to an actual person at times as I am quite challenged with technical problems."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "ck",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T21:41:40.000Z",
          "Titre": "Support via EMail, money back",
          "Contenu": "The support via EMail is phantastic: on time, friendly, patient, helpful.I made a mistake, booked an account I didn't want to book, got my money back - no problem. It's really amazing, absolutely not a matter of course in this day and age.Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Marc RICHARME",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T20:03:20.000Z",
          "Titre": "Very good support",
          "Contenu": "Very good support, reactive and efficient.(installation of synchronized dashlane on 2 PCs on Windows -firefox, chrome and edge as well-, 2 smartphones and one tablet, with autofilling of fields.It would have been perfect if I would not have to ask support for it !"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "GJ",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T02:48:04.000Z",
          "Titre": "Dashlane did what it was supposed to do…",
          "Contenu": "Dashlane did what it was supposed to do but didn't have some of the features or layouts I was expecting/wanted.Online customer service is a bit lacking but works.Apart from that its not a bad tool."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NordVPN Customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T19:18:37.000Z",
          "Titre": "Generally does what it's supposed to",
          "Contenu": "Generally does what it's supposed to. With IOS you can't stay logged in. Some sites don't auto-fill properly.Sometimes the three-number code on the back of your credit cards doesn't auto-fill."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Stryhalaleck",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T02:14:51.000Z",
          "Titre": "The support team is always courteous…",
          "Contenu": "The support team is always courteous and promptly follows up on tickets, even if they require attention from the dev team and may take a week or two to resolve."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Peter Paterson",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T01:38:42.000Z",
          "Titre": "Excellent experience once I was able to…",
          "Contenu": "Excellent experience once I was able to speak with a human. AI wasn't suitable for my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 4,
          "Date": "2023-07-16T19:08:53.000Z",
          "Titre": "Many years of use! GREAT!!",
          "Contenu": "I have been using Dashlane for many years. The whole time I had the same master password. I really like the auto fill feature for the sites I go to regularly.  I got an email suggesting I change my master password. I did, but promptly forgot it. I kept trying to log in using my old password. I spent a lot of time going to all my sites to change the passwords and reconnect. What a pain. I almost totally dropped Dashlane. I decided I liked the auto fill feature so much that I started to repopulate this with my new passwords. I also wore down my master password. I very much like this software. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Rineer",
          "Nb_Reviews": 8,
          "Date": "2023-05-15T00:41:36.000Z",
          "Titre": "Wish It Could Have Been a 5 Star",
          "Contenu": "Customer service gets 5 stars for promptness/accuracy.Dashlane gets 3 stars for taking away a useful tool (category sort) with no notice nor a commitment when it will be returned"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mnkandikaol.com",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T00:52:47.000Z",
          "Titre": "I had to wait less time on the chat…",
          "Contenu": "I had to wait less time on the chat than I expected.  Mike understood my problem and patiently waited while I tried what he suggested.  When Dashlane was telling me that what I had done didn’t work, Mike was able to tell me that from his end, it said it HAD worked.  I accidentally closed the chat but was able to figure out the rest of what to do. However, I would really like to talk on the phone with someone.  (I’m old!)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T17:41:36.000Z",
          "Titre": "Great app for keeping track of logons, credit cards, notes, and other stuff",
          "Contenu": "The app provides a great way to keep track of logins, credit cards, personal notes, and other information that needs protection.  The only negative for me is that the app allows creation of duplicate information for the same websites.  For example, it would be easier for me if the app asked me when creating a new entry that another entry already existed for the same website or credit card, or whatever.  A simple message such as \"An entry already exists for this website\" would prevent me from creating duplicates that I then have to review after the fact to determine which is the \"real\" entry and which is the duplicate because they look exactly the same."
        },
        {
          "Note": 4,
          "Lieu": "IR",
          "Pseudo": "Muhammad Ali Asudeh",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T14:08:12.000Z",
          "Titre": "I could not reset my original password…",
          "Contenu": "I could not reset my original password through the site's guidance, but when I sent you an email and you kindly guided me, I was able to easily recover my account and reactivate it.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "elneser.sharifgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T18:49:56.000Z",
          "Titre": "Well its not a 5 star because at first…",
          "Contenu": "Well its not a 5 star because at first it didnt seem i would be assisted, but as soon as the desition to help was taken the proccess was simple smooth and easy."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "eric.laworange.fr",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T09:40:55.000Z",
          "Titre": "Dashlane'support : great as usual !",
          "Contenu": "Whenever Dashlane support is needed, it is very responsive, efficient and eager to maintain contact until the right solution to the problem is found."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tom_brittonmsn.com",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T00:28:25.000Z",
          "Titre": "Torturous process to get my answer resolved. Your automated email response was returning Dashlane's emails were received as junk and undeliverable.",
          "Contenu": "I eventually was able to get my question resolved but it was very difficult and unfriendly experience. I tried the FAQs - no match. I tried the Dashlane Customer Support and the system merely replied to my question with another question. I was deeply disappointed that it was an automated system and no human interface. I finally defaulted to the email approach and waited several days from a reply which didn't come. I resubmitted my question and finally received an answer which solved my problem. Almost a week to get any response that worked. BOTTOM LINE: (1) no phone to call available when in \"uncharted waters that FAQs don't address -  BAD CUSTOMER SERVICE, (2) disappointed that a human did not monitor and reply to my question when I accessed the Customer Service Support portal - BAD CUSTOMER SERVICE. (3) lastly, too long a period to reply to my email question - BAD CUSTOMER SERVICE. In summary, Dashlane's help and customer service was the worse I've experienced in this digital world. Love the Dashland system but the bloom is off the rose after this experience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Geoff",
          "Nb_Reviews": 21,
          "Date": "2023-06-07T21:04:48.000Z",
          "Titre": "Issue sorted",
          "Contenu": "After a very challenging process to get my premium subscription restored, Peter has managed to get everything sorted out.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billy Vaughn",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:18:16.000Z",
          "Titre": "Easy and Confidence in Safety",
          "Contenu": "I was introduced by my grandson to Dashlane several years ago. He noticed me looking up a password. He said here is what you need. The best thing I have ever done. I am 80 and confident."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FrancisGC",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T20:00:28.000Z",
          "Titre": "I was able to talk to someone via zoom",
          "Contenu": "I was able to talk to someone via zoom. It's a lot easier to explain technical challenges when support can see my screen."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "A.",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T10:18:48.000Z",
          "Titre": "Great support, but a tool that needs improvement.",
          "Contenu": "The support provided by Khet was exceptional, they solve my issue without problems and receive a refund on the cost for a service my company was not going to be use, so great.Regarding the tool itself, I feel that since the deletion of the desktop tool, some functionalities, or specifically ways to organize password has been utterly neglected, doing a good tool for personal use (maybe), but not for organizations with a lot of passwords for different purposes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JDA",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T16:26:28.000Z",
          "Titre": "Fast response during business hours",
          "Contenu": "Fast response during business hours.  Initiated refund quickly.  Only wish they had a phone number to contact directly."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "lorenzo",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:05:11.000Z",
          "Titre": "Good customer service",
          "Contenu": "Very good customer service. I am giving 4 out of 5  stars just because the service might be faster and because there is no way to get help via phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr Robert Cameron",
          "Nb_Reviews": 3,
          "Date": "2023-08-19T21:11:03.000Z",
          "Titre": "The support got things fixed…",
          "Contenu": "The support got things fixed efficiently.  It would have been nice if they had warned me of this bug with upgrades before I got locked out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jnishpacbell.net",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T01:17:22.000Z",
          "Titre": "Support from Carol and Diogo was quick",
          "Contenu": "Support from Carol and Diogo was quick, easy to understand and follow.  With their help, the problem was easily resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "joejethotmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T22:26:37.000Z",
          "Titre": "I finally got the 2FA code remove to…",
          "Contenu": "I finally got the 2FA code remove to use Dashlane on other computer. I wish the explanation for using 2FA was   Easier. I’m happy it."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "JFD",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T11:04:40.000Z",
          "Titre": "Reset account issue",
          "Contenu": "The reset account process wasn't working correctly. After a talk with support we tried again and it works"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Bajcz",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T03:08:01.000Z",
          "Titre": "I needed a previous password as I'd…",
          "Contenu": "I needed a previous password as I'd accidentally saved the wrong one.   I couldn't access the previous password.   The support team tried to help me, but that information wasn't available."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "geoffglam.red",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T09:39:50.000Z",
          "Titre": "The outcome of my issue with Dashlane…",
          "Contenu": "The outcome of my issue with Dashlane was successful however the on-line guides were to useful, nor were my first interactions with Dashlane chat.It was only when on-line conversations with Serg and Elma started that we moved towards resolution of my issue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "billseifertgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T01:57:15.000Z",
          "Titre": "Great support",
          "Contenu": "Great support.  But in trying to change my email address was irritating.  It was not clear that I could not change it.  Ity turns out that my email address was my user name and to change that, I'd have to create a new account!  What a pain.  A new account means I'd lose all my rental history!  Had to leave it that way."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T18:39:20.000Z",
          "Titre": "Good support",
          "Contenu": "Support team was great and kind, and offered me a solution that worked, so thank you! Only thing is it was quite slow (1 or 2 answers per day, it took 4 business days to resolve)."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "mjcugmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T00:00:25.000Z",
          "Titre": "Missing passwords",
          "Contenu": "Recently had an issue where 99% of my passwords were missing from the app. Apparently, it was a server issue (not reassuring) Dashlane services were quick to resolve the issue though."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Manas Kulkarni",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T11:34:51.000Z",
          "Titre": "One of the Best Password Managers Available.",
          "Contenu": "The Security is obviously top notch, there's absolutely no doubt about it. But the differentiating factor is Dashlane app's UI. Both the Android and the Web apps are great in terms of their UI/UX. They should just work on the Autofill in the Windows now. From Android 11 onwards, the Autofill on Android is integrated in the Keyboard itself, which is great. But there's no such provision in the Windows version. The Autofill pop up keeps interrupting everytime. Plus disabling that pop up is also a hassle. It would be great if Dashlane could bring a more minimalistic pop up for Autofill in Windows that doesn't interrupt in between while typing. Also, they have recently discontinued the Essentials plan. The minimum plan that you can purchase now is the Premium plan, which I feel is a bit on the expensive side. It would be great if your could bring a more cheaper version of the starting plan. Nevertheless, anyone planning to switch to a Password Manager can choose Dashlane without any hesitation. You will be more than satisfied with their service."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Carlo",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T12:29:51.000Z",
          "Titre": "Solution is good",
          "Contenu": "Solution is good, support is grest. I suggest to review the bugs in order to avoid to remove and reinstall periodically the plug-in and the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheryl Purdy",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T11:26:50.000Z",
          "Titre": "Customer Support",
          "Contenu": "Representative replied within a reasonable time frame and continued to contact me with easy to understand instructions on how to fix problem I was having. Was disappointed that there is no way to actually talk to someone."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "hugo.thomas",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T17:40:06.000Z",
          "Titre": "Great but had a bug",
          "Contenu": "The customer service resolved my login issue but required action from my admin, it's too bad because it wasn't our fault.Besides that, excellent service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa H",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T23:10:39.000Z",
          "Titre": "Dashlane customer support is helpful",
          "Contenu": "Dashlane customer support is helpful,  but I wish there was a number you could call for help as the reply isn't immediate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gambelguygmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:12:45.000Z",
          "Titre": "Great but with a problm",
          "Contenu": "I enjoy using Dashlane a lot and it has been very helpful over the years.  The recent transition to its being an Extension on Chrome has been associated with problems requiring me to reinstall the Extension several times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richarld",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T15:20:58.000Z",
          "Titre": "Rita was very helpful in solving my…",
          "Contenu": "Rita was very helpful in solving my problem. I don't really understand why it occurred in the first place."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:24:07.000Z",
          "Titre": "Response was quick",
          "Contenu": "Response was quick, but I was able to resolve my issue on my own.  That is why I have not reviewed to this point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Shapiro",
          "Nb_Reviews": 4,
          "Date": "2023-05-12T15:10:51.000Z",
          "Titre": "Good customer service",
          "Contenu": "The product generally works well with the exception of some autofill episodes that can be annoying. Customer service team was immediately responsive to solving issues. Recommend Dashlane as a useful tool for password management and OPSEC"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Denis Benichou",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T18:41:37.000Z",
          "Titre": "Stuart understanded and helped me very…",
          "Contenu": "Stuart understanded and helped me very efficiently.Just a shame that the Dashlane customer service took ione wek to answer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "****",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T04:11:04.000Z",
          "Titre": "It was great until I got a new laptop",
          "Contenu": "It was great until I got a new laptop. Now my new laptop won't accept passwords that were saved on Dashlane. Big pain."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BETH MILTNER",
          "Nb_Reviews": 4,
          "Date": "2023-02-24T17:52:29.000Z",
          "Titre": "I enjoy having a password keeper",
          "Contenu": "I enjoy having a password keeper.  Dashlane foes a good job and has robust features."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Oleksii",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T10:03:08.000Z",
          "Titre": "The support was fast and to the point.",
          "Contenu": "The support was fast and to the point.The only annoying thing is that I had to type my request three times before I got help. You may want to test your UX flow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "donnablaircato.com",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T15:53:23.000Z",
          "Titre": "received a response that solved my…Couldn't accept shared password",
          "Contenu": "received a response that solved my problem BUT response time seemed delayed."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "petu.tiljanderoutlook.com",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T11:18:40.000Z",
          "Titre": "Yehhyy",
          "Contenu": "Brush for hair and the hacker and i think everything will go dayz the new one is sorted now I have"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "officeangela-versicherungen.at",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T01:43:47.000Z",
          "Titre": "It took some time",
          "Contenu": "It took some time, till somebody contaced me. But as soon as Mike wrote me, everything went good ;)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:20:34.000Z",
          "Titre": "Good Service",
          "Contenu": "The way that Mike kept me appraised of what was going on with my problem."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "F Bakhuizen",
          "Nb_Reviews": 6,
          "Date": "2023-06-30T08:57:39.000Z",
          "Titre": "browser problem",
          "Contenu": "good help within one day from Dashlane Customer Support.regarding browser problem"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "richard.j.moringmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T17:37:28.000Z",
          "Titre": "Issue was solved",
          "Contenu": "Issue was solved. Customer rep. was helpfull in helping to solve the issue."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Dominique",
          "Nb_Reviews": 14,
          "Date": "2023-05-13T20:39:24.000Z",
          "Titre": "À humanité interlocutrice !",
          "Contenu": "Finally, a company that understands that it is not necessary to offer robots as interlocutors to its customers at all costs!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Renate Hein",
          "Nb_Reviews": 5,
          "Date": "2023-02-28T07:49:41.000Z",
          "Titre": "I was very statisfied with your company…",
          "Contenu": "I was very statisfied with your company and can only report the best"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Hartsfield",
          "Nb_Reviews": 5,
          "Date": "2023-03-01T00:44:13.000Z",
          "Titre": "Agent referred me to an article from…",
          "Contenu": "Agent referred me to an article from which I was able to solve my problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kazz Lewsader",
          "Nb_Reviews": 3,
          "Date": "2023-06-12T18:05:26.000Z",
          "Titre": "The third agent was finally able to…",
          "Contenu": "The third agent was finally able to explain what I was doing wrong."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "R. ter Beke",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T08:31:28.000Z",
          "Titre": "No access DL on PC",
          "Contenu": "I solved the problem finally myself but the repsonse was fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claude S Poliakoff",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T10:44:19.000Z",
          "Titre": "My only annoyance",
          "Contenu": "My only annoyance was the delay in 2fa arrival."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Merle Weyant",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T05:20:59.000Z",
          "Titre": "It is keeping great work tracking my…",
          "Contenu": "It is keeping great work tracking my passwords."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Egon Biechl",
          "Nb_Reviews": 3,
          "Date": "2022-10-16T18:23:50.000Z",
          "Titre": "The personal assistance of the people…",
          "Contenu": "The personal assistance of the people in charge is excellent. The automated is rather poor, as it needs a lot of time and refers always to common help-advices, which do not answer the question for help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn Cobb",
          "Nb_Reviews": 8,
          "Date": "2022-09-07T16:20:44.000Z",
          "Titre": "Help articles did not address my issue, my live rep did",
          "Contenu": "None of the articles and \"help\" pages addressed my specific issue.  I chose not to try chat as my problem was a bit complicated.  While support is not immediate (you need to send your problem and wait for support to respond; a few days), the help that finally came from a service rep was extremely helpful.  He understood my issue, offered a solutuion not available elsewhere that worked.  I was able to reset master password on one device without losin my account."
        },
        {
          "Note": 4,
          "Lieu": "CI",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T11:59:49.000Z",
          "Titre": "Lots of features",
          "Contenu": "Lots of features even with the free version"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "reichhgmx.net",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T19:56:35.000Z",
          "Titre": "Good Support",
          "Contenu": "Good Support, tricky VPN setup, finally it works"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Horwath",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T21:29:32.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "Quick, honest feedback from Bernado and Taciane"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Georg Offermann",
          "Nb_Reviews": 3,
          "Date": "2022-08-10T18:30:06.000Z",
          "Titre": "… Very good support with small shortcomings",
          "Contenu": "So on the whole I am very satisfied with this support! The only drawback is that you chat and don't talk to the support until the problem is solved!The best support I have ever experienced is from Apple! I am 65 years old and have made various support requests and I am not employed by Apple!If you want I can tell you more about it!They are on a very good path!!!!!Very many thanks again for the support received!!!!👍👍🙏"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Ginc",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T23:41:21.000Z",
          "Titre": "Technical Issue completely resolved",
          "Contenu": "Simply, I had a technical issue about the synchronization process of the vault of my premium account when installing back the mobile app in a device where it had been uninstalled. Support has been found ready and concerned. Even though I do not know how, neither if it was their merit, effectively, the problem was resolved completely in less than a week, and the service went back working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candyman",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T17:23:13.000Z",
          "Titre": "Dashlane Customer Support Xperiance",
          "Contenu": "Hi,Dashlane is my one the best apps Ive ever used.Ive tested bunch of password managerbut finaly I choosed Dashlane.recently I had some major issues unfortunatlyand as I contacted DCSI got few useful tipsand finally after about 20 days of waiting(beacuse I couldnt access my phone)my issue has been completly solvedand Im happy with it.your team did a great job.I gave Dashlane 2 stars in playstorebeacuse of my issue persistedthat much long,but Now Im gonna give you 4 or 5 stars!Thank you so much"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T17:38:02.000Z",
          "Titre": "Best password manager in the market",
          "Contenu": "Best password manager in the marketThe other extra features are very useful too. The only downside is it's a bit costly in India. A one-screen Netflix subscription in India costs 2.5 USD/mo which is less than Dashlane's. Dashlane could introduce a separate billing model for India as Netflix."
        },
        {
          "Note": 4,
          "Lieu": "PS",
          "Pseudo": "Akram Abunahla",
          "Nb_Reviews": 3,
          "Date": "2022-08-10T17:19:53.000Z",
          "Titre": "One of the best password managers",
          "Contenu": "I have been using Dashlane for years now. The service is decent and is constantly updated adding new features. When they discontinued their desktop version, that caused a backlash and support tickets flooded their system. I truly thought that was the end for Dashlane, but they survived. Not only did they fix many of the issues that affected the service, but also they continued to add new features that were present jn the desktop app, but missing from their Web extension.Regarding support, there is a bit of delay in their response time, but overall support is helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Geisler",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T15:27:24.000Z",
          "Titre": "The chat function on the support site worked well",
          "Contenu": "Will of the support staff was very conscientious and totally followed up on my problem and its resolution - through to its completion.  Very satisfied with my interaction with him.  The only reason for the 4 star (rather than 5) is that it took quite a lot of email exchanges prior to my chat with Will to get the matter resolved.  After I clicked on the chat feature of the support team, everything pulled together for me."
        },
        {
          "Note": 5,
          "Lieu": "MW",
          "Pseudo": "Grey",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:12:39.000Z",
          "Titre": "Ever since I started using Dashlane",
          "Contenu": "Ever since I started using Dashlane, I never had problems with any account being compromised. Generated passwords are strong and hard to guess. Tools offered like vpn helps with security and privacy, having that VPN on their made it cost effective for me. I can save sensitive files and creds securey. It also makes it easy to access my online accounts with passkey. I’d recommend Dashlane to my family n friends."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Roly",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:10:59.000Z",
          "Titre": "Excellent product and excellent…",
          "Contenu": "Excellent product and excellent customer service. The only thing that would be better would be if they offered monthly payments for their Teams Plan so you only need to pay for what you use. But still giving them 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:46:35.000Z",
          "Titre": "Customer service is amazing",
          "Contenu": "Dashlanes manual renewal process is confusing when you’ve been on a Family plan, by default it gets you to renew with premium. Rita was very quick to refund the premium renewal and move my renewal back to the family plan"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Erik S",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:33:14.000Z",
          "Titre": "Great product that works flawlessly",
          "Contenu": "Great product that works flawlessly. Customer support is also good and was able to help out with my query."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Doug",
          "Nb_Reviews": 9,
          "Date": "2023-12-09T10:28:08.000Z",
          "Titre": "A little magic",
          "Contenu": "I recently managed to delete a bunch of passwordsI immediately let Dashline know they asked a few questions and finally rolled my Dashlane back to a time before the accident and all I well. I cannot thank you enough. Super job Dashlane!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Parnell",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:42:03.000Z",
          "Titre": "Chat excellent, email disappointment",
          "Contenu": "Asking for help with my problem using email was a dead end. I received an automatic response right away telling me they were busy and would get back to me as soon as possible.  But almost 2 weeks later, still no help. But today I presented my problem to Rita on Chat and she resolved my problem in short order. She was kind, prompt, and obviously had the expertise I needed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Laeti Mission",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:04:09.000Z",
          "Titre": "Helped changing contact email",
          "Contenu": "Helped changing contact email. easy to understand and clear process. Thank you Peter"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T01:24:13.000Z",
          "Titre": "Fantastic product",
          "Contenu": "Fantastic productI've been using Dashlane for many years, and I've never had an issue.A recent support enquiry was resolved in under an hour. The agent was very prompt and professional in attending to my issue.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blue Peak Strategies",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:31:18.000Z",
          "Titre": "It's a transactional relationship until…",
          "Contenu": "It's a transactional relationship until it isn't. Had an issue with our subscription and it was fixed by a real person. Too easy! Was pleasantly surprise because most apps nowadays don't have real people in customer service. More importantly, we've been using Dashlane for 5+ years and there's still nothing better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zachbussgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:00:32.000Z",
          "Titre": "GREAT customer service experience",
          "Contenu": "Dashlane currently (in the days prior to Thanksgiving, 2023) has a customer support team that both thoroughly verifies a customer's identity, and is patient and supportive throughout the process of regaining access to the customer's account. In my case, Manuel in particular was both clear and took as many times as needed to finally get me a three-hour, 2FA code at a time that worked best for me. Thank you for making my life easier, Dashlane! Happy Thanksgiving to your whole team."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Diana Lausch",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:17:47.000Z",
          "Titre": "Rita was able to go in and verify what…",
          "Contenu": "Rita was able to go in and verify what I was asking.  That was a relief to me and gave me much comfort."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Dihein Fernando",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T19:29:32.000Z",
          "Titre": "Extremly Good",
          "Contenu": "I have used dashlane for a year, no dataeaks,and easy to use i think everyone should use it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:05:06.000Z",
          "Titre": "We had to go back and forth a bit",
          "Contenu": "We had to go back and forth a bit, but once the rep figured out what the issue was, she was very helpful in helping me fix it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "marieurantia.org",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:52:28.000Z",
          "Titre": "Dashlane provides an easy and secure…",
          "Contenu": "Dashlane provides an easy and secure way to share passwords with colleagues who are all working remotely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike S",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T17:16:06.000Z",
          "Titre": "Customer Service is above and beyond",
          "Contenu": "Customer Service is above and beyond!  I had an issue with a certain group of passwords not showing up on Edge. Within the hour, Rita got back to me via email. It took several attempts to fix the error, but she hung in there with me.  I have been a Premium subscriber for 8 years, and get what I pay for - service that counts. Very satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SL",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:48:17.000Z",
          "Titre": "Thanks for your very good assistance",
          "Contenu": "My Representative, Rita, was very professional and helpful in answering my questions and helping me to make an informed decision on upgrading.Thanks Rita!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Blackburn",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T21:34:28.000Z",
          "Titre": "Rita sent very easy to understand &…",
          "Contenu": "Rita sent very easy to understand & complete instructions on how to correct the problem!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 4,
          "Date": "2023-11-17T12:22:09.000Z",
          "Titre": "Excellent password manager that's easy…",
          "Contenu": "Excellent password manager that's easy to use and integrates perfectly between all of my devices and operating systems (android phones & tablets / Windows PC).Following the discovery of a minor issue after a recent update, Customer Services were very quick to respond, acknowledge my query, and follow up with updates on what was occurring regarding a fix. The cause of the issue was quickly discovered and a timeframe for the fix provided via email. Just what you want from a team.Highly recommend Dashlane 👍👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "haleyrlmsn.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:23:48.000Z",
          "Titre": "had a problem with missing data",
          "Contenu": "had a problem with missing data. Submitted help request and got answer in day. Problem was resolved and data restored. Got follow-up emails from an actual person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UltimaBass",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:57:34.000Z",
          "Titre": "One of the best password managers ever.",
          "Contenu": "Fantastic app. Would be lost without it. There's so small issues where not all the passwords will automatically be added to certain password fields and the prompt will show up in text fields where I don't want them to, but other than that, I have zero issues with this password system. Absolutely would recommend to everyone."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "MartyC",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:16:46.000Z",
          "Titre": "Single user with multiple accounts (ie free and business)",
          "Contenu": "The issue affect me was that I had multiple accounts including my employers business account. This caused problems which I incorrectly blamed Dashlane for. Khet reviewed my problems and offered solutions to correct the problems.btw I didn't like using the web base chat just to be informed someone would get in touch with me a specific times. I then had to retype everything in the \"Contact us\" section. If I can't get an instant answer from the chat I'd rather not have it offered."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "PFS",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T12:34:23.000Z",
          "Titre": "Great product, great support.",
          "Contenu": "Great product. Spent a lot of time researching password managers and Dashlane came out a clear winner.  Had a minor issue when purchasing, contact the support team, issue solved in under 2 hours. Happy to recommend."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Daniel Ferrand",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:47:54.000Z",
          "Titre": "prioritize human help",
          "Contenu": "It took a long time but I think Natalia was able to solve my problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bill",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T04:59:56.000Z",
          "Titre": "For 10+ years I rave about the…",
          "Contenu": "For 10+ years I've raved about the customer service. Including this week's need, it has never been anything less than prompt, concise, understanding of the issues, able to articulate the solutions and patient guiding me through them.  Fortunately, the program is so good, i've rarely had to call on them for help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "plengfermsn.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:39:22.000Z",
          "Titre": "Rita has been extremely helpful in…",
          "Contenu": "Rita has been extremely helpful in getting an issue worked out for my using an incorrect email address.  Her patience has been above-board as well as her persistence in getting the problem solved."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Lucas",
          "Nb_Reviews": 7,
          "Date": "2023-11-08T21:58:48.000Z",
          "Titre": "Great Customer Support Team",
          "Contenu": "The level and quality of service trhat I received from your Customer Support Agents was swift. concise and helpful in all respects.  In fact they not only informed me what actions to take, but also explained why, which gave me a better undersdtanding of the overall picture. Great Service!!Great Customer Support"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "yorkiedrippinggmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T02:15:40.000Z",
          "Titre": "I had payment problem",
          "Contenu": "I had payment problem, which was partly my fault, using a wrong E mail. Rick and the team  kept me informed whilst the team traced my payment and completely resolved the matter, ensuring I was covered throughout. Excellent service from Dashlane staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Old Ski Bum",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T13:36:31.000Z",
          "Titre": "Implementing a Family Plan",
          "Contenu": "Trying to start a family plan and get my wife up and running. Instructions on the site seem ambiguous. But Rick from Customer Service walked me thru the process and even sent me detailed instructions how to get her going. Excellent job, Rick. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Ronner",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T19:28:37.000Z",
          "Titre": "Great Experience Keep It Up",
          "Contenu": "Everytime I have had a question or issue I got a response quickly and accurately to what I was working on.  Tech support is wonderful to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "None",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:18:34.000Z",
          "Titre": "You guys just nail it every time I have…",
          "Contenu": "You guys just nail it every time I have a question"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AK",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:02:18.000Z",
          "Titre": "P ayment method…",
          "Contenu": "I had question about payment method change process. Rick sent me a detailed email clarifying payment method process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vito Valentini",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T20:36:57.000Z",
          "Titre": "Dashlane tech support was great!",
          "Contenu": "I appreciated that someone was available almost immediately, they walked me through a straightforward resolution in a polite, friendly and knowledgeable manner through to the end point."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bindi",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T21:15:28.000Z",
          "Titre": "Switched my account from personal to a…",
          "Contenu": "Switched my account from personal to a company account. Nathália and Khetelin made the whole process seemless. I even got a partial credit on my personal account. perfect, thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julian",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:43:46.000Z",
          "Titre": "Good Customer Service and Security",
          "Contenu": "I had a minor panic when I was no longer able to access my account email and lost access to years worth of passwords.  The entire team responding through the live chat answered my constant questions, and had my issue resolved quickly and securely. I will agree with other reviews that the bot is garbage, but once you get a live agent everything changes."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Johan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:24:46.000Z",
          "Titre": "Quick turnaround and clear instructions…",
          "Contenu": "Quick turnaround and clear instructions to address issues."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "bucicimacigmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:00:44.000Z",
          "Titre": "Fast and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Taschetti",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T15:37:11.000Z",
          "Titre": "Great product; Great Support.",
          "Contenu": "I've been using Dashlane for several years and can't imagine my digital life without it.  It makes my logins secure and convenient at the same time.  I've also used their tech support a few times and they have always been helpful and prompt.  It's tech support that actually works!  Imagine that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SCA",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T21:08:13.000Z",
          "Titre": "timeng the…",
          "Contenu": "DASHLANE is the best password managerI spent a lot of time researching the web for the best free password managers.  I tried several, didn't care for one or more of their features....until I tried Dashlane.  Right away, I loved it!  Easy to set up and use, trust the encryption, like the dark web monitoring.  I'm telling everyone about Dashlane.  They're really liking it, too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moira Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T20:19:28.000Z",
          "Titre": "Fernanda was patient and helpful!",
          "Contenu": "Fernanda was extremely helpful and a clear communicator..  She was prompt with her responses to my problem and didn't leave me hanging for days and days.  Very good customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Knibbs",
          "Nb_Reviews": 6,
          "Date": "2023-10-02T23:10:32.000Z",
          "Titre": "Best in Class (tried most of 'em)",
          "Contenu": "I have used most of the password managers and this and LastPass are the most featured and robust.  The interface in Dashlane is simpler and my family likes it the best.   Categories and shared family accounts make it the most flexible.   Now have unique and long passwords for every account - no more duplicates.   Random generator is simplest"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Marian O 'Halloran",
          "Nb_Reviews": 8,
          "Date": "2023-11-07T01:04:03.000Z",
          "Titre": "I was locked out of my Dashlane…",
          "Contenu": "I was locked out of my Dashlane account.Both reps I spoke to online from Dashlane customer support were very helpful.They resolved my problem for me for which I am very grateful."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Ahnaf Tajwar",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:33:25.000Z",
          "Titre": "I loved the warm tone of the person…",
          "Contenu": "I loved the warm tone of the person (Peter) assigned to my case. I won't cut any stars for this, but I do believe that the replies were a bit more delayed compared to the 10-12 cases of email support I've experienced. This aspect might have some room for improvement."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T00:03:29.000Z",
          "Titre": "Having forgotten my Master Password",
          "Contenu": "Having forgotten my Master Password, I thought all was lost. There were some Secure Notes entered that I could not obtain elsewhere. With a lot of help from Diogo, my access was resurrected and I have now created backups and a recovery option for anything in the future. I am totally grateful for the assistance received, thank you."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "accounts",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T14:15:09.000Z",
          "Titre": "Great Support Team",
          "Contenu": "I found myself in a technical jam and the support provided was outstanding. Step by step instructions were provided and my problem was resolved quickly. There is nothing better than a good support team! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T20:08:49.000Z",
          "Titre": "Dashlane Help solved my login problem…",
          "Contenu": "I was suddenly unable to log into Dashlane because it wouldn't accept my Master Password on my iMac. Went through all the standard steps to fix the problem and nothing worked. I contacted Dashlane Help online and they were able to diagnose the problem and direct me through a solution. Very prompt response and clear instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin J. Meade",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T20:27:51.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Contacted Customer Service regarding a problem with the Auto-Fill feature and received a prompt response. Two days later I received a follow-up email tosee if everything was still OK. Great Customer Service."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ashish Nehra",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:17:42.000Z",
          "Titre": "Best password manager.",
          "Contenu": "The seamless password storing, it's customizable password generator and autofill option is also works good.But sometimes when filing some forms online, I don't neer dashlane for the visit, but that option doesn't work well each time, it would be good if the team improve it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "zsuzsannaklaracsehgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:36:52.000Z",
          "Titre": "Difficult",
          "Contenu": "Was pretty complicated to connect with real person.Deletion of account was easy when I was able to connect with a person via email."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Dado",
          "Nb_Reviews": 7,
          "Date": "2023-10-11T19:53:09.000Z",
          "Titre": "Dashlane helped me again, many thanks",
          "Contenu": "Dashlane is one of the best PW Manager I have ever used. Probably the best one in my humble opinion. Everytime I have needed their support, they replied in a matter of seconds, literally.This time everything was done professionally by one of their support team members and the help was there in a blink of an eye.I will continue on using the hopefully for a long long time.Thank you for helping me Dashlane, keep it up."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:21:51.000Z",
          "Titre": "Rapid response to my inquiry",
          "Contenu": "Rapid response to my inquiry, Peter understood exactly what i needed and gave me good instruction as to how to fix my problem. He restored my trust in Dashlane. Excellent service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sanghyun.kimmanna.church",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:04:58.000Z",
          "Titre": "Client support was great",
          "Contenu": "Client support was great! My issues were solved in very professional manner."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "NancyMc",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:49:11.000Z",
          "Titre": "Rick’s response was fast and accurate",
          "Contenu": "Rick’s response was fast and accurate.  I’ve been with Dashlane for 8 years and have only had one negative experience that cost me $68. Rick renewed my faith in Dashlane’s support. Thank you, Rick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Monk",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:57:38.000Z",
          "Titre": "A reliable tool, safely and easily handling my passwords",
          "Contenu": "I have used Dashlane since it's early days, thanks to a positive review in PC Magazine, and it has lived up to it's early reputation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KenC",
          "Nb_Reviews": 6,
          "Date": "2023-11-26T18:02:24.000Z",
          "Titre": "Customer Service replied with…few ways to try",
          "Contenu": "Customer Service replied with suggestions of how to resolve my problem and did follow up to make sure the problem was resolved."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil Flash",
          "Nb_Reviews": 22,
          "Date": "2023-11-04T18:18:08.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great product but more importantly, great (and speedy) customer service in resolving a recent billing issue.  Thank you, Rita!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Colin Williams",
          "Nb_Reviews": 14,
          "Date": "2023-11-23T19:02:00.000Z",
          "Titre": "A full and clear explanation",
          "Contenu": "I got a clear and full explanation for my query.they explained it so well I only needed the one response to answer my query"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Lucioni",
          "Nb_Reviews": 24,
          "Date": "2023-10-03T17:19:45.000Z",
          "Titre": "A Great help!",
          "Contenu": "I love this app. It's well-worth buying the paid version so you can access Dashlane across PC, tablet and phone. When I had a problem they were able to fix it (via email) very quickly - within 24 hours - but I reckon it would have been quicker had I been at my laptop and not at work......."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Lars",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T01:07:39.000Z",
          "Titre": "Dashlane is an outstanding password manager",
          "Contenu": "Dashlane is an outstanding password manager! Its user-friendly interface and robust security features make managing and securing my passwords a breeze. I love how it simplifies my online life and provides peace of mind. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Julius Gabel Nørgaard",
          "Nb_Reviews": 14,
          "Date": "2023-10-18T10:09:21.000Z",
          "Titre": "Safe and secure password manager",
          "Contenu": "We use Dashlane in COPUS and haven't had any issues with it so far. We are happy about the ease of use, the security, and the fair pricing. The customer service has also been helpful when needed."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "juttafingergmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T09:38:45.000Z",
          "Titre": "problem with password",
          "Contenu": "I got a very fast response and it was easy to follow. Now my problem is solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Andriaschko",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T04:53:34.000Z",
          "Titre": "Great Service",
          "Contenu": "Solved my problem in a timely manner.Changed from a free version to premium after using Dashlane for quite a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cookiemom88",
          "Nb_Reviews": 5,
          "Date": "2023-11-03T20:54:25.000Z",
          "Titre": "Fast professional response with very…",
          "Contenu": "Fast professional response with very specific directions that helped me get my challenge worked out quickly. Love Dashlane… fantastic product!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry T",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T00:04:20.000Z",
          "Titre": "Great customer support!",
          "Contenu": "I reported a bug with Dashlane launching in Microsoft Edge.  Manuel from Dashlane's Customer Support responded within 24 hours with a personized message that described the issue and how he resolved it for me.  I was delighted with my recent experience!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T21:37:14.000Z",
          "Titre": "I received Prompt accurate advice to…",
          "Contenu": "I received Prompt accurate advice to resolve a corrupted iPhone installation of the app.  It is service like this that makes paying a subscription for the app worthwhile.  Thanks Rita for your assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clancy",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:21:35.000Z",
          "Titre": "Just added my wife!",
          "Contenu": "Been using Dashlane for a few years - game changer!  First it was to capture all my passwords, This year it has been about cleaning up old stuff and closing down things no longer in use.  Great tool!  Got my wife on it now with the family plan - she is loving it too!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "prashant.mohitests.in",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T12:51:05.000Z",
          "Titre": "Dashlane Support!!",
          "Contenu": "A quick and relevant reply is all that is expected and Dashlane support team does the job. Thank you for your understanding and support. Wish you guys a bright future ahead!!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "M. ROBET Tristan",
          "Nb_Reviews": 8,
          "Date": "2023-10-02T18:51:44.000Z",
          "Titre": "Have different complex passwords for…",
          "Contenu": "Have different complex passwords for each web site, only Dashlane can give u this.Free for life for me cause I was an early adopter."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Izengard",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:16:10.000Z",
          "Titre": "Dashlane does not abandon users",
          "Contenu": "Dashlane understands perfectly well that not all residents of Russia are involved in the current situation and do not abandon their users, even despite the difficulties in making payments. I am very grateful for this service and will continue to use it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jtswitchoutlook.com",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T01:10:47.000Z",
          "Titre": "The company dashlane helped me with…",
          "Contenu": "The company dashlane helped me with something that I feel I should have known but honestly who could have known what I didn’t unless you work for the company thx Dashlane for your helping hand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 4,
          "Date": "2023-09-11T23:37:32.000Z",
          "Titre": "Dashlane is a great resource for our Company!",
          "Contenu": "Dashlane is a great resource for our company to ensure passwords are strong, not reused, and are easily shared with teams if need be.Email support is easy and prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary T.",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T17:47:38.000Z",
          "Titre": "I used the chat feature",
          "Contenu": "I used the chat feature.  Gota person almost immediately and got an answer that worked the first time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "arfsi-ky.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:30:15.000Z",
          "Titre": "Very Happy",
          "Contenu": "They replied to my emails within minutes, rather than days like some companies.  They made sure I got the issue resolved."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Wilfred IJsveld",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T16:56:36.000Z",
          "Titre": "It works like a charm and Support is…",
          "Contenu": "It works like a charm and Support is very fast and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KT",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T13:53:19.000Z",
          "Titre": "Exemplary.",
          "Contenu": "Prompt response with to the point clarification and suggestions for optional strategies when Dashlane stops offering FREE accounts.  I wish they would continue to offer FREE accounts, though!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "APP Tech",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T20:58:11.000Z",
          "Titre": "Reached out for updated Soc 2 security…",
          "Contenu": "Reached out for updated Soc 2 security documents.  Your support team directed me right to the documents needed and the review/process was easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:58:06.000Z",
          "Titre": "Agent Peter was great",
          "Contenu": "Peter, the agent that responded to my request was polite, professional and direct. He resolved my issue successfully and in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "psoltanoffgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T14:32:17.000Z",
          "Titre": "I had a problem with the Dashlane…",
          "Contenu": "I had a problem with the Dashlane software. It went on for a long time. Consequently, I was wavering in my commitment to Dashlane until I had a chance to work with them. They proved to be a first rate team. As a result I'm sticking with the company. Bravo to all team members!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lenacleriogmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T00:48:18.000Z",
          "Titre": "Quick reponse to support need...",
          "Contenu": "Emails to support were answered fairly quickly. First fix didn't work, second fix worked perfectly. The details of each fix were clearly defined and easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "charles.daigneaultvideotron.ca",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T23:08:06.000Z",
          "Titre": "excellent customer support",
          "Contenu": "excellent customer support, the problem was resolved as soon as Elma was made aware of the situation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Harwell",
          "Nb_Reviews": 6,
          "Date": "2023-11-10T12:55:52.000Z",
          "Titre": "The team at Dashlane are always so…",
          "Contenu": "The team at Dashlane are always so helpful.  I had a problem and there were able to resolve it quickly."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Armin",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T14:05:22.000Z",
          "Titre": "Best support ever",
          "Contenu": "Absolutely loved their support, lifesavers; one night I logged out of all accounts on my phone, when I went to login to Dashlane and get my passwords it asked me for an OTP code sent to my email, well I had logged out of my email as well and its password was stored in Dashlane, no way to login; if it wasn't because of the fast, nice and friendly support they provide I would have lost access to every single account I have and would have had to register new accounts most probably. Thank you for such a great support Dashlane!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "compartido.exceltisgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:15:50.000Z",
          "Titre": "Efficiency and speed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alisia Prince",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:28:54.000Z",
          "Titre": "The guys were very helpful …",
          "Contenu": "The guys were very helpful and patient with my delays and mistakes."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "webdev.glebgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:42:15.000Z",
          "Titre": "The company is doing a great job",
          "Contenu": "The company is doing a great job. Thanks to their efficient work, they have saved me a lot of time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Damian O'Neill",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T14:34:53.000Z",
          "Titre": "Had an issue with Premium renewal which…",
          "Contenu": "Had an issue with Premium renewal which was quickly sorted, and they gave me an extra month free for the inconvenience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy Lawing",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T16:45:34.000Z",
          "Titre": "Nathalia was prompt and very helpful",
          "Contenu": "Nathalia was prompt and very helpful.   Her solution fixed my problems on the very first attempt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:14:07.000Z",
          "Titre": "Peter was a fantastic help in solving…",
          "Contenu": "Peter was a fantastic help in solving my login issue. Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T00:05:16.000Z",
          "Titre": "Love Dashlane",
          "Contenu": "Love Dashlane. So easy to have all my passwords handy whenever I need them. Had a problem with my iphone Dashlane, and their very helpful tech support got it fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T16:29:16.000Z",
          "Titre": "I wish all customer service reps were…",
          "Contenu": "I wish all customer service reps were as responsive and clear in their responses as my experience here. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:49:11.000Z",
          "Titre": "Good Software, very good support!",
          "Contenu": "I continued after my first year of using it, dont want to miss it. Very fast and kind support - like it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jena.rhoneshieldbanking.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:13:48.000Z",
          "Titre": "friendly response and instructions…",
          "Contenu": "friendly response and instructions provided were easy to follow and fixed the issue I was experiencing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rndlmorrisgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:21:56.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Customer service responded quickly and resolved my issue."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "klant",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T08:53:09.000Z",
          "Titre": "Experienced a problem importing data…",
          "Contenu": "Experienced a problem importing data into Dashlane and the support team was quick to identify the issue and resolve it for me - top notch"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robbie",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:20:33.000Z",
          "Titre": "Works well",
          "Contenu": "Although I currently use Dashlane for business and personal passwords because it is the tool of choice for the company - I would personally recommend it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert Watson",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T18:50:49.000Z",
          "Titre": "Access issue",
          "Contenu": "Response was. Very helpful and resolved my issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gvpilot",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T21:24:13.000Z",
          "Titre": "Woks well.",
          "Contenu": "Works well, does far better than my old method of keeping passwords safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane Deike",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T17:25:02.000Z",
          "Titre": "Life Saver for sure",
          "Contenu": "Life Saver for sure.  No matter where I am I can get the passwords and information I need.  I have EVERYTHING in there.  It is my one stop shop for always having the info I need!!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T16:52:41.000Z",
          "Titre": "Solutions",
          "Contenu": "Got the help I needed thanks to the customer service team you proposed various options which resolved the incidence satisfactorily"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue R",
          "Nb_Reviews": 7,
          "Date": "2023-09-11T21:18:41.000Z",
          "Titre": "GREAT Dashlane tech support!",
          "Contenu": "Dashlane customer support and tech support helped me out of a jam!  They were understanding, responsive, and helpful, with excellent communication that was easy for me to follow.  MANY thanks for the great support I received recovering my Dashlane file!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "ahsaniqbalgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T13:27:31.000Z",
          "Titre": "I highly recommend to all of you download DASHLANE and enjoy. Don't need to remember multiple passwords DASHLANE will remember.",
          "Contenu": "it's  very important that I am telling what happened with me?I accidentally reset my phone on 22-09-2023. Problem is when I set up my phone I forgot my gmail password and I did not put any recovery email or phone number Google cannot recover my account I tried multiple times but Google not accept my request my all the passwords are safe in DASHLANE mobile app I download DASHLANE from Chrome and try to login but DASHLANE send email on my Gmail which I don't have then I request to dash and recover my account I put all detail to my account and today DASHLANE successfully recover my account I am so happy because my all contact safe in my Google account and google accounts password safe in DASHLANE."
        }
      ]
    }
  ]
}