{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.redragonshop.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Muhammad Ismail",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:58:46.000Z",
          "Titre": "Customer service and shipping is bad",
          "Contenu": "Customer service is bad. Not that they don't tell you stuff. But thay have such long replying time. But product looks good. And don't trust the time that it takes for it to arrive it told me that it would take 5 to 7 business days but it did not come then thay told me it would come 2 days late but I am on the 3rd day and it is still not here."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Torikul Islam",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T06:40:07.000Z",
          "Titre": "Don't waste your money",
          "Contenu": "Don't waste your money. I'm getting lots of bad experiences with this keyboard. \"Redragon K618 HORUS Wireless RGB Ultra\"When I write sometimes it auto press the keys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iury Brandao",
          "Nb_Reviews": 3,
          "Date": "2022-12-15T23:23:05.000Z",
          "Titre": "Horrible bought 2 times and 2 times I…",
          "Contenu": "Horrible bought 2 times and 2 times I had a problem, costumer service just respond when they want and don’t even try buying the mistery took them almost 3 weeks just to give me a code instead of the an actual box and all my friends got the same code I guess that was the mistery"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam Russell",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T02:51:08.000Z",
          "Titre": "Unreliable Service",
          "Contenu": "I ordered a mouse over 2 weeks ago and it was \"delivered.\" I've tracked the packing all the way to Las Vegas, Nevada, but then suddenly the email updates me saying it was delivered on the 18th at 8pm to my address in Washington. Well, it didn't, and I'm sure it's still somewhere lost in Vegas.I've already tried contacting your customer support with no answer. I also have not received a refund for a product that has obviously never arrived."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Paul Nguyen",
          "Nb_Reviews": 2,
          "Date": "2020-05-11T21:23:35.000Z",
          "Titre": "Untrustworthy",
          "Contenu": "I agree the covid19 causes the delivery delay but I can't accepted what lied to me.I ordered and paid on 28 April. They didn't do any things until I contacted them on 8 May, 10 days later and they started processing my order.  However, they shipped it from mainland China instead USA where I paid for shipment fee USA to Australia. Scam!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie S",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T01:31:28.000Z",
          "Titre": "Horrible. Do Not Reccomend.",
          "Contenu": "Bought some speakers brand new directly from the Redragon website. After 9 days of owning the speakers, they completely stopped working altogether. No sound at all.I did some research and saw that this sort of thing happens a lot with their speakers.Too late to return now due to their 7 day return policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mcclanahan Michael",
          "Nb_Reviews": 1,
          "Date": "2020-05-02T00:35:16.000Z",
          "Titre": "Havent received my item.said would be…",
          "Contenu": "Havent received my item.said would be here by 8pm today..its almost 9pm and nothing.very dissapointed.last order came no problem.should get a discount or something for my waiting."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Abdul Khan",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T12:01:53.000Z",
          "Titre": "I did not receive the item",
          "Contenu": "I did not receive the item, it was redirected back to the shipper"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pog champ",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T04:57:18.000Z",
          "Titre": "My package was at a police station for…",
          "Contenu": "My package was at a police station for 8 days"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sly Da Baby",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T18:49:02.000Z",
          "Titre": "Product did not work well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chase Carlan",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T20:15:54.000Z",
          "Titre": "shop with ease",
          "Contenu": "Very simple and easy to use"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Cruz",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T16:26:41.000Z",
          "Titre": "doesn’t even work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chase",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T17:21:46.000Z",
          "Titre": "Nothing Special",
          "Contenu": "You get what you pay for, its nothing special."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "- -",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T01:59:14.000Z",
          "Titre": "Get your Redragon on Amazon.",
          "Contenu": "Im sure ill love the keyboard, but i dont understand why i never got a timely reply and then a jump to hey you got 1 day shipping just to make things \"right\". The stress wasnt worth it to me either ways. Ended up ordering another one on eBay that i hope i was able to cancel on time. Moral of the story AVOID their online store, and get your Redragon products on Amazon, were you will get it in 2 - 3 days with out any need of writing a bad review to get their attention and get them to make things right. Redragon needs a live chat on their website and need to do better about notifying customers that packaging may take a prolong amount of time, and the covid excuse isnt working on anyone anymore."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2021-03-19T00:12:44.000Z",
          "Titre": "Refused to accept warranty.",
          "Contenu": "Ordered a new headset, the H510 Zues, brand new off ebay.Unlike MSI, who is fine with replacing something resold as long as the model number is fine, Reddragon didn't like that. Refused to even replace the mic, which is the only issue it had.$50 down the drain."
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "Milk IS LIFE",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T13:59:22.000Z",
          "Titre": "It took more than a month",
          "Contenu": "I made my order for a mouse on 27 April. Up to this day it still hasn't arrived, after something more than 40 days"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Drago",
          "Nb_Reviews": 6,
          "Date": "2021-04-17T15:23:25.000Z",
          "Titre": "I love their products",
          "Contenu": "I love their products, but RGB doesn't synchronize to ASUS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Louis",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:47:08.000Z",
          "Titre": "Good keyboard, but arrived defective.",
          "Contenu": "The keyboard itself is very good, however it did arrive with a defect.  The ‘J’ key is a bit depressed and not quite as level with all of the other keys.  It doesn’t affect typing or anything but things like this shouldn’t be happening out of the box.  I’ll try removing it and placing it back in later to see if that solves the issue."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tristyn",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T23:07:57.000Z",
          "Titre": "Great Products but Non Existent Support",
          "Contenu": "Red Dragon creates great products as I have used 2 of their mice so far and loved them!The only issue I have with them is their customer support.3 months ago I reached out regarding a question about their software. I sent another email a month later since they never got back to me. Like I said, its been over 3 months now and I have yet to hear anything from Red Dragon's support team.After 3 months of not hearing anything from the support team, especially after my follow up email, it's safe to assume I will not be getting an answer and they do not have a support team."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T Dog",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T06:18:12.000Z",
          "Titre": "I don't know why you guys don't have a…",
          "Contenu": "I don't know why you guys don't have a phone system and only a emailing one but even so you guys were very slow to write back to me everytime I emailed you (1-2 days). The only reason it's a 3/5 is because of how good your quality is in manufacturing."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "sarah banu",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T11:47:38.000Z",
          "Titre": "I just got my new impact elite m913…",
          "Contenu": "I just got my new impact elite m913 mouse , the delivery was fast and everything else was fast , mouse was good just that the life battery span is dissapointing . Every night before i go to sleep , i'd charge the mouse yet it charged only up to 70% not even full.. not only that , it drains so easily. It might be my mouse battery problem but otherwise quality standard everything is perfect.Update : Customer service was fast and i am happy they helped me out with my problem. Top notch customer service, kudos to staff."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sonya",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T05:06:18.000Z",
          "Titre": "I was concerned how this page uses…",
          "Contenu": "I was concerned how this page uses paypal to process payments on orders because my card was charged several times. Regarding my order it was shipped in 3 seperate packages instead of 1. When I asked the customer service representative he stated it was due to inventory. Overally not very satisfied."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn Edin",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T22:03:54.000Z",
          "Titre": "It’s a good quality mouse",
          "Contenu": "It’s a good quality mouse . I bought it because I thought the number buttons were programmable . But they are not . They are just mapped to the number keys on the keyboard. I needed a mouse with multiple programmable buttons. Due to a handicap. I only have one hand . I have to use different software to do this . It’s my fault for not asking I guess . Looks cool . But that’s really the extent of it. I thank you for your reply but since i bought the m908 mouse and not a key board i. your reply does not help me much thank you anyway ."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Dragoonkfire",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T13:59:15.000Z",
          "Titre": "about the ares headphones",
          "Contenu": "i bought my ares headphones 1 month ago and its alredy damaged,even tough i treat it well,im very dissapointed because i like the other products."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Rasmus Speich",
          "Nb_Reviews": 3,
          "Date": "2020-04-22T13:13:31.000Z",
          "Titre": "They sent me a used broken mouse that…",
          "Contenu": "They sent me a used broken mouse that barely reassembles what i bought. They litterally scammed me for 20 dollars.Update: got a refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Picklesimer",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T20:14:45.000Z",
          "Titre": "Only half of my order came in when it…",
          "Contenu": "Only half of my order came in when it was supposed to be a package"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Joaquin Goossens",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T06:14:18.000Z",
          "Titre": "The Products are the best",
          "Contenu": "The Products are the best, but the shipping time is horrible."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Akshay Chandra",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T14:36:24.000Z",
          "Titre": "It's been 13 days and still havent…",
          "Contenu": "It's been 13 days and still havent received my order"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Pouri",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T15:46:52.000Z",
          "Titre": "Great product but 1 con",
          "Contenu": "I’m giving it a 4 because I have one problem with the headphones and it’s if you’re wearing glasses it is going to hurt because the headphones are really tight against your ears it pushes the glasses into your head and it gets painful over time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Inky",
          "Nb_Reviews": 7,
          "Date": "2023-04-02T07:00:10.000Z",
          "Titre": "Ill admit I'm impressed..",
          "Contenu": "So far, I've bought three keyboards, and a super wide mousepad from this brand. Although I didn't purchase it online I had bought it all on sale through a retailer.I got 2 compact mechanical keyboards with brown switches and another full sized with red switches, all for around 40-60 FULLY WIRELESS!! Although I had an issue with the first unit I bought, I'm almost sure it was because I had dropped the keyboard from a high surface.Right out of the box, the feel, build quality, and over all aesthetics just jump. It feels like a premium built $120+. The lighting effects, however, are very lacking. The model I bought only comes with a few pre programmed light modes, but hey for this price id happily give that up.I think I definitely would try their other products, if your looking for something nice and affordable consider this brand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wockheals",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T12:09:27.000Z",
          "Titre": "My experience with redragon…",
          "Contenu": "My experience with redragon actually went really well, they have very good costumer service and make sure your satisfied with your order. At first i didn’t really know about redragon and i thought it was kind of sketchy but no it’s the complete opposite. I will for sure keep shopping with redragon in the future. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ramandeep Singh Sandhu",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T14:35:33.000Z",
          "Titre": "Warranty Scam",
          "Contenu": "I bought fizz k617 (red keys) from Redragon.in indian website of redragon around 8 months ago now around 5 of keys started malfunctioning and i contacted support for replacement and they said keys are considered a accessory and only have 6 months of warranty and there was no mention of this on their website, website says 1 year of warranty.I have contacted them but they said keys are considered as a accessory and only 6 month warranty on that"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Mastro",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T20:11:31.000Z",
          "Titre": "Hard to beat for the price",
          "Contenu": "Shipping was a tad slow, but the Horus Keyboard is a fantastic replacement for my old logitech, and hard to find any faults for the price.The speakers were simply too good to pass up, and can fit a lot of configurations for any desktop. The cable could have been longer, but that's an easy problem to fix.The Horus is a great keyboard for a secondary PC or to connect to other devices you'd want to use a keyboard with. It's very lightweight and compact while still being a full keyboard with useful macros.While I was able to find replacement key switches on another site for the Horus, I'd appreciate it far more if they were sold directly on Redragon, or there was a link to them. I'd like to be able to switch them out.The charging light for when it's plugged in is a bit too bright as well for my tastes.However... these are the only real complaints I have, and all of them can be addressed.I'd recommend Redragon to anyone who's looking to get nice PC accessories at an entry level price without sacrificing quality or functionality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Senjak",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T18:52:03.000Z",
          "Titre": "Product replaced under Warranty.",
          "Contenu": "Product seems to have a mechanical issue. Some troubleshooting was attempted but they then simply replaced the product under Warranty.After the initial support request, my Yahoo mail stopped receiving support agent responses, even automated ones, and I had to reach out with an alternate email to complete the support process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Chen",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T19:00:34.000Z",
          "Titre": "Noctis 632 and Taipan 810",
          "Contenu": "Good products and customer service. I ordered the Invader Pro 719 wireless to replaced the wired invader mouse I currently have, and bought the Noctis K632 along with it because I wanted to try a 60% keyboard.The order was placed but I soon received an email telling me the Pro 719 was out of stock. I was offered to wait until it's in stock, cancel the mouse order, or exchange it for the Taipan Pro M810. I chose to exchange it. I had to pay the difference of $3.24 for the other mouse, which I thought was a little strange, because it's supposed to be an exchange, but whatever. The mouse arrived a little later than the keyboard because of the exchange.When I got the keyboard, I was a little confused because the box says Horus Mini Pro instead of Noctis 632, but the product is the same as the keyboard I ordered. It took me a minute to figure out how to switch between connection modes (you use the fn key and q-t) and how the fn2 key worked because there were no instructions. I also had to look up how the macro keys worked, and am disappointed that the G1-G4 keys can't be assigned macros from the keyboard software, but that wasn't the main reason I got the keyboard so it's not a dealbreaker. There's another button with a speaker/sun icon which I'm still not sure what it does, or what all of the fn2 keys do, but I'm very happy with how the keyboard feels and types.I haven't used the mouse a lot yet, but well, it's a mouse. There's not much to say. It works, I can adjust the DPI and lighting and set macros."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Mandy Carolina",
          "Nb_Reviews": 5,
          "Date": "2022-06-25T17:51:48.000Z",
          "Titre": "Best customer service ever",
          "Contenu": "A mouse that had been in my possession for a few months suddenly broke down, unsure why since I take good care of my items. My first mouse that I received was broken from the start but got sent a new one by customer service immediately, but now this one broke too. Erin from customer service was once again incredibly helpful to figure my problem out, but once we came to the conclusion that it wasn't fixable, I was offered solutions to compensate for my broken item. So unfortunately I had two items that didn't work well/were broken, but in the end I was offered so many solutions and help that I am still a happy customer and will definitely return in the future if I'm ever in need of more items for my gaming setup. I have other items from them that do work incredibly well, so I might have just gotten some bad luck with my mice."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "gangnam style man",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T02:40:58.000Z",
          "Titre": "it's a good brand but...",
          "Contenu": "it's a good brand, for sure, just most of the stuff breaks quite easily (just played with a redragon saturn for 1 - 2 months before it played, never dropped, never did anything, suddenly the analog stick completely stopped working)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jieyang Chong",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T17:23:07.000Z",
          "Titre": "Very good after-sales service",
          "Contenu": "Customer service gets 4.5 to 5 stars.5 stars to Carrie, who attended to my issue swiftly, effectively, and very politely.Probably 3 stars to the person who responded prior to Carrie, as I have reason to believe that I was given incorrect information, although I am sure it was not deliberate or malicious.I purchased a keyboard. About 4 months later, one of the keys was faulty. I contacted customer service and was informed that the switch is hot-swappable.Carrie stepped in, offered me a replacement since it was still under warranty (different model since there was no stock of my model), and had it all done very swiftly. I was charged a bit for delivery, but for some reason I took no issue with that.Later on,  I tried to remove the key switches on the faulty keyboard for practice since it was meant to be discarded anyway. I ended up breaking the switch. There was no indication anywhere that the switches could be removed, and I subsequently found a thread on reddit suggesting that this was not possible.Anyway, long story short: I have a working keyboard now with no fuss and lots of good communication with Carrie."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Epi P. goomag",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T17:30:23.000Z",
          "Titre": "Overall happy with the after-sale service",
          "Contenu": "They reply to every email I sent and have resolved my issue. A live chat would have been easier and faster but overall, I'm happy with how they handled my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "grady",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T17:50:32.000Z",
          "Titre": "keyboard",
          "Contenu": "my caps lock button sometimes reverses so when caps lock is off it’s on and when it’s on it’s off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "connor dixon",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T23:47:58.000Z",
          "Titre": "pretty good keyboard glitches a bit…",
          "Contenu": "pretty good keyboard glitches a bit when unplugged overall good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T07:19:28.000Z",
          "Titre": "Good service",
          "Contenu": "5 stars for the customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jj Hannaford",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T21:05:22.000Z",
          "Titre": "Great for the pricepoint!",
          "Contenu": "Considering the general price of everything, overall great quality.  Speakers have a bit of a ting and funky sound to them when at full volume, but not nearly enough to be bothersome.  Great for the price point.  I have redragon headphones and a keyboard as well, both of which are great quality.  Looking forward to buying a mouse sometime in the future as well."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Tomáš Eisner",
          "Nb_Reviews": 4,
          "Date": "2021-11-30T12:54:15.000Z",
          "Titre": "Product is great",
          "Contenu": "Product is awesome, the only pitty was that I ordered a product that was in stock - and then was told they were not able to send it earlier than in one month time. Once I replied to that email stating that it was supposed to be in stock, the support guy arranged a shipping from china, that took about 4 days so I got it in time, even though it came from a different warehouse. Overall very satisfied. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "Nestor Vladimir Rosario Tavare",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T12:51:17.000Z",
          "Titre": "Undoubtedly very good products",
          "Contenu": "Undoubtedly very good products, I have no complaints about the mouse so far, the zeus h510 very good indeed but they have the detail that the adapter to connect it directly to the pc does not work well and as for the excellent keyboard but 3 keys did not work which had solution since it comes with more suiches ... just for those little details I give it 4 stars but 100% recommended if new ones are bought. I bought them used and for the price it is wonderful."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Bente Pernot",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T10:22:09.000Z",
          "Titre": "K530 White - Customer Service",
          "Contenu": "I ordered a k530 White 60% keyboard. I received said order within 5 days, which was well within the aforementioned shipping time. My Bluetooth option didn't work, so I contacted Redragon Customer Service. Within 24 hours I had a response and within the week another completely free replacement was sent my way! The people who reached out to me were polite and helped me with every question I had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "summer",
          "Nb_Reviews": 2,
          "Date": "2022-02-10T07:38:43.000Z",
          "Titre": "Great Company",
          "Contenu": "I purchased the H510 Zeus in Pink and white. First of all, the quality of the headset blew me away for the price point. The ear cushions are so soft, the headband fits just right, and it’s super cute. Only downside for me is that to control the mic volume and muting, you have to use pc or buy an adapter from somewhere else. Wish they’d include that attachment in the box. The website was easy and payment was securely made through PayPal. I ordered my headset over the weekend and received them today in perfect condition. Will definitely be using redragon in the future for gaming necessities."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittany Rogers",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T02:17:09.000Z",
          "Titre": "The product itself is fine so far",
          "Contenu": "The product itself is fine so far, but I never received an item discount code when I put in my email address, and the first week after ordering there hadn't been an update on the shipping information, just said the shipping label was created. I never received text message updates that I signed up for either.Edit: The customer support for Redragon shop is very responsive, which is a huge plus. Hopefully there won't be shipping issues with any future orders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackson Weinberg",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T02:18:00.000Z",
          "Titre": "I recently bought a mouse from your…",
          "Contenu": "I recently bought a mouse from your store, so far it’s fantastic! I also ordered a pair of headphones a few days ago, I’m waiting for those to arrive and I’m really excited for when I get to try them out. Unfortunately the P015 mousepad that I want is still out of stock. I could just look for a mousepad on a different site, buuut this one looks sick, and I love your products, so I’ll just wait patiently for new stock. :3"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aamin Withrow-Davis",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T18:47:19.000Z",
          "Titre": "The Draconic K530 is great but not perfect.",
          "Contenu": "I recently brought the Draconic K530. Great purchase, shipping was fast. But I would like to see more switch options. It’s only hotswappable with outemu switches. Plus, I would like to see more options within the software, as of now it’s pretty basic. The software should allow for more customization. Despite those few grievances I have with the Draconic K530 is a solid keyboard. Definitely would recommend to anyone who likes 60% keyboards and are just beginning to step into the world of keyboards."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jamie Woodall",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T05:31:27.000Z",
          "Titre": "My son LOVES his new keyboard",
          "Contenu": "My son LOVES his new keyboard! It lights up in the most amazing ways and it has been very easy for him to learn how to create the different settings. We received a notice that it had been delivered before it had actually arrived but we think that was more related to the courier company than Redragonshop. The item itself is fantastic!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joey Trudel",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T15:48:03.000Z",
          "Titre": "Why it's 4 stars",
          "Contenu": "I ordered a keyboard and mouse for gaming along with a head set the keyboard and mouse worked great but the headsets microphone stopped working 20 minutes after using it and my keyboard came and its box had rips and tears all over it other than that great quality."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Joost de Jager",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T09:21:47.000Z",
          "Titre": "Redragon makes really solid products…",
          "Contenu": "Redragon makes really solid products for a good price.The only thing I don't like about Redragon is their shipping,I have an order on the way right now, but when I ordered it,their website stated that I would have it before january 9th, but it is still not here. But overall really good products, and especially great customer service!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Eline",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T23:04:34.000Z",
          "Titre": "Customer service",
          "Contenu": "I bought a keyboard that I liked because of a friend that has one. It arrived pretty fast, but I received 2 instead of 1 (I only paid for 1). Thank to the great customer service was I able to find a solution.I would definitely buy for them again."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "MiSH",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T01:17:41.000Z",
          "Titre": "Redragon Aryaman RGB",
          "Contenu": "Was given a Aryaman RGB keyboard as a gift, is a fantastic mechanical keyboard for its price, enhanced my gaming experience a lot more. Would definitely recommend this for those looking for an affordable but quality keyboard for gaming and productivity :)"
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Roberts",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T10:11:56.000Z",
          "Titre": "Everything was fine except that they…",
          "Contenu": "Everything was fine except that they should add a thing where you can see how much of the product is in stock. I waited a week before they said that the keyboard i was ordering was not in stock. Other than that it was a nice experience"
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T18:37:02.000Z",
          "Titre": "Still a great keyboard",
          "Contenu": "The product itself is great! The build quality is amazing, it looks awesome as well! The 2 problems that I have with this product, which is the K530 Keyboard, are that there is a random bulge on the bottom that doesn't let me use the keyboard without the extended legs. And the second thing is that the springs in the switches are loud. And not in the tactile way loud. They have a sort of ring to it. It's not a big deal but it sound a bit off to type without headphones on. Overall it is a great product and I recommend it to anyone who is looking for a good quality keyboard. Hopefully you wont experience the same issues I had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RamosA",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T20:03:32.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Very good! Even though it took a couple back and forth emails, we were given detailed instructions to diagnose the issue and finally given a replacement. I appreciate the help and would definitely shop again in your store. Thank you!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trung Nguyễn",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T06:20:04.000Z",
          "Titre": "Good condition",
          "Contenu": "Good condition, recommend for anyone looking for a wireless mechanic gaming keyboard."
        },
        {
          "Note": 4,
          "Lieu": "VE",
          "Pseudo": "Andrés García",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T23:34:12.000Z",
          "Titre": "They took quite some time to respond… But excellent.",
          "Contenu": "They took quite some time to respond but they were extremely kind and wanting to help.Really recommended. I put 4* just for the time It took for taking a response, but the answer was just as expected"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Berry",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T14:00:18.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience.  I received a keyboard with a defective key.  They stayed in immediate contact until we got the replacements I needed to ensure proper operation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 2,
          "Date": "2022-03-30T02:28:47.000Z",
          "Titre": "I purchased K618 keyboard",
          "Contenu": "I purchased K618 keyboard, mouse, headphones, desktop sound speakers/board. Unfortunately, I didn’t get to setup my computer because I was out of state for a few months. I returned to discover one keycap was missing on my keyboard. I wrote CS to inquire about availability and cost of a replacement keycap. I was informed that replacement keycaps are not available. I sent another email begging for help because K618 is expensive Keyboard. The wrote me back assuring keycaps we’re not available through Redragon. They offered me a $15.00 gift card to Redragon. After considerable research on compatible keycaps, I found a used K618 on resale site for 1/5 the price for a new K618.  I will take the needed keycap from the used board and have the new K618 up and running. Customer Service was pleasant and did engage me in some problem-solving. I regret that a company that aspires to offer a solid product, specifically keyboards and mice can not supply minor replacement parts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alejandro Escovedo",
          "Nb_Reviews": 1,
          "Date": "2020-02-01T15:55:18.000Z",
          "Titre": "Review of shipping and store.",
          "Contenu": "I like this storr becuase it is easy to navigate and get what you want. But sometime if you buy stuff it takes a while for it to get here and idk jow to track it outside of japan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T20:29:31.000Z",
          "Titre": "Good for money",
          "Contenu": "Work well for money but be aware i have a 27\" monitor and the cables connecting the speakers just barely reach to each side. Otherwise easy to connect and change volume."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marceli Couto",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T14:27:46.000Z",
          "Titre": "the headset is amazing works amazingly…",
          "Contenu": "the headset is amazing works amazingly the only problem is that i play on xbox so i did need to buy a adapter to be able to mute my mic but in other words ⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Philippe Lacroix",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T16:22:42.000Z",
          "Titre": "Pretty good product",
          "Contenu": "Pretty good product. It has a nice quality finish, bright LEDs and many configurable options. Bluetooth and 2,4Ghz wireless works great with no noticeable lag. The low profile keyboard looks great as well. Battery life is decent. I haven't pinpointed the exact duration, but it seems to be at least 2 days with a few hours of work in each of those.It looses 1 star because of the following:Macro keys feels very mushy and low quality. They do have decent lighting though. Volume wheel works great when the keyboard is wired, but when used wirelessly, it requires too many turns to lower the volume just a bit. It just becomes faster to do it directly on screen with your mouse. I would like to be able to select the color of the LEDs. There are 9 options, but orange/amber isn't one of them. It may not be a big problem for most, but it's a bit disapointing when that's the color you are going for.Overall, good product with just a few minor flaws."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T10:24:09.000Z",
          "Titre": "Support fixed my problem",
          "Contenu": "My problems with the mouse were sucessfully fixed by the support and refunded me the money of the mouse even after the \"expiring date\" of amazon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moy Alcantara",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T19:23:31.711Z",
          "Titre": "i really enjoyed what they offered and…",
          "Contenu": "i really enjoyed what they offered and the amount of help they gave me thank you redragon and i hope to buy more products"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "H R",
          "Nb_Reviews": 1,
          "Date": "2019-12-03T17:38:05.000Z",
          "Titre": "Thank u guys really",
          "Contenu": "Thank u guys really. I fellt joy with your products. I only need my packages with the complete information because in other case the storage mark it undifined."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Misja",
          "Nb_Reviews": 1,
          "Date": "2020-06-21T12:36:52.000Z",
          "Titre": "great keyboard exactly what I was…",
          "Contenu": "great keyboard exactly what I was looking for. difficult to get in Holland though but ordering from the shop in the US worked well for me."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Albert Biondina",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T08:37:29.000Z",
          "Titre": "Good customer service",
          "Contenu": "My package was delayed by a few months. I do believe Redragon itself wasn't to blame. Serena from customer service helped me exellently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T17:35:02.000Z",
          "Titre": "I enjoy the headphones but they can be…",
          "Contenu": "I enjoy the headphones but they can be a little tight, also the second headphone wire does not work well. The usb one does."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Konstantinidis",
          "Nb_Reviews": 5,
          "Date": "2022-09-09T13:04:40.000Z",
          "Titre": "Customer Service with product.",
          "Contenu": "Great service fast response, convienence, reliable, understanding..."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mike Deng",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T12:37:19.000Z",
          "Titre": "Had software issue but iris from…",
          "Contenu": "Had software issue but iris from support was incredibly helpful and patient"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Luc Bali",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T10:30:21.000Z",
          "Titre": "delivered fast and was not damaged at…",
          "Contenu": "delivered fast and was not damaged at all. came in mint condition"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Guy Hirst",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T17:03:42.000Z",
          "Titre": "Very helpful and corrected any mistakes."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Tyson Shill",
          "Nb_Reviews": 1,
          "Date": "2019-10-15T04:29:02.000Z",
          "Titre": "Everything is good except the shipping…",
          "Contenu": "Everything is good except the shipping time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Levi Bowman",
          "Nb_Reviews": 2,
          "Date": "2020-05-01T22:47:07.000Z",
          "Titre": "Fair price",
          "Contenu": "Fair price for quality product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Lucadamo",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:18:51.000Z",
          "Titre": "Very Good Service and Even Better Quality Products",
          "Contenu": "I have previously built many PC's but now I am building my first high end gaming PC. I've been sourcing all my components for best quality but TRYING to stay within a reasonable budget (although it has been raised 3x already). I was very impressed by the quality AND price of the items sourced from Redragon, especially the rbg keyboard, mouse and speakers. If I hadn't already received all my other components, I would have definitely ordered much more. There service is very good and their products are excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Schuyler Gutting",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:29:00.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great Customer Service! Was sent the wrong product, I reached out and they responded promptly, told me I could keep the one they had sent as an apology for the mix up and had the correct product to me within a few days. Quality has been great on both the headset and the speaker!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Justin Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:23:24.000Z",
          "Titre": "Great product, BETTER service",
          "Contenu": "First, THANK YOU CARRIE!!I would just like to say that dealing with Redragon support on my recent keyboard purchase was one of the best customer experiences I've had. The agent was apt, and quick to help, and provided me with solutions rather than trying to kick me to the curb. I really like my new K580, but I like my customer experience with Redragon EVEN MORE!! I have recommended this product to friends, coworkers, knowing full well they will be taken care of. I TRUST Redragon support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Goldberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:07:33.000Z",
          "Titre": "Great Products and Amazing Customer Service!!",
          "Contenu": "I recently purchased a keyboard and mouse bundle from this store. After making my purchase I realized I could have picked a different color mouse for the bundle, so I sent an email asking if something could be done to swap them out. Almost immediately I got a response saying they could definitely help me and fix my mistake. Once I got the package I checked and they had swapped what I asked them to and both items work great. Perfect christmas gift and amazing customer servics!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:42:09.000Z",
          "Titre": "The communication from Chance was…",
          "Contenu": "The communication from Chance was outstanding and we really appreciated being kept up to date on the status of our deliveries.  The keyboard, mouse, and backpack are all high quality items that are already making our computing activities more enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Browitt",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:01:45.000Z",
          "Titre": "Quality and style, good price",
          "Contenu": "RedDragon has very quickly become one of my favorite places to get my pc peripherals from, they items are quality made and affordable. I love the style of there items."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "danzagoonie (danzagoonie)",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:23:53.000Z",
          "Titre": "Trundle K668",
          "Contenu": "Purchased the Trundle K668. It's a really nice and comfortable keyboard to use. I like the short cut keycaps they use.. Mute, Calculator, Lock Screen and switch screen options.I'd recommend this keyboard."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Szinyákovics Dusán",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:29:29.000Z",
          "Titre": "Top Customer Service",
          "Contenu": "Top Customer Service! The Customer expirence is top priority for them. Also with the products and support. I recomd them for everyone!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Maverickh99",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T13:37:05.000Z",
          "Titre": "Shop and customer service are perfect!!",
          "Contenu": "Shop and customer service are perfect!! The shop works well, the order was plaiced easly and payment supports all standards methods.Only one note, the order status has only few states so can appear that the order was not processed although it was.The customer service is fast, kind and precise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ric Gerace",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:20:25.000Z",
          "Titre": "Absolutely fast response to a problem",
          "Contenu": "Absolutely fast response to a problem. No hassle."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "- Pedro Costa",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:33:54.000Z",
          "Titre": "Excellent product and customer support",
          "Contenu": "The product behaves exactly as expected, the quality is great and the customer support was exceptional. Couldn’t recommend working with Redragon more!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Krisztián Nagy",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:18:26.000Z",
          "Titre": "Easy to contact with their customer…",
          "Contenu": "Easy to contact with their customer service, and the delivery was fast.The products are really good quality."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Wesly Salazar",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T09:14:24.000Z",
          "Titre": "It was great",
          "Contenu": "It was great. My keyboard for some reason stopped working correctly and they send one new to me cause it was still in warranty. The costumer support was great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:45:40.000Z",
          "Titre": "Quick Response to Correct Customer Error on Order",
          "Contenu": "After choosing the wrong saved shipping address, Chance from Redragon support responded quickly to my email and was able to get the shipping address changed before the order shipped. This is yet another reason why I will continue to order items from Redragon with confidence."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "gibzx",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T09:07:33.000Z",
          "Titre": "Excellent cutomer service and products",
          "Contenu": "I bought a gaming wireless mouse and keyboard during the Black Friday sale, which were delivered extremely fast. They are working great, and I've been loving them so far. I only had a small issue with getting the keyboard software to program my keyboard macros, and thankfully the customer support was nothing short of spectacular! Customer service responded right away, and one of their reps - Helen, was extremely helpful in getting my problem solved - She was excellent in finding the cause of my issue and helping me to get the proper keyboard software. Overall a great purchasing experience, I would recommend Redragon fully!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seulbee Lee Bzzy Bee",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:54:25.000Z",
          "Titre": "Love it!",
          "Contenu": "I'm so sad that I can't attach any pictures! I got a pink speaker from Redragon and it's so cute! I connected it to my monitor and it works great! Love it!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Adam Casian JustPlayz",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:08:02.000Z",
          "Titre": "Amazing customer support and great…",
          "Contenu": "Amazing customer support and great products."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Miljan",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T02:51:21.000Z",
          "Titre": "Value through the roof",
          "Contenu": "Been using their keyboard daily since 2018 and it still works excellent. All props"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "megan zuccaro",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:25:39.000Z",
          "Titre": "I love Redragonshop💕💕 my son started…",
          "Contenu": "I love Redragonshop💕💕 my son started gaming on a computer a few years ago and he was insistent about getting his mouse, headset, keyboard and more from this company. I was a little hesitant about it but I’m so glad I did. He was had one mouse and one headset malfunction on him and when I reached out to the company, they were amazing to work with on replacing the items. I save all boxes so I have the serial#s, when I contacted the company I had no issues taken pictures of everything they need. I have dealt with a customer service rep.named Kiana and she was everything you could have wanted when dealing with a company. They have definitely earned not only our loyalty, but we tell everyone who games about them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Taehoon Kim",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:09:06.000Z",
          "Titre": "Good products",
          "Contenu": "I bought a wireless keyboard, and a wireless mouse through their online store. Also received free keyboard through their survey program. The items arrived quickly with no issues at all. Customer service was extremely quick and very friendly with their response.Positives: -good quality for their price.-good designs.-excellent customer service.-power for both wireless keyboard and mouse last very long.Negatives: -cannot connect to software wirelessly.-The UI interface isn't user-friendly as compared to other software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Filipiak",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T04:30:13.000Z",
          "Titre": "Customer service via email was prompt…",
          "Contenu": "Customer service via email was prompt and courteous.   Was able to take care of my issue quickly and sent out the new speaker within a couple of days.  Great service by Maria and others.   I appreciate the straight forward answers to my questions.   Matter was resolved quickly.  Thank you all so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Danforth",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T21:38:31.000Z",
          "Titre": "Impressive Customer Service",
          "Contenu": "I had a keyboard problem.  As it turned out, nothing was the matter with the keyboard; I didn't understand how to use some of the features.  Customer service was quick to explain what I needed to do. They responded immediately.  I did it, and all is well."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Kondor Máté",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T13:34:37.000Z",
          "Titre": "Costumer service experience",
          "Contenu": "I ordered a keyboard from redragon shop, but have not seen a change for some time, so i contacted the costumer service. They were quick to respond, and informed me that there had been a slight delay. They helped me get my order quickly after that. The keyboard is great, and i really liked the costumer service experience. All in all i definetly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Gabrielius Stankus",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T13:52:15.000Z",
          "Titre": "Great mouse",
          "Contenu": "Bought a crappy mouse from store for 10 euros. Got smashed to pieces, because the sensor was extremely poor, in the following two weeks. Decided to buy this mouse instead. Had it previously. The problem was that the middle mouse button sometimes stopped working. Tried to open the mouse, was unsuccessful, so had to throw it out :D. Anyway, the previous mouse lasted for 3-4 years, so the performance/price ratio is extremely high. Would recommend this mouse to anyone, who wants a \"budget\" gaming mouse that, paradoxically, performs like the more expensive variants."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Adrian Roel Lapus",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T14:41:43.000Z",
          "Titre": "Redragon the best",
          "Contenu": "Everything about the entire Redragon is perfect.The quality of their products are really great considering their price.Not to mention their incredible customer service. They respond pretty fast and straight to the point. They have even recommended a product that I bought and I loved it.Definitely will buy most of my future PC accessories from this shop 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Wheeler",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T04:44:11.000Z",
          "Titre": "The monitors that redragon makes are…",
          "Contenu": "The monitors that redragon makes are really well made and the colors look excellent compared to the SAMSUNG Odyssey G5 Series I had before I purchased these new monitors. I still have and use the old monitors but the colors and refresh rate are much better."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Baciucu Cristian-Iulian",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T08:04:43.000Z",
          "Titre": "Great experience",
          "Contenu": "I bought a pair of wireless headset, which came with a small bug into their system and that was appearing only in the wireless mode. In wired mode they were working fine. Having a wireless headset was the main reason that made me to buy them. I reported the problem to them, and someone from support contacted me via email to describe the problem.After a discussion with them, they decided to send me another pair of headset, without returning the existing one, which was really great. Now i'm using the other device send by them and everything is ok with them.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VIRGINIA HUNT",
          "Nb_Reviews": 4,
          "Date": "2023-10-19T17:44:40.000Z",
          "Titre": "Great Products that Don't Burn a Hole in the Wallet",
          "Contenu": "I get varying computer equipment from Redragon as often as I'm able to, and they never cease to make me a proud customer of theirs. If I order from Redragon direct, their communication is stellar, and there have been Sundays where I get my item. Definitely can recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 3,
          "Date": "2023-10-08T13:11:10.000Z",
          "Titre": "CS was most helpful when I needed a…",
          "Contenu": "CS was most helpful when I needed a refund and then requested a credit instead towards a new purchase. Their patience and understanding was wonderful. Entire experience was finished in a short period of time. Will always be a customer for such a great company that truly cares about their customer base. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aleks Ghislain",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:02:16.000Z",
          "Titre": "Great customer experience",
          "Contenu": "Thought I had a package go missing, not only did they work on getting me an answer, they did it on a week night well after normal business hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Braydon Block",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T13:09:07.000Z",
          "Titre": "Best keyboard for $75",
          "Contenu": "This keyboard is just extremely good overall it has RGB and programmed lighting affects built in which is fantastic the switches sound great does not sound pingy at all would get again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arkade Grunge",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T23:12:04.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience, one key on my keyboard stopped working after more than 8 months. Helen from customer service was helpful and sent me a new keyboard. Absolutely great. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T.K.",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T06:05:01.000Z",
          "Titre": "I have two M913 mice and just got the …",
          "Contenu": "I have two M913 mice and just got the  K596 keyboard. I initially had trouble loading the macro programming software and opened a ticket. They were very responsive but the problem  was on my end. Windows was going through an update and after that the software installed fine. Redragon have great value for advanced feature computer products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Priyank Thakkar",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T13:07:38.000Z",
          "Titre": "Better than Logitech customer rep.",
          "Contenu": "This is my first time ordering from Redragon shop. I usually stick to Amazon for such purchases for easy returns and customer service. That being said, I cannot be more happy with my experience of purchasing directly from redragonshop. I had ordered a mouse, a keyboard and a desk pad. I wanted the shipment early so I urged the customer support rep to help me with the same. To my delight, I received the package very quickly. The customer service is quite responsive and satisfactory. I would highly recommend others to shop from the website only."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Dugg",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:05:17.000Z",
          "Titre": "Solid products and A+ Customer Service",
          "Contenu": "Shipment carrier lost my package but RD was quick to fix it and expedited a new shipment to my doorstep the very next day. Their PC peripherals are solid and have many options for any budget. It's an easy recommendation as a repeat customer!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Eric Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T13:48:01.000Z",
          "Titre": "Amazing Custermer Support",
          "Contenu": "I had a number of keyboard-related issues that I didn't understand. The Redragon customer support was quick and kind to respond with clear instructions to my problems. All the issues were resolved and I am satisfied with the build quality and typing experience of my new keyboard."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Baalversi",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T11:08:52.000Z",
          "Titre": "Redragon Olaf K648 wired 90% mechanical…",
          "Contenu": "Redragon Olaf K648 wired 90% mechanical keyboard arrived swiftly and well packed. its a amazingly solid keyboard. Had a questions about replacement keycaps as this is non standard layout keyboard if i want to change the look in the future. I got a response from the UK customer service team within 30 minutes with my answer and some links to external resources thanks Erin. Quality product swift efficient and lovely customer service new fan of the brand right here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff O'Connell",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T12:35:52.000Z",
          "Titre": "Redragon's customer service is the best, no lie",
          "Contenu": "Redragon's customer service is the best.  Very responsive and has fixed anything that has been an issue with no questions asked.  I would fully recommend them to buy your peripherals for your computer systems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Novak",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T22:39:48.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. My first keyboard had an issue with sticky keys, despite redownloading of software and cleanings. Even though I had it for almost a year, they were kind enough to ship me a new one after trying to help me troubleshoot. New keyboard has no issues! Very cute and sounds good for a more affordable keyboard. Very happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael West",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:34:17.000Z",
          "Titre": "Great customer support",
          "Contenu": "The keyboard was great and the customer service was quick and helpful. Thanks Carrie!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T15:37:47.000Z",
          "Titre": "This is a great product and a great…",
          "Contenu": "This is a great product and a great price and I don't know how to say it any better than that. The enthusiasm projected by the company and the obviously real world experience with their users just add to a total value added experience.I'm always surprised by the little niceties that you realize when looking at how it is designed. I'm speaking about the k631 but I've had other products of theirs and was just as delighted. Except the coffee and the keyboard didn't mix very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cardnial Omega",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T03:53:03.000Z",
          "Titre": "My Main Source for Computer Accessories",
          "Contenu": "Their shop is my first stop for anything I'd need for my setup, and they're not shy to show off their impressive inventory to peruse to your hearts desire."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Danny Phan",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T13:10:31.000Z",
          "Titre": "Fantastic",
          "Contenu": "Had a problem with my gear and after many attempts to try and fix it they straight up just sent me  new ones. great company and i will be buying from here again"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Imre Demian",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T08:40:04.000Z",
          "Titre": "Had a keyboard delivered",
          "Contenu": "Had a keyboard delivered, with extra key caps which unfortunately wasn't available to deliver here in my country, but without question they offered me another keycap type, that was a little more expensive, without any problems.The package arrived in 5business days, had no trouble with anything at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T16:18:42.000Z",
          "Titre": "Satisfied Customer",
          "Contenu": "I made a mistake and ordered the wrong switches on my HORUS wireless keyboad and customer service promptly (within hours, not days) swapped the switches before they were even shipped.Beyond that, I am incredibly impressed at the quality, from the charging cable to the keyboard's feet to the switches themselves. Everything seems solid and made with high-standards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Panetti",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T17:16:41.000Z",
          "Titre": "Happy Razer Convert",
          "Contenu": "I swapped from using Razer devices to Redragon some time ago and I have been impressed every time. Build quality is great and I can use all my devices without having to install 3rd party software (it's optional for use of more advanced features) -- particularly important since I run Linux. Support is where they really shine though -- Helen and everyone else on the team have been swiftly responsive and helpful every time, which unfortunately is increasingly where in the industry. They are definitely a bar above the rest!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T05:11:59.000Z",
          "Titre": "My package got lost through the mail BUT.",
          "Contenu": "My package got lost through the mail.. even though it took a little longer than expected redragon noticed that the package wasn’t being delivered and they quickly issued a replacement. By far the quickest customer service I have ever gotten. I didn’t even have to tell them it was lost they followed up to make sure I received my package. The keyboard is AMAZING 100/100 the clickety clackety is so satisfying and the keyboard is amazing quality for the price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zirins",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T06:02:41.000Z",
          "Titre": "Great Customer Support!",
          "Contenu": "Lost my USB dongle for the mouse and asked for replacement, but since each individual mouse has their own designated USB, they couldn't do it. Instead, they resolved it by sending me a open box product (the same one I'm using) and I just had to pay the shipping ($10). The customer service is quick and useful. 5/5"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat Nazarov",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T09:46:47.000Z",
          "Titre": "Plenty of reasons to stay loyal to Redragon!",
          "Contenu": "Most tech companies leave you high and dry in the event you need customer support - not Redragon. The products speak for themselves, and customer service is reliable, efficient, and unbelievably kind, even over email. Shoutout to Kiana for bearing with me through the troubleshooting process and helping me solve my problem!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "N Steves",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T12:42:47.000Z",
          "Titre": "Redragon is an awesome company to deal…",
          "Contenu": "Redragon is an awesome company to deal with, they actually do care and have shown it. I purchased the K556 Pro last month but unfortunately was on back order. The keyboard arrived really early, and their support staff is beyond any other e-commerce I've previously dealt with, exceeding all. The Keyboards are solid as well as the mice. Currently own the K556 Pro, K530 Pro, and M913, all are amazing and unique. Definitely my new favorite shop."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "sushi",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T17:08:08.000Z",
          "Titre": "Legit mechanical keyboards",
          "Contenu": "CASTOR K631 PRO Mint is my second mech keyboard from RedDragon, there is all i need: it's silent and hotswap with bluetooth connection. You've got there great customer service, and another good thing is i didn't have to pay duty fees to east EU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Klingler",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T17:29:14.000Z",
          "Titre": "Great experience, even with some hiccups",
          "Contenu": "Had some technical issues with my K556 Pro that ended up only being with the 2.4 wireless signal.After some troubleshooting, the customer support team decided to just send me a brand new keyboard!Great entry into mechanical kbs, and awesome customer care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Dietz",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T18:33:56.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service and support team. When I had a question about how my order was shipped, I recieved a detail email with the break down of each item and they included tracking info."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Marc Bongartz",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T22:08:22.000Z",
          "Titre": "Shipping was exceptionally fast",
          "Contenu": "Shipping was exceptionally fast, much faster than I expected - ordered monday, received thursday - 3 days, you guys are magic !"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "RT",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T12:27:33.000Z",
          "Titre": "Bought a nice K621 Horus TKL keyboard",
          "Contenu": "Bought a nice K621 Horus TKL keyboard. EU (Czech Republic) delivery was very quick, 5 working days or so. The keyboard is worth the price and works well just like more expensive competition. Smallest hiccup with availability of a color was resolved the next day after I placed an order, the support offered several solutions and was very friendly and responsive! Overall, a great experience with both the shop and the product."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Adrianna Komi",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T18:44:29.000Z",
          "Titre": "Amazing experience!",
          "Contenu": "I was assisted by Helen, who provided step by step instructions in order to troubleshoot and when the troubleshooting didn't help, immediately offered to replace my faulty equipment! Very happy with the speed in which this whole interaction happened! Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "blake davison",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T03:13:17.000Z",
          "Titre": "Bought a new ATTROX mouse for work but…",
          "Contenu": "Bought a new ATTROX mouse for work but had some trouble getting the software to run so I could create macro keybinds. Support responded within the day and had an alternative software to try and it fixed my issue instantly. Customer support was why I decide to leave such a good review but the product works exactly the way I wanted."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Parrot",
          "Nb_Reviews": 16,
          "Date": "2023-08-01T06:06:58.000Z",
          "Titre": "Ignore the 1 star reviews",
          "Contenu": "Ignore the 1 star reviews, I've had the best experience with redragon products, as for redragonshop, although there might be a few glitches (as per a lot of websites) the support team is amazing! They go above and beyond to solve your problem!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Silver Ven'thil",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:20:44.000Z",
          "Titre": "Great Service, an even better product line up.",
          "Contenu": "Never had a negative experience, either with customer service or product themselves. I made an error in an order so it didn't get to me, and it was just a matter of filling out their form and it was dealt with almost immediately during business hours the next weekday. Delivery is fast, and you don't pay for brand name marketing on products. Gaming Peripherals both built to last and be easy to maintain."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Meeks",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T17:49:10.000Z",
          "Titre": "They are just the best",
          "Contenu": "I have had nothing but great experiences with Redragaon.  My keyboard, mouse and even the things I use for xbox are all Redragon.  I just recently built a gaming pc for my daughter and she now has all Redragon items as well.  Chance, from their customer service team, is amazing.  Super friendly and helpful.   I couldnt ask for anything more when from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Filipiak",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T15:44:22.000Z",
          "Titre": "Was referred to Redragon by a few…",
          "Contenu": "Was referred to Redragon by a few members on a DCS squadron I was flying on. They have been using Redragon products for years with no issues.  Pricing  on Redragons products is excellent.  I am building a new system from ground up and acquiring parts for my build. Redragon parts I picked up saved me around $200.  I appreciate their quick customer response via email.  Once I have my build complete,  I will provide a update as well.  Thanks again to the crew at Redragon!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Chris Devos",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:10:46.000Z",
          "Titre": "excellent customer service and I've…",
          "Contenu": "excellent customer service and I've never been disappointed with their products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T03:40:29.000Z",
          "Titre": "great products & fast shipping",
          "Contenu": "ordered a keyboard and mouse - very high quality (especially for the price) and they were delivered within a couple of days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ML",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T18:52:46.000Z",
          "Titre": "Redragon are great!",
          "Contenu": "Redragon makes great products and their support was fast, responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonardo Coelho",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:02:32.000Z",
          "Titre": "Their customer service is excellent",
          "Contenu": "Their customer service is excellent, they were ready to help very quickly and efficiently. Many thanks especially to Carrie. Very polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ghost",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T00:43:24.000Z",
          "Titre": "I have bought several products from…",
          "Contenu": "I have bought several products from redragon. Ive bought mice keyboards and speakers. Recently just bought a new wireless mouse as an upgrade from the wired version had an issue with the right click. I sent an email to support and they sent me a replacement that works perfect! Great products at decent prices staff is helpful as well. 9/10 recommend redragon"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T19:03:46.000Z",
          "Titre": "Amazing and quick customer service!",
          "Contenu": "When my package was stolen off my price, Redragon made sure I had a replacement within a week, free of charge. The product itself is great, but what's even better is their customer service. They're absolutely dedicated to making sure you get your order, and that you like what you bought. I would absolutely recommend buying from them, especially with their very generous return policy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SixHealthOfFury",
          "Nb_Reviews": 5,
          "Date": "2023-05-05T00:52:37.000Z",
          "Titre": "Better than advertised",
          "Contenu": "My only complaint is that each product page did a poor job describing how good they actually were. I'm very satisfied with the Predator mouse as well as the two GW910 webcams I purchased. Even better, the price was on par with premium products I would have bought elsewhere. Will be buying from here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "debra",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T05:07:24.000Z",
          "Titre": "Delivered as promised",
          "Contenu": "Delivered as promised. Excellent customer service regarding delivery and follow-up.  Will highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bailey Hopkins",
          "Nb_Reviews": 4,
          "Date": "2023-09-26T04:59:24.000Z",
          "Titre": "Ordered headphones on Amazon",
          "Contenu": "Ordered headphones on Amazon - arrived on time and support got back to me quickly when I had a bit of a struggle setting up. They even followed up to make sure all was “ok” after their initial emails. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Furgerson",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T17:36:29.000Z",
          "Titre": "Amazing Customer Support",
          "Contenu": "I got a keyboard from Redragon. After 1.5 years I had a problem where it would not work anymore, but I contacted their support and they responded very fast. They did some troubleshooting with me and then determined it was broken and sent me a new one within 2 days. The support representative was very polite and helpful the whole time. This experience has given me great confidence to buy products from Redragon because I know I wont have to worry if there is a problem with any of them."
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Iakovos",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T21:13:14.000Z",
          "Titre": "Redragon - Best value for money",
          "Contenu": "I don’t usually write reviews but in case of Redragon it was worth the time. I was looking on the web for a low profile keyboard and for the amount of money I was able to spend, Redragon K618 Horus was the best value for money I found. After a week of use with my new keyboard, I had also purchased the M690 Pro mouse and I couldn’t be more satisfied. Finally, worth mentioning that the customer service was very helpful about my order shipment status."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alonso Luna",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T06:54:59.000Z",
          "Titre": "I definitely recommend Redragon.",
          "Contenu": "I definitely recommend Redragon.The assistance is very helpful and they offer a quick response.I purchased my M811PRO (great mouse for Autocad) from Amazon USA, unfortunately I had wireless issues but the tech support has been great, and they resolve my problem right away with a very kind attention."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alex C",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T01:54:46.000Z",
          "Titre": "Good product and Excellent Customer…",
          "Contenu": "Good product and Excellent Customer SupportCustomer Service gave me prompt technical support with clear instructions to solve my problem. Much appreciated.The keyboard K622 is exactly what I want. I enjoy using it with the choices of backlit and its perfect size."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Maxwel Perna",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T16:25:42.000Z",
          "Titre": "A+ Company",
          "Contenu": "I wanted to share my experience with the Red Dragon mechanical keyboard switches I recently purchased. I ordered two sets of switches, one of which arrived promptly through Amazon shipping, while the other was delivered a bit later by USPS.Initially, there was a bit of confusion regarding the delivery, but I must commend the exceptional customer service team for their prompt and efficient assistance in resolving the issue. Their support played a significant role in making the overall experience a positive one. In fact, I was so impressed with their assistance that I went ahead and purchased a third set of switches.Onto the switches themselves. I'm thoroughly impressed with the quality. These switches offer a very smooth typing experience. Even the tactile/bump style switches provide a satisfying feel, striking a balance between a pronounced tactile response and a comfortable, non-stiff sensation. What particularly caught my attention was how well the silent switches perform. They manage to maintain their quiet operation without compromising on the keypress's tactile feedback, avoiding the typical 'mushy' sensation that can sometimes accompany silent switches.In summary, I can confidently say that the Red Dragon mechanical keyboard switches have exceeded my expectations both in terms of product quality and customer service. The combination of great products and excellent service is a winning formula, and I wouldn't hesitate to make a purchase from Red Dragon again in the future."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MilkedWoman",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T21:19:32.000Z",
          "Titre": "Great keyboard",
          "Contenu": "Keyboard came with extra switches and some key and switch puller. The only thing I have to say is that the wire is connected to the left of the keyboard and that's kindsa weird I would have prefered on the right or just at the usual place on top."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hunter Kunze",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T19:26:58.000Z",
          "Titre": "Phenomenal experience",
          "Contenu": "Phenomenal experience. Products were shipped and arrived promptly. Products were well-packaged to prevent shipping damage. Due to an issue with one product, I was sent a replacement item free of charge. 100/10 customer service, WILL be buying from again!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Raines",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T14:48:55.000Z",
          "Titre": "***** Customer Service",
          "Contenu": "At first I thought my keyboard was missing since it wasn't in the box, but customer service provided me with a second tracking number right away. The keyboard and speakers work great and the customer service was friendly and quick. Couldn't ask for more."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "F L",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T21:01:20.000Z",
          "Titre": "Great products but even better service",
          "Contenu": "Great products but even better service. Helen was so helpful, this was one of the best customer services I've ever had! Other companies could learn something from this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garon B Tornell",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T22:01:30.000Z",
          "Titre": "Very quick response",
          "Contenu": "I got an email response very quickly, which I thought was excellent. And also I got a written detailed explanation of what to do to solve my issue. It didn’t work so I was sent a new product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiden Butler",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T01:04:25.000Z",
          "Titre": "I love this keyboard it has so many…",
          "Contenu": "I love this keyboard it has so many great color presets. It also has amazing sound and quality. I love this I had recently switched from a more expensive keyboard I switched for the reason of sound and size, and this redragon is amazing I love it much more than my previous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Blake",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T21:10:51.000Z",
          "Titre": "Great customer service!!",
          "Contenu": "I had accidentally bricked my keyboard and asked for help and once they figured out how I did it, they replaced it immediately. It arrived a day later and I was very surprised to see that it was already delivered. Great customer service. Thank you again for your understanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan, Nick",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T19:18:30.000Z",
          "Titre": "This experience was made great because…",
          "Contenu": "This experience was made great because the items arrived promptly and together. I did not have to wait for two separate shipments and they came very quickly. The order was accurate and the product delivered matches the description and I found no flaws in my products."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Peter Pokhylko",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T17:46:10.000Z",
          "Titre": "Excited",
          "Contenu": "I've got a keyboard and the mouse from Redragon. The keyboard was lost during shipping, so they kindly suggested me to send another one (the same model). So, though I had to wait 4 weeks to get it, but in the end I'm excited. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "machination1311",
          "Nb_Reviews": 6,
          "Date": "2023-08-11T19:16:20.000Z",
          "Titre": "Very good support :)",
          "Contenu": "english with google translate :Purchase of the M990 mouse on 06/08.On 08/08, message from support to inform me that the mouse is temporarily out of stock, with the choice:* wait for mid-August for a restocking of stockOr* a refund of the order.I say I can wait.In the end, shipment of the mouse on 09/08 for reception on 10/08.So, very happy with the service offered by REDRAGON, whether it is the support or the mouse.I would never change mouse brands again, this is my second of the same brand.The first died after 3 years of intensive use.En français :Achat de la souris M990 le 06/08.Le 08/08, message du support pour m'informer que la souris est momentanément en rupture de stock, avec au choix :* attendre pour la mi-août un réassort du stockOu* un remboursement de la commande.Je réponds que je peux attendre.Au final, expédition de la souris le 09/08 pour une réception le 10/08.Donc, très content du service proposer par REDRAGON, que ce soit le support ou de la souris.Je ne changerais plus jamais de marque de souris, ceci est ma seconde de la même marque.La première a rendu l'âme après 03 années d'utilisation intensive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Family Pop TV",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T18:30:53.000Z",
          "Titre": "Delivers on Both - Product and Service.",
          "Contenu": "I have ordered a K652 keyboard on 14 April 2023. Shortly I was informed via email that the keyboard was temporarily out of stock but I was given the option to wait for it to be replenished or to cancel my order. I chose to wait, and the keyboard was delivered to me within 3 days. The customer service representative who I spoke to was very polite and professional, and they answered all of my questions promptly. I am 100% happy with both the product and the service. I would definitely recommend Redragon 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erick Ocanas",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T13:23:00.000Z",
          "Titre": "Definitely recommend",
          "Contenu": "My first time ever buying a gaming keyboard and reddragon gave me one of the greatest experiences ever! Absolutely love the keyboard and will definitely come back to buy more gear! 10/10"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "jodi marie",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T14:33:48.000Z",
          "Titre": "I own 3 Redgraon products so far and…",
          "Contenu": "I own 3 Redgraon products so far and the quality has been consistent and the performance has been great. They have multiple options to fit every budget and I will continue to purchase items from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brooklyn Moon",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T19:02:22.000Z",
          "Titre": "I ordered the hz150 headphones and they…",
          "Contenu": "I ordered the hz150 headphones and they are amazing. Compared to other headphones I’ve tried they are so comfortable and don’t hurt my ears after wearing them for long times. They also sound amazing and the mic is so clear. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SOMBER",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:27:50.000Z",
          "Titre": "thank you so much for helping me",
          "Contenu": "thank you so much for helping me, the shipping was fast and they took care to replace my item thank you."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kusprr.",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:23:45.000Z",
          "Titre": "Nice…",
          "Contenu": "Really good product would recommend every time again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Molly Boehne",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:11:45.000Z",
          "Titre": "very nice response",
          "Contenu": "very nice response, gave me in depth answer with photos as well. amazing!!! thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Jurkovic",
          "Nb_Reviews": 4,
          "Date": "2023-10-11T20:38:42.000Z",
          "Titre": "Fantastic company",
          "Contenu": "Great products great prices great customer service hastily ready to help you with any problems you may experience if any."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:28:12.000Z",
          "Titre": "Flawless experience buying from the…",
          "Contenu": "Flawless experience buying from the company. I would highly recommend them !!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Julien Beauvillier",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T01:55:08.000Z",
          "Titre": "Very happy!",
          "Contenu": "I purchased the Horus keyboard and I’m very happy with it! It’s gorgeous, functions perfectly fine and sounds amazing."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Danilo Maia",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T00:34:31.000Z",
          "Titre": "I wrongly updated my Keyboard and it…",
          "Contenu": "I wrongly updated my Keyboard and it stopped working properly. I contacted support and they quickly helped me by sending me the right firmware for my keyboard and it started working correctly again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Sukel",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T12:26:29.000Z",
          "Titre": "Redragon has always been a wonderful…",
          "Contenu": "Redragon has always been a wonderful company making amazing products that are affordable while still being high quality. Their customer support is stellar and always have your back if something goes wrong!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JesusFan",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T15:00:40.000Z",
          "Titre": "Good product good service, good shipping",
          "Contenu": "So they were out of the product I ordered so they offered me a few options, I chose to wait as I wasn't in a hurry to build my PC. Then they made sure to follow up every time, was very nice, and then when they shipped the product it arrived in half a day. Solid build, good quality. Good customer service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Eric Frendo-Cumbo",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T17:13:28.000Z",
          "Titre": "I just can't believe how amazing this…",
          "Contenu": "I just can't believe how amazing this company is. You can always expect something great for the right price without having to spend hundreds of dollars on other brands. I feel recently they have updated their switches at least the \"reds\" for the FIZZ 60% keyboard. They have this nice little grip to them that makes it feel comfortable to press. Some may like it while others may like a much faster feel. The older ones on my other Redragon K582RGB V2 board were like that. There's hits and misses with having a 60% keyboard but if you know that then you come to expect what you're getting. Macro's in most cases help make bindings better and it helps for the arrow keys which may come useful for some games and dos games. The RGB is utterly fantastic. I feel the lighting is much better on this keyboard then my previous as well. It's snappy small and just right for gaming. You just have to make sure you set your macro's right and deal with not having a Prtsc button. There's other software that will give you keybinding screenshots so Prtsc doesn't need to be the all out. Beautiful keyboard and lots more space to deal with now :)."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T10:22:31.000Z",
          "Titre": "Carrie from Redragonshop was great…",
          "Contenu": "Carrie from Redragonshop was great help. My keyboard seemed to have broke and they got it me a new one within a few days. Was amazing service and can't thank her enough as I had no keyboard. 5/5"
        }
      ]
    }
  ]
}