{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.ipvanish.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TODD DOTEN",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:05:22.000Z",
          "Titre": "Even after canceling",
          "Contenu": "Even after canceling, They repeatedly for months try to run your credit card!! Over 20 attempts so, I’m continually having to report them to my virtual card service provider.Thankfully apple is now automatically declining each attempt!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Prof Decryption",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T11:11:16.000Z",
          "Titre": "Whover designed their website needs a…",
          "Contenu": "Whover designed their website needs a good slap. |Trying download for my mothers re-installed laptop. No download links anywhere other than third party sites.Probably won't renew after this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ScottF",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T00:49:55.000Z",
          "Titre": "Poor service",
          "Contenu": "Service did not work. Quality and bandwidth were poor. I requested a refund within the 30-day trial and the company would not respond so I was forced to dispute the charge with my cc. Run!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "lee curtis",
          "Nb_Reviews": 11,
          "Date": "2023-12-13T12:31:35.000Z",
          "Titre": "Did not work at all and what was…",
          "Contenu": "Did not work at all and what was advertised as a 7 day trial has taken a payment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:29:02.000Z",
          "Titre": "Still charged when my account has been deleted",
          "Contenu": "I had my account deleted for months now, and I didn't noticed they still charged my account for it and only way they are helping is my refunding the last charge when there has been multiple charges. Now I have to cancel my card and get a new one since I am afraid of getting my money stolen by them. Refrain from their services"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ricardo Fonseca",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T22:41:57.000Z",
          "Titre": "Poor and fake advertise",
          "Contenu": "I have been using IPVanish for a good few years...but this year I'm extremely disappointed. They advertise a 24 Month plan + 3 months free for 2.49USD per month. (81% Discount they called it)I Bought the plan and for my surprise I was charged $80.67 for 1 year subscription and next year subscription is set to be USD 179.99...where is the 81% discount? it's rather the double of what was promissed.The advertise is a trap...which is disapointing as they were quite good on what they do. I'm now going to ask for cancellation and money back!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Ciaran Hurley",
          "Nb_Reviews": 5,
          "Date": "2023-11-29T01:20:52.000Z",
          "Titre": "STAY AWAY!!",
          "Contenu": "I agreed by email with Bobby that my subscription would be renewed for $31.50 plus tax. I was told to check my IPVanish Account and Invoices to pay through PayPal. I checked this several times over a period of 10 days or so. There was no invoice there and I sent emails to Bobby to say so. Then Bobby asked me to send details of the invoice I paid last year through PayPal. I did this only to be notified that they had charged $149.44 to my PayPal account - almost 5 times more that I had been quoted. I have sent 3 emails since to get a refund but all of these have been ignored. I now have no option but to open a dispute on my PayPal account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VINCENT POWELL",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T15:28:20.000Z",
          "Titre": "IPVANISH is a good product but terrible…",
          "Contenu": "IPVANISH is a good product but terrible customer service. After using IPVanish for 4 years, I did not renew but then found my credit card had been renewed for another 3 years without my knowledge. I have been fighting for my return of funds but Ziel at IPVANISH customer service played hardball and I see they have done that with many other customers. BUYER BEWARE. Their attempt to keep customers with a small print that offers refund to some, but not others. You need to replace Ziel and find someone that offers customer service"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Walter Medak",
          "Nb_Reviews": 11,
          "Date": "2023-11-10T15:53:51.000Z",
          "Titre": "I signed up with them based on reviews I read",
          "Contenu": "I signed up with them based on reviews I read. That turned out to be a mistake. I could rarely get the VPN to run on my Android TV box, and not at all on my computer. I cancelled the account, and after some back and forth, it was set to NOT auto-renew and then go away, as I was told by one of the people there.I get email from another person there that had obviously not read previous emails about the cancellation. I had to copy and paste the relevant info my reply to the last person emailing me.They should be talking to each other so that one hand knew what the other one was doing.Not recommended."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T00:48:36.000Z",
          "Titre": "Does not work with ESPN",
          "Contenu": "I resubscribed and was unable to reactivate my account. Contacted support and after an hour they could not figure out why. They had to cancel the subscription and refund me. I then subscribed again using a different email address and it worked. Then I found out that ESPN will no longer stream when using ipvanish, even though ipvanish's website specifically says it does work with ESPN. I tried multiple servers and still couldn't stream. I did a Google search and found that ESPN has blacklisted all their servers. I just subscribed to a different VPN app and it works perfectly. Now I can't get my money back because they don't offer refunds for monthly subscriptions! I would not recommend ipvanish to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T16:59:54.000Z",
          "Titre": "Customer service tried to bully me into staying",
          "Contenu": "Customer service tried to bully me into staying with the company. They had took the money out of my PayPal account before I could cancel the service and then did not want to refund me. They wanted me to except a lesser price for another subscription. I told them no I already had another provider. I told them I would fight it with PayPal. The person kept telling me I wouldn't win my case and that the only option I had was to expect the offer they were giving me. Finally I got pissed off enough I cut off communication and got hold of PayPal. PayPal refunded me. If you use this company you better have extra security like PayPal or Ipvanish will railroad you when it comes time to cancel."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Phil Armston",
          "Nb_Reviews": 8,
          "Date": "2023-11-13T14:25:04.000Z",
          "Titre": "Customer care rubbish",
          "Contenu": "I canceled my subscription and asked for a refund, which I received ok. The next day they took out more money, and gave me a subscription i did not ask for or want. They now refuse to give a refund on the subscription I didn't want."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mitch Alsobrook",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T03:43:33.000Z",
          "Titre": "IPVanish wont work for my application",
          "Contenu": "IPVanish wont work for my application. I have also found other VPN's much cheaper. I canceled my subscription on the day of my renewal and was charged anyways and they only offered a replacement for a lower price instead of a refund. I am not happy with IPVanish and will never use them again. Try Private Internet Access. Much cheaper and works great."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mare Fuori",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T20:11:01.000Z",
          "Titre": "Not compatible with Netflix",
          "Contenu": "States compatible with Netflix, does not work and customer support team aren't able to help and have also stopped answering to live chat messages anymore, emails also ignored. Not possible to do refund either so will have to do chargeback through bank for false advertisement as I bought a service that does not work / exist."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Derek S",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T21:47:16.000Z",
          "Titre": "Be aware of unauthorized charges!",
          "Contenu": "Be aware of auto-renewal charges at an outrageous rate. I contacted them to cancel and they refused to refund me."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ben Salisbury",
          "Nb_Reviews": 5,
          "Date": "2023-09-19T00:30:21.000Z",
          "Titre": "Make sure you cancel your subscription!!!!!",
          "Contenu": "I signed up to this service thinking that it was a good deal, however after the second year I decided that I did not want to renew as i was not using it. I recieved an email from paypel saying the it had auto renewed, so messaged them immediately, however they informed me that once it had renews they would not refund my money. This feels really underhand and not the way legitimate company's operate. I feel scammed!"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Joseph Scruggs",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T09:18:39.000Z",
          "Titre": "Been a customer since 2015",
          "Contenu": "Been a customer since 2015, always paid on time. I logged in using a username, and they must have changed to email login. It doesnt accept my login, works for the app, but not online. Explained all this to customer support and guess what, they tell me I need to login and update my settings!  If I cant login, I cant update.  I have had it with their customer support (Arnel), need reading lessons on what the customers needs are.  3 emails sent and still get these stupid, not useable responses.Update 4 Oct 2023:  Sorry, but you dont treat longtime customers like this and expect to get away with it.  I will use another VPN provider and at the same time, save some money.  Or do u want to offer me a year for free?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "D F",
          "Nb_Reviews": 5,
          "Date": "2023-08-30T02:39:57.000Z",
          "Titre": "WASTE OF MONEY DO NOT BE SCAMMED BEEN…",
          "Contenu": "WASTE OF MONEY DO NOT BE SCAMMED BEEN IN QUE POSITION 1 FOR 11 HOURS NOW AND NO ONE ANSWERS, COMPLETE SCAMMERSTHE VPN IS NOT RUNNING AND DOES NOT WORK, ITS STILL COMING BACK AS MY SAME ISP AND NOT A DIFFRENT ONE - DOES NOT WORK ON APPLE AND DOES NOT WORK ON FIRESTICK -COMPLETE WASTE OF MONEY - HAS DAMAGED MY FIRESTICK WITH ITS FAKE APP. SCAMHAVE REQUESTED MONEY BACK AND REPORTED TO TRADING STANDARDS FOR SCAMS AND TO THE ADVERTISING AGENCY FOR FRAUD AND WILL TAKE FURTHER."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T20:22:32.000Z",
          "Titre": "This company can't get their facts…",
          "Contenu": "This company can't get their facts straight. They charged my card and offer me a reduced rate so I give them the last four digits of my card to confirm and they say incorrect. I tell them I have my card and my statement in front of me and I gave them the correct info and they insist I am wrong. This has all of the signs of a scam and I want ALL of my money back!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marchant Robert Brian",
          "Nb_Reviews": 10,
          "Date": "2023-09-26T21:15:14.000Z",
          "Titre": "Complete and utter rubbish",
          "Contenu": "Complete and utter rubbish. Used this service very infrequently but when I tried  it would not do a 'Ronseal' and do what it says on the tin,  all i get is techno babble and quotes from the T&C's from their so called help line."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Purple UnicornHunter",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:03:59.000Z",
          "Titre": "Spend your money with a different service",
          "Contenu": "This is by far one of the worse customer service experiences I have ever had. First the service stopped letting me sign in, so I stopped using it. I was unable to sign into my account and cancel prior to the renewal date (I reset my password so many times I got an error telling me I did it to many times and to try again later) so they charged my card $95 dollars. After contacting and wasting over an hour the problem WAS NOT FIXED. They even reset the password and I copy and pasted and still couldn't get in. Their answer was just reboot the computer and try again later. The customer service reps I dealt with made me feel like I was a liar and stupid( Myco and Irish). If you are thinking of using this VPN service, DON'T!!!! I will be contacting my bank over the fraudulent charge and then filing a complaint with the BBB. STAY AWAY!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emile Greenhalgh",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T10:31:41.000Z",
          "Titre": "Refuse to cancel subscription",
          "Contenu": "IPVanish gave a good service, but when it came to renewing the price more than doubled. So I cancelled my subscription (via their website) before it was due to renew...or so I thought! They still took the money from my account anyway and refused to refund. There are plenty of other VPNs out there which don't try and rip you off like IPVanish"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jay",
          "Nb_Reviews": 2,
          "Date": "2022-11-13T20:29:28.000Z",
          "Titre": "Absolutely crap",
          "Contenu": "Absolutely crap, their online page is a joke, you log into your account and theirs basically nothing their. then they set up a new \"account portal\"what another load of crap they wont recognise my password. So i selected cant remember and they said they sent me and email to change my password.. That didnt arrive so now ive an accout that i cant log into! and they dont even give you an option to cancel your account!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T19:42:12.000Z",
          "Titre": "Website promises 30 moneyback guaratee",
          "Contenu": "Website promises 30 moneyback guaratee.  They do not honor that. Their product did not work with my version of windows so I immediately cancelled.  Very confusing website (I'm sure that is intended).  You should not trust this company.Followup:  I did contact support and they told me that they only give the money back guarantee to 1 year or 2 year orders.  I had a 30 day order.  It was not clear when I tried your product that I had to have a 1 year order to get my money back.  This is a somewhat hidden restriction for the 30 day moneyback guarantee.  It doesn't make any difference though, because I now believe you to be an untrustworthy company.  I you want to keep my $12 then I guess go ahead and keep the $12,  but I will always give you a bad review."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Wake",
          "Nb_Reviews": 4,
          "Date": "2023-10-04T16:10:20.000Z",
          "Titre": "Took out over £90 the following year…",
          "Contenu": "Took out over £90 the following year when I didn’t need the service and Iam now struggling to get my money back, leave well alone scammers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Whittle",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T17:54:09.000Z",
          "Titre": "IPVanish has charged my account twice…",
          "Contenu": "IPVanish has charged my account twice for renewal causing my account to be overdrawn.  Even after calling and speaking with someone.  They gave me misinformation on the first call and then refused to pay the overdraw charges even though it is their fault that 2 charges were run.  We have done business with them for years, but they obviously don't appreciate me as a customer. Don't do business with them and definitely don't give them a credit card number."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Rob Wiebe",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T20:27:46.000Z",
          "Titre": "It works……BUT…….",
          "Contenu": "The service works… but you need to waste half of your day to try and get anything changed on your account because you don’t get to control anything even though you pay for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T01:09:04.000Z",
          "Titre": "i am so pissed for days now you keep…",
          "Contenu": "i am so pissed for days now you keep sending me password  s ad codes to try andgey i pvanish back on line to me. NOTHING works::::::: WHY caNT you techs doa remote install pf the i p vanish IF  YOU CANT MY LAWYER SAYS YOU HAVE # DAYS TO DO SO OR WE SUE>"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Terrell",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T17:41:11.000Z",
          "Titre": "poor customer service",
          "Contenu": "I have been using this program for well over a year now and it's been great until their last update. I haven't been able to connect to my emails or search the internet with it connected since. i contacted support and they wanted me to change all my settings to conform to their updates which would cause my pc to run poorly. I asked for a refund since i just recently renewed my subscription and was told I couldn't get a refund since i was well over the 30 days. they changed the program I didn't ! I wouldn't recommend  IPVanish for that reason."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mike willgress",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:37:51.000Z",
          "Titre": "I have been with IPVanish for seven…",
          "Contenu": "I have been with IPVanish for seven years and had few complaints Until they took my yearly subscription £89 last November since then IPVanish has only worked intermittently and suddenly the program disappeared from my computer. I have tried on numerous occasions to reload the program to no avail. It is with sadness that i must now look for a new provider. Goodbye IPVanish"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jac",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T15:56:33.000Z",
          "Titre": "Will Take Your Money Even After Account Cancelled",
          "Contenu": "My account is inactive because this app did not work. It has taken two payments in a month span. I took it to support & they only refund on the two year policy, not monthly. Even with proof it was a wrongful payment taken out. There are way better apps, don’t be like me. Do your research before paying anything! This place is continuously taking money out of my account every 2 weeks."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Deniz",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T13:54:58.000Z",
          "Titre": "It doesn't even work with YouTube and…",
          "Contenu": "It doesn't even work with YouTube and who knows how many other sites, definitely not worth to subscribe beware! You pay for it to not even work, they don't mention it on their sites but I reached out to their customer support and indeed, they admit it does not work with YouTube and say there's nothing they can do about it. It's not a good VPN service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Donna Hill",
          "Nb_Reviews": 8,
          "Date": "2022-11-08T11:57:42.000Z",
          "Titre": "Rip you off after cancelling!",
          "Contenu": "Went through the cancellation process, even took a screenshot with date and time of me doing so, yet still took subscription money the next month. I emailed and asked for a refund with proof of cancellation but they still refused and their robot of a customer service agent kept emailing me the refund policy.I'm not interested in your policy! Give me my money back!!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Sameer",
          "Nb_Reviews": 4,
          "Date": "2023-03-16T07:22:46.000Z",
          "Titre": "Unexpected Termination of Account",
          "Contenu": "I have been using IPVanish for more than two years and have paid for it. One fine morning, they suddenly send an email with the following message:Dear valued subscriber,We regret to inform you that IPVanish is no longer able to service your account, and your subscription with IPVanish has been terminated.We appreciate your understanding in this matter and wish you all the best.If you have any questions or issues with your termination, please feel free to contact our customer service team.Sincerely,IPVanishNo reason provided. No advance notification. The account is closed and I cannot login anymore.How can they terminate a subscription without informing us in advance or issuing the refund? They seems to exist to cheat customers and steal their money. Don't trust them"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew Smith",
          "Nb_Reviews": 14,
          "Date": "2022-11-21T11:45:41.000Z",
          "Titre": "don't trust them",
          "Contenu": "they never let you know your subscription is due, cancelled it last year, but they still took a payment, cancelled it again this year, tried to contact someone can't get to anyone, will no have to do it via bankthis company can't be trusted"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jonathan w",
          "Nb_Reviews": 23,
          "Date": "2022-11-13T17:29:54.000Z",
          "Titre": "bad service useless vpn",
          "Contenu": "keep trying to charge me and no option to cancel available.   I'm supposed to let them take money so I can cancel even though I'm not committed.    the service is TERRIBLE. the vpn itself isn't fit for use, lag spikes slow connection the geo region is broke.   this company needs closing down.  it is VERY ANTI CONSUMER"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JoAnn Hardin",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T13:04:13.000Z",
          "Titre": "I don't believe the service ever…",
          "Contenu": "I don't believe the service ever actually worked. On top of that, I was double billed in Nov. I just canceled and requested a refund for fees paid today. This was the response:IPVanish will only refund your purchase (Yearly and 2-year plans only) if you have chosen to cancel within the first 30 days of service.If you signed up for a yearly or 2-year plan (Monthly plans not eligible) on our website, you can automatically have a refund processed by logging into our website and completing the cancellation within the first 30 days of your subscription.I did not see this upon subscribing. I have not even tried using the service since November. Buyer be ware. If you want a refund be sure to subscribe to a lengthy plan, for a service which doesn't appear to work and enjoy being double charged for fees!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Betsy Moss",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T21:27:20.000Z",
          "Titre": "Theft",
          "Contenu": "My husband ordered this service last year and used my credit card to pay the yearly rate. We used the service less than 20 times, as it kept disconnecting in it's own. MY card was charged AGAIN for a yearly fee. I did not give MY permission to use MY card for a renewal. I emailed the company, and was told that HIS subscription would be cancelled and MY card would be refunded. My husband then received another email offering the service at a lower rate is we changed our mind, but MY card had never been refunded over 2 weeks later."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 4,
          "Date": "2022-08-04T06:13:04.000Z",
          "Titre": "Not for iPhone or iPad",
          "Contenu": "Bought this at the Apple store, but doesn’t work for iPhone or iPad according to their customer service and my experience.  They also said I had to use a computer.  Only Mozilla browser was suggested as acceptable.  MLB will know your location even with IPVanish connected.  Didn’t work for me. I’ve requested my money back, but no reply so far."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "melissa howard",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T14:44:07.000Z",
          "Titre": "I have read TERRIBLE reviews of this…",
          "Contenu": "I have read TERRIBLE reviews of this company and how not to trust them and they take your money with horrible service.  I hate that, and horrible customer service.  NO thanks.  I will look elsewhere.  Thank you everyone, for your honest, negative reviews.  Greatly appreciated."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Ömer Faruk",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T20:19:23.000Z",
          "Titre": "They deleted my account according to their head.",
          "Contenu": "They deleted my account according to their head. I can not log into my account. I bought a 1 month subscription. My account was deleted after 1 week. I can't get my account back. Ivan from live chat tried to solve my problem. He couldn't solve my problem and left the conversation unannounced. This company is definitely a scam. I recommend you stay away. They take your money and delete your account unannounced."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Bianca",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T03:13:07.000Z",
          "Titre": "Tried it briefly very buggy wouldn’t…",
          "Contenu": "Tried it briefly very buggy wouldn’t stay connected then when it did say connected it seemed not to do anything but say it’s connected I received a refund and I also found that even with the first time discount it’s way over priced"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kellie Telford",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T20:56:38.000Z",
          "Titre": "Customer service is appalling",
          "Contenu": "Customer service is appalling, they just don't give a toss. They locked me out of my account, and I still have 4 months paid for. Stay away from these mudhooks. I replied to the email they put in their responses yesterday, management#ipvanish.com and as yet no reply, if they get this sorted I will change my review but I don't hold out much hope. They are scammers... I had to get another VPN, as IPVanish has been down for 2 days now, with no response from their help crew. Nord is a lot better on performance and price and customer service."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Shane Barrett",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T02:27:53.000Z",
          "Titre": "Absolutely shocking company no customer…",
          "Contenu": "Absolutely shocking company no customer service I put in wrong email by mistake and can’t even log in I tried everything made a email with the wrong email I put in absolutely everything and no customer service tried to get a refund nothing absolute joke not set up right and no customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john suire",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T16:39:51.000Z",
          "Titre": "Difficult to be refunded",
          "Contenu": "I realized that my account was charged for a years renewal and I wanted to cancel. Person was friendly and offered me to refund half my payment if I agreed to a different plan. I refused and preferred a refund. That's when things turn a bit unfriendly. The person said I could not be refunded, that I had to give a 30 day notice, and that \"you signed the contact and you know the rules\". Actually, I never read these minor contracts and didn't know, which is my fault. I have been with ipvanish for years, stopping from time to time, then returning. Money is tight now, so I wanted to drop it for a while. But after this, I won't be back this time. I don't understand these 30 day rules. Why do companies think that they need my money more than I do? Especially for a service that hasn't been rendered yet? I had a gym do the same years ago. Never went back either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deb Az",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T18:47:43.000Z",
          "Titre": "They unauthorized my old credit card.renewed my subscription after I…",
          "Contenu": "They renewed my subscription after I canceled it a month before renewal and charged $99. On a old canceled credit card and refused to credit me back. DONT USE THEM!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "yums",
          "Nb_Reviews": 7,
          "Date": "2023-02-21T11:51:05.000Z",
          "Titre": "Don;t deliver the services they say they do",
          "Contenu": "Say on their website that they provide VPN in certain countries like Nigeria, but when you sign u for premium it turns out they don't."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NiniC",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T10:31:50.000Z",
          "Titre": "Paid for a two year subscription and…",
          "Contenu": "Paid for a two year subscription and still no activation email. What's the delay? I would never order from them again. When I pay for something I expect it right away. money was taken from my account immediately."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Robbie",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T00:51:10.000Z",
          "Titre": "I have been a customer of this company…",
          "Contenu": "I have been a customer of this company for several years. Unfortunately, I forgot to turn off the automatic renewal feature, and as a result, I was charged an annual fee without my approval. Despite my attempts to resolve this issue with one of their customer service representatives, all they did was send me links to their policies that state a no refund policy. Therefore, I recommend considering an alternative company's services instead."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Andrew Hard",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T13:50:26.000Z",
          "Titre": "No subscription",
          "Contenu": "I have just canceled my first yearly subscription 5 days ago.But they don't refund back until now.That 's wrong support and bad."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JORDAN CARR",
          "Nb_Reviews": 9,
          "Date": "2022-12-05T21:31:54.000Z",
          "Titre": "STAY CLEAR",
          "Contenu": "Used the software less than an hour, wasn't a fan of the GUI, didn't get a great connection.Zero help on livechat, was told i can't get a refund.. i literally have statutory rights, not that this company cares. Just want your money.Stay well clear."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Ian Samways",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T11:50:06.000Z",
          "Titre": "Renewal",
          "Contenu": "My renewal was 2/9/2024 and they took payment 2/9/2023 and refuse to return my money! Even offered me a deal on my own many!! Not happy at all be careful people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Cook",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T04:50:14.000Z",
          "Titre": "I can't remember my email man and I…",
          "Contenu": "I can't remember my email man and I can't log in and you guys don't have a way around that that's a problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J S",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T01:32:43.000Z",
          "Titre": "DO NOT PURCHASE THIS SERVICE",
          "Contenu": "DO NOT PURCHASE THIS SERVICE You would be wise to go with another service provider. Horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T01:35:26.000Z",
          "Titre": "DO NOT PURCHASE THIS SERVICE",
          "Contenu": "DO NOT PURCHASE THIS SERVICE You would be wise to go with another service provider. Horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Gingrich",
          "Nb_Reviews": 4,
          "Date": "2023-01-31T02:42:54.000Z",
          "Titre": "Service will VANISH. Your money will VANISH then you will need to search for a reliable VPN provider",
          "Contenu": "I asked support for help because my isp blocks me from refreshing my iptv only when the vpn is active.  I subscribe to the vpn to hide my iptv use because they buffer my connection when I watch the iptv. During chat sessions,   Ipvanish had twice told me level 2 dev would respond to my issue but they never bothered to respond either time. I have the chat transcripts to prove. They also state on their site they have 24/7 support but when I tried contacting them tonight at 12:30 AM est, the bot told me there was nobody online to help me.  So much for their nonexistent support.  I have over 2.5 months left on my contract but I guess I'm SOOL to get help. Glad I arranged contract termination at the end of this subscriptionAdded: Wes emailed me at 6:24pm tonight(Jan 23 2023) asking for my PayPal invoice ID as proof of account ownership and when I noticed the message at 9:21pm, I replied and provided the ID. Since then, they've made no further contact.  I need the issue resolved and don't want to keep waiting. I first addressed the issue with them last weekADDED JAN 30 2023: after i emailed them AGAIN, they called me today but told me they no longer offer the ability to cast from device to tv. I still have  over 2 months left on my subscription and noticed this issue about 2 months ago and  can't use the vpn to prevent my isp from monitoring me then buffering my connection. This vpn is useless. They also DIDN'T offer any refund. BUYER BEWARE. Your service and money will vanish, though"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Beaton",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:48:03.000Z",
          "Titre": "I would have given them no stars if I…",
          "Contenu": "I would have given them no stars if I could.It wasn't until I few months ago after installing another app on my android phone that I found out that IPVanish lied and is still lieing to their customers.It says it right on their privacy policy and right after you install it on your phone, that they protect your privacy.They don't, they let Google and another company called Adjust put their tracking right in their app, so these company's can steal your personal information right from your phone everytime you use their app, they let these company's do this because they are greedy and don't give a st about your privacy.I have proof with screen shots of their app being open or closed and Google trying to get 32 personal things off my phone 258 times in about 10 minutes.Advise, find a VPN that actually does what it's says about your privacy.With Google and Adjust company's inside the the IPVanish app, they don't  just try and take counts or what pages you are viewing, Google requests your postal code, email address, GPS location, first and last name, what app you are using, what device you are using, these company's try and request 32 different things from your device, which is no ones business but my own, it's an easy fix really, take these evasive Companies from your app, then your app might be true with your so called privacy statement, until you get rid of Google or Adjust, we as customers don't have privacy within IPVanish..Now IPVanish wants to take this off line, because they don't want everyone to know how they have lied to their customers, I have deleted IPVanish and now using a real VPN the doesn't let companies take your personal information."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Aftermidnight",
          "Nb_Reviews": 51,
          "Date": "2023-07-03T10:19:30.000Z",
          "Titre": "So they have updated the application…",
          "Contenu": "So they have updated the application for mac and made it miserable this vpn sucks for mac now"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T19:01:36.000Z",
          "Titre": "Terminated account",
          "Contenu": "Terminated accountI received this email below:Dear valued subscriber,We regret to inform you that IPVanish is no longer able to service your account, and your subscription with IPVanish has been terminated.We appreciate your understanding in this matter and wish you all the best.If you have any questions or issues with your termination, please feel free to contact our customer service team.Sincerely,IPVanishI made contact and was told due to RBI my account has been Terminated due to being located in India.I am not located in nor have I ever been located in India and considering this is a company that deals with IP Addresses and can see my location and that it has not changed in the years I have been with them I have lost confidence in them.Apparently my billing address is in the US and was previously in India?What are they doing with my data as this has never come from me I have no India or US affiliation so struggle to understand how this is possible.How secure is my data?How can they not know where I am when on their app it shows your IP Address and location.I have been told I will receive an email about the refund for the ten months I am still owed.If I receive it I may improve the review as before now I have had no issues but I don't believe I will have confidence to return to them and will probably go with NORD or another provider as they don't have a clue how my billing address can be incorrect and if I did not give them this information is it not fraudulent changes to my data?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ricky Hales",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T23:07:01.000Z",
          "Titre": "DO NOT USE IP VANISH",
          "Contenu": "DO NOT USE IP VANISH. This company has continued to try to take money from my bank 5 times in the past month without authorisation. On 20th Aug i received an email to say my subscription was due to be renewed on 25th Sep 2022 as IPVanish set up auto renewal. The email stated If you wish to change your service, log in to your Account Portal and select the ‘Subscription’ tab. To which i exercised my right for my subscription to not be renewed and end on the this date. I was then contacted by Jelynn from the IPVanish Support Team stating \" We are reaching out because you mean a lot to us. We can see that you are looking for a less expensive option. I am delighted to be able to offer you the next year of IPVanish for only $28.80  ( a 68% saving off of our $89.99 standard VPN Subscription) I then received 3 additional emails all the same \"Hello,I wanted to follow up with you regarding our last message. Let us know if you're interested in proceeding and a member of our team can help you immediately. Jelynn I never replied as I had already made my decision and had changed my preferences so that my subscription would end as above.On the 26th November I then received an email telling me my payment method could not be charged. Why have these people tried to charge me?More emails followed stating my account will be suspended. I have contacted them numerous times advising that I do not want to continue any subscription with them and to stop trying to take money from my account without authorisation and all I get is the same response. For me to cancel I must provide them with my card details, full name and post code"
        },
        {
          "Note": 1,
          "Lieu": "UG",
          "Pseudo": "Ivan osugwari Musisi",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T14:33:18.000Z",
          "Titre": "I'm new here and not yet experienced",
          "Contenu": "I'm New here and not yet experienced with the service but I hope illness enjoy the most."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Daniel Sirbu",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T23:12:54.000Z",
          "Titre": "You have 30 days money back…",
          "Contenu": "You have 30 days money back guaranteeafter you paid. After 40 days their app will stop working, f scammers and don’t give money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toshalyn Erve",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T13:51:21.000Z",
          "Titre": "Beware of the free trial and their Customer Service if and when you have an issue!!!",
          "Contenu": "I got IPVanish at a recommendation of someone I was doing business with because I was having trouble with my firestick reception and it turned out I didn't need the service. I realized this a day or two into getting the service so I made sure I canceled within the 30 day free trial period window. I no longer had the service and this company still charged my Paypal account and I had no idea until this year when they charged it again 84.99!  They were trying to delay giving me that back but I got my bank to refund it right away and after almost 3 months of going back and forth with Wes from IPVanish I still have not received my refund that they were never supposed to take in the first place because I canceled my service within the first two days during the \"free trial period\". Do not use their service because if you have any issues their customer service is HORRIBLE it seems like Wes is the only employee at the company because he claims I can't talk to anyone else their is  no one on a higher level that I can talk to. At this point I am not even sure I will get my money back I feel like every time I talk to him (only via text btw because there's no number to call to speak to anyone) he always has an excuse as to why its taking so long to receive my money that they never should've taken in the first place and tried to take again...smh!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shakim",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T06:11:20.000Z",
          "Titre": "I was charged for this service but…",
          "Contenu": "I was charged for this service but can’t login or change my password"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jason Hawkins",
          "Nb_Reviews": 22,
          "Date": "2023-02-12T21:01:38.000Z",
          "Titre": "Doesn't work unreliable",
          "Contenu": "Doesn't work, cuts off on every setting tried. Lucky if you can stay on the internet for 10 mins with it. Very unstable"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gerald",
          "Nb_Reviews": 4,
          "Date": "2022-09-22T16:05:22.000Z",
          "Titre": "Useless For Me In The UK",
          "Contenu": "If you live in the UK this VPN in my opinion is rubbish!! It is detected by just about every important website and thus you cannot connect unless you disconnect the VPN which defeats the whole point of having a VPN!! The following of my applications will not work with this VPN: BBC I Player, Amazon Fire Stick, BBC F1 audio, Google, National Lottery, BT, Barclays, Natwest, ITV Player and dozens of Retail Sites that will not accept payment with this VPN switched on. I assume dozens of others in the UK that I do not use but you may do, will not work when using this VPN. I have contacted IPVanish and confirmed with them they do NOT have a solution but of couse they do not want me to tell you that so no doubt they will come up with a load of rubbish in reply to this review However, you can trust me because I know what I am talking about and I am lumbered with this VPN until February and I have exhausted all the options. Originally, one idea I really liked was that I could install IPVanish via Merlin software directly on my router which gave me the VPN at source so I did not have to connect each device seperately or install the program on every device. When I did this it looked very promising until I found that it simply blocked at source (The Router)  all the websites mentioned earlier and probably many more and of course in order to fix this I would then have to log into my router to switch the whole program  off in order to get the relevant web sites so nothing worked for me here in the UK. be warned!!!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Padraic",
          "Nb_Reviews": 3,
          "Date": "2022-10-04T05:19:09.000Z",
          "Titre": "I just paid €47.72",
          "Contenu": "I just paid €47.72 When I had a choice for $3.99 but yet I was charged €47.72 my email is still waiting for a response I am so disappointed in a very poor response to my email after payment out.!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "James Haldane",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T16:28:56.000Z",
          "Titre": "No experience to report on.....",
          "Contenu": "No to to have any experience.....So dum question at this point in time..Ask later if it matters still."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake Ocho",
          "Nb_Reviews": 4,
          "Date": "2022-12-08T17:30:34.000Z",
          "Titre": "They never returned money from so…",
          "Contenu": "They never returned money from so called trial, then lied about the refund."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Shahid Khan",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T16:45:29.000Z",
          "Titre": "Whenever i started this vpn my laptop…",
          "Contenu": "Whenever i started this vpn my laptop was being off. The restart option comes on screen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Takeita Locke",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T12:20:58.000Z",
          "Titre": "Never used the app but I could tell…",
          "Contenu": "Never used the app but I could tell from the beginning it’s ran in to misleading because it’s saying pick a two dollar four dollar or five dollar membership paying from either of them but when it’s collection timing they’re asking for way more money smh 🤦🏽‍♀️"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eleyas Khan",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T19:14:40.000Z",
          "Titre": "Really good nice wow beautiful awesome"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customeri.miller",
          "Nb_Reviews": 3,
          "Date": "2022-09-04T18:25:03.000Z",
          "Titre": "bought a sub for this last year for a 2…",
          "Contenu": "bought a sub for this last year for a 2 year deal and now after the first year they want more money...stay away they a bunch of scammers robbing you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:04:09.000Z",
          "Titre": "I have been unable to sign into my…",
          "Contenu": "I have been unable to sign into my account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Enrique Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T12:20:51.000Z",
          "Titre": "Can't cancel my subscription",
          "Contenu": "Can't cancel my subscription, what's wrong with these people"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Scott",
          "Nb_Reviews": 3,
          "Date": "2022-09-11T20:56:02.000Z",
          "Titre": "scammed outa 3 times the cash",
          "Contenu": "picked a pacige at 13 dollers got charged 30 pounds stirlingf when i whent to the saport he treds hard sell saying they dont offer refunds but i could pay another 13 dollers and then get 30 dollers backl its pounds you took and its not permited to hardsell and brech you own coad of conduct scammers and its slow anmd not at all unrestreted load of s\"\"£$ hears my live chat Live HelpTomyCustomer Supportyou billed me tree timesa the price that itr said ment to be around 12 pounds not 30Chat startedTomy joined the chatTomyHi scott, Thank you for contacting IPVanish Support. My name is Tomy and I will be assisting you today.I can help you to check it.What is the email address associated with your active IPVanish account?i was ment to get promotion and i got bvilled full price scotnurewgfuhwer:ui@iufioreifjoei9TomyPlease stand by while I review your account.i want to cancel slow as hell toboot#TomyWe can charge you $14.99 USD for the 3 months plan and then we can refund you $29.99. Is that ok with you?what so u want to bill me again no chance#just refund amnd cancelk like is promised TomyI can refund you $29.99 and we can set to renew on 18th Sep 2022 at a price of $14.99. Is that ok with you?youv left me with very littel iv 2c small kids no cancel and i want 29.99 pounds stirling like you took out of my account#ill go to express vpn farly sure thy know what there doingTomyWe can certainly process your request to cancel the account. Is there anything we can help you with before you cancel? If you use the IPVanish VPN you will be protected so you can try to access any blocked contents or you can stream so no one will be able to track you.IPVanish uses AES 256-bit VPN encryption, the industry standard for data encryption. It makes decrypting your data virtually impossible and is employed by governments, journalists, and privacy advocates around the world to protect their most sensitive data.nope its to slopw to stream no ta refund cancelits not u mate i just hate being flesed refund will return when ?#TomyIf you have a slow speed issue we can help you to check it. Currently, we don't provide a refund for the 3 months plan but I can check with my supervisor for it. Before that if you allow us we can troubleshoot the issue.or If you still wish to cancel the account please provide us with the following details.*your webpage advbertized a price farv lower than you charged me and your webpage states if im not happy i get my mony bk #full name of my partners card ?when will i get my cash back Tomy is typing"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "D L",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T22:26:04.000Z",
          "Titre": "after downloading once the vpn and then…",
          "Contenu": "after downloading once the vpn and then the virus after it scanned my computer for  viruses it pulled my drivers from the boot sector to start the computer and put them in its vault than shut down and restarted with blue screen and wouldn't load again paid 80 dollars to get it fixed contacted them and they said no way i said I've had this computer 6 years never had a blue screen in my life till i downloaded this on my computer .computer was never the same so got a new one thought id just see what happens when i download it on new computer bang with 1 min of loading it closed and came back on blue screen again didnt waste me time mentioning it happened twice now on two diff computers as they would say the brand new computer was faulty noth there software absolutley fuming and cant believe its never happened to any one else ."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Alison Parker",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:44:55.000Z",
          "Titre": "I really love this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Whitney B.",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T01:39:49.000Z",
          "Titre": "I paid 2 hours ago and I am still…",
          "Contenu": "I paid 2 hours ago and I am still waiting for the email so I can log in.... scammish much??!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sarah",
          "Nb_Reviews": 6,
          "Date": "2022-09-21T18:32:59.000Z",
          "Titre": "does not work on my mac",
          "Contenu": "does not work on my mac! and they keep btaking payments. no one to contact!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Baker",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T20:26:06.000Z",
          "Titre": "VPN keeps disconnecting and…",
          "Contenu": "VPN keeps disconnecting and reconnecting. The issue has not been resolved"
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Efe David Oderhohwo",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T00:12:55.000Z",
          "Titre": "I downloaded Ipvanish vpn yesterday",
          "Contenu": "I downloaded Ipvanish vpn yesterday, so I accepted the free trial so I can understand how the app works, then after using it I wasn’t satisfied because that was not what I wanted so I went on to delete my account because I don’t want to do anything with them anymore, so they told me an email will be sent to me so I can deactivate my account, then I received the email and followed the instructions given by them, so after sometime today they debited me of the monthly subscription but you people gave me free trial, and I even cancelled the subscription because I don’t want it anymore, and now they are saying no refund for monthly subscription, please I need my money back please, you guys should refund me"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Patrick Gibbons",
          "Nb_Reviews": 2,
          "Date": "2022-06-23T00:50:13.000Z",
          "Titre": "New interface worse than useless",
          "Contenu": "As a long-time happy user of IPVanish I, like reviewer Sean Daniels, am appalled with the latest update. It's worse than useless. Read his review for more details. Thank God, like Sean, I was able to revert the update back to my previous version but now the app constantly throws up nag popups requesting me to update which I can see no way of disabling. IPVanish What were you thinking?! Change back to the old interface pronto to save your reputation!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maggardamy",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T04:51:10.000Z",
          "Titre": "Give it a try",
          "Contenu": "I’m just now getting it set up"
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Aonkon",
          "Nb_Reviews": 3,
          "Date": "2022-06-30T17:12:54.000Z",
          "Titre": "IPvanish is just so trash and garbage…",
          "Contenu": "This VPN is just so trash and garbage quality. I live in Asia. I used  Surfshark and Nord before. They have a good ping and less packet loss. But in this trash IPvanish 300% or more packet loss in every game. Don' t bother to purchase the subscription for gaming. This vpn is just so trash."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "IPVanishVPN",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T15:36:51.000Z",
          "Titre": "I tried IPVanishVPN for 2 days it…",
          "Contenu": "I tried IPVanishVPN for 2 days it wasn’t for me because it didn’t unblock geo content I asked for a refund but they don’t give back your money if you buy a monthly subscription they only refund your money back if you buy 1 or 2 yr subscription thought I’d let people know."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "יואל דוסוליה",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T22:53:45.000Z",
          "Titre": "Very bad services",
          "Contenu": "They doesn t know the difference between streaming servers for netflix and regular servers ... they are lying in the chat. Not professional at all ... i will never subscribe . If they can not answer to a simple and common question so what will happen if i need them for technical services lol . I suggest everybody to look for an other vpn"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sotirios Thoupi",
          "Nb_Reviews": 4,
          "Date": "2021-09-29T15:00:17.000Z",
          "Titre": "THEY TOOK PAYMENT WITH OUT CONCENT",
          "Contenu": "i cancelled it 2020 through PayPal stopping payment  but this year they managed to get payment i have no invoice for it through paypal i cant find payment email i didnt even relise they took the payment in january they declined a refund ... since streaming became iligal i had not use for this ipvanice any more that was 4 years ago ...i never authorised or new of this years payment still NO REFUND"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T21:04:02.000Z",
          "Titre": "I purchased IPVanish because I spend…",
          "Contenu": "I purchased IPVanish because I spend 50% of my time in Mexico and wanted to use my Amazon fire tv here. I was told IPVanish would enable me to do that just as I do in the US. Not true, Amazon is still restricted due to geographic location. If I had known I wouldn't have bought it"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gary Lindsay",
          "Nb_Reviews": 4,
          "Date": "2021-09-12T09:08:28.000Z",
          "Titre": "This does not work for firestick users overseas",
          "Contenu": "This does not work for firestick users overseas, Amazon blocks it and you are unable to view any content, they have advised they do not currently have a solution to this issue, basically it does not work as advertisedAfter the response from IPVanish I was offered the standard free trial of another product, this also failed to meet my requirements.Disappointing as IPVanish previously worked well."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bob.",
          "Nb_Reviews": 27,
          "Date": "2021-06-25T06:58:21.000Z",
          "Titre": "Continual Server Refresh",
          "Contenu": "Continual server refreshes moving you to USA servers. Despite reporting this several times it has been happening now for months and all you get told by customer services is that it will get fixed on the next update. But it never happens. Will not be renewing this year. I want to be on the server of my choice and not keep having to change back to it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Fums",
          "Nb_Reviews": 3,
          "Date": "2021-06-07T22:00:23.000Z",
          "Titre": "What a horrible excuse of a VPN",
          "Contenu": "What a horrible excuse of a VPN. If you actually want to stay and have a constant connection to the internet do NOT buy this service. Trying to game with it and the servers disconnect ALL THE TIME meaning I lose connection in game too. Don't come at me with a \"please send an email to our support team\" BS; you can't fix a bad all around service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teg G.",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T14:19:06.000Z",
          "Titre": "Wretched",
          "Contenu": "Horrible, non-existent customer service.  Impossibly complicated and annoying service to employ and utilize. The company took my money and provided me nothing of any value; month after month after month after month.  Then, finally this fool gets the ending indignity of paying an additional $33 to kick these swindlers out of my checking account.  They absolutely disregarded all phone and email requests for assistance, discontinuance, or even, compromise."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kerrick Brown M.A.C. Deuce",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T17:25:34.000Z",
          "Titre": "Customer service is very lackluster",
          "Contenu": "Customer service is very lackluster, especially if pertaining to a refund. Im still waiting to get my issue resolved, was speaking with a customer service rep and after providing verification of my identity, I’ve been unable to get any assistance going further, no phone support only email reps."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dongjun Kim",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T07:20:50.000Z",
          "Titre": "I subscribed this service for 1 year…",
          "Contenu": "I subscribed this service for 1 year but some speed isn’t great that I expected so I just turn it off for using regular without Ipvanish. After this issue I don’t have any reason to keep this service for 1 year until next year so I requested to cancel the membership. But they declined because cancel policy should be before 30 days. I do want to refund a partial but they didn’t offer anything. I don’t recommend the service for first time user with 1 year membership."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graham Whibley",
          "Nb_Reviews": 15,
          "Date": "2021-11-01T12:25:02.000Z",
          "Titre": "Ipvanish is rubbish",
          "Contenu": "I have had Ipvanish for a year in that time it has never worked now they have charge me another year and it still does not work, I have tried support but it times out every time before connecting, what a load of scammersI will be asking for a refund if I can ever get hold of them"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Humble Singh",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T23:19:40.000Z",
          "Titre": "cancelled automatic renewal and still charged!!",
          "Contenu": "I cancelled the automatic renewal and they still took money out of my account without my permission! Then I had to go through the HASSLE of contacting this rubbish American company to get my money back. I unfortunately had to deal with a useless person who instead of apologising and arranging a refund was trying to sell me another subscription.SCAM!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Karlie D",
          "Nb_Reviews": 2,
          "Date": "2021-06-26T21:33:40.000Z",
          "Titre": "DO NOT USE IPVANISH.",
          "Contenu": "DO NOT USE IPVANISH.They don't refund the money they sneakly take out and have poor customer service! I have been trying to get my money back (over $100 AUD) and they won't refund it. I will have to lodge many complaints and get my voice heard so they do the RIGHT thing!They CANNOT BE TRUSTED, SCAMMERS!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Kenney",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T14:03:48.000Z",
          "Titre": "Very bad experience",
          "Contenu": "Very bad experience, IP Vanish have taken my money without my consent and have not provided any service. They are saying they won't refund my card despite taking without authorisation. They are very difficult to get hold of there is an automated customer service email which is useless. What should be a quick matter to resolve had drawn out for months, I have contacted management and it is still not resolved."
        },
        {
          "Note": 1,
          "Lieu": "EE",
          "Pseudo": "Dmytro Chasovskyi",
          "Nb_Reviews": 8,
          "Date": "2021-03-09T22:18:50.000Z",
          "Titre": "Morons! Worst service ever!",
          "Contenu": "Morons! Better choose other VPNs. I tested them out to see if I could/want to use them and subscribed for a month, ensuring that the money-back guarantee policy protected me. They rejected paying me back as it was only money-back for an annual subscription. I didn't use the service. The support was useless. Stay away from this provider!!!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T16:19:02.000Z",
          "Titre": "Still waiting 1 month later for credit",
          "Contenu": "Still waiting 1 month later for credit.  Not my problem they have a new finance system on board."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adrian",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T13:07:21.000Z",
          "Titre": "Used the VPN for a year due to it…",
          "Contenu": "Used the VPN for a year due to it effectively costing me nothing with cashback. Deecided after a year it was worth switching to Nord VPN. Cancelled the supscription after receiving a reminder in August amount the extension. IPVanish then took a years payment on 1st October. I immediately contacted them to confirm why and request a refund. It was suggested that the online help I received via their chat didn't have all the information required even though I was given the impression it was resolved and wouldn't renew.They are now asking for an additional payment for the new years subscription which will then activate an automatic payment back to me. Why they cannot provide a refund I don't know. I'm reluctant to give them anymore money given how they have behaved up to this point.Amounts to little more that theft so wouldn't recommend unless its free."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eman Pac",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T00:02:45.000Z",
          "Titre": "Generally Unreliable",
          "Contenu": "Doesn't reconnect automatically, you have to constantly check to see if you are connected, blocks connections on iPhone"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Clark",
          "Nb_Reviews": 7,
          "Date": "2023-10-06T14:39:16.000Z",
          "Titre": "Poor..trying to over charge",
          "Contenu": "When my contract was coming to an end I was offered the full price renewal.  I had to contact IPV to get a better deal which they did eventually offer when I pointed out the available on line deals.  On renewal day what did they do…they charged me the full price and took it out of my account….robbers.Contacted customer service who at first would not honour the deal I was offered, until I told them I had all the conversation transcripts on email….surprise surprise they then honoured what they originally offered.  Really poor service and after being with them for 5 years I doubt very much I will renew at the end of this years contract.IPV need to also offer the best deal to existing customers rather than milking them and offering the best deals to new customers.  Very poor in fact it makes me angry that we are treated this way.Top tip, use the online chat service and use the request transcript button, no arguments then."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T07:20:14.000Z",
          "Titre": "I purchased IPVANISH to stop buffering …",
          "Contenu": "I purchased IPVANISH to stop my network provider from throttling my internet speed. This has not helped. I'm still getting throttled daily, especially when a big game comes on. Most of the time I disconnect IPvanish and the streaming works much better. The main reason that I purchased this VPN was to stop the buffering as a result of AT&T throttling and it has not been successful thus far. If there's anything I can do to improve your system on my end please let me know."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Juan Ramírez",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T23:12:32.000Z",
          "Titre": "Not happy",
          "Contenu": "For YouTube works fine, BUT it doesn’t work on iPad or IPhone for Netflix or any IOS device and they tell you that once you are already enrolled. Bad experience, I would never recommend."
        },
        {
          "Note": 2,
          "Lieu": "FI",
          "Pseudo": "kl dt",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T11:00:12.000Z",
          "Titre": "The 'free trial' is not free",
          "Contenu": "The 'free trial' is not free, they charge you right away.Beware."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "godfrey ayetey",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T16:01:52.000Z",
          "Titre": "Soso",
          "Contenu": "Update i got one refund in google pay so I add one star to this my previous review. ///My Experience with ipvanish ,---anyway got one refund so is abit ok one payment was not refunded as there was a paypal case and is maybe paypal fault too. I liked the service when is was workin and my subscription was working .1 st when its work is work very fine anyway this company disabled accounts without even refunding.I might need to mention I use paypal and is happens that the paypal account i used and the email I register ip vanish was not same mail use in paypal,Anyhow does it matter ? is paid and so I want to use or if can t I want a refund!So I lost 2 accounts in about one month total amount I paid is about 100 euros.*1 st I got the one account there was a promo welcomeback60 coupon code if I remember correctly So that was about 40 euro paid then after a couple of days the account was disabled. What I did then I file a case in paypal. While I always trust anything in paypal. Paypal decide in that case for ip vanish and closed the case saying I receive my product.?? Well is funny isn’t it is a service that supposes to be valid for a year which was disabled after a days.So in my point of view, I did not receive the product I not get what I paid for a year subscription Which could use for a day, so Paypal r u ok ?Than message ip vanish about it ohh they reply me that since I start the case I must get money in PayPal. Hello case was closed in ur favor I can't close the case still u owe me my money or a service that I can t use.Paypal message--*Update on your case  We received the claim(s) you filed on 24 January 2023.  We have reviewed this transaction(s) and are denying your claim(s). This decision was made because we received shipment tracking from the merchant confirming that the merchandise was delivered. We're sorry for any problems you may have experienced with the transaction(s).Buyer Protection.  Transaction informationDispute Case ID xxx Transaction Amount $38,49 USDDispute Amount $38,49 USD Transaction ID:xxx Transaction Date 24 January 2023Ok fine I thought that was a cheap deal and since I like the service when it worked I bought with my phone in google pay.That same story after about a week service is disabled ip vanish support tells me is was canceled on my end.How I can cancel there aint no cancel button all I canceld is automatically resubscribe in after 2024.So ip vanish reply me say is cancelled and I should get back my money from play store, wow great I message play store who let me know I can t get back anything.Playstore message--*problem status We've received your refund request for IPVanish 1 Year Subscription Free trial (IPVanish VPN: The Fastest VPN) for €59.99, Transaction ID xxx  However, this purchase was not made in accordance with our policies.  We understand that this can be frustrating and we apologize for any inconvenience this may cause.Damn this company is serious ????i delete this review if once i get a refund...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marry June",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T02:11:25.000Z",
          "Titre": "I Ipvan sh is a very strong VPN to get",
          "Contenu": "I Ipvan sh is look like incredibly hard protection"
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "Valentines Chido",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T04:26:02.000Z",
          "Titre": "Someone access and change my ip password"
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "Bachlynn Amber",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T10:16:03.000Z",
          "Titre": "Amber Lynn Bach",
          "Contenu": "I’m celebrities you can follow me up"
        },
        {
          "Note": 2,
          "Lieu": "QA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T16:27:39.000Z",
          "Titre": "The service itself is good when it…",
          "Contenu": "The service itself is good when it works but I regularly have problems with the following:It keeps blocking the selected protocolthis time it does not even  let me in with my password saying:An error occurred while sending the request.For the above reasons I have problems using the service on a regular basis."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark E",
          "Nb_Reviews": 11,
          "Date": "2021-11-19T16:20:54.000Z",
          "Titre": "ipvanish billing error",
          "Contenu": "Used ipvanish in 2019 good product and fair price but cancelled in autumn 2019 as no longer needed. Last week almost 2 years later i received an email from PayPal as they had charged me again for no reason. Spoke to ipvanish and they corrected the mistake quickly and easily but no apology for taking money without authority."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ursula Tucker",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T23:26:44.000Z",
          "Titre": "All was well until I cancelled",
          "Contenu": "All was well until I cancelled.  DON'T SIGN UP FOR ANNUAL...8 days = 1 year.  When I signed up, contract stated we had 30 days after our subscription to cancel, but with the annual renewal subscription, you must cancel within the 7 days of the renewal (not $30).  Who knew!!!!  We have not used the service very much... I guess the $92 is more important to Ipvanish than fairness & goodwill."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "brendan james",
          "Nb_Reviews": 2,
          "Date": "2021-05-09T01:01:38.000Z",
          "Titre": "IPVanish’s Fair n Honest Review",
          "Contenu": "IPVanish was difficult to install but worked okay to start with then went downhill and after paying in advance it crashed completely after contacting Support I was emailed 10 very difficult tech tasks to try fixing the connections but no Refund, maybe as I’m from New Zealand way down in the South Pacific my very Bad experience happened, in the end I abounded IPVanish never Returning"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ADMIRAL OZ GAMING",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T01:25:03.000Z",
          "Titre": "when i first paid for the service it…",
          "Contenu": "when i first paid for the service it worked as intended. then it seemed like mlb app, hulu, disney+, espn and others caught on and no longer will load up with this vpn. so it rendered useless. i paid for this so i could watch mlb and other apps with blackout restrictions to bypass... nope. wont work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lea Ann Williams",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T05:03:12.000Z",
          "Titre": "Pricing at first is a tricky",
          "Contenu": "It is a great service and you can add a ton of devices at a cheap rate when you sign up. But, after that, it increases and increases. I had $90 this year when I just cancelled. The year before it was 70. Why would you stay faithful when they only reward the newcomers. I cancelled and can sign up for ½ the price."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Andrea",
          "Nb_Reviews": 4,
          "Date": "2021-03-30T18:10:32.000Z",
          "Titre": "Below to average",
          "Contenu": "Ok vpn, but expensive for what it offers.PRO: Interface is smooth, big amount of servers in different countries, ok speed.CONS: Disconnects all the times although Killswitch option is available , it does not unblock netflix, prime video and any other U.S or U.K streaming service , average speed comparing to competitors, most of ip are banned and you have to resolve captcha even for a google query ... this happens  most of the times.As above mentioned is an ok vpn, but It cannot be used for specific purposes."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Markus",
          "Nb_Reviews": 4,
          "Date": "2021-03-30T19:06:09.000Z",
          "Titre": "Worked great at first",
          "Contenu": "Worked great at first. Had problems and talked to customer support. WORST customer support I've ever had to deal with. They know nothing about their own product and I knew more then they did most of the time. Haven't used it since my problem still hasn't been solved"
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Thomas Åkerlund",
          "Nb_Reviews": 9,
          "Date": "2019-02-11T07:35:53.000Z",
          "Titre": "IPVanish is totally unprofessional",
          "Contenu": "IPVanish is a totally unprofessionally company. They are not even able to supply an invoice for the services they provide. Here's the answer I got when I asked for an Invoice:\"From: Cristina (IPVanish)Feb 11, 2:17 AM ESTHello,As mentioned, we do not have a mechanism in place to generate a full invoice. We can only provide you with a text-only record of your last 5 transactions via email. CristinaIPVanish Support\""
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Grahame Anderson",
          "Nb_Reviews": 8,
          "Date": "2017-08-21T17:30:00.000Z",
          "Titre": "Unworkable speed",
          "Contenu": "I have run IP vanish for several months without issue. However, recently, perhaps since their update, it has been way too slow. We are rural and at best get 39 Mbps but running IP vanish this has dropped to below 2Mbps. Just did a speed check and was getting 19 Kbps..... just cancelled my subscription as I have failed to receive any response from their help desk."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Chrisgo",
          "Nb_Reviews": 2,
          "Date": "2018-03-07T03:29:03.000Z",
          "Titre": "Went back to IPV after a long layoff but found",
          "Contenu": "Went back to IPV after a long layoff. I was hoping they had improved, but alas no. The software continues to connect and disconnect many many times a day, cutting off the download server each and every time. I run win7 ultimate, and have a 20 yr background in IT support, so i am no novice user. The software may work differently on other OS's but on win7 it is rubbish. They know this is and has been happening but obviously have no way or desire to fix it."
        },
        {
          "Note": 2,
          "Lieu": "LU",
          "Pseudo": "uromahn",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T23:02:26.000Z",
          "Titre": "Would be great if speed wouldn't suck",
          "Contenu": "Measured with speedtest.net, I am getting at least 30mbit/sec down and up on any of my devices. However once I connect to IPVanish the best I am seeing is 1mbit/sec down and about 2-3mbit/sec up. This speed reduction is a mystery and unacceptable to me making it practically unusable.\r The only positive thing about IPVanish is the large number of servers across the globe."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "pegasus",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T14:01:39.000Z",
          "Titre": "Saudi Arabia has got your measure",
          "Contenu": "I did use IPVanish in Saudi Arabia for a while (a month or two) and it was OK, not blisteringly fast, but could live with it.\rThen the Saudi authorities got to know you and your service. Now, although your service works in Bahrain, if I try to log on to IPVanish in Saudi, I get a report that my computer is not up to date, and I just cant log on. Pity really."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "ewk430944",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T18:53:55.000Z",
          "Titre": "waste of time. Every half hour down. Terrible slow even using local server.",
          "Contenu": "I've contacten the helpdesk and relay my experiense with ipvanish.  It took the two days to come up with an answere...Reinstalling te software using admin permission  which didn't helped  a bit. Every half  hour  te connection was lost where as Windows creates a new network connection... Speed is zo slow, watching a mp4 movie isn't possible having ipvanish active. Even using the fastest (national) server ..\rFor me what can vanish is IPvanish."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andre P.",
          "Nb_Reviews": 2,
          "Date": "2019-12-06T19:22:14.000Z",
          "Titre": "Terrible Customer Support",
          "Contenu": "I used IPVanish during a deployment it worked For what it was intended to be used for. But once I arrived back to the states I canceled my subscription with them. As time went by I was being continuously charged for a monthly subscription of $10. I emailed customer support multiple times about the issue. They continued to charge me for subscription which by then totaled $90 is charges. They were only willing to reimburse me $20. In order for me to stop being charged I had to contact my bank. Customer service isn’t about people it is about the $$$$"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ashley",
          "Nb_Reviews": 1,
          "Date": "2014-10-12T23:36:33.000Z",
          "Titre": "destroys internet connection",
          "Contenu": "had high hopes with this program. while it does let me access sites i wouldn't be able to otherwise without it, it is very slow. i had to disconnect the program just to be able to write this review because while connected, it said \"could not connect to the internet\" :S i bought a year subscription, and now am regretting it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Armand Cipullo",
          "Nb_Reviews": 2,
          "Date": "2019-05-17T23:02:46.000Z",
          "Titre": "IP Vanish caused all sorts of problems…",
          "Contenu": "IP Vanish caused all sorts of problems with my MacBook Air. Compatibility issues. I use it on my fire sticks but can't use it on my 18month old Mac. Tec support specifically Daniel Lopezis supposed to call me when this issue is resolved. So far he has not contacted me. Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael romigh",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T13:42:52.000Z",
          "Titre": "The info you sent me did not work",
          "Contenu": "The info you sent me did not work. She tried to change all the billing info but it wouldn't take the payment. I don't know if it's because she lives in florids and I live in ohio. If this can't be fixed I'm going to have to find a new vpn. Sorry ty"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alec",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T16:29:51.000Z",
          "Titre": "worst live chat and even email service",
          "Contenu": ".The vpn works only in my PC (windows 8.1)  properly. I've problem installing on dd-wrt and on apple device and I emailed them still they didn't replay me . I hope atleast I can cancel this vpn ( I don't except for refund cos support almost not exist )  easily . Totally overrated VPN service I ever tried ."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "david",
          "Nb_Reviews": 1,
          "Date": "2015-10-22T18:43:43.892Z",
          "Titre": "Its ok but customer supoport doesnt exist imo",
          "Contenu": "I have used it for about 8 months now, not had any real trouble with it untill recently. First off my router settings were blocking the dns. I tried contacting support and got no reply. So since support doesnt exist I have cancelled my subscription and have say 5 days left. Since then though im getting constant disconnects. VPN says its connected, but i get page not available. I contacted support again when cancelling and still nothing from them., Looks like a one man shop. Shame as i had no issues untill now"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "rememoi28",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T23:42:25.000Z",
          "Titre": "not worth any money",
          "Contenu": "Free apps work the same or better on a win 8.1 platform and it's too bad I've given up because I liked the service at first until it became totally unstable . Please advise if you can do anything to help as I'd like to upgrade in the event youd know a way to make things work. Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "sjeffery01",
          "Nb_Reviews": 1,
          "Date": "2014-12-05T18:23:52.000Z",
          "Titre": "Bugs/terminated a month early",
          "Contenu": "Title says it all, It worked well for a while and then in the last few months of use there were constant issues and I always had to play around with it to get it to connect, and then my service ended a month before my year ran out with no message informing me that my service was ending etc."
        },
        {
          "Note": 2,
          "Lieu": "FI",
          "Pseudo": "Jason Borne",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T08:57:51.000Z",
          "Titre": "give zero if I…",
          "Contenu": "I would would also give zero if I could. They took an unauthorised payment (09-2020) from my PayPal account. I only got info of payment to my email. Constant problems with login, password reset says my account is inactive but paid. IPVanish could not ID me ! I provided my paypal statement and they give me incorrect login details with password. excellent job. If I will not get refund to my account I will contact my credid company to process this furter.   WATCH OUT this service provider.*UPDATE*They open me new account with my correct details. Process took around 2 months, did not get refund. Things start moving forward after this feedback."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mad",
          "Nb_Reviews": 1,
          "Date": "2019-10-16T17:59:07.000Z",
          "Titre": "Thought I was covered but it leaked my…",
          "Contenu": "Thought I was covered but it leaked my IP address and now I got a letter from my ISP telling me all the torrent files I have downloaded and they are going to cut off my internet and the Media lawyers are threatening to sue me if I don't pay up"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "NoName",
          "Nb_Reviews": 1,
          "Date": "2014-12-17T18:37:46.000Z",
          "Titre": "Internet download speed",
          "Contenu": "Update IPV software at 16-12-2014 \rstart speed 22 Mbit, this is maximum from ISP\rafter variable time (5 to 10 min) speed drops to 0.8 Mbit\rthen up to 12 mBit, then to 0.7\rspeed is not constant.\rRestart windows, start speed 22 Mbit, then 0.8 Mbit etc.\rReason???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "christopher lista",
          "Nb_Reviews": 2,
          "Date": "2020-01-22T03:10:08.000Z",
          "Titre": "Firestick is very complicated to set up…",
          "Contenu": "Firestick is very complicated to set up and more so trouble shooting tryed pretty much everything with qualified person all of a sudden tv went out still have tv guide but no picture have circle but do have strong internet connection"
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "Sebastien Colpin",
          "Nb_Reviews": 5,
          "Date": "2019-02-26T00:44:15.000Z",
          "Titre": "Too much expensive for a low quality service !",
          "Contenu": "Doesn't unlock TVA Canada nor Netflix ! Cannot be used at Mc Donald's ! Slow and useless customer service ! Extremely expensive ! Servers disapearing without notice ! Some countries missing (China?). Difficult settings..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chaz",
          "Nb_Reviews": 3,
          "Date": "2021-12-02T13:41:06.000Z",
          "Titre": "Cannot Cancel Subscription",
          "Contenu": "IPvanish has the ability to do what it says; but some caveates go with that. You WILL encounter location issues using IP-based apps like Netflix and other functions that attempt to authenticate your IP address. You will die trying to let a site know you are not a Robot until you shut IPvanish down, leaving you vulnerable to what it was designed for. While moving my computing to another solution I discovered I cannot end my subscription on the website. Clicking the Cancel Subscription WILL NOT CANCEL IT. Calling support, they dodged the issue. It's not in their financial bottom line interest. So I removed the payment information which was the only solution. Sure enough I got a notification to update my payment info. So, be careful what you start - you will have to divorce them to end the subscription."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Mike Copland",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T21:58:01.000Z",
          "Titre": "Too unreliable!!",
          "Contenu": "I changed from another provider (more expensive) but from the word go I found IPVanish to be unreliable and effecting other programmes. The Tech solution was to reinstall, but after a couple of these I just gave up and uninstalled forever."
        },
        {
          "Note": 2,
          "Lieu": "HR",
          "Pseudo": "MT",
          "Nb_Reviews": 5,
          "Date": "2020-03-21T11:23:21.000Z",
          "Titre": "I bought this VPN at a higher price",
          "Contenu": "I bought this VPN at a higher price, 15min later I saw it with a discount. I felt cheated. When I contacted customer support they didn't resolve my complaint. I canceled it because of poor customer support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MR MARK BEATTIE",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T19:08:45.000Z",
          "Titre": "Seems to be OK thanks",
          "Contenu": "Not very happy, with this vpn,  it doesn't  seem to be working  here,  just keeps spinning around  and not working .OK seems to be working OK  again for the moment thanks."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Peter Burgess",
          "Nb_Reviews": 4,
          "Date": "2020-11-30T07:22:55.000Z",
          "Titre": "Servers are slow",
          "Contenu": "Servers are slow, It like a free VPN.Not very good others know that your using a VPN so no good Hulu,Prime,ect not like other VPN I've used in the past ....suppose you for what you get......"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T02:52:14.000Z",
          "Titre": "For the past few days",
          "Contenu": "For the past few days, my IPVanish is not allowing me to open the servers on my TV.  It's asking for a password, and when I put the correct one in, it shows up as in 'unknown error\"."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Colin ide",
          "Nb_Reviews": 25,
          "Date": "2020-02-12T19:37:00.000Z",
          "Titre": "IP vanish will not work on my samsung…",
          "Contenu": "IP vanish will not work on my samsung tablet. It only works on my samsung phone.Help desk not much help. Ask you for things you know are working as it works on my phone. Hence the reason for 2 stars"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chaya Keeton-Lucafo",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T23:09:56.000Z",
          "Titre": "Green graph is gone away.",
          "Contenu": "Don't like this format, now that the software update changed it. I like my green graph and now it's gone. Please bring it back or I may leave."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Silvana",
          "Nb_Reviews": 2,
          "Date": "2019-10-30T21:55:47.000Z",
          "Titre": "Very weak and slow",
          "Contenu": "Hi, my connection is very weak, keeps loading and completely stops playing a movie. I’m the only using the internet and yet extremely slow. I rather disconnect it and watch something else."
        },
        {
          "Note": 2,
          "Lieu": "LT",
          "Pseudo": "Renatas Andrejevas",
          "Nb_Reviews": 3,
          "Date": "2015-09-28T18:07:25.955Z",
          "Titre": "Buggy service",
          "Contenu": "I would have given you 1 star only but Im giving you 2 stars because when it works it works well but most of the times it doesn't.\r Issues Ive had:\r 1. Internet connection breaks after running the program. IPvanish is closed and there is no internet. In order to get the connection back I have to connect to IP vanish. There must be some bug on their end.\r 2. Subscription issues. Ive enrolled to auto charge but once the billing cycle ends I have to resubmit the payment, and somehow they payment gets declined and I have to do workarounds to pay them.\r 3. I constantly can't login to the app because of the password issues. Then I have to reset it. But after 5 or so unsuccessful attempts it limits my IP access to the program."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-03T17:17:28.000Z",
          "Titre": "I respect what the program is trying to…GOOD BUT CAN BE BETTER",
          "Contenu": "I respect what the program is trying to do but when it is running there’s to much buffering and it always wants to reconnect to a faster server which turns out to be the same server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "allan2837",
          "Nb_Reviews": 6,
          "Date": "2014-11-28T00:40:23.000Z",
          "Titre": "I hope your technical product is 100% better than your customer NO service.",
          "Contenu": "I actually have no way of knowing how well this product performs, but I have not suffered any on-line security breeches, which likely says it is successful. Pros: no known security breeches, no degradation of data speed. Cons: Numerous loss of connection with DNS server requiring reconnection. A non-existent customer service department. Think of it this way, there is no published phone # for customer service. How are you supposed to contact customer service via computer when your connection is down? Even when you devise a way to get through they don't respond. I placed a request for technical help 28 hrs. ago, still no response outside of an automated response saying someone will get back with me shortly. I would not recommend this product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Forrest",
          "Nb_Reviews": 2,
          "Date": "2020-03-26T14:17:12.000Z",
          "Titre": "I'm not satisfied with the service",
          "Contenu": "I haven't seen any increase in speed and some of my applications will not recognize me when I try to connect. I don't see any value in having this service so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronni",
          "Nb_Reviews": 2,
          "Date": "2019-09-05T02:33:29.000Z",
          "Titre": "Ever since I started using IPVanish",
          "Contenu": "Ever since I started using IPVanish, I've been bombarded with pop-up ads that take me to another window.  I'm fairly ready to cancel and go to another company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Warren",
          "Nb_Reviews": 2,
          "Date": "2019-12-12T14:32:13.000Z",
          "Titre": "Your service started off great",
          "Contenu": "Your service started off great. Now however I have trouble getting it to connect just about every morning. For instance I can't get it to connect right now."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "jeffreyLoliver",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T22:52:48.000Z",
          "Titre": "was good once",
          "Contenu": "Now it goes to the 'starting connection' screen and sits there, forever.  Reinstaled app to no avail. Haven't gone back to providers. My shortcoming I guess."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dozer",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T14:23:53.000Z",
          "Titre": "Great as long as you sit and watch it.",
          "Contenu": "This product works well, WHEN it works.  It loses connection and has to redial frequently.  Kinda defeated the purpose of an ananomizer. if it randomly shuts off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T22:55:23.000Z",
          "Titre": "SugarSync service offered by IPVanish…",
          "Contenu": "SugarSync service offered by IPVanish no longer works on the website for me and I have no access to the information is stored in SugarSync"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "ewk305238",
          "Nb_Reviews": 4,
          "Date": "2014-11-26T11:35:38.000Z",
          "Titre": "Poor performance",
          "Contenu": "This service often is unusable due to very poor performance. The internect connection keeps dropping and the bandwidth is not even 50% of normal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-30T23:10:47.000Z",
          "Titre": "I haven’t had time to troubleshoot yet…",
          "Contenu": "I haven’t had time to troubleshoot yet but after a couple weeks I had to turn it off as nothing could get through it on my IPad."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alberto Zuin",
          "Nb_Reviews": 7,
          "Date": "2021-01-28T10:42:31.000Z",
          "Titre": "Not suitable for firestick",
          "Contenu": "The service does not work on firestick and one week has passed since I posted an enquiry, customer service did not answer yet."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Bee Jay",
          "Nb_Reviews": 1,
          "Date": "2018-02-07T17:02:26.000Z",
          "Titre": "BBC iPlayer will not work with IPVanish when abroad - official confirmation from IPVanish",
          "Contenu": "Despite a number of days of emails back and forth between me and IPVanish about the inability to connect to BBCiPlayer from abroad, with ‘try this city, try this sever, try this fix’, IPV have finally provided this statement:“Despite our best technical efforts, IPVanish can no longer support access to BBC. Our hope is to make IPVanish work with as many websites as possible, but it is more important for us to remain transparent with you about this restriction. The BBC has taken measures to block all VPN connections from IPVanish. Though we have implored the network not to target those protecting their online privacy with our service, these pleas have fallen upon deaf ears. While our team works hard accommodating service access for streaming video, we wish to gently remind you that IPVanish is primarily a privacy product and should be used as such. We apologize for any inconvenience. ”Whether this is the final ‘fob-off’ line simply to close down my ticket, or the reality of the situation, I don’t know, but others might like to draw their own conclusions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T20:51:21.000Z",
          "Titre": "Having problems with connecting to my…",
          "Contenu": "Having problems with connecting to my wifi. Has been trying for over an hour.😢. Can you help?"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Antonio",
          "Nb_Reviews": 3,
          "Date": "2019-05-17T20:35:41.000Z",
          "Titre": "I still don’t understand how I ve been…",
          "Contenu": "I still don’t understand how I ve been disconnected from IPVanish- everything was working fine and I paid for it"
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "Sylvester Agah Cool money",
          "Nb_Reviews": 3,
          "Date": "2022-09-25T03:16:30.000Z",
          "Titre": "I love it",
          "Contenu": "My friend  tell me about it I love it"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "chris wilkinson",
          "Nb_Reviews": 6,
          "Date": "2019-06-27T19:50:09.000Z",
          "Titre": "Haven’t been able to log into my…",
          "Contenu": "Haven’t been able to log into my account for weeks. Neither can I access their website to cancel my renewal"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dianna",
          "Nb_Reviews": 2,
          "Date": "2022-01-31T22:09:40.000Z",
          "Titre": "Does not work on Windows 10",
          "Contenu": "Does not work on Windows 10. I have done everything possible and still won't work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2019-06-26T23:54:36.000Z",
          "Titre": "Ipvanish are some petty betties",
          "Contenu": "So i downloaded ipvanish last week. I only bought the monthly service since i was unsure about the service. I wanted it to stream videos and stuff on My amazon firestick. The service worked great. I had no buffer or anything in my videos. I decided that i wanted the yearly subscription. But i also wanted the discount code offered by one of my favorite youtube channel. So i cancelled my subscription. Do not cancel your subscription if you have ipvanish they'll never forget. So after i got my refund i went back to try to get the yearly deal....nope, it says that my ip has been blocked from downloading the service again. So then i went to the email they sent me about cancelling my subscription and saw if i could just reactivate my old account and try to switch to the yearly plan through the account.....nope! It doesn't work. I can't sign up again.Now i don't know if this is ipvanish doing this but..i try to subscribe to other vpn services. 2 others. There is always a crash when i try to pay for it. I don't know if this is ipvanish putting a real block on my ip but they've completely lost my favor. Avoid this company y'all. Not for service but for reputation."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "ali414",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T21:57:24.000Z",
          "Titre": "website don't work",
          "Contenu": "I can't enter the website and the program don't work after a month of use ...\r (save your money)"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Miss Lynne Douglas",
          "Nb_Reviews": 9,
          "Date": "2020-10-25T11:24:12.000Z",
          "Titre": "I'm having trouble with my password and…",
          "Contenu": "I'm having trouble with my password and I know its   Correct so its been a waste of money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ernest Ramirez",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T19:41:54.000Z",
          "Titre": "Don’t know if it’s really working…",
          "Contenu": "Don’t know if it’s really working because I’m still not able to stream my movies on my mega box"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Marco Baggioli",
          "Nb_Reviews": 25,
          "Date": "2014-11-26T07:25:44.000Z",
          "Titre": "connection keeps on falling off, painful",
          "Contenu": "VPN connection very unstable and I kept on getting disconnected every few minutes... Not worth it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T10:49:08.000Z",
          "Titre": "Great app to have and use now it has so…",
          "Contenu": "Great app to have and use now it has so much more to offer and more for your buck"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jim Reynolds",
          "Nb_Reviews": 10,
          "Date": "2019-11-27T12:05:10.000Z",
          "Titre": "Whenever I have Vanish connected I…",
          "Contenu": "Whenever I have Vanish connected I cannot get subtitles on Cyberflix,Bee TV and Cinema"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "DB",
          "Nb_Reviews": 6,
          "Date": "2017-12-06T13:14:40.000Z",
          "Titre": "Slow, overpriced, rubbish support.",
          "Contenu": "Very slow, overpriced.  Tech support are only capable of sending copy and paste replies."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Michael Lynch",
          "Nb_Reviews": 1,
          "Date": "2019-11-02T13:09:21.000Z",
          "Titre": "A lot of sites tell you that you are…",
          "Contenu": "A lot of sites tell you that you are using a proxy server and won't let you in"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2019-05-17T22:37:40.000Z",
          "Titre": "Disappointed",
          "Contenu": "I’ve been in China for 1/2 a month now, they keep blocking my use of your software."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "ewk573544",
          "Nb_Reviews": 2,
          "Date": "2014-11-28T08:00:54.000Z",
          "Titre": "Throughput too slow",
          "Contenu": "Using the VPN connection, throughput drops significantly. Main reason for not using it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T17:20:09.000Z",
          "Titre": "Easy to set up,reliable and never…",
          "Contenu": "Easy to set up,reliable and never crashes.Not the  Best vpn out there. Slows your broadband too much."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2019-01-31T15:56:45.000Z",
          "Titre": "Didn't work",
          "Contenu": "After I downloaded it, it failed to work even once. Was issued my money back."
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "Nyla summer",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T03:16:40.000Z",
          "Titre": "Can’t make a page"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Wood",
          "Nb_Reviews": 3,
          "Date": "2021-10-17T13:54:20.000Z",
          "Titre": "Unfortunately slower than my ExpressVPN.",
          "Contenu": "Unfortunately slower than my existing ExpressVPN when tried."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Caynor",
          "Nb_Reviews": 1,
          "Date": "2019-11-25T23:29:39.000Z",
          "Titre": "Works well",
          "Contenu": "Works well. No problems. Troy at troypoint told me all about it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Saxon",
          "Nb_Reviews": 1,
          "Date": "2018-11-07T00:18:05.000Z",
          "Titre": "It’s as advertised",
          "Contenu": "It’s as advertised , helps streaming and is very functional"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kelvin Diggle",
          "Nb_Reviews": 5,
          "Date": "2019-10-19T10:06:21.000Z",
          "Titre": "No probs as yet",
          "Contenu": "No probs as yet, will see the outcome at a later date"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "mmwaveguy",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T22:31:54.000Z",
          "Titre": "Ping times are too high and see varies from good to bad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ao",
          "Nb_Reviews": 1,
          "Date": "2020-01-12T19:27:31.000Z",
          "Titre": "Need to have a closer connection for…",
          "Contenu": "Need to have a closer connection for Oklahoma"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "StanGeltman",
          "Nb_Reviews": 7,
          "Date": "2020-11-24T18:18:51.000Z",
          "Titre": "Attempted to CANCELO November 14",
          "Contenu": "Attempted to CANCELO November 14, 2020!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T00:07:44.000Z",
          "Titre": "I did not understand the use"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Serena Captain",
          "Nb_Reviews": 2,
          "Date": "2019-05-17T18:42:50.000Z",
          "Titre": "Cancelling the IP is hard to cancel"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "ewk44782",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T16:24:58.000Z",
          "Titre": "not working with android lollipop yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-19T12:24:22.000Z",
          "Titre": "No Amazon prime video or imbd."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mysticism Of adversity",
          "Nb_Reviews": 2,
          "Date": "2020-02-22T15:52:54.000Z",
          "Titre": "problems connecting",
          "Contenu": "Having problems connecting"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2019-06-06T18:29:11.000Z",
          "Titre": "Having problems loging in"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T02:31:59.000Z",
          "Titre": "Slows speed way down"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ANDY TURNER",
          "Nb_Reviews": 11,
          "Date": "2023-12-15T13:34:30.000Z",
          "Titre": "I was looking for a good VPN",
          "Contenu": "I was looking for a good VPN. It said $2.99 or £2.99, can't remember exactly now. Anyway, I accepted the trial @ that price. only to find out it had taken the $89.00 or £89.00 straight away. Not happy at all about this. Sent in a query about it. Took a bit for them to answer, Christmas coming so understand why it took so long. Replied and still waiting for response. I don't think I will get my money back. If they had not took money straight out, I probably would have subscribed next year. Would have been Feb or March before I did though."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kevin Grattan",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T17:25:10.000Z",
          "Titre": "Like the other customers I had issue…",
          "Contenu": "Like the other customers I had issue with the billing, I wasn't informed when my bill arrived and money was taken out which seemed more expensive than Last year after getting in touch they give me a discount apart from this issue it's quite a good service..it would be a good idea if also they could put a dot on the screen to notify that the vpn is working Like the green safety dot that used to be available for free. And next year I would like to be informed prior to renewal as to how much the vpn is going to cost"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "frank scuorzo",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T00:20:03.000Z",
          "Titre": "Server Down",
          "Contenu": "Took awhile to figure out server was down after reloading app on firestick with tech support.Need some app to filter ads coming over as well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Wood",
          "Nb_Reviews": 4,
          "Date": "2023-11-05T17:46:14.000Z",
          "Titre": "Reliable, economical and fast",
          "Contenu": "I've used Ipvanish on several devices for many years.I recently purchased a new Amazon firestick 4K max & wanted to connect via my existing Ipvanish account.I was unable to sign in using my existing credentials. After many frustrating attempts, I tried to contact phone support. After 3 attempts, including leaving a call back number, eventually I called again & was able to connect to support personnel. I was surprised to learn that I could no longer sign in with my existing password, as it contains the special character '#'. I was also informed that the character '!' cannot be used.Customers should be made aware of this condition. It would have saved me hours of frustration.Additionally, once signed in, I was unable to connect to my optimum server. I used live chat & was advised to change the protocol from 'wireguard' to 'open VPN'.Following this advice, my device is now successfully connected.Strangely enough, all my other devices are using a password with the # character & are connected via the wireguard protocol.I'm happy with IP Vanish, but the company really needs to share this information with customers, to avoid wasting time & effort."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Xytriza",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T11:19:25.000Z",
          "Titre": "Mixed Experience with IPVanish VPN",
          "Contenu": "I initially purchased the VPN for my friend in Russia, but encountered issues as it was region blocked. I contacted customer support to address this matter, and while I admit I was somewhat frustrated during the process (my apologies for that), I eventually managed to get it working on my own device with manual configuration.I still couldn't get it to work on my friend's device. At this point, I decided to request a refund, only to discover that the refund policy required purchasing the yearly plan, which I found quite frustrating.I continued to inquire about the possibility of a refund, knowing it might not be possible but still feeling frustrated with the situation.Since I couldn't refund, I just decided to use the Windows app on my device, and it works good without the need for manual configurations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clinton Dowd",
          "Nb_Reviews": 3,
          "Date": "2023-10-28T14:47:53.000Z",
          "Titre": "Downloading speed",
          "Contenu": "Initially, there was a 90% reduction in internet speed. On your chat service, I received advice from  Carlos which got the speed reduction down to 45 %. In the interval, I found another resolution to the issue. As my TV viewing is all streaming the speed of downloading is marginally effective."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T10:11:15.000Z",
          "Titre": "Easy to use app",
          "Contenu": "Easy to use, easy to install"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T23:31:26.000Z",
          "Titre": "I reestablished my account",
          "Contenu": "I reestablished my account but when I try to connect my password is not working and when I try to change it I do not receive a code"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Becker",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:26:18.000Z",
          "Titre": "still getting almost the same amount of…",
          "Contenu": "still getting almost the same amount of buffering i did before signing up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Winston Toppin",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T19:26:57.000Z",
          "Titre": "I’m trying to renew my subscription.",
          "Contenu": "I’m trying to renew my subscription.It keeps saying accept the terms and condition but I can only find the terms spelled out not how to actually accept them."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Stephane",
          "Nb_Reviews": 7,
          "Date": "2023-04-30T21:54:11.000Z",
          "Titre": "Works OK but Unsubscribing has been…",
          "Contenu": "Works OK but Unsubscribing has been made intentionally difficult , and client support pretend cancelling where it won't- one month paid and not needed, had to spend too much time to finally cancel"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T00:18:11.000Z",
          "Titre": "My vpn is not staying connected i have…",
          "Contenu": "My vpn is not staying connected i have to keep signing in and does not stay on ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MoreTwztd_",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T02:12:31.000Z",
          "Titre": "This has to be the worst vpn ever",
          "Contenu": "This has to be the worst vpn ever. They over charge me every month. It was supposed to be $2.99 for the first 3 months. The first month I was charge $2.99 and two weeks later I got charge $11.99 every two weeks. You can’t contact them because there is no phone number to talk to anyone so I’m just going to cancel my service and look for another vpn provider this one is way to much for no reason and to charge me every 2 weeks instead of every month that’s no go with me 👋🏽"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Kirscher",
          "Nb_Reviews": 5,
          "Date": "2022-03-23T02:23:42.000Z",
          "Titre": "It downloaded and installed without…",
          "Contenu": "It downloaded and installed without incident. However, I haven't figured out how to tell if it is doing anything, or if it is even running. The UI provided by Firestick isn't very comprehensive, so I don't have much insight into what is running and what is not. (I'm obviously not an expert on the Firestick.)So I guess it's doing what it's supposed to, but I really don't know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Archie Amos",
          "Nb_Reviews": 18,
          "Date": "2022-02-27T04:23:15.000Z",
          "Titre": "Intermittent Connection Breaks",
          "Contenu": "First up I am a trained technician having dealt with practically every aspect of computers except coding since 1983. I installed IPVanish based on a colleagues recommendation without a second thought. For the most I have found the product ok, my biggest and greatest issue with the product is that it doesn’t keep a constant connection. Periodically the software voice will let you know you connection is lost. I will continue to use this product for the time being however connections are too important in my business. I use Windows 10 with 12 go of ram and two 512 ssd drives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "lady veteran",
          "Nb_Reviews": 2,
          "Date": "2021-12-08T05:48:04.000Z",
          "Titre": "Okay VPN but can't log into Yahoo without disconnecting VPN",
          "Contenu": "Many regions to pick from which is great, but when I try to log in to yahoo --a error message keeps coming up---rate limited. When I disconnect the VPN, I can log in but it kind of defeats the purpose of a VPN if I have to disconnect when I go to a sites with passwords. Other than that, its okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philip .",
          "Nb_Reviews": 2,
          "Date": "2020-10-21T10:50:53.000Z",
          "Titre": "When I tried to ad my wife laptop to…IP Vanish is only 1/2 good",
          "Contenu": "When I tried to ad my wife laptop to IPVanish the \"HELP\"  didn't help.  When I activated the live chat I couldn't respond, the chat box would not send my response. On your web site it kept telling me how much it would cost for me to subscribe.   I've already subscribed and paid.  SO  the bottom line is my wife's laptop is not signed on to IPVanish. so you are only 1/2 good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "🩹",
          "Nb_Reviews": 2,
          "Date": "2021-02-19T03:08:57.000Z",
          "Titre": "Making the best of It.",
          "Contenu": "I keep getting spammed the f out, but mostly because I plug my email into places I should be wearing protection for like a email condom or dental dam for my eyes and ears and brain. I’m not sure if it’s even working on my phone but I’m pretty sure it is on my streaming device.  I can’t login with my email and password but I keep receiving emails. I should probably try to reduce the amount of frequencies I’m experiencing or at least redirect-deflect them somehow. 🔫"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T08:46:03.000Z",
          "Titre": "Bad Blood",
          "Contenu": "On 12/20/20, I attempt to login, putting my password in attempt to open, correct password, but would not open \"too many chances\" was the message across my tv screen. I only login once, this is not what I expected from this app, tried again, & again, same message, my bill is paid. Will ask for a refund if continues to happen"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kala ocasio",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T00:29:18.000Z",
          "Titre": "i vanish",
          "Contenu": "I don't have comments to provide, other than I think its wrong that we must pay for tv now a days and on top of that we have to apply for all these apps in order to watch tv, esp. when we are unemployed and trying to pay other bills that are required. I know tv is an option, but under circumstances, my children and wifi would be lost, in order for them to continue with their education, so of course, society has no choice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-20T16:26:36.000Z",
          "Titre": "I'm still new at using this on my…",
          "Contenu": "I'm still new at using this on my Firestick device so I'm still not decided if it meets my expectations. Not having a lot of luck be able to watch a lot of the movies I want to see so I'm feeling disappointed in that aspect. I know some people that like it and it works well for them. I don't think it's for everyone. I do like it on my phone cause it does well in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Karl",
          "Nb_Reviews": 2,
          "Date": "2021-03-15T10:22:51.000Z",
          "Titre": "The 3 stars is because it keeps…",
          "Contenu": "The 3 stars is because it keeps disconnecting. You can be watching something then the sign disappears that says it activate. You then go to ipvanish and you see your not connected even though you have ticked the reconnect and connect on start up. So are you protected when its doing this"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Umar Abid",
          "Nb_Reviews": 31,
          "Date": "2020-06-07T13:05:05.000Z",
          "Titre": "SLOW SPEEDS",
          "Contenu": "To be honest they have their own servers but the but I fond the default setting to be so slow that just turning on this one windows 10 latest build it would be half the speeds i get from my isp. I have 40mb download and with it went to 24 download speeds. I then tired tweaking changing ports and everything setting I could find but in the end it was slow and did not give me very high speed. Mebe on android and ios it better but for windows, it's not cutting the mustard in speeds."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T21:53:00.000Z",
          "Titre": "No way I know if it works",
          "Contenu": "No way I know if it works.  I see the screen, but how do I know?  And there are a few Popular Apps that IPVanish is not allowed to be running to use the App.  Example Amazon Prime, Internet Apps.  I'm sure you know this.  So I have to deselect the IPV and then reopen Prime.Almost everytime IPV will NOT disconnectl, I must REFRESH and reload my Firestick and the Disconnect IPV, then reopen Prime.  Thus I'm going back and forth opening, closing, reopening apps, refreshing, deselecting.  Then at times I forget to RE Connect IPV."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "helmonice",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T18:24:52.000Z",
          "Titre": "Sometimes - Interfere when it should not",
          "Contenu": "Sometimes, this seems to interfere with my web access to normal everyday sites that I have used for a very long time. I never had that problem before, ever. I am giving it time, in hope that I do not continue to have any additional problems with IPVanish, for then I will have thrown my money away for no reason."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rusty",
          "Nb_Reviews": 3,
          "Date": "2020-05-10T16:48:28.000Z",
          "Titre": "I gave it three stars due to the fact…",
          "Contenu": "I gave it three stars due to the fact I'm still learning how to utilize this app so far I've had no problem but there's so much of it that I'm still scratching my head and trying to figure it out but to those of you that are Geeks check it out because it seems to have good options next review hopefully I'll have it all in my head or I will be out of my head I've been on the computer train for many years but one comes along every so often like almost every day and really stumps me...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Hull",
          "Nb_Reviews": 2,
          "Date": "2020-03-24T13:46:42.000Z",
          "Titre": "my internet was slowed down so I exited…",
          "Contenu": "my internet was slowed down so I exited out of IPvanish only to find that I couldn't connect to the internet. I could only connect via IPvanish. I work from home and have applications that require as much speed as I can get. I did a clean reinstall of my computer and didn't download IPvanish again"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Melanie",
          "Nb_Reviews": 16,
          "Date": "2019-12-05T06:32:49.000Z",
          "Titre": "Payment without notice",
          "Contenu": "Took payments without notice. Customer services don’t reply to messages to discuss.  Avoid at all costs.  Update, I have amended my review as I have now resolved this following contact from ipvanish.  It would have been better if the company had notified me before taking the money but they have offered a refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sidney Thurman",
          "Nb_Reviews": 15,
          "Date": "2020-07-19T01:15:56.000Z",
          "Titre": "Although it’s cheap the quality is not",
          "Contenu": "Although it’s cheap the quality is not what I expected! On tv shows the seasons will not play at all! The Nova app is the worst for tv. I haven’t been able to play anything. I am paid up for a year so, I am stuck but I will have to go with the SoPlayer next year if I can’t get better service."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T10:57:15.000Z",
          "Titre": "Decent but not great",
          "Contenu": "Most of the time, IPVanish works fine. Oftentimes, though, it will disconnect from a server at any random time, which is frustrating when I’m watching a show from a different country. Also, when that happens, it often takes a while afterwards to successfully connect to a different server with a reliable connection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gordon Arnold",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T21:02:21.000Z",
          "Titre": "I really can't give any opinion at this…",
          "Contenu": "I really can't give any opinion at this time I bought prescription and have not used it yet and not sure how to set up my internet and the other devices I've been trying to find somebody to explain that to me I haven't found that out yet so I'm paying for something I'm not using"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Amaya",
          "Nb_Reviews": 2,
          "Date": "2019-02-12T19:29:10.000Z",
          "Titre": "Use IPVanish pretty regularly",
          "Contenu": "Use IPVanish pretty regularly. It is pretty easy to use. The main reason why I am giving it 3 stars is because I've found a lot of their labels such as \"Boston\" isn't actually Boston.. It pushes you to somewhere overseas. Pretty misleading and not a one time occurrence. I wish they had MI locations as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer Big Monroe",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T03:34:15.000Z",
          "Titre": "It seems to work ok at times",
          "Contenu": "It seems to work ok at times, and then sometimes my WiFi is still getting hacked. And the next thing is why no one told me about the cloud storage? A friend told me about it but I can't seem to be able to get a registered key to use it!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "J3ffryC02050810",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T10:20:20.000Z",
          "Titre": "Good but not great...",
          "Contenu": "Was satisfied with the service until we started getting blocked by some U.S. network and streaming providers indicating they could tell we were accessing their site from an anonymous IP address. Started with HULU and then the network sites and then amazon. Netflix was still working but I no longer wanted to pay for a service I wasn't receiving in full. Web site, software and support were all very good."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "ewk460498",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T10:02:17.000Z",
          "Titre": "Not all connections are optimised",
          "Contenu": "Nice app and it work but not for all applications I use.\rI have some problems with Outlook 2013 as I cannot send emails, just receiving them.\rFuther I find it difficult other applications to set it up with IPVANISH.\rThe speed is lower then my usual Speed over the normal IP connetion even if I use te fastest Connection offered.\rOn the other Hand, I can watch Videos on Youtube which are blocked in Germany by GEMA and that is nice :-)"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2014-12-02T17:38:45.000Z",
          "Titre": "Good but improvable",
          "Contenu": "Hi guys\r Good\r+ Autostart with Windows\r+ Autohide in Tray on Startup\r+ Fast Connection established\r+ Generally fast speeds\r+ Good Forum\r+ Good Support\r+ Much improved VPN Client\r Improvable\r- Only 1 concurrent connection per device and protocol, others offer 3-5\r- Sometimes high pings even if I'm in the same country\r Wishes\rPort Forwarding Support\rSupport for higher encryption\rShow where I'm connected if I hover over Tray icon"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "A West",
          "Nb_Reviews": 4,
          "Date": "2020-01-28T13:23:27.000Z",
          "Titre": "VPN Client DNS issues when disconnected",
          "Contenu": "When disconnecting from the VPN Client on Macbook, The DNS settings for the computer had been modified by the VPN client and will cause connection issues until either the workstation is rebooted or the DNS configuration is manually returned to your defaults or preferred settings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T13:00:19.000Z",
          "Titre": "Throttling",
          "Contenu": "IPVanish is easy to use, however, it crushes my internet speed.  I understand that VPNs will slow your speed, but I find myself having to turn it off from time to time due to the slow downs.  My connection speed will be reduced up to 90%, which makes it impossible for me to work."
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "debugipbgp",
          "Nb_Reviews": 2,
          "Date": "2014-12-01T20:07:32.000Z",
          "Titre": "Good product but needs some tweaks for reliability.",
          "Contenu": "the application works as promised. My biggest complaint would be that I get disconnected often. The program will automatically reconnect but It would be nice to know why it disconnects so often. I'm assuming it's a capacity issue of some type on the vpn servers.  But overall I am very happy.  I do a lot of network testing and IP Vanish is helpful when you want to test connectivity sourcing from other parts of the country or the world.\rI wish they would add a split tunnel option."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 2,
          "Date": "2019-05-17T19:15:44.000Z",
          "Titre": "Rubbish and waste of money",
          "Contenu": "Found this does not work very well on Amazon Fire stick , as it just never connects just a rolling wheel. Whilst in Cyprus cannot get BBC iPlayer to work keeps getting blocked by the BBC . So overall a waste of money and wished I had not bothered . Will not be caught out again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T02:45:19.000Z",
          "Titre": "I've successfully used IPVANISH on my…",
          "Contenu": "I've successfully used IPVANISH on my firestick, but I'm having issues installing it on my windows PC.  The installation continually fails. I've turned off my firewall, but that didn't resolve the issue."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "112147",
          "Nb_Reviews": 7,
          "Date": "2014-11-26T17:36:50.000Z",
          "Titre": "What support?",
          "Contenu": "I contacted your support department because when starting the computer IPVanish will not start. The only solution I found was deinstalling IPV before shutdown. And install it again every new session. Support did not help at all. By accident I found the reason why IPVanish wants me to deinstall it and reinstall it after I turned on the computer. And found a 'simple' workaround. What I don't know if it is a bug in IPVanish or that it was designed that way.\rIPVanish v2 does not help at all, it is worse than v1."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-13T17:29:17.000Z",
          "Titre": "Connection issues...",
          "Contenu": "After losing connections multiple times last week I contacted the tech support and they ran thru some options. Prior to that I was losing connection every 30 hours or so and after following their suggestion I kept a connection for nearly 63 hours before it dropped off. I contacted them and was told that it wasn't necessarily a problem on their end. I use ipvanish via Amazon Firestick. They don't tell you this when you sign up. I've decided to disconnect it entirely when not using it. I've never used a VPN before and I'm not sure if other VPN have these same problems because they say it could be an issue with my ISP."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 2,
          "Date": "2019-05-17T19:00:08.000Z",
          "Titre": "When IPVanish is connected to servers…",
          "Contenu": "When IPVanish is connected to servers in St Louis my internet connections disappear. I have Century Link as a provider. Could they stop my access to their DNS servers?  When I change to another server location, such as Denver, I get internet access. What the hey?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sandy336",
          "Nb_Reviews": 5,
          "Date": "2020-01-17T19:00:46.000Z",
          "Titre": "IPVanish is not working on FireTV",
          "Contenu": "IPVanish is not working on FireTV. Customer care accepted that it's not working and they are forcing me to buy some other service instead of fixing existing issue.Social media support manager was able to resolve my issue finally."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TD2",
          "Nb_Reviews": 8,
          "Date": "2017-06-23T00:23:25.000Z",
          "Titre": "5 Connections actually means 1 if not using openvpn",
          "Contenu": "Your 5 connections that you pay for is only 5 if you use OpenVPN. L2TP/PPTP/etc is only allowed 1. Not ideal all devices that want PPTP. Update: support responded quickly for my refund request so not bad experience. Wish the pricing was more obvious."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Westy",
          "Nb_Reviews": 2,
          "Date": "2022-03-11T01:50:05.000Z",
          "Titre": "IP Vanish decent but over priced and customer service is awful",
          "Contenu": "IP Vanish was easy to setup and use but costly so when I found another VPN I liked I had a very hard time canceling this product when it was renewal time. I was in the site in and cancelled my service a rep butted in and started telling me he would reduce their price to what I already paid for their competitors. I told them if you want to keep customers renewals  you need to offer the discount before they cancel and then the emails started that they were trying to recharge my credit card for a renewal subscription.They actually tried to charge my card 3 times but failed. Keep demanding I give them my information so they could decide if I was the customer.   So if your a customer I can tell you if you want a better price demand one or leave. I love my new VPN so 27 months for $60 instead of 85 a year. Glad I left!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T11:31:56.000Z",
          "Titre": "I sent emails this morning to…",
          "Contenu": "I sent emails this morning to Switzerland, and they would not send, and when I turned IPVanish off on my smartphone, they went right through..Why does a protective device prevent things being sent or viewed on TV especially Prime?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence Richmond",
          "Nb_Reviews": 1,
          "Date": "2017-07-04T05:02:46.000Z",
          "Titre": "No customer support.",
          "Contenu": "When I first got IPVanish I had trouble using the service,I sent two emails and have yet to hear from them.I had another problem.I couldn't watch movies while the service was on.I emailed and still no reply.Their customer support is horrible."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "mattari",
          "Nb_Reviews": 6,
          "Date": "2014-11-26T09:10:16.000Z",
          "Titre": "Good....but  Italian server is down several times",
          "Contenu": "In general the bandwitdth is great, but the italian server is down many time. Sometimes it's just once in a day, but other times it goes down continuosly for hours.\rI don't want to hide that in those cases I thought to change VPN provider......"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GEORGE MOISE",
          "Nb_Reviews": 1,
          "Date": "2020-02-09T01:52:25.000Z",
          "Titre": "Please, do better!",
          "Contenu": "Hi Guys,The french server has been down now for quite some time. How come you only had 1 server for the whole France. Yet, you advertise having many servers. Not good. You were so highly recommended by Troypoint.com. Oh well!"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "pjotr20",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T23:21:22.000Z",
          "Titre": "great choice of servers but impeding streaming to some extent",
          "Contenu": "great choice of servers but on streaming content lacks bandwidth. strange though because on simple downloads I don't have these problems. sometimes connections stop to let data through however ipvanish doesn't renew such corruot connections."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T00:28:24.000Z",
          "Titre": "So far not very impressed it buffers…",
          "Contenu": "So far not very impressed it buffers alot on my fire stick and it I turn up vanish off it seems to be okay maybe not enough towers for good signal paid for a year I will see how it goes wether I keep it or not"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Gilkey",
          "Nb_Reviews": 3,
          "Date": "2021-01-15T03:24:31.000Z",
          "Titre": "Good Price for the First Year!",
          "Contenu": "Good service. The only negative I have is they offer a greatly discounted price to new customers. The current customers have to pay more than twice the amount. Show some love to your current customers too!"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "ewk575561",
          "Nb_Reviews": 3,
          "Date": "2014-11-26T17:26:08.000Z",
          "Titre": "Its really slow.",
          "Contenu": "Its not my first choice its half the speed as normal internet. On start up many times i get not a automatic login so i must do it manualy. I get really often disconected during downloads. What i like is that i am not traceable and anonymous."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T13:26:20.000Z",
          "Titre": "I unfortunately do not understand how to use, my fault",
          "Contenu": "I unfortunately do not understand how to set up ipvanish and am looking for someone i know who has it and can explain how to set it up to do what is best for me. When i connect not a lot happens that i can see."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jason melling",
          "Nb_Reviews": 10,
          "Date": "2019-09-11T18:12:33.000Z",
          "Titre": "Truthfully the app works great but look…",
          "Contenu": "Truthfully the app works great but look round, you will find it cheaper, aswell wen you don't realise you subscription is up after a year they take you money out for another year without warning, so to me a rip off"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2021-06-20T14:12:40.000Z",
          "Titre": "I'd give it more stars if I didn't have…",
          "Contenu": "I'd give it more stars if I didn't have issues going to reliable sites. I have to disconnect IPVanish... log into my normal Wifi network to access some site that I normally use (daily)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 2,
          "Date": "2019-08-26T22:37:22.000Z",
          "Titre": "Amazon and VPN's",
          "Contenu": "I was truly hoping to eliminate all fees for other services, ie, Netflix, Amazon Prime, Hulu..etc.  Amazon Prime is blocking my being able to stream on the firestick.  Amazon is blocking all VPN's.  Just frustated"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "tonl51",
          "Nb_Reviews": 18,
          "Date": "2014-11-26T09:33:37.000Z",
          "Titre": "Sometimes the connections are very slow.",
          "Contenu": "I have an internet connection of 120 mb.You would expect the connection to IPVANISCH servers are fast.And that happens at the start but after some time the speed drops off.I hope this will improve even.\r sorry for my english"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2020-05-13T13:46:46.000Z",
          "Titre": "Printing problems. Temporary. All good now!!",
          "Contenu": "There are problems I had during the IPVanishApp, that took me hour's to figure out. For example, printing can't  be done while IPVanish is connected...However I'm good now. No  disrespect"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Xavier",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T13:18:07.000Z",
          "Titre": "VPN as expected",
          "Contenu": "IPVanish seems to be a very good VPN because I have not encountered certain issues that I was seeing. However, I haven't seen enough to really be concrete on my decision of saying it is excellent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-31T17:37:04.000Z",
          "Titre": "Easy to set up & use",
          "Contenu": "Easy to set up & use.  Netflix does not work for me when IP Vanish is connected.  Streaming tv doesn’t work either with IP Vanish unless I activate tv service first & then IP Vanish.  Good price."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-19T00:50:54.000Z",
          "Titre": "IPVanish works perfectly if you can…",
          "Contenu": "IPVanish works perfectly if you can find it and log in. I can't find its location on my PC, so I can't log in which means I can't watch Netflix from Mexico. It should not be this difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darren Page",
          "Nb_Reviews": 8,
          "Date": "2019-12-27T17:51:06.000Z",
          "Titre": "i have had ipvanish for 3 years not good",
          "Contenu": "i have had ipvanish for 3 years, it was a cheap deal promising the world, you cannot watch the bbc iplayer on it, i opened a complaint ticket about it and never got a response. i’m not joining gain"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "James Evans",
          "Nb_Reviews": 2,
          "Date": "2021-02-03T14:17:56.000Z",
          "Titre": "good except for occassional lag",
          "Contenu": "It's fairly good service, except occassionally it lags when streaming and connected to default server, but then just reconnect to other location that is less busy and fix the speed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cas Sikora",
          "Nb_Reviews": 1,
          "Date": "2020-06-06T21:47:45.000Z",
          "Titre": "Lots of site available from all over…",
          "Contenu": "Lots of site available from all over the world but the IPVanish really slows down the download speed.  In my case the speed dropped from 80 MPS without IPVanish to 8 MPS with IPVanish on."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Frank Jones",
          "Nb_Reviews": 2,
          "Date": "2019-12-04T11:27:54.000Z",
          "Titre": "When Ipvanish works it works well",
          "Contenu": "When Ipvanish works it works well, it tends to freeze a bit, having some issues but I will keep using it for a bit more and see what happens. I have to stop and restart the app quite a bit.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Lane",
          "Nb_Reviews": 1,
          "Date": "2020-02-23T03:11:57.000Z",
          "Titre": "VPN easy to use",
          "Contenu": "VPN easy to use. The problem I have is it slows my speed down an my TV shows spends more time buffing . Have had to turn off VPN so I could watch some programs. Hope you can get it fixed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 4,
          "Date": "2021-01-25T00:30:03.000Z",
          "Titre": "Most tv apps do not accept IPVanish",
          "Contenu": "Most tv apps do not accept IPVanish, ie, HULU and others. I have to disconnect from it. It only works for apps tht show the latest movies; ie, Cinema HD and a few others."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stan Salisbury",
          "Nb_Reviews": 2,
          "Date": "2019-09-03T15:43:40.000Z",
          "Titre": "It's too soon to properly evaluate…",
          "Contenu": "It's too soon to properly evaluate IPVanish. Sometimes it seems to help and sometimes not. I am currently using it to hide my location, but it's trial and error a this point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frustrated",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T04:09:15.000Z",
          "Titre": "Vanish works great on my fire stick",
          "Contenu": "Vanish works great on my fire stick , but can'ti get your software to load on my windows 10 computer I have spoken with tech support and tried their suggestions to no avail.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samic",
          "Nb_Reviews": 1,
          "Date": "2019-10-18T04:47:55.000Z",
          "Titre": "So far I've had no issues",
          "Contenu": "So far I've had no issues, but it's to early for me to properly evaluate this product. I need more time to properly evaluate this product, to see if any issues arise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T23:25:40.000Z",
          "Titre": "My screens goes blank/disfuntional",
          "Contenu": "My screens goes blank, no connection when it’s connected,  how do I get credit for no screenIt’s been out for 5 days. From oct 18, until now October 23.It’s not working"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T08:54:39.000Z",
          "Titre": "Good experience",
          "Contenu": "I like the product. I used for my work not for my company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NOT HAPPY!",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T11:56:26.000Z",
          "Titre": "Woke up yesterday to a charge that I…",
          "Contenu": "THIS HAS BEEN CORRECTED BY IPVANISH just be aware that IPVanish subscriptions funded by Credit Card or PayPal are designed to automatically renew. (support.ipvanish - DOT - com/hc/en-us/articles/115002074834-Auto-renew).FYI - I changed my 1 Star rating to a 3 Star. Overall I'm pleased with the way IPVanish handle the issue, I just would have liked to have received an email regarding the pending renewal so I could have stopped the renewal before it occurred. Had I received that email they would have earned 5 Stars, as I was pleased with the service up until the renewal.ORIGINAL REVIEW BELOW:Woke up yesterday to a charge that I did not authorize. Apparently when signing up they enroll you in auto renewal. They do this without letting you know. Also, they do not send out a heads up email like other companies to let you know that the auto renewal is about to happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T22:52:42.000Z",
          "Titre": "I have sent a message with no response…",
          "Contenu": "I have sent a message with no response yet as to why my vpn doesn’t stay connected to my iPhone other wise I am very pleased how it works  on my other devices"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Hoffman",
          "Nb_Reviews": 3,
          "Date": "2019-05-18T13:51:02.000Z",
          "Titre": "Slows my internet speed by about a  1/3…",
          "Contenu": "Slows my internet speed by about a  1/3 and at times can’t get it to connect. The I.M. Support is bad ,one guy I spoke with about a problem  mysteriously disconnected."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T02:38:40.000Z",
          "Titre": "I keep having connection problems with…",
          "Contenu": "I keep having connection problems with my laptop. Work well on my phone,  it won’t connect on my laptop. It was at first, but I cannot get it to work anymore."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2019-05-18T03:07:18.000Z",
          "Titre": "I am still looking for a fix for my…",
          "Contenu": "I am still looking for a fix for my email. It does not work with Brighthouse servers and needs a correction to the software.I have been waiting since 4/27/19. HELP!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2019-10-23T11:23:13.000Z",
          "Titre": "Installed software and start program",
          "Contenu": "Installed software and start program, connect , see a graph but honestly can not say I see any speed increase. Not sure if it enhances the speed as it indicated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SergioValued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T15:45:53.000Z",
          "Titre": "Cannot use with certain programs",
          "Contenu": "Cannot use with certain programs. I have to shut it down. The set-up instructions are simple but don’t address this when the option is not present on the menu."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rkayman001",
          "Nb_Reviews": 2,
          "Date": "2014-11-26T16:50:57.000Z",
          "Titre": "Lots of servers. Works well from US. China reliability needs improvement.",
          "Contenu": "I bought a year for two reasons: (a) my company blocks GitHub - can be used to expose corporate secrets - and GitHub, Gist et al are used extensively with StackOverflow and other instructional sites; (b) access to real internet when I'm in China - Twitter, blogs, Google, DuckDuckGo, stream from Netflix, etc. \r Desktop client upgrade looks very nice but has some rough spots where you don't know what it's doing. Nothing too major, easy to overcome and expect will go away with some additional updates/tweaking (most notable is when pinging the full list of servers - sometimes app is not responsive and sometimes you want to force the refresh of ping times but it won't let you.\r Mobile client could work more like Astrill which provides a more seamless iOS experience.\r Anyway you slice it, IPVanish gets the job done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Wilder",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T08:16:42.000Z",
          "Titre": "i need to speak with customer support",
          "Contenu": "i have recently tried to contact a customer support representative and I was unable to speak with anyone to resolve an issue with my account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "art331",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T21:35:47.000Z",
          "Titre": "Improve speeds",
          "Contenu": "Overall, the service does what it says it is supposed to do.  However, some speed improvements would be nice.  My 50 Mbps downstream slows to 8 Mbps down when connected."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-03T21:30:50.000Z",
          "Titre": "Slightly disappointed that it slows my…",
          "Contenu": "Slightly disappointed that it slows my internet speed down on occasion when streaming TV.  Other than that it works as advertised."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Stephen Johnson",
          "Nb_Reviews": 5,
          "Date": "2020-11-28T10:32:44.000Z",
          "Titre": "Still getting use to using it not very…",
          "Contenu": "Still getting use to using it not very good at using gadget but it seem to b working  was alot of buffing but I've up graded so see how it gose"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "CARLOS COLACO",
          "Nb_Reviews": 14,
          "Date": "2019-05-19T09:41:58.000Z",
          "Titre": "Seamless installation issues with bandwidth",
          "Contenu": "Sometimes the bandwidth is not god for streaming.The installation was seamless without issues.I recommend it if it was not the issue regarding bandwidth."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "saitosei",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T12:15:22.000Z",
          "Titre": "Vanishing is good but ....",
          "Contenu": "But the fact that crossing platform like ps4, apple tv and xbox is not quite supported without buying equipment is a down. I have another provider who does this."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "lousy service",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T13:30:58.000Z",
          "Titre": "Customer service leaves a lot to be desired…in fact it is lousy service...",
          "Contenu": "Customer service leaves a lot to be desired...why is it so hard to have a human being call you back so you do not have to wait?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rodriguez Daniel",
          "Nb_Reviews": 4,
          "Date": "2016-07-02T21:43:35.000Z",
          "Titre": "dinosaur customer service",
          "Contenu": "after several attempt contacting IPVanish  trying to resolved a dns leak they never got back to me,, if i am not important neither ARE YOU..  adios amigos.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T04:40:09.000Z",
          "Titre": "So far with the apps I use the most I…",
          "Contenu": "So far with the apps I use the most I haven’t seen anything good. However, there are apps I haven’t tried yet so I can’t say it is a total bust"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IPVanish User",
          "Nb_Reviews": 1,
          "Date": "2014-12-13T21:08:43.000Z",
          "Titre": "Solid VPN service, servers and software. Poor account control.",
          "Contenu": "There is no way to prevent repeat billing from the website other than to completely cancel the account. They still keep a record of your credit card."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Ederaldo Freitas",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T18:40:06.000Z",
          "Titre": "I liked IPVanish and it securety…",
          "Contenu": "I liked IPVanish and it securety features but altough my fast internet connection, IPVanish did not solve my problems with slow streaming."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 2,
          "Date": "2019-12-02T01:08:07.000Z",
          "Titre": "It seem like since I got the service",
          "Contenu": "It seem like since I got the service, I’m not able to watch any of the movies, I’m not sure what’s going on but my systems is buffing more"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-14T14:35:27.000Z",
          "Titre": "IPvanish seems to be doing what it's…",
          "Contenu": "IPvanish seems to be doing what it's supposed to do. I find that I can't connect to my printer when I'm connected to IPvanish."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Valued Customer Lawrence",
          "Nb_Reviews": 2,
          "Date": "2019-11-26T21:47:42.000Z",
          "Titre": "I paid for a few months and after the…",
          "Contenu": "I paid for a few months and after the first few weeks it's stopped working I was very happy with it but now feel a little let down"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LadyZ",
          "Nb_Reviews": 4,
          "Date": "2019-09-07T17:25:49.000Z",
          "Titre": "Sometimes,I just don't know",
          "Contenu": "Sometimes, I just don't know if it is truly working.  My apps still read weather from my area and not my \"new location\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ThrillDriven",
          "Nb_Reviews": 2,
          "Date": "2019-11-14T01:16:09.000Z",
          "Titre": "Number of servers and Task Kill are excellent, not speed, stability and security at pc start up",
          "Contenu": "A lots of servers in all the World, but their speed is not always good, some servers are so slow, in addition to the connection crashes very often. Nice to have a Task Kill that immediatly isolates your dispositive from the net, but it's a big pest to wait to the reconnection every time, may while you are doing something of importance.A serious risk to privacy is due to the fact that IPVanish doesn't start immediately when the computer is switched on, but does in time to connect unprotected wi-fi, with all applications, before you start the VPN. I'm sure that isn't set up any delay for this program. I don't know why so that is always start last.Very nice graphic interface and some tools are useful, like the LAN Task Kill and prevention of IPV6 leaks or DNS leaks. The \"Scramble\" function, instead, does not prevent at all from being recognized as VPN users.Overall, it can be improved a lot, but the bases are good. Nothing to do, though with the real industrial VPNs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T20:32:07.000Z",
          "Titre": "First couple days",
          "Contenu": "First couple days, worked fine, but, now having major delay in WiFi connection and long buffering. What can be done.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Hoey",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T17:12:08.000Z",
          "Titre": "I do a lot of online things that…",
          "Contenu": "I do a lot of online things that require a VPN. IP Vanish works great for me.  I can connect to hundreds of different servers, I typically choose one closest to where I'm staying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "radunn",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:46:13.000Z",
          "Titre": "IPVanish - My Personal Experience",
          "Contenu": "I've am a IPVanish user for several years and have had nothing but success.  The current issue I have (which is not detrimental) is that when I connect to a server my default IP address is displayed as the VPN IP address.  To resolve this 'bug' a simple disconnect/connect resolves this issue; displaying the correct VPN IP address.Aside from this minor issue I am content with IPVanish."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Brown",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:31:33.000Z",
          "Titre": "My service was great except this is the…",
          "Contenu": "My service was great except this is the 5th email I received to complete a survey, when I did the survey yesterday.  It's a little much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Sharer",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T22:05:52.000Z",
          "Titre": "In one week I had two billing issues but all was taken care of…",
          "Contenu": "I've had two billing issues in one week and the employees in chat helped take care of it. I was billed a higher rate (3x more) for my annual subscription, apparently my annual deal ran out and they reduced it. Then I had a double billing for the higher amount and they credited me back that. All in all I would recommend IP Vanish. I've not had issues before in several years."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:41:46.000Z",
          "Titre": "After 2 years of using IPVanish",
          "Contenu": "After 2 years of using IPVanish, I have no complains"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Dusko",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T02:31:01.000Z",
          "Titre": "Purchased a deal for 24 + 3 months",
          "Contenu": "Purchased a deal for 24 + 3 months. Speeds achieved with them were very good however as I had some issues with my IPTV, decided to cancel after a day of use. Got refunded within a couple of days so customer support is amazing. Probably not the best out there but I would recommend it to anyone 👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia H. Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:30:33.000Z",
          "Titre": "The Way to Go",
          "Contenu": "I’m delighted that I can use it on-the-go to protect my devices, even when visiting friends/relatives. Also, I have encouraged them to become a part of the IPVanish family. 👍"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Casper Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:55:11.000Z",
          "Titre": "IPVanish marketing is confusing",
          "Contenu": "Update: IPVanish reached out to help me with my situation. The advertising itself is still a concern, but I am rating 4/5. If you are skeptical about trying their product and opt for a 1-month money-back trial, they capitalize on you and deny you a refund. The fine print states the money back is only for the annual plan. This is predatory because more skeptical people wanting a refund will wish to try 1 month first."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dottie",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T06:34:18.000Z",
          "Titre": "Wrong amount taken from my PayPal a",
          "Contenu": "The amount taken from my PayPal account was way more than the subscription I chose. As it was way out I didn't reply to the confirmation email, hence I have no log on details. Stuck in limbo. Customer services are not very responsive. I've tried to cancel the order but can't find a way. Update. This matter has now been resolved. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Asbjørn",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T08:00:28.000Z",
          "Titre": "auto-renewal changed price without…",
          "Contenu": "Auto-renewal changed price without notification and different price then agreed.It tok some time, but after talking to the Email provided on the feedback, the situation solved it self, and i will continue to use the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARILYN",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T00:05:58.000Z",
          "Titre": "IP VANISH is the Best VPN Service",
          "Contenu": "IP VANISH is up to date with their VPN services. Customer service is okay-  knowledgeable, sometimes does not return calls. I have been with IP VANISH for 4 years, they do not sell your information to other companies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T15:52:44.000Z",
          "Titre": "It worked well on tvOS",
          "Contenu": "It worked well on tvOS. There were some slow downs but server shopping helps with that. The tvOS app could benefit from more settings like its iOS app version (eg., split-tunneling, etc) Otherwise, set up, connection & everything else was as easy as 1-2-3."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheyanne K.",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:54:59.000Z",
          "Titre": "The service is great and there are a…",
          "Contenu": "The service is great and there are a large number of servers to ping off. I guess the only thing is in the US you don't know where the servers are located and you don't know what state you are pinging off. I like to choose my server location/ otherwise it is great."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T18:55:12.000Z",
          "Titre": "ipvanish customer",
          "Contenu": "As i have been a ipvanish customer for nearly 5 years now i can honestly say that their service is excellent and as the www gets increasingly hi tec they have kept up, which includes logging in and changing passwords.Ipvanish is year on year cheaper than all other vpn providers but there are others now that are offering more inviting services like ad blockers which the internet is increasingly making more annoying, still, i have 4 months left to decide."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T16:19:51.000Z",
          "Titre": "Spinning Blue Circle",
          "Contenu": "I still get the spinning blue circle and I will go in and change the location. The three that I’m using are Chicago, Dallas and Boston… However, it might be that it’s my Internet and it’s not IP vanish all and although I really like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Reego",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:33:33.000Z",
          "Titre": "Recently, a couple of issues",
          "Contenu": "Recently, it seems that the IPVanish application really slows my Internet down quite a bit. Can you recommend some settings that may help that.  Also, there needs to be an easy way to take it off of automatic renewal as I know, no refunds are given once it’s renewed. It has worked well for many years, but here lately for some reason it seems to grow in size, it went from like 141 MB to 680 MB and my fire stick kept telling me that I needed to delete some apps.  Has anyone else had this problem lately?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Collette",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T07:53:51.000Z",
          "Titre": "Watch what they charge on renewal",
          "Contenu": "Had I not gotten charged a charge I didn't get agree to and had to get in touch with customer service but when I spoke with Albert he absolutely made it right. I hate that when it comes to renewal time return customers like myself has to call, waste, beg for a better rate, it's just not right.  Others want my business, why don't I give it to them?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 16,
          "Date": "2023-09-30T11:24:43.000Z",
          "Titre": "I had to get in touch with support",
          "Contenu": "I had to get in touch with support, as I wanted to take an offer for a year, as my initial month was ending.Very good support, that eventually sorted it out and gave me the years offer!Maybe not the cheapest VPN on the market, but with excellent support and a good app ( on my Firestick) the price is probably decent.Will be interesting to see what I get offered after my years sub is up."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Walter Medak",
          "Nb_Reviews": 11,
          "Date": "2023-10-09T15:37:43.000Z",
          "Titre": "Works well with the Amazon Cube",
          "Contenu": "It does work well with the Cube, although I can't getting going with Ubuntu 23.04. It either stops unexpectedly or it fails to connect. No reason given. I'll try it later with Windows."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT HUNT",
          "Nb_Reviews": 3,
          "Date": "2022-10-14T17:37:57.000Z",
          "Titre": "Interfacing with other apps iPhone and fire stick.",
          "Contenu": "What I’m noticing is my apps on my Iphone don’t work well with IPVANISH. Also my Amazon fire stick some of the app buffers allot. Google search won’t work, what I have done is disconnected from IPVANISH in order to use what app chooses. I been experiencing these problems since day one of purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T04:03:30.000Z",
          "Titre": "It works very well in most cases",
          "Contenu": "It works very well in most cases. But occasionally, I have to wait a few hours before I can watch my shows on NFL+. I dont know the reason why, so I just keep trying until the games can be watched."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephon",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T13:29:10.000Z",
          "Titre": "Auto Connect Option for Android Devices.",
          "Contenu": "IPVanish is a great VPN with a steady connection, however, I would like to see the auto connect option for unsecured wifi network connections available for Android phones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Disappointed in Canada",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T19:15:13.000Z",
          "Titre": "Had IPVanish for a couple of years",
          "Contenu": "Had IPVanish for a couple of years. I had some issues and customer service fixed the issues promptly. Thanks Doug."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Fergi",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:19:54.000Z",
          "Titre": "I use this for my fire sticks and my…",
          "Contenu": "I use this for my fire sticks and my phone and husband's phone It has some quirks like the vpn indicator nit being able to be used even with the adb shell app fix Itvwould be nice to know when it isn't on.. hoping to get a fix soon and I loving it so far !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T14:36:06.000Z",
          "Titre": "I have not had any issues yet so I…",
          "Contenu": "I have not had any issues yet so I really didn't know how to answer."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jim Corkery",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:11:42.000Z",
          "Titre": "Joe in customer service.",
          "Contenu": "Joe in customer service.Provide me with a competitive price.Jim"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T10:44:22.000Z",
          "Titre": "Good service",
          "Contenu": "Good service Easy to use Fast connection At the end of this month I will Subscribe for one year"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Holdgaj",
          "Nb_Reviews": 5,
          "Date": "2023-10-21T09:47:42.000Z",
          "Titre": "Got this because of the Apple TV app",
          "Contenu": "Got this because of the Apple TV app. Its working well, and the servers are fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cecilb",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T21:14:45.000Z",
          "Titre": "Installation and setup was very easy",
          "Contenu": "Installation and setup was very easy, and implementing usage was smooth.I have not encountered any problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T05:00:55.000Z",
          "Titre": "Great value  easy to use!!",
          "Contenu": "As advertised this was easy to set up, runs very smoothly. Also has a great introductory price, so.i signed up.for the two year plan.Absolutly would do it again."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Harry Haralambidis",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T07:30:46.000Z",
          "Titre": "Up to now ...",
          "Contenu": "Up to now everything is great !I am having a great experience with IP Vansih. I keep exploring it."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Dane",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T06:27:15.000Z",
          "Titre": "IPVanish",
          "Contenu": "Easy install of the VPN, A/V and Firewall.The VPN only eat 20 MB/s out of my 100 MB/s.A/V and Firewall run fine and don't take much system.First year 40 US$ for VPN, A/V and Firewall.So all in all, one of the best VPN's i ever had.Great, a happy camper.  :)))"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Rogers",
          "Nb_Reviews": 5,
          "Date": "2022-08-21T02:23:55.000Z",
          "Titre": "Product works as advertised although I…",
          "Contenu": "Product works as advertised although I don't use every feature."
        },
        {
          "Note": 4,
          "Lieu": "BO",
          "Pseudo": "Brayan Rosas",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T14:25:05.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, It is easy to use, and I had a very good experience while using the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T13:33:15.000Z",
          "Titre": "No Change",
          "Contenu": "There is nothing I can see that you need to cange, keep up your good work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby J",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T19:23:58.000Z",
          "Titre": "Just got this",
          "Contenu": "Just got this. It works well so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T15:06:04.000Z",
          "Titre": "Pretty easy to do \"with instructions\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bert",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T07:26:31.000Z",
          "Titre": "Seems to work as advertised",
          "Contenu": "Seems to work as advertised! No complaints."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer Allan Findlay",
          "Nb_Reviews": 12,
          "Date": "2023-07-29T11:31:37.000Z",
          "Titre": "IPVanish is doing what I wanted it to…",
          "Contenu": "IPVanish is doing what I wanted it to do."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 6,
          "Date": "2023-09-08T11:49:40.000Z",
          "Titre": "Great protection but sometimes…",
          "Contenu": "Great protection but sometimes interferes with apps"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T18:55:04.000Z",
          "Titre": "The rep was knowledgeable",
          "Contenu": "Quick response"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George  Stuart",
          "Nb_Reviews": 3,
          "Date": "2022-06-29T17:10:08.000Z",
          "Titre": "Does the average user actually \"know\"…",
          "Contenu": "Does the average user actually \"know\" if a VPN connection is really working or not?Reduction of advertisements related to searches is a good indicator. They do seem to have been reduced. So that's a good sign. I have IPVanish installed on my 3 Firesticks and my main PC.I wonder if there is a way to install it between my home LAN and my router? That would cause everything on my network to \"filter\" through the IPVanish!"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Zamani Blacky",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T04:23:38.000Z",
          "Titre": "Indian",
          "Contenu": "Am here to make sure you are ready to move forward with the hustle"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rob",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T05:45:21.000Z",
          "Titre": "i purchased ipvanish so i could stream…",
          "Contenu": "i purchased ipvanish so i could stream unthrottled. it certainly seems to have worked because my fire stick rarely buffers anymore.  i don’t know much more about it and the app doesn’t do a great job of educating its users of how to take fulladvantage of the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T19:12:30.000Z",
          "Titre": "IPVanish is a great service that I have…",
          "Contenu": "IPVanish is a great service that I have been using for years. The only issue I have is with the app on my iPhone. I like to use the IPVanish on demand mode with a few exceptions to not turn on for as they are trusted wi-fi. The app will still go into VPN mode for the items I have marked as trusted. Sometimes it works and sometimes it does not. If they could get the app to be more accurate I would give them 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T14:27:16.000Z",
          "Titre": "Pleased Overall, but...",
          "Contenu": "Overall I have been pleased with the IPVanish product.  I primarily use it on my Mac desktop, but I have also found use for it on my iPhone and Firestick devices.  My only complaint is that the product tends to drop connections if left unattended for long periods of time.  For example, I can set the computer to download a list of items, go to run an errand, and when I return the computer is still downloading... but IPVanish is no longer running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2021-12-23T05:39:53.000Z",
          "Titre": "IPVanish is a great app to hide your iP…",
          "Contenu": "IPVanish is a great app to hide your iP address but at some point will disconnect while surfing the internet so if you're doing a transaction like banking just log out then reconnect IPVanish the go about your business , IPVanish is not ment for gaming as ii will disconnect & crash your game. Other than that it's a awesome VPN."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck the Islandbilly",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T08:16:44.000Z",
          "Titre": "My First Time VPN",
          "Contenu": "Got it fairly easy on my kindles and PC. Youtube gave some pointers on the settings. My Windows 11 S mode PC, unfortunately, won't install. I don't know of any way to safely install without giving up my S mode which I like for some reason. Windows S mode does offer free vpn apps, but I'm leary of free after reading C-net's review of them. Anyway, it runs quietly in the background and I haven't noticed any slowdown with my simple browsing and emails. I will look for the next bargain when my subscription expires next year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Diakite",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T01:22:30.000Z",
          "Titre": "Charged me a year after I cancelled",
          "Contenu": "Charged me a year after I cancelled. Make sure you keep watching your statements. Sorta dishonest. If I cancelled your service you should not have access to charge my account. Update: I got this resolved after I called. The service itself was good."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T23:18:34.000Z",
          "Titre": "Uhhh I got recommended this VPN.",
          "Contenu": "Uhhh I got recommended this VPN.. I’m not sure if I’m even using it right i dont really know much about VPN anyway the transactions for the purchase fell threw, im happy too just repurchase. Ok thankyou sincerely, David"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T16:52:45.000Z",
          "Titre": "IPVanish was easy to install and setup",
          "Contenu": "IPVanish was easy to install and setup.  It is less intrusive than others I have tried.  (It still causes problems with some sites.)  Also, it is very fast.  I rated it 4 stars because, if I am shopping, I still get constant ads for what I looked at.  I thought it was supposed to keep my online activity private.  Or am I thinking wrong?  I check to see if IPVanish is still running all the time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Big Mike",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T09:55:00.000Z",
          "Titre": "The product is working great",
          "Contenu": "The product is working great. The issue was reaching a login prompt to sign into the app/launch the application. there should be a login prompt on the main page of the site. The main page contains excessive information about purchasing the product.  This information should be access via a link for additional payment options, along with detail about the plan you are purchasing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Johnjcb",
          "Nb_Reviews": 13,
          "Date": "2021-08-21T10:17:22.000Z",
          "Titre": "Initial setup was a nightmare took over…",
          "Contenu": "Initial setup was a nightmare took over 12 hours to get rectified,Went to site, choose a payment, payed for it, waited and waited for email confirmation, sent a email to support, support tells me to go to control panel, panel asks for username and password which I never made yet, another email to support, eventually screensaved PayPal payment, then went onto live agent chat, and that person gave me my username, which was email, and a reset for password, and it worked."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2022-02-23T20:35:10.000Z",
          "Titre": "A good practical set of features",
          "Contenu": "A good practical set of features, but the colors used [dark green & black background] should be changed for better & easier viewing. Plain black & white with some blue highlighting would be a lot easier for people [like me] with poorer euesight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T15:14:52.000Z",
          "Titre": "you have an exellent customer service,4…",
          "Contenu": "you have an exellent customer service,4 stars will come when i can use beyondtvservices.net works with US being in Canada i can only use canada but not US,otherwise everything else works with US ,i repeat except beyond tv,they also told me to use canada not us .i prefer US for various reason Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T06:58:08.000Z",
          "Titre": "Renewed by hookup on March 22nd for a…",
          "Contenu": "Renewed by hookup on March 22nd for a year....Then on the 31st I had a glitch in the program..Went in to try to correct the problem and ended up getting charged again..This time I assume it was a half year for $ 26.99 not the $ 44.99 that I was charged on the 22nd..My credit card ending in 1825 felt the blow....I really like your service, but  was over charged for it...Thank youJesse Smith."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Norris Beckford",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T18:38:04.000Z",
          "Titre": "The product is good and works well",
          "Contenu": "The product is good and works well, BUT I cancelled last year and was offered a good deal. However, when I agreed to the new deal, I was asked a lot of questions about what I was using the product for which I thought was unnecessary.  When I checked my susbscription I found that it had been paid from my account, without my permission , even though I had cancelled last year and sent proof of cancellation.  I am still awaiting confirmation of how much I have paid without my permission.  So while the product is very good, if you cancel, you may still be paying for it."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Sergio",
          "Nb_Reviews": 7,
          "Date": "2021-04-27T09:38:36.000Z",
          "Titre": "On PC It works fine but not on iPhone",
          "Contenu": "On my PC, the VPN with Colombian servers works fine and I have access of some specifics Colombian services, but on my iphone, with the same Colombian servers, I don't have access to the same services that I do when I connect to the VPN from my PC. It should work the same on both iphone and my PC. For this reason, my rating is a 4."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T15:48:35.000Z",
          "Titre": "Very good app for securing all of your…",
          "Contenu": "Very good app for securing all of your private transactions. Each time you log in the IP address is never in the same location. My only hiccup once in a while is the app will disconnect unexpectantly,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T14:10:53.000Z",
          "Titre": "Server connection drops out regularly",
          "Contenu": "There are times when the server connection is lost and then automatically reconnects. Which interrupts my work as there's no internet connection during this time period.Thankfully, the app does generate a pop-up notification when this occurs, but it shouldn't happen as often as it does."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T13:16:44.000Z",
          "Titre": "We have used ipvanish for about a month…",
          "Contenu": "We have used ipvanish for about a month now and it has helped our live stream tv performance. There has been a few times that the automatic host location was operating with very low download speed. Overall we are pleased with ipvanish."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued CustomerEddie W.",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T14:03:46.000Z",
          "Titre": "I havent had any problems  yet....but…",
          "Contenu": "I havent had any problems  yet....but I'm havent developed  that immaculate trust that it does everything  I heard it does yet...but so far I'm very satisfied..I'm sure that it will  become  a 5 star rating in the near future...and I intend to use it from now on .thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-15T19:19:52.000Z",
          "Titre": "RIGHT NOW",
          "Contenu": "RIGHT NOW, MY OUESTION IS, WHY EVERY TIME I PLAY AMAZON PRIME VIDEO'S, I HAVE TO DISCONNECT MY VPN, IN ORDER TO PLAY THESE VIDEO, A FRIEND TOLD ME TO CHECK OFF PRIME VIDEO IN SPLIT TUNNELING, DID THIS SEVERAL  TIMES AND I STILL HAD TO TURN OFF MY VPN. PAIN IN BUTT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 7,
          "Date": "2021-03-17T14:31:19.000Z",
          "Titre": "Mostly satisfied",
          "Contenu": "So far, I'm pleased with IP Vanish. Between the price and performance, I am pretty much satisfied. My only small issue is that with some devices I have to disconnect it in order to gain access (google, amazon movies, etc.). Other than those micro-issues, I'm content."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gee",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T22:48:00.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, I suppose. I have no idea If the program actually is doing what it claims to do. I haven't seen any indication otherwise, so I will take IPVanish's word that it's program is legit and is functioning properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T00:50:13.000Z",
          "Titre": "The site was easy to use",
          "Contenu": "The site was easy to use. The speed was little bit slow.  Great monthly prices for a VPN."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T14:02:50.000Z",
          "Titre": "Had a hard time  with getting up and…",
          "Contenu": "Had a hard time  with getting up and runing. IPvanish was very help full and explained it very good . I was up and runing .Had a problem later but it was the router. an IP6 still had some kinks  we got that runing also , Happy with IPvanish"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "star u",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T14:50:33.000Z",
          "Titre": "Good",
          "Contenu": "Problem with billing solved."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T08:37:14.000Z",
          "Titre": "Probably the best",
          "Contenu": "Having lived in an obfuscated country, I have great difficulties in using the internet freely even through some prominent VPN apks. IpVanish seems to be the best to deal with such conditions. I wish the price could be more competitive."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Wilm",
          "Nb_Reviews": 14,
          "Date": "2023-09-08T13:20:39.000Z",
          "Titre": "Good and easy",
          "Contenu": "Goodand easy to install"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Brian M",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T21:08:02.000Z",
          "Titre": "It works",
          "Contenu": "It works , reasonably easy to understand and can use without issue (unlike other VPN systems where ou have to be a scientist or programmer to understand what the system is asking u to do!Recommend IPVanish...works for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Budman",
          "Nb_Reviews": 6,
          "Date": "2021-07-13T11:47:15.000Z",
          "Titre": "It was easy to install on several…",
          "Contenu": "It was easy to install on several devices including my television in my fire stick my phone in my iPad it’s tough to review because it’s something that runs in the background and if you don’t see it it’s doing it’s job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T16:23:07.196Z",
          "Titre": "The software does exactly what I need…",
          "Contenu": "The software does exactly what I need it to do and that is to keep my information from falling into the wrong hands. It's user-friendly and sets up in minutes. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2021-05-10T03:09:49.000Z",
          "Titre": "I have tried to get into some channels…",
          "Contenu": "I have tried to get into some channels and it says that it is blocked and to get a VPN, which I have.  I do not know what to do to resolve this issue.  Other than that it is good and it appears to make my connection faster."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat McCarthy",
          "Nb_Reviews": 1,
          "Date": "2021-09-19T17:36:42.000Z",
          "Titre": "The pricing is great",
          "Contenu": "The pricing is great! Ease of installation is just as nice. The only drawback that I am seeing so far, is that some of my TV apps are giving me a difficult time about IP address is showing up that are not mine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T14:43:16.000Z",
          "Titre": "Happy for multi device ability",
          "Contenu": "Happy for multi device ability. Unable to break through some sites. Seems to be preventing me from logging on to chrome and internet explorer: keep getting internet access blocked message."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T17:31:55.000Z",
          "Titre": "Amazing with one exception",
          "Contenu": "Amazing with one exception. If I'm using IPVanish while using cell data rather than wifi my speed is drastically reduced. Often times won't even load the page. Over wifi all my devices work amazingly."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Stefan Butnicu",
          "Nb_Reviews": 12,
          "Date": "2022-04-08T18:41:50.000Z",
          "Titre": "Great value for money but not great",
          "Contenu": "Great value for money but not great, as I could not trick video streaming platforms as to my location. It's up there but not if you really want to hide completely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T19:41:35.000Z",
          "Titre": "Too many surprises",
          "Contenu": "Too many surprises, such as disconnecting without notice, slow start-up, and need to change servers because sites block me.  However, using the VPN gives me confidence that I'm being protected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T14:27:51.000Z",
          "Titre": "Gr8 price",
          "Contenu": "Gr8 price, but it won't start up automatically. I have to go into the app and connect to a server. I have all the check boxes marked, to open automatically, etc. But its ok."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Paul Ogier",
          "Nb_Reviews": 3,
          "Date": "2021-12-13T09:56:25.000Z",
          "Titre": "The speed and price is very good",
          "Contenu": "The speed and price is very good. It would be great if they had more functionality that other providers have. But for the basics, I would recommend them to everyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T13:56:41.000Z",
          "Titre": "I have been having problems signing…",
          "Contenu": "I have been having problems signing into my banking website.  I had to turn IPV off.  This has happened a few times.  I however do not have that problem with other sites."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": ".Chris",
          "Nb_Reviews": 13,
          "Date": "2021-06-07T16:41:28.000Z",
          "Titre": "Met my Expectations",
          "Contenu": "Generally a good app and worthwhile. Can be a little erratic when trying to log in. However, that’s my biggest ‘gripe’. Otherwise, not bad, affordable, would recommend it."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T07:01:45.000Z",
          "Titre": "The speed is good but",
          "Contenu": "The speed is good, tho the software is buggy. Sometimes I connect to the VPN and it says connected to Germany but the IP is for USA!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 4,
          "Date": "2021-10-21T21:46:09.000Z",
          "Titre": "4 Stars but I would of given it 5 - Speed Problem",
          "Contenu": "I subscribed for a one year subscription and this VPN is almost everything it says it is. The different countries it says it streams using it is awesome. I'm in the US and I streamed in UK and Australia so far and it worked great. I didn't try it in other countries but I'm sure it would work there too. The only reason I didn't give it 5 Stars is because the speeds are not what I'm looking for. the mpbs without it reads about 324 upload and 41 download. When I put it on, it drops drastically to 81mpbs upload and 37 download. That's a massive drop. Other than that, I am delighted with the product and would of stayed if it weren't for the drop in speeds. I'll be leaving another review once I cancel. So far the customer service has been superb as well. I have no complaints other than the speed. Two Thumbs Up for me on most of the service.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T09:57:15.000Z",
          "Titre": "I bought a vpn to use on my Amazon fire…",
          "Contenu": "I bought a vpn to use on my Amazon fire stick. The Fire stick recognizedIP vanish and would not play any movies on Amazon Prime.It works great on my phone and my PC ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Roy",
          "Nb_Reviews": 5,
          "Date": "2022-05-24T12:35:00.000Z",
          "Titre": "I find it's hard work trying multi…",
          "Contenu": "I find it's hard work trying multi equipment it was easy on my mobile but hard to do on my firestick other than that it's ok"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "1stxshoppa",
          "Nb_Reviews": 2,
          "Date": "2021-08-10T18:34:27.000Z",
          "Titre": "Too soon to know for real, for real",
          "Contenu": "It's great for now, but it's way too soon to speak on actual results better determined over time. I will know better later, and will update accordingly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith Hardy",
          "Nb_Reviews": 10,
          "Date": "2021-07-21T18:54:13.000Z",
          "Titre": "So far so good!",
          "Contenu": "Very helpful with some issues I had at first, mainly caused by my lack of tecchsavvy. Have used them before when it was fast and useful, can’t comment so far"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T13:04:23.000Z",
          "Titre": "Very easy to install and set up. Only downfall and it seems to true of most VPN companies low cost for 1st year and very expensive renewal at end of 12 months"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Morgan James",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T20:41:27.000Z",
          "Titre": "Struggling with the company and now…speaking in word louder and louder",
          "Contenu": "Struggling with the company and now they are saying that the other day and night and I almost told the company is not a huge fan of the payment"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T14:31:55.000Z",
          "Titre": "Works good, Limited options",
          "Contenu": "Works great! Slightly limited when it comes to choice of countries/cities and their respective servers. All in all, decent VPN."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued TammyCustomer",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T18:07:39.668Z",
          "Titre": "It serves it’s purpose",
          "Contenu": "I’m very new to ipvanish less than 2 Months. I’ve had to restart it which is quite annoying but for now it serves it’s purpose."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony norton",
          "Nb_Reviews": 2,
          "Date": "2021-08-19T07:14:09.000Z",
          "Titre": "Does what it says on the tin and…",
          "Contenu": "Does what it says on the tin and probably more. Not that savvy with these type of things. Having said that was easy enough to set up for my needs."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kevin Neal",
          "Nb_Reviews": 6,
          "Date": "2021-06-17T04:25:49.000Z",
          "Titre": "Good product",
          "Contenu": "Good product. Doesn’t seem to lose speed when active. Kill switch option is handy, as has disconnected unknowingly before. Generally really pleased."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Carter",
          "Nb_Reviews": 8,
          "Date": "2021-08-15T04:47:13.000Z",
          "Titre": "I am new to IPV so I will reserve 1*…",
          "Contenu": "I am new to IPVanish so I will reserve 1* until I am better aquatinted.But so far so good.On my limited experience I would recommend It."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas Trimmer",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T18:32:44.000Z",
          "Titre": "When viewing streams",
          "Contenu": "When viewing streams, I P Vanish causes my screen to freeze. Also, it pauses my screen while viewing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T12:40:31.000Z",
          "Titre": "I like the idea of an extra level of…",
          "Contenu": "I like the idea of an extra level of security on all my devices, but why do I find periodically the app turned off on its own ??"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dmitri Haller",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T06:00:45.000Z",
          "Titre": "Nice and effective but some issues",
          "Contenu": "I have used a lot of VPNs and it is one of the best that I have used. But sometimes it does not work and my original IP gets detected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T00:04:05.000Z",
          "Titre": "My router being used as VPN router…",
          "Contenu": "My router being used as VPN router stopped working.  Had to reprogram it and use a different VPN Server to get internet access."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nick Powell",
          "Nb_Reviews": 10,
          "Date": "2023-12-21T11:37:28.000Z",
          "Titre": "Used IPVanish for several years now",
          "Contenu": "Used IPVanish for several years now!  Found it to be a great app that works well to hide my location.  Selecting an 'a' location enables me to operate MS Outlook 2021 at the same time as the VPN.Have had several occasions where I have needed to contact Customer Support over the years.  I have always had a quick response with a solution to the current problem or lack of knowledge on my part.Renewed for another year earlier this week."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Laurence Silcock",
          "Nb_Reviews": 66,
          "Date": "2023-12-19T14:26:05.000Z",
          "Titre": "Christmas 2023 Renewed ipvanish 5th…",
          "Contenu": "Christmas 2023 Renewed ipvanish 5th year keep me and my family safe with easy to use unlocking geo locked apps The customer service team is always available to solve any issues and I have never experienced one who doesn't seem to know what they are doing. Easy to connect and use. I can literally connect anywhere using as many devices as I want (that's the icing on the cake)"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Mar",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:48:17.000Z",
          "Titre": "Great VPN …",
          "Contenu": "Great VPNThe customer service team is always available to solve any issues and I have never experienced one who doesn't seem to know what they sre doing. Easy to connect and use. I can literally connect anywhere using as many devices as I want (that's the icong on the cake)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TheSlash",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T18:06:21.000Z",
          "Titre": "It works great",
          "Contenu": "It works really good. No issues to report so far. I use it when on public Wi-Fi for banking and I am very happy with performance. Price was good for initial subscription period and renewal price is quoted high. That’s the only thing that will prevent me from renewing the service before it expires."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr William Heeley",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:14:00.000Z",
          "Titre": "Ip vanish is like my family taking care…",
          "Contenu": "Ip vanish is like my family taking care of me on line step by step they hold your hand and when they show you how to use them they fade into the background watching your safe online stuff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:50:12.000Z",
          "Titre": "It does the intended job",
          "Contenu": "It does the intended job. No issues it's a simple interface and has all the necessary options."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Billy",
          "Nb_Reviews": 9,
          "Date": "2023-12-19T13:45:41.000Z",
          "Titre": "Easy and excellent - it just works!",
          "Contenu": "The software is easy to install and configure, performs excellently, and is protecting all my devices. It just works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Escaloni",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T23:00:27.000Z",
          "Titre": "Very effective support after IPVanish crash",
          "Contenu": "I have used the service for several years, and received many upgrades since then.  The latest one together with a Windows update, made IPVanish stop.  I contacted IPVanish for help.  I had to uninstall and reinstall the latest version.  That is when I realized how many updates I received.  Uninstalling took an effort, but worked per the instructions.  The new installation worked great.  It took less than an hour."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Darren TAYLOR",
          "Nb_Reviews": 14,
          "Date": "2023-12-15T16:58:13.000Z",
          "Titre": "Good VPN",
          "Contenu": "Easy to use and works well, maybe introduce a pay monthly amount  of  £5 a month  instead of a full years subscription in one payment   ?"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T12:55:34.000Z",
          "Titre": "Very helpful when I called with a log…",
          "Contenu": "Very helpful when I called with a log in problem (my fault) never have had a problem with connection"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T20:15:51.000Z",
          "Titre": "Great VPN!",
          "Contenu": "This vpn is great! It's very easy to set up and use.  Plus their customer service is awesome. They are always there to help when in need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DIANE",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:00:59.000Z",
          "Titre": "Safety",
          "Contenu": "Once I got in touch with a tech. They fixed my problem and now I'm good. I feel safe to know they are on it. If anything is going on I will be notified. Thank you TeamDiane"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T18:36:53.000Z",
          "Titre": "Another Day in the Jungle",
          "Contenu": "Went on live tech support after receiving a notice from paypal that my act was charged almost 100.00 for a IPVanish renewal. Had not received a notice from IPVanish that act was near renewal. Checked act and it was set to expire on 12/2. Wasn't any time, so I assumed it was for a year, so I explained to tech support that that seemed to be an exorbitant amt. since I was all the time seeing how they discounted subscriptions to new users.  And how I had been a customer for years and there were other VPN companies who would treat me as a \"new user\". Ginno was very professional and patient. He was able to offer me a great deal on my renewal subscription and have the amt I was charged returned to my paypal act. Great people and easy to deal with . Five stars as far as I am concerned"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mr PAUL MCCOWAN",
          "Nb_Reviews": 16,
          "Date": "2023-12-02T15:33:09.000Z",
          "Titre": "A great vpn",
          "Contenu": "As a loyal customer to IPVanish they have looked afterme and they are one of the few companys where you can speak to a human being instead of a machine the customer service cannot be beaten"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete Fenboque",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T23:41:09.000Z",
          "Titre": "Easy to use and install",
          "Contenu": "Easy to use and install. Price is good compared to others.Do I know if it’s working, I have no clue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerry",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T05:42:35.000Z",
          "Titre": "I have used IPvanish for some time now…",
          "Contenu": "I have used IPvanish for some time now and find their tech support is second to none.  I like the way it operates on all my devices and for a long time now no complaints and no issues on any of my different devices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:36:38.000Z",
          "Titre": "Look at what you're downloading",
          "Contenu": "content loading is fast and better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Brands",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:58:19.000Z",
          "Titre": "well working cool but I want no ads and…",
          "Contenu": "well working cool but I want no ads and redirect from 3rd parties using tracker and ads!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Champ Daily",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T05:13:59.000Z",
          "Titre": "IPVanish is the Shiznit!",
          "Contenu": "IPVanish is the Shiznit!! Respectfully! Easy to use and very effective!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Maguire",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T01:42:22.000Z",
          "Titre": "Good Experience.Brilliant customer service",
          "Contenu": "Brilliant customer service, made it very easy to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Otto",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T21:19:15.000Z",
          "Titre": "It's basic and easy to use",
          "Contenu": "It's basic and easy to use. User interface is simple and easy to grok. Nicer looking than Surfshark's confusing and busy UX. Works well. Not all the features I'd like but I'm satisfied and just re-renewed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RS S",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:56:03.000Z",
          "Titre": "the support is great..any problem…",
          "Contenu": "the support is great..any problem always quickly solved...price is also great..software works great too...."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:51:27.000Z",
          "Titre": "Useful program",
          "Contenu": "Useful program. Works perfect. Good support service."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Antonio M",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:27:28.000Z",
          "Titre": "Best VPN",
          "Contenu": "I have been using IPVANISH for over 6 years.  The service and support has been nothing but excellent.  Excellent Tech support when needed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "TERENCE MCCRORY",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T16:40:21.000Z",
          "Titre": "The renewel charge was far to much and…",
          "Contenu": "The renewel charge was far to much and I complained  got the refund which was not aproblem. Then got a fair deal. I have read that some people have problems with the renewal policy but you can sort it out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T23:12:26.000Z",
          "Titre": "Happy Floridian",
          "Contenu": "Yesterday and today I received the best help I could have ask for, extremely knowledgeable and the most courteous, I’m glad to have chosen IPVanish for my VPN.You make me a very happy customer Thank you very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Washington",
          "Nb_Reviews": 7,
          "Date": "2023-11-11T23:21:21.000Z",
          "Titre": "Great VPN",
          "Contenu": "I used IPVanish, years ago and I’m STRONGLY considering using it again! At that time, I received a special discount, but don’t remember where it came from! I will be trying IPVanish, again!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "George Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:28:52.000Z",
          "Titre": "Why Change....",
          "Contenu": "The program meets all the criteria required to fulfil my needs. If I could get a little more incentive I would never look for another program to replace what I have."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jon Cooper",
          "Nb_Reviews": 11,
          "Date": "2023-11-03T11:36:21.000Z",
          "Titre": "Great Value VPN",
          "Contenu": "I wanted a VPN that was simple to use but offered maximum protection at a reasonable price. I was extremely pleased that IPVanish was easy to install and worked well on my PC, mobile and firestick device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara James",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:53:02.000Z",
          "Titre": "Prompt response to a query",
          "Contenu": "In answer to a query, I received information that would correct a situation and allow me to sign on to a safe website. I've felt confidence in Ipvanish since I first used the app. I know it is protecting me when a site either refuses to allow me access or list my location as somewhere other than where I am."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Somewhat good but confused",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T17:45:29.000Z",
          "Titre": "I've been using them for years",
          "Contenu": "I've been using them for years. Inexpensive but thorough with wonderful follow-up if there is a problem. Looking forward to another year of great service with them"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:56:20.000Z",
          "Titre": "Easy enrolled Membership giving great…",
          "Contenu": "Easy enrolled Membership giving great protection at a sensible price! Highly recommended..!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JonGee",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:27:12.000Z",
          "Titre": "Simply a great VPN",
          "Contenu": "Easy setup App. Unlimited devices. Multiple Worldwide Servers. Wire guard security with easy useful guidance. And finally very good value at a sensible competitive price. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:51:47.000Z",
          "Titre": "Just a bit of a problem but the service…",
          "Contenu": "Just a bit of a problem but the service rep took care of all the issues and now everything is all right"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Stewart",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T20:31:11.000Z",
          "Titre": "Cost, availability and service",
          "Contenu": "I've used IPVanish in Costa Rica as well as the United States. They have multiple servers worldwide that I connect to all the time. Their service is always reliable.  I love the unlimited number of connections as well. The cost is competitive, and the remewal fees are very reasonable.  Don't know why they aren't on every list as one of the best VPNs to use"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Braithwaite",
          "Nb_Reviews": 4,
          "Date": "2023-09-16T23:35:13.000Z",
          "Titre": "I was unable to log in and contacted…",
          "Contenu": "I was unable to log in and contacted technical support who helped sort it out.   As a suggestion, why cant IP Vanish send a blanket email to all users to advise that  a change like 'full email address is needed for the app'.This should be easy and save them getting heaps of tech support queries.  Happy with IP Vanish but will shop around before next renewal as price is quite high for Australian users."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Walden",
          "Nb_Reviews": 15,
          "Date": "2023-12-14T01:55:18.000Z",
          "Titre": "Very good does the job it is supposed to do well done.",
          "Contenu": "The perfect product which does the job it is supposed to do."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Randy K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:22:16.000Z",
          "Titre": "Had a problem with the OS Windows 7.",
          "Contenu": "Had a problem with the OS Windows 7.They responded with a fix and now ALLis good.Thanks, Randy K."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Content Sales",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T21:45:49.000Z",
          "Titre": "IPVanish provides really easy to use download, dashboard settings are easy to navigate.",
          "Contenu": "IPVanish provides really easy to use software that downloads across different mobile devices. Also their customer service support is AWESOME! Questions get answered and any system glitches are resolved during 1 point of contact. Their pricing is also reasonable and you truly get more bang for your buck! First time user of VPN and very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr North",
          "Nb_Reviews": 18,
          "Date": "2023-12-11T21:17:50.000Z",
          "Titre": "great service as always fast a rliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelah",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T01:48:01.000Z",
          "Titre": "IPVanish is a great VPN",
          "Contenu": "I have used IPVanish for several years and have never had any problems with the service.They have excellent customer service.They're attentive, knowledgeable, and answered my questions and resolved my issue to my satisfaction.The issue was not due to the actual service by IPVanish.I highly recommend IPVanish to anyone be it family or friends."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "patricio jr cantiller",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T06:53:56.000Z",
          "Titre": "Ipvanish was great apps",
          "Contenu": "Ipvanish was great! Ive been using it for more than 5 years. Unfortunately, I have to try another vpn apps to and ill see how it goes.Thanks for your service and would certainly recommend this apps to friends!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 5,
          "Date": "2023-10-09T16:27:39.000Z",
          "Titre": "A quality service at a reasonable price",
          "Contenu": "Their price is reasonable. All the server connections that one would require. Easy to set up for basic use, but provides more advanced settings for fine-tuning. Support is very good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Norman",
          "Nb_Reviews": 14,
          "Date": "2023-09-25T13:37:53.000Z",
          "Titre": "Recently had an issue with not being…",
          "Contenu": "Recently had an issue with not being able to log in, the on line support was fantastic and I was logged back in within 20 minutes. Support staff know the product well and issue I had and i did not have to keep explaining whatthe problem was unlike other tech support chaps."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "The Mack",
          "Nb_Reviews": 4,
          "Date": "2023-09-03T16:31:20.000Z",
          "Titre": "Virtually Private Network",
          "Contenu": "IPVanish have been using IPVanish the last 3years primarily on Linux, put occasionally on PC and Android. The fact it is available cross platform is essential and it has an extensive spread of VPN servers.Upgrading from Ubuntu 20.10 broke my VPN connections and surfing the net was useless. However after contact customer support I had a FIX within a week which explicity told me the issue and the workaround.The mark of a really good organisation is the level of support after they have your money and IPVanish were prompt, professional and knowledgeable; highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:27:41.000Z",
          "Titre": "Ipvanish is a useful VPN",
          "Contenu": "Ipvanish is a useful VPN. It does what it suppose to do. It was recommended to me by a friend who is also a computer tech..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daz brown",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T13:02:51.000Z",
          "Titre": "Great service and very helpful",
          "Contenu": "Great service and very helpful, I'd never heard of IPVanish until a friend mentioned about your services. Thankyou"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "calvin Mcvey",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T15:33:28.000Z",
          "Titre": "Very professional and helpful…",
          "Contenu": "Very professional and helpful information over text"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customery",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T03:20:01.000Z",
          "Titre": "Has allowed me to watch streaming…",
          "Contenu": "Has allowed me to watch streaming services and bank safety"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas white",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:46:57.000Z",
          "Titre": "The best",
          "Contenu": "Customer service is great ip is great I'm happy with this service th. Yall"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ad hand",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T05:15:06.000Z",
          "Titre": "Family of users for several years",
          "Contenu": "I have been using IPVanish for several years now without any hiccups. One issue was resolved within one day. I will continue to use this app and would recommend to others. My kids also use this app"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:33:12.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. I’ve had IPVanish for over 2 yrs and it’s easy to use and works great. Best prices and very effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane A",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:53:31.000Z",
          "Titre": "Great customer service.",
          "Contenu": "What made the experience superb was the great customer service I received from Vins. In this day and age of poor customer service it was refreshing to speak to someone that showed caring and patience with this old woman."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Muenzer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T16:39:45.000Z",
          "Titre": "I have had IPVanish for 3 years",
          "Contenu": "I have had IPVanish for 3 years now and love the service. I have had a couple minor problems over the years, and each was solved with the online chat service.  Wireguard is the fastest VPN protocol to use. Thank you for that! I have had no problem negotiating a better renewal price yearly. I do wish the loyal customers would get a better rate. There are many VPN services out there for cheaper prices, but I'll stay with IPVanish because it works. First time, every time! Thank you for a great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Mikula",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T16:38:05.000Z",
          "Titre": "I am about to come to an end with my…",
          "Contenu": "I am about to come to an end with my 3rd year of having IPVanish as my VPN. I contacted support and was given a lower price to stay with them for another year. The service is great and have had no problems except my IPVanish modem stopped working. So now I just use the app and all is well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Bonanno",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T02:44:48.000Z",
          "Titre": "Excellent servce and protection.",
          "Contenu": "Excellent protection and an excellent support staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Brown",
          "Nb_Reviews": 6,
          "Date": "2023-11-03T15:21:10.000Z",
          "Titre": "Very easy to sign up",
          "Contenu": "Very easy to sign up, connect and stay connected. Our experience so far has been great, and we feel safe."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "alistair.",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T12:29:51.000Z",
          "Titre": "Awesome service & company",
          "Contenu": "Can't understand the negative reviews, IP Vanish is a top service. I have tried many VPNs and this is by far the best in terms of speed, convenience and features. There is even an app for the FireStick, and split tunneling works great for apps that won't accept VPNs. Customer support has been great when I needed it, and pricing is more than fair. All in all a brilliant service and company to deal with. Keep up the good work guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "randy Washington",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T19:15:43.000Z",
          "Titre": "Auto renew was high",
          "Contenu": "Auto renew was high. I called Ipvanish and they gave me special deal for being a loyal customer. They refunded back to my account and also sent email very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T18:25:34.000Z",
          "Titre": "3 year user",
          "Contenu": "I've had IP Vanish for about 3 years now. I've always gotten it on sale since everytime around my renewal date they run a really big sale. Unfortunately they didn't do that this year. I was able to get in touch with customer service fairly easily and explain my situation. Their customer service was absolutely excellent in helping me with my issue. They were able to renew my subscription for about the same price I paid last year. I just wanted to write this review to give not only the VPN itself 5 stars, but also give 5 stars to their support team who went out of their way to help me out. I greatly appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Marsay",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T14:22:13.000Z",
          "Titre": "This is the second time I've signed up…",
          "Contenu": "This is the second time I've signed up to ipvanish, it's fast to connect and dosnt affect my Internet speed.I also use on my phone and have no problem's whatsoever knowing I'm protected with banking is great.Well done ipvanish I am a happy customer and would recommend you to everyone of my friends."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nemanja Dragićević",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T10:21:09.000Z",
          "Titre": "Best VPN!",
          "Contenu": "First of all best VPN, great featires no logs, second, when I needed help from customer support I got a reply immidiately, live chatted until we found a solution to my problem. Great support and great software, recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T15:11:16.000Z",
          "Titre": "I'm befuddled because for years I paid…",
          "Contenu": "I'm befuddled because for years I paid a high cost dollar wise for cable service. I receive hundred times more service from IPVanish than all the services combined. Excellent service of protection. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:43:14.000Z",
          "Titre": "Walter took care of me",
          "Contenu": "Walter took care of me. And was very nice."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Ikaram Ikaram",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:33:01.000Z",
          "Titre": "Irfan",
          "Contenu": "Sar Mera account login Nahin ho raha hai VPN per"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Faye Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:28:29.000Z",
          "Titre": "Service is excellent",
          "Contenu": "Service is excellent!  Been using this app for a few years now!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ollie BC",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T22:39:34.000Z",
          "Titre": "Great deal on pricing",
          "Contenu": "Great deal on pricing, was super easy to install and when I had technical difficulties that wait time was short and the issues were resolved swiftly."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "sergios tsountas",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:32:28.000Z",
          "Titre": "the service was  very good  thanks"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Cliente",
          "Nb_Reviews": 7,
          "Date": "2023-12-16T13:29:15.000Z",
          "Titre": "Outstanding customer support",
          "Contenu": "Outstanding customer support, always there for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "timerrity",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T00:08:28.000Z",
          "Titre": "Quality VPN and support",
          "Contenu": "Very good vpn at a value price. Customer service went above & beyond to solve issue that turned out was not related to vpn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Berry Jr",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T20:51:30.000Z",
          "Titre": "IPVANISH is the greatest IPV on the…",
          "Contenu": "IPVANISH is the greatest IPV on the market! It works, protects & is a phenomenal value for your money!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nik Worthem",
          "Nb_Reviews": 10,
          "Date": "2023-11-29T17:44:42.000Z",
          "Titre": "Excellent service....",
          "Contenu": "Excellent service and the product is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:31:42.000Z",
          "Titre": "Great app",
          "Contenu": "Great app. Easy to use and it really works"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carlito",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T03:38:12.000Z",
          "Titre": "I recently signed up for IPVanish VPN…",
          "Contenu": "I recently signed up for IPVanish VPN and have been blown away by the service. The sign-up process was simple and the installation was a breeze. Once I was up and running, the speed and reliability of the VPN were exceptional. I was able to browse the web, stream videos, and download files without any lag or buffering issues.What really stood out to me was the company's commitment to privacy and security. IPVanish utilizes top-of-the-line encryption and has a strict no-logging policy, so I feel confident that my online activity is secure and private.In addition, the customer support team was extremely helpful when I had a question about setting up the VPN on my device. They were quick to respond and provided clear instructions that made the process easy.Overall, I highly recommend IPVanish to anyone looking for a reliable and secure VPN. The company's commitment to privacy and customer service sets them apart from the competition. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T05:11:42.000Z",
          "Titre": "This VPN works great",
          "Contenu": "This VPN works great on all my Apple devices, including my Apple TV. It is very stable. I don’t get disconnects. It enables me to run apps outside the US that don’t normally work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T03:16:51.000Z",
          "Titre": "Renewal Process",
          "Contenu": "I have had IP Vanish for three years now and have not had any problems that couldn't be solved with an email or phone call.  I still operate a laptop using Windows 7.  They provided me a VPN version to accommodate my Operating System (OS) even though they are using upgraded versions for current Operating Systems.  They always modify my annual cost to a lower amount.  But I do have to contact Customer Service around renewal time to negotiate a change in price.  If anything, I would like to suggest to your business, for the subscribers that have a long standing order with your services, when a person is coming up for annual renewal, IP Vanish should reward and advertise exclusively to those customers, beforehand, a reduced renewal rate to inspire repeat/recurring service.  Instead of having the customer contact and haggle a reduced rate.  There are so many VPN services always advertising great deals to steal business away from you.  Customers like to have attention.  It makes us feel wanted, even though we already know this.  Validation if you will.  When a customer is handed a reduced renewal service plan prior expiration, it makes the process and decision easy.  Easy is good.  Reward loyalty and excite your customers. Thank you. Dale"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Grimley",
          "Nb_Reviews": 19,
          "Date": "2023-10-06T20:56:42.000Z",
          "Titre": "Really good service.",
          "Contenu": "Really good service availability and speeds. Best of all excellent value service. I would highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jacob Brumby",
          "Nb_Reviews": 4,
          "Date": "2023-02-13T18:43:27.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. I had a problem and it was easy to find a form on their website to submit an enquiry (unlike most companies). I received a reply the same day and my problem was resolved within 24 hours."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T19:26:50.000Z",
          "Titre": "Experienced a problem and requested…",
          "Contenu": "Experienced a problem and requested help. The help response was immediate, I followed the advice and within a minute the problem was resolved. A first class service from a first class company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Iain and Susan D",
          "Nb_Reviews": 13,
          "Date": "2023-10-25T16:58:52.000Z",
          "Titre": "Easy interface and as I travel between…",
          "Contenu": "Easy interface and as I travel between the UK and Europe I can easily optimise my location."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "michael dempsey",
          "Nb_Reviews": 11,
          "Date": "2023-12-15T20:45:17.000Z",
          "Titre": "Excellent product",
          "Contenu": "The service was excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason  Park",
          "Nb_Reviews": 5,
          "Date": "2023-09-24T16:31:30.000Z",
          "Titre": "Quick internet and security",
          "Contenu": "Quick internet and security. I’m just so broke with all my other bills I could no longer subscribe."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hamshaw",
          "Nb_Reviews": 27,
          "Date": "2023-11-03T18:26:58.000Z",
          "Titre": "Excellent service and good back up when…",
          "Contenu": "Excellent service and good back up when things go wrong which is very rare"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Silby",
          "Nb_Reviews": 11,
          "Date": "2023-10-20T20:13:39.000Z",
          "Titre": "A proper company that actually listens…",
          "Contenu": "A proper company that actually listens to its customers and acts when I was uncertain about staying as costs had gone up ipvanish stepped in discounted for me and wham I am back in highly recommended this van provider"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T16:15:21.000Z",
          "Titre": "Great Value",
          "Contenu": "Great Value!  I’ve been a customer of this VPN Service for over 3 years.  More than 5 devices allowed!  Easy to understand with many options to ensure your privacy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SBreezy",
          "Nb_Reviews": 8,
          "Date": "2023-11-20T23:46:35.000Z",
          "Titre": "Best VPN PERIOD",
          "Contenu": "Been a customer for the past 6 years and the service is great!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Leo",
          "Nb_Reviews": 4,
          "Date": "2023-10-04T14:44:52.000Z",
          "Titre": "very polite conversation",
          "Contenu": "very polite conversation, good service, gave me a good feeling that i could talk to a person and they delivered a good renewal quote"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "pete barnett",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T15:47:13.000Z",
          "Titre": "have been with IPVanish for several…",
          "Contenu": "have been with IPVanish for several years I am Very Satisfied I`ve have had to uninstall it several times to do things on my pc it always reinstalls very easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry sturgeon",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T15:22:22.000Z",
          "Titre": "One of my favorite Apps for",
          "Contenu": "Very nice and helpful and a good knowledge of information to help you look learn and get the best apps for you and your family to be safe I love this app check it out and you will love it too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Whitmore",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T12:14:59.000Z",
          "Titre": "Great customer service they solve my…",
          "Contenu": "Great customer service they solve my problems and kept me here as a customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Higgins",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T15:52:27.000Z",
          "Titre": "It has only been one month but I am…",
          "Contenu": "It has only been one month but I am enjoying using the service and capabilities that it has I am not  cannot give a detailed review at this time  but  personally I  think it is a great vpn program"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mic",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T22:52:44.000Z",
          "Titre": "The interface is very easy to use",
          "Contenu": "The interface is very easy to use, no noticeable slow down with my home network. Very reasonably priced. I shopped around, and choose this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:54:51.000Z",
          "Titre": "Helped me out with payments...awesome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T16:22:04.000Z",
          "Titre": "Good",
          "Contenu": "I got this vpn on the Feb 9 2023 it  work great easy to setup on a computer. I leave the VPN on  while I am online don't have any problems with it. I like how It will protect yourself on your PC from Spyware and viruses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T20:59:48.000Z",
          "Titre": "works awesome on apple tv",
          "Contenu": "works awesome on apple tvim in Puerto rico and i can watch youtube tv from here"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T12:26:11.000Z",
          "Titre": "I’m happy with my purchase and…",
          "Contenu": "I’m happy with my purchase and experience with IPVanish. I hope it is not limited and I can use it as much as I want"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kimberly ritter",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T16:06:17.000Z",
          "Titre": "customer service",
          "Contenu": "The customer service lady was kind and friendly she took care of my reason for calling"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chile",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T18:31:00.000Z",
          "Titre": "Best VPN",
          "Contenu": "This is the easiest VPN I have found to setup and a great value. The only thing I would like to see changed is the automatic renewal. It should be an option. Otherwise it's a great VPN."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T16:01:59.000Z",
          "Titre": "Best vpn I have ever used",
          "Contenu": "Best vpn I have ever used! I have used many over the years and would recommend IPVanish to anyone and everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T01:44:32.000Z",
          "Titre": "My experience has always been great…",
          "Contenu": "My experience has always been great with ipvanish it's a wonderful app and I would recommend using it all the time for everything it's the best one out there yet"
        }
      ]
    }
  ]
}