{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.signix.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:34:57.000Z",
          "Titre": "I haven’t receive any jobs yet since…",
          "Contenu": "I haven’t receive any jobs yet since purchased"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T19:13:40.000Z",
          "Titre": "This software is a pain to my brain",
          "Contenu": "This software is a pain to my brain.  Software definitely needs improvement.  Whoever designed this needs to use it.  Drawing all these boxes is stupid and time consuming.  Why can't the form pop up with fill in fields?  Nope, that's too easy.  Ridiculous software.  Going to decommission my notary."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MI",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T17:19:55.000Z",
          "Titre": "Unable to log in",
          "Contenu": "I have followed the guidelines on how to save the personal link however I am still unable to log in after reaching out to support a number of times. Why spend money on this program when I can’t even sign in??"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "CT",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T09:49:47.000Z",
          "Titre": "It is counter intutitive",
          "Contenu": "It is counter intutitive, too many key strokes to perform simple signature and no way of decreasing sizes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JASMINE",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T21:44:30.000Z",
          "Titre": "I BOUGHT THIS PRODUCT AND NEVER USED…",
          "Contenu": "I BOUGHT THIS PRODUCT AND NEVER USED IT. IT WAS LESS THAN  DAYS AND WHEN I CALLED TO GET A REFUND BECAUSE I DIDN'T NEED THIS PRODUCT I WAS TOLD I COULD NOT.  300.00 IS A LOT OF MONEY TO THROW AWAY TO A COMPANY THAT DID NOT PROVIDE A USABLE SERVICE.  I WILL NOT BE PROMOTING THIS PRODUCT AND IF ASKED I WILL TELL THEM THEY WOULD BE BETTER OFF FLUSHING THEIR MONEY DOWN THE TOILET.  SAME RESULT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Ann",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T20:33:24.000Z",
          "Titre": "Program will no not goodt work for me in edge…",
          "Contenu": "Program will not work for me in edge customer support was limited and no knowledge I was assigned a manager or specialty person who is as ditzy as a calm I had to get a new one as of today I've had no training per se I haven't been able to use your system The only person that has been very helpful to me is Sam The salesperson but if somebody asked me for a recommendation I would say lack of knowledge by customer support Gina is a nice person but she shouldn't be in the position she's in because she does not listen and my frustration with paying $300 for this platform his fire exceeded anything I could ever think of and it's already paid so I'm going through training tomorrow hopefully it'll be better I have a thousand and one questions but I'm afraid to ask anybody because nobody seems to know anything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T18:33:27.000Z",
          "Titre": "I thought the training was very rushed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T14:54:45.000Z",
          "Titre": "Clunky system",
          "Contenu": "Clunky system. Had users that couldn’t verify ID. Some were title companies getting ready to do a lot of remote closings and decided not to use this platform because of it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Torri",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T16:41:52.000Z",
          "Titre": "Using your software to do a remote…",
          "Contenu": "Using your software to do a remote notarization is very problematic for me.  I have been trying over and over again and have not been able to do a successful notarization."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T18:29:46.000Z",
          "Titre": "I wish there was a mobile app",
          "Contenu": "I wish there was a mobile app. The software is pretty awesome and worth the money. My only complaint is that the lack of a transaction payment option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ilene Dunn",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T19:35:32.000Z",
          "Titre": "Great customer service",
          "Contenu": "Waverly is very responsive and did the state set up and the notary training for me quickly since I need to notarize right away.  I few minor changes would be nice, like being able to delete any suspended transactions, and to delete my own templates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Ann",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T18:29:36.000Z",
          "Titre": "New start",
          "Contenu": "Waverly and Sam are the best.  Sam jumped on my first review because the assigned agent to me, well lets just say was a nice person BUT has no training skills.  Waverly was then assigned to me and listened to me and my concerns we did both trainings, and even though I know I will have questions she has opened up the communication path.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Jones",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T00:58:47.000Z",
          "Titre": "Rylan was very patient with…",
          "Contenu": "Rylan was very patient with me...everyone who knows me, knowsbthat dealing with me can be over whelming at times! But not for Rylan...He answered all of my questions even the ones I asked multiple times😬 He was very polite and professional...and most importantly, he WASN’T PUSHY! On my face book Norotory Group anyone who asked about a platform I recommend Signix because of my experience with Rylan! Thank you Rylan👍🏾"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruben",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T01:55:37.000Z",
          "Titre": "Very easy process to learn and easy to…",
          "Contenu": "Very easy process to learn and easy to use. Customers have been providing great feedback on how easy it is to use the videocall and esign feature. Support team is amazing and always available. The system does glitch and freezes at times (I use Chrome)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T20:52:16.000Z",
          "Titre": "It was our first signing so there were…",
          "Contenu": "It was our first signing so there were some kinks to be expected. some connection issues that could have been bad wifi . Over all though a great service that we can now provide to our clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reginald",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T16:58:25.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "SIGNiX was eager and very helpful in explaining their onboarding process. The free classes were helpful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CAROLINE",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T22:00:40.000Z",
          "Titre": "Excellent Training",
          "Contenu": "I am assigned to one Signix representative and she’s great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T03:38:38.000Z",
          "Titre": "SignX is very easy to use with only…",
          "Contenu": "SignX is very easy to use with only minor tech issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elisabeth",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T17:45:31.000Z",
          "Titre": "I really like that there is someone to…",
          "Contenu": "I really like that there is someone to walk you through the steps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T06:15:58.000Z",
          "Titre": "Good service, great attitude",
          "Contenu": "Customer satisfaction is clearly their priority!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elia",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:22:02.000Z",
          "Titre": "Very Helpful",
          "Contenu": "Thank you Sanjuan! He was very helpful awesome customer service, the training in the SIGNix Academy is very understandable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon G",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:59:31.000Z",
          "Titre": "My experience was great!",
          "Contenu": "My experience was great! Finally, a team of professionals who are live on their ZOOM meetings, telephone calls, and live when you call for customer support.  Signix, I am so happy that this company thinks of the customer's satisfaction.  I am definitely amazed at the fact that when a client calls for support and the \"live\" team support is there to answer the telephone and the clients and not sent around in circles through an automated voice-activated system. Yes! This works for me! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Mason",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:35:00.000Z",
          "Titre": "Signix is the online platform !",
          "Contenu": "Signix is the online platform I recommend to use for your, e-notary platform provider. The customer service and follow-up is the best I ever seen.  Waverly call just to see how things are going, and if there is anything she can do to help, also let her know when I do my first e-notary, that meant alot.K.Mason"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dixon Irving",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:32:06.000Z",
          "Titre": "Well as being new to notary work being …",
          "Contenu": "Well as being new to notary work being  done remotely, it’s a bit more intricate then I anticipated but that’s what training sessions are for. The three training sessions were well prepared & well delivered for me. I will be reaching out for a little guidance and advice the upcoming weeks. Thanks much for your help so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ka-sekhem",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:42:08.000Z",
          "Titre": "Waverly and Gina are very helpful…",
          "Contenu": "Waverly and Gina are very helpful and always willing to assist with making sure I easily understand how to work the portal. I will definitely refer other notaries based on this helpful experience Gina and Waverly provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Wright",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T14:45:13.000Z",
          "Titre": "Very Good Training",
          "Contenu": "The training that one receives is exemplary.  Gina is my contact person, and from the very beginning she directed me to the valuable videos that aid in learning the SIGNiX platform.  Gina, then, walked me through each phase.  If ever I get rusty, the videos are always there for me to refresh my skills."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harvey",
          "Nb_Reviews": 3,
          "Date": "2022-09-30T02:34:25.000Z",
          "Titre": "I love Signix",
          "Contenu": "I love Signix!  With so many ROM platforms on the market, Signix made my decision to go with them easy by listing all the benefits and options available.  Their support network is absolutely amazing.  Their reps reach out to answer any questions you may have in a friendly, knowledgeable and patient manner. You'll be glad you chose Signix!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne L.",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T14:51:31.000Z",
          "Titre": "Customer Support - One-on-One Training",
          "Contenu": "I scheduled a separate, one-on-one meeting with Gina Salisbury after the 2nd Zoom group meeting.  Gina was awesome!  She was patient, answered all questions, and did a live demo with me, which was easy to follow, as I felt the first video went very fast.  Based on this level of customer support, I would recommend Signix to everyone!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maura",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T21:48:17.000Z",
          "Titre": "Signix had videos to help understand…",
          "Contenu": "Signix had videos to help understand the process.  But the frosting on the cake was Gina.  She was informative, helpful and all around professional.  I felt that if I have questions later she would go out of her way to  help me. Great personality and a good face for your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:29:41.000Z",
          "Titre": "I love using Signix for my remote…",
          "Contenu": "I love using Signix for my remote notary.  It is quick and getting more fluid as time goes on.  It is very user-friendly and I have control over when and who gets the documents to sign."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T19:17:52.000Z",
          "Titre": "SIGNiX has worked great for us",
          "Contenu": "SIGNiX has worked great for us.  SIGNiX has provided a value-add and  21CFR11-compliant solution for our business.  SIGNiX sales and support team members are friendly, responsive, and always available to help or answer questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayle",
          "Nb_Reviews": 3,
          "Date": "2023-06-21T19:42:14.000Z",
          "Titre": "Great training experience!",
          "Contenu": "Instructor was very thorough and engaging. I feel much more comfortable abt being an online notary now and look forward to doing multiple demos for even more peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary F",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T21:48:28.000Z",
          "Titre": "Wonderful remote online notarization platform!",
          "Contenu": "Signix offers wonderful training for the remote notarization platform that I am using. My trainer, Gina, was very helpful and answered any questions that I had. You are permitted to do as many demos as necessary before going live, and the product is overall quite affordable for businesses large and small. I also like that SIGNiX offers their own electronic certificate within the platform, which is one less thing I need to get on my own. Also their customer support is quick and efficient, and they fixed an issue that I had right away. I have not gone live yet since the authorization for New York State is taking forever, but I feel totally supported by SIGNiX and look forward to using the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T14:19:24.000Z",
          "Titre": "The customer support was top notch",
          "Contenu": "The customer support was top notch. No question went unanswered, usually in a matter of minutes.  And the instruction in use of the platform was comprehensive and exhaustive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T23:37:15.000Z",
          "Titre": "Great training process",
          "Contenu": "I received eNotary training. Each of the trainers including Waverly who I worked with mostly, were very kind and always willing to help with questions. They have followed up with me to make sure I am doing okay and have any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaTanya",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:33:05.000Z",
          "Titre": "SigniX is a great eNotary platform!!",
          "Contenu": "The platform is great & training was not only helpful & needed, I love the resources available plus extra training if needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robbin Chase",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T21:21:15.000Z",
          "Titre": "Waverly was very informative and willing to give one on one assistants.",
          "Contenu": "I really appreciated the insight Waverly gave for Signix.  She is willing to do one on one trying.  I will be needing that extra help to get started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathie",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T22:05:34.000Z",
          "Titre": "We were extremely happy with very efficient, professional, thorough and timely service.",
          "Contenu": "We were extremely happy with very timely and efficient response and service designed to our specific needs. Madeline was wonderful in coming out to do a hands on training."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T23:21:46.000Z",
          "Titre": "Personal hands on approach to training…",
          "Contenu": "Personal hands on approach to training is what's got me sold on Signix.  They care about your experience and knowledge of the platform and make sure that you have a good understanding before you complete your first transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacey",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T13:34:13.000Z",
          "Titre": "Great Experience!",
          "Contenu": "This was a great experience with professional and helpful trainers!  They follow up and advise as needed.  It is super to have a go-to training department when learning something new.   Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T18:47:25.000Z",
          "Titre": "Good people to work with.",
          "Contenu": "Sam Wes was excellent an he is a good man. The young lady who did the onboarding training was excellent. I am satisfied with the service as of now. Promote these type of people and pay them well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 2,
          "Date": "2022-05-30T17:49:59.000Z",
          "Titre": "Stephanie and Gina provided amazing…",
          "Contenu": "Stephanie and Gina provided amazing customer service in helping me get my first transaction completed. I had to expedite everything because my previous providers system was broken and I had a short deadline to get a document notarized. They were very resort and extremely helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Mueller",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T18:29:43.545Z",
          "Titre": "Signix has been a game changer for us!",
          "Contenu": "I deal with eSignatures a lot in my current role and I will say that Signix customer support (especially Connor) have been super helpful to me.  They are always very quick to respond and are extremely friendly and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Williams",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T06:19:54.000Z",
          "Titre": "Training was with Ryland Hissong",
          "Contenu": "Training was with Ryland HissongAnd he was patient and fielded all of my questions very succinctly. And give me links to the follow up practice exercises as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T03:28:01.000Z",
          "Titre": "My experience with both Madeline Uhrik…",
          "Contenu": "My experience with both Madeline Uhrik and Waverly Felts has been excellent they both maintain a positive attitude I can hear them talk to me with a smile I felt they both personalize the talk to my needs they actively listen to my list of questions been new to this productsThanks for meeting the customer service expectations I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T18:45:34.000Z",
          "Titre": "Great Initial Training",
          "Contenu": "The tutorial webinars to demonstrate how the product works are a great way to get started.  Gina Salisbury is a great trainer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T16:05:22.000Z",
          "Titre": "Training Sessions",
          "Contenu": "I enjoyed working with Gina very much on the training of your program. She was very kind and took time to explain along with making sure all questions were answered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ERIN HOPKINS",
          "Nb_Reviews": 5,
          "Date": "2023-05-05T18:42:50.000Z",
          "Titre": "Very good training",
          "Contenu": "Very good training. The pertinent information was covered and I feel confident that I will be able to perform well as a RON."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T19:20:04.000Z",
          "Titre": "The site appears overwhelming, however really is not so!",
          "Contenu": "While the site appears confusing and overwhelming, the training makes it understandable and flow well.   Thank you to a great SignIx team for your honest efforts, understanding and patience with our many questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coleen",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T21:11:18.000Z",
          "Titre": "Exceptional service Great and easy to…",
          "Contenu": "Exceptional service Great and easy to understand training. It's perfect for myself as  a new notary. I feel confident that I have the knowledge to be a successful RON."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melton",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T18:05:12.000Z",
          "Titre": "Gina is fantastic!",
          "Contenu": "I found Gina to be very clear, thorough, laid-back, and easy to follow.  She made sure concepts were clear before moving to the next concept."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BJ Buccini",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T20:54:13.000Z",
          "Titre": "Very informative",
          "Contenu": "Very informative. Answered all questions and made me feel very relaxed and not afraid to ask anything. Very down-to-earth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Witcher",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T17:38:27.000Z",
          "Titre": "SignIx has been very easy to use",
          "Contenu": "SignIx has been very easy to use. It’s very user friendly and the staff have been very helpful. They have been very helpful and quick to reply or call back when I have a question. The customer support is wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabian",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T04:11:45.000Z",
          "Titre": "I am very satisfied that I've signed up…",
          "Contenu": "I am very satisfied that I've signed up with you. Terrific training and extremely easy to use software.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phoneanotary.com",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T17:53:31.000Z",
          "Titre": "Easy to follow",
          "Contenu": "It was easy to follow and offered a lot of information. I love the fact you did not have to wait until the end to ask a question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genniene",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T20:46:57.000Z",
          "Titre": "The service is very convenient however…",
          "Contenu": "The service is very convenient however it is a little tedious to keep up with it’s definitely not cut and dry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jocelyn",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T19:35:26.000Z",
          "Titre": "Great communication and training!",
          "Contenu": "Lots of training, VERY responsive and quick to answer the phone, and the platform is easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-09-26T19:43:29.000Z",
          "Titre": "Great training My questions were…",
          "Contenu": "Great training My questions were answered, but there will be more as I get into this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen O Dzurilla",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T21:49:24.000Z",
          "Titre": "worked fine",
          "Contenu": "Everything worked well --Client used computer which was much easier than phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T23:06:26.000Z",
          "Titre": "The system is easy to use and the staff…",
          "Contenu": "The system is easy to use and the staff is super helpful. The training is well done and it really prepares you to use RON."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T20:05:09.000Z",
          "Titre": "super fast response",
          "Contenu": "Conor was super fast at getting back to me.  Greatly appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joann",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T22:30:29.000Z",
          "Titre": "The training sessions were every…",
          "Contenu": "The training sessions were every helpful and the guides were informative, and had answers to the questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joycelyn",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T17:23:32.000Z",
          "Titre": "She was kind professional and Eager to…",
          "Contenu": "She was kind professional and Eager to explain how signix works"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Lee",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T22:53:44.000Z",
          "Titre": "My success story",
          "Contenu": "The desire of the instructor to have me secede at my notarizaton demo and understand the RON process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Akeisha",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T20:23:36.000Z",
          "Titre": "Good customer service",
          "Contenu": "Update: My issues were triaged and handled- happy with the conclusion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T01:02:26.000Z",
          "Titre": "They have been very helpful",
          "Contenu": "They have been very helpful. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T18:23:32.000Z",
          "Titre": "Sam is excellent and very helpful",
          "Contenu": "Sam is excellent and very helpful! Love using SignIx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T18:35:16.000Z",
          "Titre": "Your representatives are very helpful",
          "Contenu": "Your representatives are very helpful. Rylan, Jessica and Waverly.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:33:41.000Z",
          "Titre": "Gina is great and very quick to…",
          "Contenu": "Gina is great and very quick to respond. It's also user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T00:16:23.000Z",
          "Titre": "My customer was able to navigate…",
          "Contenu": "My customer was able to navigate through the signing with minimal issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T03:50:06.000Z",
          "Titre": "Everyone has done a perfect job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Elbon",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T17:57:14.000Z",
          "Titre": "The classes were well presented",
          "Contenu": "The classes were well presented. the videos and downloads are great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T07:09:48.000Z",
          "Titre": "Great training with Gina Salisbury"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marina",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T23:36:29.000Z",
          "Titre": "Responsive to my inquiries with a quick…",
          "Contenu": "Responsive to my inquiries with a quick turnaround."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Mullin",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T19:19:51.000Z",
          "Titre": "Great instruction",
          "Contenu": "Great instruction, user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T22:33:37.000Z",
          "Titre": "Gina was great",
          "Contenu": "Gina was great!  Very patient and thorough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T15:17:27.000Z",
          "Titre": "The instructor was very detailed and…",
          "Contenu": "The instructor was very detailed and informative in offering instruction during Training Demo 1.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T17:36:44.000Z",
          "Titre": "Thanks for having all the resources."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josseph Hendricks",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T15:49:32.000Z",
          "Titre": "You did fine",
          "Contenu": "You did fine.  I think I may need to do the tutorial once more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "iris",
          "Nb_Reviews": 2,
          "Date": "2022-05-14T05:07:41.000Z",
          "Titre": "GREAT SERVICE",
          "Contenu": "GREAT SERVICE - ASSISTANCE & FOLLOW UP FROM CUSTOMER SERVICE / TRAINING ETC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T01:38:30.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication and patience with my issue. Definitely would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julliette",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T17:53:14.000Z",
          "Titre": "Awesome Training",
          "Contenu": "I am very pleased with the training provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:51:11.000Z",
          "Titre": "Great help and on boarding!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naa",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T23:16:54.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, efficient, easy to follow instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-07-26T22:31:56.000Z",
          "Titre": "Sign is a easy Process thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haris        Hassan",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T18:04:50.000Z",
          "Titre": "You done excellent.Fast customer…",
          "Contenu": "You done excellent.Fast customer service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T20:41:54.000Z",
          "Titre": "Great service across the board"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucia",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:13:48.000Z",
          "Titre": "Easy to follow steps",
          "Contenu": "Customer support is excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernhard",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T22:47:16.000Z",
          "Titre": "One of the best in the industry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T18:30:17.000Z",
          "Titre": "Very good Customer Service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willie",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T17:41:07.000Z",
          "Titre": "None qwer tyu iop a s"
        }
      ]
    }
  ]
}