{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.crucial.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose C",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:06:11.000Z",
          "Titre": "Order took 2 weeks to drop off with carrier",
          "Contenu": "Made an order and it was marked as shipped on December 7, 2023. Have been checking the tracking number every day since and has barely been marked as dropped off with the carrier on December 20, 2023. Will never be ordering from here again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Xuan Huong Tran",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:25:10.000Z",
          "Titre": "Never received it… first wrong ups…",
          "Contenu": "Never received it… first wrong ups tracking number,  then 2nd number from Canada post was not valid.   15 days after buying, never received it and no valid tracking number… looked like a scam. I want my money back.…"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 49,
          "Date": "2023-12-20T12:48:22.000Z",
          "Titre": "Promised refund non existent",
          "Contenu": "I received some RAM which I realised I didn’t need shortly after ordering but the product arrived.I set up an RMA with Crucial for the unopened product and Crucial accepted the return.I sent the item Royal Mail Special Delivery and have contacted many times chasing the refund.Customer services kept saying it will be with you soon, wait until x date. So I then contact them on that date and they said we promise it will be with you by two days ago.No refund received. Contact Crucial customer services and they said they will now escalate it and the refund will be processed within 24 hours.Have I received a refund? No. I have to keep chasing and provide the same information over and over again.I am thinking of reporting Crucial to the trading standards as by law they must refund me in a swift manner, and this has been going on over a month now.Beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert De La Garza",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:44:27.000Z",
          "Titre": "I have still NOT received my item that…",
          "Contenu": "I have still NOT received my item that my bank account was already charged for!!!  Any idea how much longer?  I need this RAM upgrade before Christmas!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Dicharry",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:24:44.000Z",
          "Titre": "Item was out of stock 3 days after I…",
          "Contenu": "Item was out of stock 3 days after I ordered says it was shipped out but nothing on the tracking number. Was ordered dec 3rd out of stock email on the 5th and shipped the 10th and now on the 15th no tracking information"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:25:55.000Z",
          "Titre": "Still waiting.....",
          "Contenu": "Still haven't received my order from over two weeks ago. When I asked your customer service about it, all I get was \"it was shipped\". No other help at all. I went ahead and bought what I needed from Amazon and had it in two days. You need to step up your game, Crucial."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarmid Hermiz",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T03:52:29.000Z",
          "Titre": "Very slow shipping method, Tracking does not work",
          "Contenu": "The item I ordered is taking forever to get here (over 2 weeks now). Clicking the link to track the order online redirects to UPS website but it gives an error for wrong tracking number!! I contacted customer service via chat and the agent gave me a link to track the order and to my surprise it was USPS not UPS!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LWF",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:57:56.000Z",
          "Titre": "Couldn't back up to SSD due to repeated…",
          "Contenu": "Couldn't back up to SSD due to repeated cloning errors. Contacted them via chat, email and phone. The help I got was careless, lacking English understanding and among the worst in memory."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Graham Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:01:27.000Z",
          "Titre": "SSD wasn't compatible with my MoBd",
          "Contenu": "I used the crucial app to scan my computer for upgrade of SSD and chose the top of the line offered but I could not fit the SSD to my computer. I have a membership at BestBuy/GeekSquad and took it to their shop to fit and commission the new SSD but after trying for some hours it seems that the computer motherboard will not accept the faster Gen5 SSD after all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T00:27:34.000Z",
          "Titre": "Not Compatible as Claimed",
          "Contenu": "The RAM modules I ordered (Crucial Pro DDR4 3200MT/s Memory Kit) were supposed to be compatible with my new Dell Inspiron 3020 Desktop. However, after installation the computer would not boot up. Tech support advised to remove the battery from the motherboard for 15 minutes, replace it, & boot up. My computer still would not boot up. I have had to return the modules for a refund. I obtained a Kit from another vendor which worked fine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shihchieh Su",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:53:06.000Z",
          "Titre": "Lack of communication, 2 weeks still nothing",
          "Contenu": "Order is still in process for 2 weeks.  Customer service is worst, waiting for 30 minutes to get an agent, then put on hold for another 30 minutes, and disconnected."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Natalie K",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:19:25.000Z",
          "Titre": "terrible customer service and faulty website",
          "Contenu": "The product was advertised to include one month of Adobe Creative Cloud access. However, due to the absence of any email confirmation from the registration process, I am unable to utilize this feature that was marketed on their website. Also, terrible customer service. When I could not register my product online due to a website error. I contacted support and despite being promised a follow-up within 1 to 2 days, I received no response. When I reached out again after two days, I was only informed that they would look into the issue and get back to me in an extended timeframe of 12 days. That will be a wait of half a month so that basic staff of customer service can figure out what went wrong about a simple email forwarding error."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Ajello",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:00:40.000Z",
          "Titre": "still hasn't shipped and no update",
          "Contenu": "Well ordering was easy, but that's where it ended. First off they got back to me to let me know they over sold and may take 7 to 10 days.Now on day 11 I still haven't heard from them (item came back in stock 2 days after they said it was out of stock) and still hasn't shipped. Tried the bot chat thing (no human opinion) and it only answered one time out of 10 tries and that was to say my question was to short (asked for a update to the order) my order number   1337865124739"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie O'Donnell",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:33:22.000Z",
          "Titre": "Unresponsive with a damaged item",
          "Contenu": "I received an item - the mailing package was fine-  but the product packaging had been opened and the seal was broken. I wanted to exchange it for the same item undamaged. I called and sent an email with a photo while on the phone and was told I would get a response within 2 hours but I haven't gotten any response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abhimukta Banerjee",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:25:54.000Z",
          "Titre": "Do not trust their Website inventory…",
          "Contenu": "Do not trust their Website inventory and tracking information. Their product is trusted but marketing and customer care is worst. It has been 8 days since I ordered an SSD m.2 but was not shipped till yesterday. Now it shows an invalid tracking info!Their Chat virtual agent will make you more angrier.Order from Amazon even if you need Crucial."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Viking",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:01:56.000Z",
          "Titre": "Never order through Crucial",
          "Contenu": "Order wasn't shipped until I started asking about it and would have rather cancelled and got it somewhere else. Agents would disconnect calls and chats the second I brought up trying to cancel the order.Edit: They shipped my order 4 hours after the person below replied so that I can't cancel the order. Incredibly scummy way to do business, seriously never order through crucial"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:08:46.000Z",
          "Titre": "No Cross-Shipping Option",
          "Contenu": "No Cross-Shipping OptionI have been purchasing Crucial memory and drives for many years and have always been happy. I have never needed support until now. If you plan to use Crucial memory in a device used for business purposes, think twice before purchasing memory directly from them.I purchased a 32GB Kit (2 x 16GB) on 10/6/2023 and found that one of the sticks was defective after testing and reloading several times. When I contacted support on 11/10/2023, the support representative said they do not cross-ship and would send a replacement once they received the memory and verified it was defective.Support said I could return the memory for a refund, “returned on 11/17/2023,” but that was not the case. Crucial shipped the replacement memory on 12/8/2023. I contacted support on 11/10/2023. It took Crucial Support over ten days to send the replacement memory “that I had already replaced.”Again, use caution if you use their memory for business hardware. You might have some downtime unless you have spare memory or hardware available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "California Kid",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T07:40:09.000Z",
          "Titre": "Still waiting on a single piece of…",
          "Contenu": "Still waiting on a single piece of memory ordered and supposedly shipped a week ago. Finally looks like it will show up in another week. Online customer service was horrible. Probably one of the worst purchase experiences I have had for a while. Previously ordered from them but something changed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JImbo 44",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T18:56:23.000Z",
          "Titre": "Multiple issues",
          "Contenu": "First off, they sent me the wrong memory sticks, and that was after they scanned my computer to select the correct ones, and also, they have an ongoing problem with their account set up and login. They keep saying that I have an incorrect email address, but it's the SAME EMAIL I ORDERED THE PRODUCT WITH. Next, their robochat device cut off my complaint response after about 50 words and told me goodbye. Guess I'll see what happens after the weekend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anthony williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:37:13.000Z",
          "Titre": "YOU SCAMMED ME OUT OF MY WHAT I THOUGHT…",
          "Contenu": "YOU SCAMMED ME OUT OF MY WHAT I THOUGHT WAS A FREE ADAPTER, TILL I REMEMBERED I PAID FOR IT, I HOPE A 5CENT ADAPTER WAS WORTH LOSING MY BUSINESS, ANTHONY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megh Shah",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:45:03.000Z",
          "Titre": "Disappointing in delivery speed",
          "Contenu": "Very very disappointed in delivery speed.I got email with tracking number, and for first 3 days ups website couldn't recognize it.At the time of writing this, the items is still not delivered! And a feedback is being asked for. If i would have ordered anything straight from china (AliExpress, temu) they would have already shown up in half of this time!!! I ordered on 20th nov and the delivery date is 7th dec. It's way way too slow delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Montgomery",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:04:31.000Z",
          "Titre": "Took forever to receive item and when I…",
          "Contenu": "Took forever to receive item and when I did get it product was mailed in a flimsy bubble mailer and the box is crushed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Mclean",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:30:01.000Z",
          "Titre": "Having brought SSD drive and sending it…",
          "Contenu": "Having brought SSD drive and sending it back. I'm still waiting on a refund it's been over 13 working days and no refund still. I've contacted them a few times. And all you get is it's been passed on to be investigated. 16th November they received there item back and still nothingOrder 1109722684339"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Ajello",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T19:28:41.000Z",
          "Titre": "2 orders shipped",
          "Contenu": "So I have not one but now 2 orders now they told me the first one is discontinued and would refund The first order and for me to make a second order for the newer model which they would give me a discount still more than a paid for the first one but I agreed now they have shipped both and now I get to deal with shipping it back The service has been god-awful and I would stay away from this company at all costs 1354770954739"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Aiken",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T07:25:58.000Z",
          "Titre": "If you buy from them, expect less than advertised and a big hassle for returns.",
          "Contenu": "I ordered two NVme SSD harddrives( add on for my Intel Inspiron and Lenovo Thinkpad.  I ordered a 1tb upgrade for each of my computers.  The advertised speed was 6000 mb give or take. Neither device came anywhere close to those speeds, maybe 1/3rd as fast as advertised.  Both machines have similar Intel I 7 8 core processors, maybe different bus speeds.  I bought directly from Crucial, Big mistake if you have to return something. One of the SSD's came with a heatsink, I did not need. Simple mistake, but after a week of discussion with the sales staff, they finally at my insistence sent an RMA.  Its in the mail now, I wonder if I will ever really get a refund. Very cumbersome process."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Maxonator",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:03:46.000Z",
          "Titre": "The prices are not listed as American…",
          "Contenu": "The prices are not listed as American currency until the end, resulting in what appears to be lower prices than are actually present. Expedited shipping was double the price and arrived one day sooner. I had to also pay an extra 100 dollars to have the items cross the boarder as well. An initial cost of around 320 came out to 650+ in the end. I would avoid buying crucial especially off their website. Use new egg or some other website and stick to actually well known brands such as Corsair or gskill"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T04:11:57.000Z",
          "Titre": "Placed 4 orders",
          "Contenu": "Placed 4 orders, each time items showed in stock then received an email stating items were out of stock a few days after I ordered. Do not order directly from them if you expect your order to arrive in less than 3 weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rest",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:46:10.000Z",
          "Titre": "Horrible purchase experience",
          "Contenu": "Horrible experience. Ordered on 11/28; Crucial shipped via UPS/USPS Mail Innovations and charged credit card on 11/29; UPS stated estimated delivery 12/08; USPS stated still awaiting the package from UPS on 12/08; UPS stated the package most probably was missing and advised to call Crucial to file lost claim; Crucial stated wait till 12/11 for replacement to ship and to wait at least another 10 days to arrive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rudy Villa",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:37:51.000Z",
          "Titre": "SSD NEVER ARRIVED",
          "Contenu": "Placed an order for a SSD on Nov. 21st and it’s now day the 2nd of Dec and my order has still not arrived . Tracking my order sucks and consumer service does no justice either. Should’ve read recent reviews before ordering from here ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "William Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:34:42.000Z",
          "Titre": "Order not received",
          "Contenu": "I placed my order on 12/04, today 12/18 and I haven’t received my package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve J",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T15:04:43.000Z",
          "Titre": "Received Crucial-recommended memory-Memory errors",
          "Contenu": "Received Crucial-recommended memory-plugged it in.  Got memory errorsOrder Number: 1312860474739 Order Date: October 23, 2023And it cost me $10 to send the bad memory back.And yet, when I provided them with the information they requested, they still haven't contacted me.Crucial used to be the go-to company for memory.  No more.  I won't be ordering from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:49:33.000Z",
          "Titre": "Scam Company",
          "Contenu": "Ordered from crucial site directly (mistake 1)Did not make an account so order I did not recieve a \"order password\" (mistake 2)Now I can't return the useless m.2 they sent me 3 weeks later than promised. There is no support, no QA, and no return process for items from crucial. Don't buy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Verba",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T10:19:30.000Z",
          "Titre": "I have ordered memory but did not receive",
          "Contenu": "I have ordered memory from crucial twice now. Said it was delivered but I never received item. TWICE!"
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Herman",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T07:17:17.000Z",
          "Titre": "Unfair commercial practice",
          "Contenu": "All the cost were not informed at the purchase moment in Crucial Web site. Handling cost was a surprise, UPS charged it to me as a condition for final delivery to my address. That is an unfair commercial practice that I did not expected from a prestigious company as Crucial."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Scott",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T11:11:16.000Z",
          "Titre": "Cannot rate your product if it hasn't…",
          "Contenu": "Cannot rate your product if it hasn't shipped yet. Send new survey after I receive it. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karon Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:06:38.000Z",
          "Titre": "I ordered the 2-16GB DDR5 Ram upgrades…",
          "Contenu": "I ordered the 2-16GB DDR5 Ram upgrades and I received an email saying there has been a delay because they are out of stock. I don't think I should have been able to order it if they were out of stock. Then I asked to be compensated with an extra 1TB Gen4 SSD and I was told I can only get express shipping. Which would be pointless becuase I'm already waiting on the item to be restocked. (First Time Buyer)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Sneed",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:05:59.000Z",
          "Titre": "I ordered two products that never…",
          "Contenu": "I ordered two products that never showed up.  They said it was delivered but they couldn't tell me who signed for it.  They also said it was delivered to the receptionist.  Thats funny, I don't have a receptionist at my house.  The guy was rude and I have lost a couple of hundred dollars.   DO NOT USE CRUCIAL.COM,  scam, scam, scam!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "joseph faska",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:04:27.000Z",
          "Titre": "Should not have bought this",
          "Contenu": "Took too long to come.Can't get answers from support on what to do. Phone calls drop, and chats stop in the middle. Emails to support are not always answered. Did not clone the first 2 times. When I finally got through to someone in support their response was that I should have used a boot disk. That did work, but I don't think the directions said that was required.  The scanner said there were two slots for memory in a laptop. Based on that I assumed I could use both SDRAMs at once. There is only 1 slot for memory in the laptop."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T17:51:03.000Z",
          "Titre": "Configurator recommended incompatible memory",
          "Contenu": "I used the crucial configurator to scan my laptop and then purchased recommended memory. However, the memory I purchased is not, in fact, compatible. Worse, I installed the memory while waiting on a new battery and did not keep the packaging, so I’m not sure I can return it. So much for trusting the configurator."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Matthew Pagtalunan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T10:06:07.000Z",
          "Titre": "I CANCELLED THIS ORDER WEEKS AGO AND…",
          "Contenu": "I CANCELLED THIS ORDER WEEKS AGO AND THEY STILL HAVEN'T GIVEN ME A REFUND AND NOW ARE TELLING ME TO REVIEW THE PRODUCT???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JJM",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T15:30:34.000Z",
          "Titre": "I bought 64GB of ram",
          "Contenu": "I bought 64GB of ram. My computer was crashing all the time. Called to get a refund. Was told I have 45 days to get a refund. I do not think is fair. If memory is bad from manufacturing issues I must be refunded no matter what."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "vc",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:45:24.000Z",
          "Titre": "Your acronis clone tool does not work",
          "Contenu": "Your acronis clone tool does not work. In my opinion Acronis makes garbage. I am re-cloning now with Macrium"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DX",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T15:05:24.000Z",
          "Titre": "The order was Out of Stock",
          "Contenu": "The order was Out of Stock. but no  clear information on refilling from online order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hung L Hu",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T05:57:29.000Z",
          "Titre": "No delivery after 2 weeks!!",
          "Contenu": "As of to date (12/1/2023), I still have not received the item that I ordered as I kept on getting notice from UPS that they are going to deliver the next day.  When the next day comes, it is delayed again.  It has been more than 15 days (11/17/2023) and I have yet to receive the item!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stuart Royal",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:40:02.000Z",
          "Titre": "The memory will not work in both of my…",
          "Contenu": "The memory will not work in both of my 8900 dell towers I have never had this before with any drives or memory ive boughtAny suggestions"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Thommycal",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:33:04.000Z",
          "Titre": "I will NEVER buy anything Crucial or Micron",
          "Contenu": "I bought on ebay,  open box, 2 Crucial SSDs 500gb P3 for my computer repair shop.  They both developed fatal hardware errors in a few months.  Although the SSDs are well within the guarantee period, Crucial would not replace them because I was not the original buyer  (and neither would be my customers so no guarantee for them either).    I will NEVER buy a Crucial product again for myself, or my customers.  Samsung has a much better warranty:  they replace their defectives no matter who has it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:12:10.000Z",
          "Titre": "I had to pick up and pay for my package…",
          "Contenu": "I had to pick up and pay for my package at my post office. Shane"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Morbius",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:24:57.000Z",
          "Titre": "Agent did not comprehend my problem!",
          "Contenu": "Agent did not comprehend my problem!Agent kept interrupting me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Yarter",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T05:34:51.000Z",
          "Titre": "The last two times i have ordered…",
          "Contenu": "The last two times i have ordered memory, the tracking number sent  does not work?? It is shipped via UPS to the post office for delivery. I can not track the package in UPS because the number is a USPS number .  I am left in the dark as to the where about the package and therefore can not tell my customer when I will receive the memory or when to expect to see their computer back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "meksikatsi",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:40:45.000Z",
          "Titre": "SSD did not allow cloning",
          "Contenu": "I have extensive experience with computers.  I read the info carefully but there was nothing that told me I had to buy an SSD that matched the 2T HDD in my computer, so I bought a 1T SSD, since I only had about 300 GB of data on the HDD.  Your software would NOT allow me to clone my HDD, so your SSD is now sitting on my desk.  I bought another 2T drive from another company and the cloning went smoothly.  Very disappointed in your lack of info on this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Derek",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T22:16:34.000Z",
          "Titre": "Shipping ripoff",
          "Contenu": "They continually charge me for expedited shipping, but, never send the items in a timely manner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy Acord",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:54:14.000Z",
          "Titre": "The worst customer service I've ever experienced, EVER!",
          "Contenu": "Customer service was unable to cancel an order just 5 minutes after it was placed online. The order shipped with an invalid tracking number, and when I reported this to customer service they told me I was checking too soon and just had to wait longer. Well, I waited days and it was still invalid because they sent a UPS tracking number but shipped it by slow boat USPS. It eventually showed up, but now I have to process a return because I couldn't wait for it to show up and I ordered from another vendor. Good product, terrible customer service. Lesson learned, never order directly from Crucial, go to Amazon or some other retailer instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus Soukup",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:29:04.000Z",
          "Titre": "What seems to be rude customer service agents and dishonest products",
          "Contenu": "I was having what I thought was a pleasant experience with a Crucial agent until they just ghosted me. Stopped responding, and after reading the other 1star reviews on here I think there may be a pattern - Crucial may not want to admit to higher error rate than advertised. I will leave this review up until I get an answer and the problem resolved. Because I can only infer from what has anecdotally happened to me - my current situation is without answerAttached is the SMART data from my drive, sure its only a single Reported Uncorrectable Errors 1 ECC Correction Failures - and all I was asking what was the acceptable error rate, is this drive safe enough to store things on long term when this has occurred within the first few hours of being turned on - shipped straight from Crucial themselves.And yet no response other than \"This could be possibly due to Bad Memory or CPU issue\" And I responded with how is that possible as my other crucial drives do not have this issue, only this brand new drive from crucial No response. Ghosted...... Who does that?????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Hedler",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:03:15.000Z",
          "Titre": "Receive the wrong one",
          "Contenu": "Received my order, it was the wrong size, the one that came out of my laptop as less than half the size of the one I received, and I used crucial’s recommended one for that laptop"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Barnet",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:44:31.000Z",
          "Titre": "I used the system scanner to upgrade my…",
          "Contenu": "I used the system scanner to upgrade my laptop. I then ordered the ram that crucial suggested. The ram module does not fit at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Sides",
          "Nb_Reviews": 6,
          "Date": "2023-10-03T14:52:27.000Z",
          "Titre": "Do not buy on Crucial website- go to Amazon",
          "Contenu": "I needed the additional memory because my laptop was down. Took longer than that to receive. In the meantime, the same memory was available on Amazon and delivered next day. Crucial used to fulfill orders within 48 hours instead of taking 4 days to ship and another 4 days transit time.Update. After reviewing Crucials response, my update is: Crucial needs to check its shipping department. I contacted the carrier and the item was not received by them for four days. It was delivered to me 10 days after I placed my order."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard H",
          "Nb_Reviews": 7,
          "Date": "2023-10-16T10:30:54.000Z",
          "Titre": "Not delivered, no tracking, won't resend.",
          "Contenu": "Ordered a lot of ram for a server, est. delivery was 3 - 4 working days. we are now well over a week after i ordered, the tracking says the label has been printed and nothing else. It has not been scanned by UPS once. I contacted Crucial last week and was told they wouldn't do anything until today. Contacted this morning and all they say it the will send to the \"concern\" team which may take 10 business days before they will consider resending the obviously lost order. It has been 11 days since i placed my order and not one bit of tracking has been logged by UPS. Simply not good enough."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "beer_on_hold",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T01:00:59.000Z",
          "Titre": "SSD CT4000P3SSD8 (NVME 4TB) drive",
          "Contenu": "SSD CT4000P3SSD8 (NVME 4TB) drive: be aware, this is QLC drive without DDR cache, which means that write speed is approx. 90-95MBps !!! performace is below even spinning drive with fraction of a price cost. Additionally, 4TB SSD having 800TBW is extremely low (but fare, considering technology). You'd better go with normal HDD in this case. Doesn't make a shread of sense to buy one."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "CRISTIAN",
          "Nb_Reviews": 72,
          "Date": "2023-10-31T18:09:22.000Z",
          "Titre": "Disappointed with this company",
          "Contenu": "Disappointed with this company. False advertising os speed of their nvme drives and software that does not even load on Windows 10. Crucial storage executive.A complete disaster"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S. Rich",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:26:06.000Z",
          "Titre": "Shipping was slow, terrible tech support",
          "Contenu": "Shipping was slow, mail innovations is one of the slowest shipping options due to significant delays while USP transfers the package to USPS. Neither carrier will acknowledge having the package during the multi-day transfer. Tech support was useless. After exhausting all the articles and videos on Crucial's site (as well as internet searches) to determine the issue, I contacted tech support only to deal with someone who sounded like they were reading from a script or googling ideas. The end result was tech support telling me to use a third party software which did not appear to be secure and was not free. Sincerely felt that the issue was with the SSD drive, since I've cloned and replaced drives before. Returned item--at my expense. Disappointed and frustrated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed B",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T21:16:49.000Z",
          "Titre": "I bought a Crucial 6X 4TB ext",
          "Contenu": "I bought a Crucial 6X 4TB ext. SSD HD. It arrived in good time, but it was VERY difficult to set up, and then it worked horribly for what I bought for - storing a large PHOTOS library on my Mac. When I sought Tech help, first by phone- I could not understand anything the support guy said to me. One try I got disconnected, and another time there was much disturbing shhhhing,   I hung up. A fourth time I called, I could not understand the support tech guy, but he gave me an e-mail address to write to, which I tried. It got rejected ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carl Blackburn",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T13:49:31.000Z",
          "Titre": "I regrated having bought directly form…",
          "Contenu": "I regrated having bought directly form Crucial. By surprise, I had to pay UPS for import fees.Moreover, pricing on Amazon is almost 50% cheaper for the same SSD."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathleen Ellsworth",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T00:24:43.000Z",
          "Titre": "Order # 1280234194739",
          "Contenu": "Order # 1280234194739I am unable to get any help on this order as it does not accept the email address, order # or credit card # for the Order Lookup link as I used Pay Pal to pay for the order.The problem is I ordered an SSD after doing a scan on the computer that I wanted to upgrade.  I was sent a Product SKU-CT1000P3SSD8, Crucial P3 1000GB PCIe M.2 2280SS SSD.  However after removing the back cover to my HP All-In-One I am unable to find a slot for an SSD and the SATA drive slot is much too big for the new Crucial SSD.  I need to return for refund or replacement, but can't do through the normal channel because the Order Lookup does not work for me.Please have someone contact me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan V",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:46:49.000Z",
          "Titre": "Product not received",
          "Contenu": "Good luck ever receiving your order or getting any real tracking info. I will never buy from crucial again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "joe",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T05:25:45.000Z",
          "Titre": "The app will recommend you the wrong…",
          "Contenu": "The app will recommend you the wrong memory, I wasted 90$ on memory I can’t use"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wilson Fletcher",
          "Nb_Reviews": 6,
          "Date": "2023-09-23T22:11:19.000Z",
          "Titre": "Very Poor Communication from start to…",
          "Contenu": "Very Poor Communication from start to finish. The part I wanted was not compatible with my system, which the Compatibility Checker assured me it was. No reply to email for return - I got a form letter with no instructions so I just sent the darn thing back and hope I get my money back. Buying from this vendor is about as personable and reliable as a broken vending machine."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 4,
          "Date": "2023-07-19T16:03:47.000Z",
          "Titre": "Very poor service",
          "Contenu": "Long delivery time - 1 weekFaulty product, warped DIMMUseless support - agents don't understand anything and cant communicate clearly.  No idea what is happening with my return.I usually buy from Crucial for the quality, what has happened? Cost savings by sourcing cheap components with poor QA and outsourced customer services?Very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MM Robb",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:51:08.000Z",
          "Titre": "ABSOLUTELY Terrible Customer Support",
          "Contenu": "MS500 SSD arrived dead, but it took 10+ hours for Crucial CS to determine this. Multiple agents could not coordinate a fix. They finally instructed me to return the SSD (at MY expense), then wait and wait for a replacement -- a return that could take 2-3 weeks total. Other companies overnight replacement parts. When Crucial parts fail, they make brand ambassadors like us wait for weeks -- and pay for shipping of THEIR faulty parts. What's more, in the troubleshooting process, the India-based CS team told me to change several BIOS settings which now have caused conflicts with my Operating System. Asking for a fix, their CS Team today told me to completely reformat my disk, meaning I will have to reload Win11 and all the OS updates and then reload and tweak dozens of software programs, just to return my computer to pre-Crucial status. We have long been Crucial brand ambassadors but Crucial CS today is terrible and their incompetence is costing me a lot of money. Shame on Crucial. My social media campaign against Crucial has just begun!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edward Herron",
          "Nb_Reviews": 3,
          "Date": "2023-09-30T11:32:28.000Z",
          "Titre": "T700 4TB SSD Return",
          "Contenu": "I ordered the new T700 SSD and it was DOA. Upon submitting the return ticket I still haven't heard any response from Crucial a week after I entered the ticket. In the automated response email from Crucial it said that I would receive an email shortly with instructions on where to send the return. And no such email has been received I will reach out to the support team again to get this resolved as quickly as possible. If I knew the return process would have been so brutal I would have just ordered it from Amazon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathon Saari",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T15:55:49.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service, customer service is non existent.. poor quality products, inconsistent products and poor quality control. You have to pay to return items, that they send to you that do not work.I will never buy from Crucial again. And i would always advocate against it. Everyone should know to never use crucial!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Akram shaik",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T04:36:31.000Z",
          "Titre": "One of the worst experiences..",
          "Contenu": "One of the worst experiences... till now I haven't received my order yet. I call Five times to customer support but no proper response. I keep telling the shipping destination wrong.  At last support person create a new order request but still I haven't received the details. Shipment and Billing Details:Order Number: 1232230444739Order Date: July 15, 2023"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Giovanni Valle",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T02:59:26.000Z",
          "Titre": "Have not received product to date",
          "Contenu": "Two weeks after placing my order, I still have not received anything. If I use the tracking code provided for the order, I get a \"We could not locate the shipment details for this tracking number\" error. Contacting support is difficult. Terrible service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oldman Camarillo, CA",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T22:53:25.000Z",
          "Titre": "Shipping information was unacceptable",
          "Contenu": "Shipping information was unacceptable.  Ordered on a Friday, received shipping info on Monday with link to UPS shipping.  However, NO INFORMATION on shipping site.   Called customer service, they said takes  48 hours to update!   Four days later....UPS updated and shipment would arrive in 4 busniess days.  I took Crucial  7 Business days to arrive.    Next time just use AMAZON for memory."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter M.",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T06:41:40.000Z",
          "Titre": "Defective modules. No returns",
          "Contenu": "My very first order which predates this one by a couple months, was a 96GB kit (48GB x 2) ram modules for laptop, which worked perfectly fine. I ordered another 48GB single module (same everythingas the kit btw, just more expensive), and turns out it is defective. When put in my laptop, it won't turn on at all (exact behavior: IMMEDIATE POWER OFF, after power on) - My laptop is CONFIRMED WORKING AND COMPATIBLE 101% with these 48GB modules. AS I been using the 96GB kit on it.I did all sorts of troubleshooting, like trying one of the modules from my 96GB kit in that other laptop, and it works, but when trying that new 48GB in any laptop where I been using similar module (also ordered from them as I mentioned) it simply doesn't even let the laptop start, immediate power off after powering on.I can 101% assert that the module I received is indeed defective (I feel like it's shorted inside) based on how my laptop behaves when turned on.I am absolutely disappointed $184 flushed down the drain. Thanks a lot crucial for not allowing returns either.If I could rate you as 0 stars, I would.I have not been able to speak to support either.Unless you must, do not buy directly from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous.",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T04:07:51.000Z",
          "Titre": "Incompetent.",
          "Contenu": "What went wrong? You shipped my memory with no apartment number on the envelope even thought it WAS in the order information. Unacceptable. Also...try hiring some support technicians that an American can understand. Hiring people with thick foreign accents so you can pay them less and the company fat cats can line their pockets is NOT customer support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Sims",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T14:32:34.000Z",
          "Titre": "HHD to SSD Cloning Problem",
          "Contenu": "I am on my third try to clone my laptop drive to the Crucial SSD but the Acronis software seems to not be working properly. Acronis reports the cloning was successful but when I install the SSD I get a message stating \"repairing errors,  this might take over an hour to complete\". Then after more than an hour the message is \"your pc cannot repair the errors\". I've looked online for help but the problem I'm having is not addressed.After searching online for similar issues, I found some people have experienced problems with the Acronis software. I found a another cloning/back-up software and using it was a breeze and it only took 2.14 hrs to complete the process."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Uday",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T15:52:43.000Z",
          "Titre": "Absolute waste of time",
          "Contenu": "Absolute waste of time and incompetent customer service. Ordered RAM on 24th April and was shipped on 25th April to reach Ireland.  Their website says it should arrive in 5-10 working days. Their shipping partner says 3 days within Europe. We'll, the item never moved from Netherlands and customer service had no idea what's going on with it. They has scripted answer like bots and we're just pushing it forward when followed up. Not recommended at all. The worst ever experience we has with any well known company. Luckily Amazon had same RAM, they delivered in 2 days and guess what....at 20% lower price ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damian Turchan",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T16:12:16.000Z",
          "Titre": "Configurator is incorrect for a HP…",
          "Contenu": "Configurator is incorrect for a HP ZBook Fury 15.6\" G8I had to call Customer service 3 times 1) I was disconnected after transfer  2) Lady could not speak clear English  3) Long call because rep didn't understand the issue and he couldn't get a supervisor on the callCrucial shipped DDR5-5600 Instead of the correct part DDR4-3200Also Product Code 695163 for DDR5-5600 is not in your system"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Pettit",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:24:27.000Z",
          "Titre": "you site made me buy the wrong ram card…",
          "Contenu": "you site made me buy the wrong ram card for my gl502vmk asus rog strix and i dont feel like going through the hassle of returning it.. so enjoy your 40 dollars. as your site recommended that 16 and 8gb were compatible with it and the forums for looking it up were poor on information. so I wont be buying the 8."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "REZA FARZAN",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T04:28:45.000Z",
          "Titre": "Crucial diagnostic determined a wrong…",
          "Contenu": "Crucial diagnostic determined a wrong part for my computer. When I tried to return it, the Return page was not available. And when I wrote to the customer service, I only got a run around, form messages from India based reps. Finally after two days, I was able to connect to the return department and ask for an RMA.My experience was horrible. I will not buy anything else from Crucial."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammad khalid Alamyar",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T20:27:31.000Z",
          "Titre": "Delivery is so bad My RAM is 3 mile…",
          "Contenu": "Delivery is so bad My RAM is 3 mile away from my home at last station since 4 days  and still at USPS station. it was combined UPS & USPS no responsibility from the beginning, just send item by one career not 2 or combined."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T16:11:50.000Z",
          "Titre": "Literally the worst customer service…",
          "Contenu": "Literally the worst customer service you could imagine. As others have stated, the tracking numbers provided are invalid (not found by UPS). Called in a few times and was told to continue waiting.If you do want to purchase directly from their website, I recommend using PayPal or a credit card so you can easily get your money back when Crucial inevitably fails to deliver the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frustrated",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T18:28:16.000Z",
          "Titre": "Frustrated",
          "Contenu": "I purchased 32GB (2 sticks of 16GB) DDR4 ram.  After install everything works but after a few minutes, the screen goes black.  After experimenting, I found that one of the sticks is unstable but the other works fine.  Crucial will not send a replacement without the faulty RAM being returned first.  This computer is running a CNC machine and I can not afford to be without production for that long.  So in the end I paid for 32GB to get only 16GB of functioning RAM.  Not a good deal.  If I sell a customer a faulty item, I feel responsible and will send a replacement and wait for the faulty item to be replaced at the customer's convenience.  Micron's warranty process needs to be changed to reflect the real world needs of the customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jorge ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:38:04.000Z",
          "Titre": "I canceled order for my money refunded",
          "Contenu": "I canceled order got  my money refunded  3 weeks later they decide to charge my card again  and then when you call the machine speaking’s sounds like 1990s robot I already knew I was going to have trouble of course they barely know English   Smh some fraud sh1TT I tell you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin love",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:37:51.000Z",
          "Titre": "Still do not have it",
          "Contenu": "Still do not have it. Takes way to long."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T19:57:47.000Z",
          "Titre": "I ordered memory for delivery",
          "Contenu": "I ordered memory for delivery , somehow the unit number for my home was missed.my fault completely . I could not get ahold of someone to try to rectify the address situation. Now I have to wait for a refund on an item. To repurchase and wait more time . I was hoping that the reps could've corrected the address and sent me the order . But nope its a waiting game. And it didn't help that I got emails receipts from two different company's.  So tracking down a customer service rep or anyone outside of a chat never happened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Broderick",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T20:14:34.000Z",
          "Titre": "Checked the compatibility of the SSD…",
          "Contenu": "Checked the compatibility of the SSD and my motherboard on the Crucial website and it verified that it would work. Once I got it and spent 2 days trying to get it to work, finally figured out that it’s not compatible and I wasted $450 on the ssd that would not work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kevin John Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T13:55:41.000Z",
          "Titre": "ordered ssd on 7/5/23 was posted on…",
          "Contenu": "ordered ssd on 7/5/23 was posted on 9/5/23 using royal mail 24 hour. followed the link in email to spring gds, package started in Prague CZ,followed by Pulhiem DE, followed by the Hague NL customs, then finally Middlesex customs, and still not recieved it, so much for 24 hours, i ended up buying 2 from amazon delivered the same day, god knows when crucials one will turn up, i'll never use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Once Great Customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T13:29:24.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "Returns are a hassle. Even after you get the return approval you may NEVER see the credit. Customer Service Reps don’t speak English and hard to understand. It’s exhausting & near Rip Off criteria!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rip",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T18:20:22.000Z",
          "Titre": "Crucial cheaps out on customer service…",
          "Contenu": "Crucial cheaps out on customer service which 9x out of 10 is an indicator on their products because what else do they cheap out on.  They're one of those companies that send American jobs overseas. After struggling for days trying to mirror my windows o/s drive with endless errors I finally give up and call \"tech support.\"  I got some guy in India (Pakistan? He was reluctant to tell me where he was but the accent was very thick.  I respect that he learned English, he seemed like a nice enough guy, but that doesn't mean he's easy to understand) that I could BARELY hear... that was working from home.  He tried to tell me he was on a landline but he was not, cell phones cutting out are unmistakable.  So a) his voice volume was painfully low, b) his accent was SO thick when the line wasn't cutting out I could understand maybe 3 of 10 words c) his line kept cutting out like he was constantly hitting the mute button randomly.  One of the few things I understood the guy say was crucial drives are not compatible with all motherboards/BIOS for mirroring.  This is how they reward their customers for giving them their business.  Sell a product that can't be mirrored, and if they need help? You get routed to Azhbadabalahad in Pakistan who is working from home.  Never again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DALE BANKS",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T16:54:57.000Z",
          "Titre": "Deliveries are painfully slow",
          "Contenu": "Deliveries are painfully slow. For a company who is known for it's memory, I should not be able to get your products from second hand suppliers 500% faster."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian DeBonis",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T17:16:26.000Z",
          "Titre": "Wrong RAM",
          "Contenu": "Wrong RAMI used your website to enter in my computer and it told me which RAM was compatible. I purchased that one and it is the wrong speed and causes memory errors on my PC and does not work.  When I tried to return it I have the Email address and order number but your website \"can not find my order\" or account. I have sent a message to your support team but now have to wait up to 1 day for a reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:26:27.000Z",
          "Titre": "Time from payment to actual product…",
          "Contenu": "Time from payment to actual product placed for delivery was ridiculous. Faster options with better support out there.  Will never shop or purchase crucial products again.  4 months later and I still have not  been given any way to return the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl Ball",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:51:22.000Z",
          "Titre": "Order did not arrive",
          "Contenu": "Order did not arrive, UPS tracking number does not work, very difficult to get help from the website. Glad the order was low value as it seems that I am not getting the product I ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey H",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T20:08:04.000Z",
          "Titre": "I don't doubt that the quality",
          "Contenu": "I don't doubt that the quality of the product itself . However, the support people do not speak English as a first language and they are almost impossible to understand. I was cut off three times. I was never able to get answers as to how I could access the Crucial to see what was copied over and access it. It became impossible and I had to return it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CD",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:22:31.000Z",
          "Titre": "the guy gave me no useful info and…",
          "Contenu": "the guy gave me no useful info and instruction, basically told me to \"wait another day then contact us again\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer Middletown CT",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T01:32:41.000Z",
          "Titre": "RETURN ISSUES",
          "Contenu": "I tried to initiate a return and the website was saying I was entering the wrong email and the order number I put in did not exist. I have better things to do with my time than I try to keep reentering the numbers that I know are correct because I copied them from the original email of the order confirmation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:52:35.000Z",
          "Titre": "Surprised & very disappointed",
          "Contenu": "Pre sales with raj he suggested upgrades as per my motherboard as advertised on your website, I asked if a mounting screw came with it he said no , didn’t know what screw size , spent hours to find out ,ordered it ,spent $15.00 for it only to find it was included with your m.2 drive ,countless calls to tech support to get it working , 23 hours of tinkering,finally I called tech support & get someone who wouldn’t give his name when asked   , had kids screaming in the background tells me it’s an issue that Dell & you are aware of ( then why recommend it) finally he says that tech support is going to find a solution & get back to me .they never did & I rma the product. Raj also asked it I would e/mail the general manager & put in a good word for him - a e/male is in the works to him with full details of what was just describedDid you not read what I wrote. In the many calls to tech support I got raj I mentioned the screw I had to buy since he said it wasn’t included, he asked did you get it yet , i replied no not yet , raj says we’ll send it back then . Ok I should spend another $15 ( that will make $30 total for the screw that’s included  - point being he didn’t know his product .Countless hours into trying to get your product to work & finally I get a tech support ( the one that wouldn’t identify himself , the one with his kids screaming in the background so I couldn’t even hear him as he mutes the conversation many times , tells me - there are known incompatible differences with my Dell & your product- so why recommend this to me This is customer service ?This is the way to treat a customer?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T23:00:33.000Z",
          "Titre": "Awful Customer service",
          "Contenu": "I placed an order, but I needed to cancel it shortly after. I tried to cancel it for three days before the package was shipped, but they ended up shipping the package anyway so I had to pay 15 dollar return shipping"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nate Millard",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T02:59:24.000Z",
          "Titre": "Every time I try to place an order for weeks now.",
          "Contenu": "Every time I try to place an order, It fails to go through.  I have been trying since Sept. 25th.  I have a case number of 01712725.  After using the chat support and being ignored, I finally started calling.  I was told the issue would be looked at, but it wasn't elevated until the 2nd or 3rd call.  When I reminded them I'm a reseller they finally stopped telling me to buy from somebody else, and that they would actually look into the problem.  That was last week, and I still haven't heard anything back.  When I noticed the email asking me to rate my purchase experience (what purchase) just now, I tried submitting another order.  It's still failing.  As I keep saying, the first order I placed on the 25th and originally went through okay.  Later in day it was refunded for some reason.  The credit card company told me there were no issues with the account, and the order cancellation and refund wasn't necessary.  Since then, once I fill in the payment and shipping information and submit the order, it fails.  I've been able the get tax exempt approval from other parts suppliers so I have a source until this gets fixed.  I would like to buy from Crucial, but your web site won't let me.  Please let me know when this issue is fixed, or let me know if I need to fix anything I did wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Cole",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T21:10:54.000Z",
          "Titre": "When I discovered Crucial years ago",
          "Contenu": "When I discovered Crucial years ago, I thought I had found the forever solution to my memory problems. I ordered and Crucial performed for many, many transactions. The last two times I ordered from Crucial it took for EVVVVVVVVer for me to receive the memory.  I could have reordered, driven to California to pick it up and back to the East coast, only to track down the client who was on vacation at Disney World, install the memory, and still had time to spare before the USPS, (yes, not Fedex or UPS, but the modern, stuck-in-neutral Postal \"Service\"), actually dropped the package in my mailbox."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blazan-420 O.",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T05:53:38.000Z",
          "Titre": "Ram tool from site did not work…",
          "Contenu": "Ram tool from site did not work correctly ended up ordering returned it twice waiting on the second refund an update email was provided letting me know if the refund completion which was very helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew B",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:24:01.000Z",
          "Titre": "Warning about the free delivery",
          "Contenu": "I got the correct parts and I am happy with that but I would have bought them somewhere else if I knew the delivery time would take weeks longer than expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alfred Owens",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:22:29.000Z",
          "Titre": "The item was too long of a wait for…",
          "Contenu": "The item was too long of a wait for delivery. I thought I had purchased the item locally."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keannu Lenz",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:47:14.000Z",
          "Titre": "Ssd doesn't work.",
          "Contenu": "The SSD card I bought for the Inspiron 15 3501 does not work. A system shows that I need a hardrive even though my past SSD worked fine without one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T20:43:43.000Z",
          "Titre": "Before purchasing",
          "Contenu": "Before purchasing, I used Crucial's upgrade scanner which GUARANTEED compatibility, and could NOT install the SSD. Their software said the target drive was too small. Old drive 1TB, new drive 500GB, used space, 150 GB. Spent 4 DAYS and could not install. Spent hours online with support chat. They could not help. Said they thought it might be a software conflict on my machine. Had experienced son come over and see if he could install, and no. Contacted cust svc and asked to return, but would have to pay return shipping. It's a small thing, but I didn't feel like I should have to pay to return something they said was guaranteed compatible. So, instead of returning, and because it wasn't a lot of money in the first place, I bought an enclosure from another site and will use said drive as a backup. I will probably not buy from Crucial again because of this experience. I also was a past customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Durfey",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:05:35.000Z",
          "Titre": "Poor Delivery",
          "Contenu": "I placed order on 11/20/23.The ssd arrived on 12/5/23!Had I been advised of a two week delivery, I would have paid for express shipping."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "St St",
          "Nb_Reviews": 10,
          "Date": "2023-11-15T14:47:03.000Z",
          "Titre": "Bad products, no customer email support ..",
          "Contenu": "No customer email support ... So we have to write our experience on this platform: We've bought 2 Crucial X6 SSDs and all of a sudden the writing speed drops to 50 MB/s after a while working with them. Blackmagicdesign's Speed Test starts at 720MB/s and then slowly drops to 50MB/s. We are very disappointed and will return the units."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HS",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T08:34:58.000Z",
          "Titre": "Browse options, don't rely on system scanner",
          "Contenu": "I wanted to buy some RAM for my pc, and the scanner suggested an option. I bought it, then looked at other options just for the sake of it. There was \"Pro\" RAM of the same type and amount for $20 less. I couldn't cancel my order even though I had just placed it.The tracking system is also in shambles. It kept saying that there was \"no package under my tracking ID\". I called a representative, and she told me it would take 5 days for the tracking status to update. The status never updated.My package did eventually arrive after 8 days, but I was worried the whole time that I'd been scammed. I won't be buying from Crucial directly again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nissi Wang",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T23:47:09.000Z",
          "Titre": "Improve shipment tracking",
          "Contenu": "Need to improve information for tracking shipments. If you don't ship right away, customers need to be informed of this, using a message like \"Your item has shipped.\" Do NOT pass on a tracking number until the shipment is in the hands of the shipping company. I tried for several days to track my shipment using the tracking number that was emailed to me right after I paid. But when I entered the tracking number into the shipper's website, the response was that the tracking number was incorrect. I had to contact Crucial's customer support, who was only somewhat helpful. Only after several days when the item was actually being shipped, did the tracking number work."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Cliff Kelly",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T21:58:41.000Z",
          "Titre": "The price wasn't what I thought",
          "Contenu": "The price wasn't what I thought. I canceled the order. I am in Canada and I didn't realize that the price was in US dollars until it was charged to my card. I  think the price should reflect where you are purchasing from."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mark Steeves",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T02:55:18.000Z",
          "Titre": "Like Dealing with a 6 Day Migraine ordering RAM & SSD",
          "Contenu": "This time... Well. In bound duty to Canada was not mention nor warned about. Was not clear purchases were being made in USD but figured as much it would be. Referenced Credit Card to check. Paid for Expedited International shipping 22 USD,advised 2 days and through UPS. Package delayed on 3rd day and advised by UPS shipper had not provided any broker info. This turned into a Friday, UPS charged a further $19.45 USD to release package the following Monday. Resulted in 6 days , untold delays, extra costs and a field employee down 3 days waiting for His system to become operable again. 1st and last attempt at buying anything from Crucial ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter M.",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T03:08:07.000Z",
          "Titre": "The DIMMs (RAM) don't work on ROG SCAR…",
          "Contenu": "The DIMMs (RAM) don't work on ROG SCAR 16 2022.Address input wasn't great.  Loqate sucks. You didn't provide any options to add my phone number for the delivery.I couldn't find anywhere on your site, which laptops that 96gb kit is compatible with. Also lack of explanation as to why it is incompatible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cary Watson",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T18:39:00.000Z",
          "Titre": "Better products.",
          "Contenu": "I tried getting information on the web page which was a total failure. So I called Customer Service who provided me with helpful service. Once I received the product I found it to be inferior.  I ordered a 2.5 to 3.5 SSD Bracket, which was difficult to mount.  I had to physically cut and bend the mounts to fit the Crucial 1T drive.  Then the mounts didn't easily fit into the CPU case.  Please speak with the engineers about compatibility issues.  Both these products (the SSD drive, 3.5 to 2.5 adapter) were Crucial products and should have work perfectly together."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gregg Walker",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T03:22:37.000Z",
          "Titre": "Was disappointed with shipping",
          "Contenu": "Was disappointed with shipping. My ordered was placed the 29th of July didn't get till August 4th. My order that is only like 60 miles from Mountain Home, ID. Went from Meridian, ID to Salt Lake, then back to Mountain Home. I was given a tracking number early on I tried taking it, said the tracking number was no good. Contacted customer service they said the tracking number would show up on the 4th of August the day it was delivered, why bother giving a tracking number."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Irvine",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T03:26:04.000Z",
          "Titre": "Be wary about the cloning software Crucial suggests when cloning your hard drive to SSD.",
          "Contenu": "Acronis True Image to clone is NOT free, to have it do a clone you need to pay $49.99 nowadays to get the tier of service necessary to do a clone. The video and link need to be updated with either an alternate free cloning software or a warning about how much it will cost. There are other options out there that are free!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ShawnLeb",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T21:13:20.000Z",
          "Titre": "It took nearly a month to get one item",
          "Contenu": "It took nearly a month to get one item. Contacting support wasn't an issue, but by the point I felt I needed to contact them any trust was lost. When they finally sent a shipping number it didn't work for several days. Thankfully the item arrived eventually and worked, but there was no way to cancel the order or determine where it was in the process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carl LaFong",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T05:18:06.000Z",
          "Titre": "Poor Shipping and Tracking",
          "Contenu": "Very nice website, very helpful to select the proper memory or SSD. The problem is with your shipping. It took almost a week for the memory  to be shipped and  to get a tracking number and then the tracking didn't work. Crucial ships with UPS but then the package is turned over to the USPS and disappears. Tracking dies at that point. I'll buy somewhere else in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Gamache",
          "Nb_Reviews": 4,
          "Date": "2023-01-06T05:51:51.000Z",
          "Titre": "Processing and shipping needs work",
          "Contenu": "Processing and shipping needs work. I ordered and paid for 2nd day delivery. Took 10 days. I could have ordered from the Crucial store on Amazon and gotten it in 2 days for free. Prime member. Paid $8.75 for nothing. I put in a second order and it still hasn't processed or shipped. Going on 6th day now. Maybe you need more people or something?The memory I ordered is fine. Kudos for that at least. But your shipping is Luke the old pony express ..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 6,
          "Date": "2022-12-14T00:05:38.000Z",
          "Titre": "VERY LONG DELIVERY TIME",
          "Contenu": "VERY LONG DELIVERY TIME. unfortunate decision to change horses in mid-stream (UPS to USPS). Our USPS service is notorious for terrible delays, late (dark) deliveries, sometimes no mail at all for two days then lots of “lost” mail when deliveries resume, etc. repeated forecasts of mail deliveries revised up to five times and ultimately very late."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-08-16T14:21:32.000Z",
          "Titre": "I can no longer trust your so called…",
          "Contenu": "I can no longer trust your so called (100% guaranteed compatible). I ordered some DDR 5 RAM and an SSD for a Dell XPS 8960, and before I even receive it, one of your engineers is telling me to return it, Huh! I thought it was 100% compatible. Anyway, I just returned both items, which I still have not received credit for. I did not open the package and I paid extra to enclose items in a box with packing peanuts around them, so they would not get damaged, much unlike your packing practices!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ranger Kidwell-Ross",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T22:38:24.000Z",
          "Titre": "Bait and Switch?",
          "Contenu": "I was told the 4T SSD drive I ordered was in stock so ordered to replace my dead iMac drive on December 28th. Still hadn't even been shipped when I called on around the 6th or 7th. In the meantime I have no office computer and my one-person business is basically shut down. Hard to want to buy from the company ever again..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arthur Perkins",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T19:48:53.000Z",
          "Titre": "Poor Service and Poor Attitude",
          "Contenu": "To start with, I didn't get my package. I waited a month to see if my package would ever come. When I finally called Crucial, they told me that the package got lost. And, that they would send a replacement order and ship it Priority. Well, four days later, the package shipped. And, it didn't ship priority. I called to find out why only to be met with an agent with an attitude.So, why would I become a repeat customer with this kind of treatment and attention to detail?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T03:03:34.000Z",
          "Titre": "First my order was out of stock but…",
          "Contenu": "First my order was out of stock but never communicated it clearly.  Then when the item came back in stock it took a week to get it shipped out then another week to be delivered.  I’ve bought items on eBay from China that had faster shipping.  This is what I would expect from a private seller not a company like crucial."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John S. Beardall",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T06:07:56.000Z",
          "Titre": "Shipping Sucked",
          "Contenu": "I would have liked to select the method of delivery for my purchase.  I was told by customer service that Crucial selects the least expensive method in order to offer a discount.  According to tracking online, the item spent days sitting 30 miles from my home waiting to be delivered.  If I had chosen the shipping method, I would have paid extra to get it in far less time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T03:58:52.000Z",
          "Titre": "Slow shipping.................",
          "Contenu": "I could have bought this on Amazon with quick Prime delivery.  I thought it would be nice to cut out the middle man and help Crucial make more profit.  Little did I appreciate that my 2 day Prime delivery would be nearly 2 WEEKS from Crucial via the USPS."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T23:47:52.000Z",
          "Titre": "I ordered my product on 12\\15\\22 and i…",
          "Contenu": "I ordered my product on 12\\15\\22 and i still have no delivery date as of 12\\29\\22. Shipping is not great. Everything else is wonderful. I love the product and the customer support. I have been using Crucial products for over 15 years. Just shipping this time is really bad. Hope this can help you with any issues. Thanks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arthur Fontaine",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T07:24:17.000Z",
          "Titre": "Don't auto feed customers an answer so…",
          "Contenu": "Don't auto feed customers an answer so quickly.  When wanting a refund for example or a replacement. Don't send them warranty information in which I'm certain they have looked over already! Send them the ability to print out the label you made out for them in advance. And not a well, if you want to send it back statement, than do this or that by writing the address manually and all that stuff.  Then embarrass yourself by way of saying prove who you are when clear information was given you in the first place!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Augustus C Temple III",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T22:43:25.000Z",
          "Titre": "Took too long to Arrive",
          "Contenu": "ORDERED the Computer Memory on November 28th.It SHIPPED on December 1st.I RECEIVED it on December 12th from the Post Office on USPS Mail Innovations (which starts off with UPS then they hand it off to USPS)...\"IT TOOK TOO LONG\".They should have informed me BEFORE I purchased it that, it would take that long to arrive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Figueroa",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T13:43:51.000Z",
          "Titre": "i placed my ordered and never received…",
          "Contenu": "i placed my ordered and never received any indication that the order was received or that it was being processed or shipped.   Funds were deducted immediately from my account so i know the transaction went through.  Every time i checked the status it was showing \"unconfirmed\".   When i spoke with an agent or several occasions each time they said it was going to ship within 24 hours.  This happened twice.   Second time i canceled the order.  At that time, in my account, my order was still showing as unconfirmed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TheGear",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T18:49:44.000Z",
          "Titre": "Unfriendly web site, when it comes to support",
          "Contenu": "1.  The tracking URL provided was incorrect.  Eventually I realized that I could dig the shipper's number out of the URL and use it on their site;  this worked.2.  At one point in the process I saw a web page that indicated that my order had been partially shipped.  Fortunately that turned out not to be the case.3.  At no time was i ever successful in using the chat feature to find out a correct URL or a delivery date.  Your chat feature fails the Turing test:  there are obviously no human beings behind it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Vernon",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T18:55:10.000Z",
          "Titre": "Ordered from them 2 times 1 day apart",
          "Contenu": "Ordered from them 2 times 1 day apart. Paid for express shipping for both, received 1 , waiting for the other. The first order I received was in an oversized ups bag with no protection (ram was in a plastic sleeve) Don't know what to think about the shipping process, paid 8.99 for express shipping, wow!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T03:13:12.000Z",
          "Titre": "Some problems",
          "Contenu": "I received an email implying that the RAM had been delivered when it had only been shipped, if even that.  The tracking number didn't work until a few days later.  I wondered if I had gotten scammed, especially since the email was kind of wonky.  The website also didn't seem modern and paying with PayPal caused some confusing things to happen.  Using my email to get my password failed, maybe because I used PayPal, adding to my concerns about the purchase.The RAM did arrive and appears to be in good condition."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DBR",
          "Nb_Reviews": 3,
          "Date": "2023-10-04T04:25:02.000Z",
          "Titre": "Ran the test for compatible products…",
          "Contenu": "Ran the test for compatible products for my lenovo ideapad. no where does it say I need to buy a cable for the sata drive. how can it be compatible if there is no way to plug it in. the memory dimm when fine as expected so far so good. If I buy your products in future will get them via amazon as free returns. I am still waiting for a prepaid label to return the sata drive that does not fit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Foggie",
          "Nb_Reviews": 6,
          "Date": "2022-12-12T16:13:22.000Z",
          "Titre": "Delivery took extremely too long",
          "Contenu": "Delivery took extremely too long for arrival.  Still haven't received product ordered on Dec 1st and it is now Dec 12th; but the reason why I'm posting this now is because when I tried to TRACK the package on my account on the website, the order no longer is listed. Poor Customer Service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Preston Page",
          "Nb_Reviews": 8,
          "Date": "2023-03-28T21:38:20.000Z",
          "Titre": "Disappointed by Shipping Experience",
          "Contenu": "Disappointed because on check out, there was no estimated ship or arrival date.  When I tried to check status, the UPS tracking number link threw an error.  When about a week later, I received an email shipment notification, but the UPS tracking still threw an error.  Love the products, but the web site and shipping expenses have room to improve.("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RobT",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T17:55:37.000Z",
          "Titre": "Crucial.com order delivery is terrible",
          "Contenu": "I've never had a problem with Crucial products, but their order delivery system is terrible. I still haven't received my order I placed 2 weeks ago for stock items. My advise; If you're looking for a quick turn around, pay the higher price and buy from a local retailer, or try Amazon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lance Woolie",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T23:52:52.000Z",
          "Titre": "Tracking ?",
          "Contenu": "No, tracking during shipment. Basically ups  just says we will let you know when it’s going to be delivered and here I am weeks later waiting on the SSD with no idea when it will ever come inThe crucial hardware i works great but , it’s crucial that I know when I’m getting it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse Worrell",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T23:09:46.000Z",
          "Titre": "I use the memory finder guide on the…",
          "Contenu": "I use the memory finder guide on the crucial site that said this memory would work in my specific machine.  While I got the memory within the promised time - it did not work.  My thought is that since it was a faster speed than the existing memory it was to replace that is why the system did not recognize it. No option for different memory speeds were offered.  Sadly - I had to send it back for a refund. I am usually a big fan of crucial because they always get it right - but not this time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RDanahy",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T13:09:54.000Z",
          "Titre": "Snail Pace Delivery for simple purchase",
          "Contenu": "The single memory upgrade ordered was in stock and ordered March 19 - and on arrival worked fine in the Lenovo AIO desktop just fine on install.However, it was frustrating to order this simple part and wait 11 days March 30 for its delivery in a flat mail package. It delayed the repair and I will use another vendor with to purchase even the same product such as Amazon or NewEgg."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Boyd",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T22:41:05.000Z",
          "Titre": "Understand how orders are shipped",
          "Contenu": "I placed my order on 12/07/22 and finally received my order on 12/20/22.  I should have done more research on how my order was going to be shipped prior to placing the order.  Because it was shipped via UPS and then transferred to USPS, my order was temporarily lost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken Keefer",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T21:20:13.000Z",
          "Titre": "The order has not arrived",
          "Contenu": "The order has not arrived.  It was placed on 11/29 and today is 12/15..  I was just told by customer support to wait till 12/20 until Crucial would take action.  I was not expecting the order processing and deliver to take so long.. Order number is 1051302754739.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wayne Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T05:12:44.000Z",
          "Titre": "Shipping sucks",
          "Contenu": "Shipping sucks.  They use the UPS sure post where the post office does final delivery.  UPS delivered to point of transfer to post office fairly quickly then several days no update of tracking.  Finally on about the 8th day it showed out for delivery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Napoletan",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T17:41:48.000Z",
          "Titre": "All I wanted after seeing no shipping…",
          "Contenu": "All I wanted after seeing no shipping history, was an answer as to whether my product actually had shipped.  I called you and of course got customer service somewhere overseas.  I could not get any type of answer from them.  AND I hate when customer service just repeats back to me the facts that I gave them.  internet customer service… makes you want to go back and shop at K Mart."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry S.",
          "Nb_Reviews": 5,
          "Date": "2023-01-29T19:19:59.000Z",
          "Titre": "Your shipping method (UPS Mail…",
          "Contenu": "Your shipping method (UPS Mail Innovations) is the slowest possible out there, taking a week+ for my item to get to me. Plus, your support department employs hard-to-understand people, who do not give proper information on how to resolve issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J MARK DEISERING",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T15:05:20.000Z",
          "Titre": "Tracking the order in the beginning was…",
          "Contenu": "Tracking the order in the beginning was hard to do. I tried to chat in multiple times and the chat screen just loaded it and over. It would be nice if you had a way that the client could go in and just get an update with what is going on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dawson King",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T04:09:25.000Z",
          "Titre": "Zero communication and slowest delivery…",
          "Contenu": "Zero communication and slowest delivery possible.  I ordered on Dec 26, received on Jan 17, there was no communication about delays, no response to my inquiries about the status staying on “ordered” for weeks.  Product itself is fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tiresmoke",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T16:05:34.000Z",
          "Titre": "Eight days later wrong memory.",
          "Contenu": "After an 8 day wait to receive the memory I ordered. Your sub-contractor sent the wrong part number of that memory purchased and for the privilege of your mistake I had to pay additional shipping costs to return the memory to them. I Lost work time in the process and still have to wait until they SAY they have received the returned memory and then maybe have wait an additional 8 days to have my account credited. Very bad buying experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Ives",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T03:42:37.000Z",
          "Titre": "Hardware Good, Software Bad",
          "Contenu": "The products themselves are fine.  I have ordered before and never had trouble with the hardware.  However, you need to ditch Acronis TrueImage.  It is crap.  It is SLOOOOOW and doesn't work.  Had to switch to Macrium to get my disk cloned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matt Pipke",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T19:24:28.000Z",
          "Titre": "poor service on weekends and after hours",
          "Contenu": "if you order over a weekend and need to make any changes, things don't go as planned.at least not for me, they cancelled my order and made me re-order everything, delaying the order.All I wanted to do was cancel an nvme and replace it with a sata III drive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert B Kinn",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T21:13:43.000Z",
          "Titre": "16mb ram chip was really two 8mb Chips",
          "Contenu": "Item described as 16mb ram chip was actually 2 8mb ram chips.  it makes a difference when ram slots are limited.  Also the return of product does not involve getting a shipping label.  Amazon has make return labels a shipping standard."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trent Whiteley",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:35:27.000Z",
          "Titre": "The screw provided for securing the ssd…",
          "Contenu": "The screw provided for securing the ssd is slightly too small, came loose after 48 hours and risked shorting out the motherboard."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Ambriz",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T14:23:02.000Z",
          "Titre": "I ordered some RAM for my laptop…",
          "Contenu": "I ordered some RAM for my laptop computer on 02/20/23. As of 03/08/23 I have not received my order.  I did receive an email on 02/22/23 saying that they do not currently have sufficient inventory to fill my order and that typically, inventory is replenished within seven to ten business days, but that that was just an estimate.  The company should adjust their system to let people know whether items are in stock or not so they don't create false expectations that goods will arrive on time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven P Kerimian",
          "Nb_Reviews": 2,
          "Date": "2022-12-25T13:43:04.000Z",
          "Titre": "Bad shipping",
          "Contenu": "The tracking information is not accurate and I am waiting since December 10 and still no item I have ordered. The thing is I am disappointed because I have used crucial in the past and things were fast and no issues"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse Bee",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T22:13:09.000Z",
          "Titre": "It wasn't until 14 days after my…",
          "Contenu": "It wasn't until 14 days after my account was debited that my purchase finally arrived. I had hoped that buying directly from the manufacturer that their \"Free Shipping\" wouldn't entail a two week delay in delivery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn M",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T14:54:28.000Z",
          "Titre": "Not exactly starting off good",
          "Contenu": "The purchasing process was sinple. Easy to use, easy to find the right product. Especially since they have the product finder tool. However, after only 24 hrs of having my new NVME M.2 SSD my computer crashed. After performing numerous tests, the short and long DST results were not good. Tests determined that the SSD is on its last leg. Moments before the crash a test of read/write speed was performed and it peaked at a disturbing 1,400mbps which is very. Very. Far from it's claim to over 6,000.  The warranty process has not be bad so far, however I am still fresh into the claim and have not received the replacement drive. At this time one additional star given for the fairly simple warranty claim."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Parchim",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T22:30:30.000Z",
          "Titre": "Good customer service, but...",
          "Contenu": "I'm giving two stars because the customer service rep was very helpful. Unfortunately the ssd did not clone and could not get it to clone on three attempts.   The computer is at a shop for cloning and it failed for them twice...so far.  May end up asking for a return."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James E Young",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T19:22:09.000Z",
          "Titre": "The shipping method you used is…",
          "Contenu": "The shipping method you used is extremely risky. I have had several orders disappear from other companies that utilize the UPS \"mail innovations\" method.  From my experience, once UPS turns the item over to the US Postal Service for final destination delivery, there is an extremely good chance the item will mysteriously disappear.  That has happened to me several times.  Indeed this time the official USPS record shows that they delivered your shipment was delivered in my mailbox in the early afternoon, when in fact it did not show up on my front porch instead of mailbox until 8:30 pm that day. I do not know if it was a Postal Service employee who put it on my porch or a neighbor who received it by mistake.  Nevertheless, I feel lucky that it did arrive at all. Please consider any other shipping method other than UPS Mail Innovations."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Le Baron",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T04:44:41.000Z",
          "Titre": "Let Down By Micron",
          "Contenu": "I ordered 2x 16gb RAM and it took many days for the order to be filled and even longer plus the shipping time. Compounded by a snowstorm in colorado the delivery was further delayed by 2 additional days. (2 weeks since order.) I ordered RAM from corsair and the order was filled and got delivered in 4 days since purchase. I felt like i was let down by the shipping time and the time it took to fulfill an order from Micron. While the chips arrived in excellent condition i felt like it was lucky that they did because they were NOT boxed and the USPS delivery had folded the padded envelope. To make matters worse the RAM did not arrive in a static/moisture protective barrier like the RAM i ordered from Corsair did. At all most every turn i feel let down my Micron. From order fulfillment time, shipping time/speed, shipping material method, and no environmental protection for the RAM chips to protect against elements/static electricity."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Vernon",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T00:50:41.000Z",
          "Titre": "I used your on-line assessment tool for…",
          "Contenu": "I used your on-line assessment tool for two different computers.  For both it said there were two RAM slots each that could hold  16 GB chips but only had 4GB in one.  So I ordered recommended 16 chips to replace the 4.  Turns out those 4 were integrated and not replaceable.   So now I have 2- 16 GB chips with no place to for them."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "dave mooney",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T16:26:55.000Z",
          "Titre": "Crucial - poor logistics/delivery",
          "Contenu": "I ordered memory from Crucial on the 19/08. It finally arrived today 02/09. In between it was \"lost\" for a week somewhere between Germany and Netherlands. Crucials help desk advised that there was nothing they could do as they delivered in 10 working days and to wait until 04/09. Thats 16 days in real money.On the first fitting of the memory the computer would not boot. There was no display and the power button kept going off. I did try various combinations of old and new memory for the same result.Some research said to leave it for a while (32Gb @ 5-10 minutes). I retried this and my computer is now reporting 32Gb. So how is the memory? Well, its memory and I wouldnt know if its better or worse than other brands.Where things fall down is the delivery times. I could have bought the same from Amazon or eBuyer at the same or lower cost and had next day delivery.If anything does go wrong, I am expected to pay return postage and insurance, and accept all liability. Given the hassle of getting it in the first place I have zero faith in Crucial or their logistics if I need to return it.I hope there are no more problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Livengood",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T06:15:06.000Z",
          "Titre": "Can’t say how good or bad the product…",
          "Contenu": "Can’t say how good or bad the product is yet but I will take a chance with a 5 yr warranty but it took forrreeevveerrr to get it over a week and no tracking for 4 days after they sent the email it was shipped"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "richard sorge",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T22:28:01.000Z",
          "Titre": "Web site PC scan was inaccurate on…",
          "Contenu": "Web site PC scan was inaccurate on available upgradable RAM."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Paul Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:07:34.000Z",
          "Titre": "Had to pay taxes at the door!",
          "Contenu": "Had to pay taxes at the door!The point missed by Crucial is to provide a BETER service by including all taxes and costs in the price and paying it on behalf of the customer. This is what a good business does. Product is great just this service is not!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T16:43:05.000Z",
          "Titre": "I placed orders for (3) different…",
          "Contenu": "I placed orders for (3) different memory chips and (1) SSD.  One memory chip did not fit into the computer ( I scanned with the on-line tool).  Rather than return it, I used it in an older laptop.   I have tried cloning my existing drive 5 times to the new drive.  On the 3rd attempt, I was able to boot the computer with the new drive, however, something was corrupt and the Windows search would not work.  All other clones would not boot.  I ran SFC, and DISM no errors were found on the existing drive.  Some online posts say Acronis could be the problem.  I have a new drive that I cant use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy Lund Springer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T21:32:18.000Z",
          "Titre": "I received an email with a tracking…",
          "Contenu": "I received an email with a tracking number that did not work. Got with an agent that provided the correct tracking number and claimed the email was not from their company...HADisappointed in the time it took to receive."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Sa Sameer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T09:20:28.000Z",
          "Titre": "Worst service for laptop ram…",
          "Contenu": "Worst service for laptop ram replacementIt takes more than 1 month still waiting in Karnataka mysore"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed Tobey",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T21:36:35.000Z",
          "Titre": "Difficult instructions",
          "Contenu": "My software developer son had so much difficulty he could not complete the cloning. So far I'm stuck with the old hard drive. I'd love to have the new SSD working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Albert Zodun",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T05:57:56.000Z",
          "Titre": "My order sat on your loading dock for…Bad fullment and shipping.",
          "Contenu": "My order sat on your loading dock for 2weeks packed and waiting for UPS pickup. STILL waiting for my Cbip shipment. PRODUCT was not out of stock according to your website wen ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T17:01:40.000Z",
          "Titre": "Took too long to ship",
          "Contenu": "Took too long to ship. Tracking number didn't work for several days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Kirstein",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T02:27:36.000Z",
          "Titre": "Issues with delivery",
          "Contenu": "Well for starers you didn’t have a delivery date. I had no idea when the package was gonna show up. It also seemed like no one knew where it was or what was happening when I reached out. I was lucky to get the package at all as it even showed up after the date I was told after my third conversation."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jean-Daniel Grob",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T23:15:15.000Z",
          "Titre": "Item in Stock (NOT)",
          "Contenu": "I bought an item supposedly in stock only to receive a notice, a few days later, that it's back-ordered with no clear restocking date."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Kinney",
          "Nb_Reviews": 7,
          "Date": "2023-04-06T18:36:39.000Z",
          "Titre": "Slow express shipping",
          "Contenu": "I paid more, knowingly, on your site rather than buying it from Amazon I was trying to keep money out of the machine that is AMAZON. I took the money I saved from a discount code and applied it to faster shipping. It took longer to arrive than it would've from Amazon and ended up costing me more in the end. Lesson learned."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Martin Beard",
          "Nb_Reviews": 8,
          "Date": "2023-02-25T16:12:48.000Z",
          "Titre": "Used to be Great - Not anymore",
          "Contenu": "This company used to provide superb service but now they are so slow to ship items - Once they claimed the item was shipped then apologised for not shipping it and this time its been 8 days so far since they took my payment and still no goods"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Phelps",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:59:05.000Z",
          "Titre": "No update notifications of shipping or…",
          "Contenu": "No update notifications of shipping or tracking and it took way too long to receive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JUSTIN",
          "Nb_Reviews": 3,
          "Date": "2023-01-13T19:02:03.000Z",
          "Titre": "Shipping Process Not Reliable",
          "Contenu": "As I write this review, the order has not been received almost 2 weeks from when order was placed on December 29th, 2022. It is not due to arrive until January 17th, 2023."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tmac",
          "Nb_Reviews": 4,
          "Date": "2022-12-09T17:08:38.000Z",
          "Titre": "Took way too long to get what I ordered…",
          "Contenu": "Took way too long to get what I ordered tracking info didn't work for days i ordered the max amount of RAM the pc would support it made almost no difference in performance"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Thorn",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T04:24:08.000Z",
          "Titre": "Delivery date kept changing for a week",
          "Contenu": "Delivery date kept changing for a week.  Use a different method that doesn't involve the usps."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald Hemming",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T11:08:04.000Z",
          "Titre": "Very slow shipping",
          "Contenu": "The tracking number didn’t start tracking until 4 days after I placed my order even though I was told it had already shipped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J Turner",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T18:08:49.000Z",
          "Titre": "Still a good company but there is significant room to improve",
          "Contenu": "I have a Dell Inspiron 13 (7386). I needed to upgrade my M.2 SSD. I looked everywhere to find info about what was compatible. The crucial scanner failed. The Kingston scanner said it could not identify the computer. I used the crucial database which stated I could upgrade my 256Gb M.2 SSD all the way up to a 4TB. Come to find out crucial's database was not correct. After i stalling, I received an error code I entered into Dell's website in qhich they let me know that either the drive was not compatible or was faulty. Then they offered compatible drives, which was only up to 1TB. I went to Best Buy, bought, installed and it worked fine. So I got to pay return shipping since the Crucial scanner didn't work on my computer and they don't stand by what their database says. Also they wanted me to write the RMA number on the form with the return address. Well they don't have anything that states it is the RMA. They sent two emails. One when opening the return and the other after the return was approved. They provided a return reference number, but they were different on each email. I had to call and ask. Then, the next day, they sent an email clearly stating which number was the RMA#. It is the return reference number on the 2nd email."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E Paul Freitag",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T18:16:51.000Z",
          "Titre": "I still have not my order since it was…",
          "Contenu": "I still have not my order since it was shipped on 2/13 today is thge first time i see it has been received by UPS  due to me next week."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Garrison",
          "Nb_Reviews": 3,
          "Date": "2023-01-17T20:40:41.000Z",
          "Titre": "Still haven't received item after 17…",
          "Contenu": "Still haven't received item after 17 days. I was sent an email saying the item had shipped but when i tracked the package the tracking number didn't exist."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Davick",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T02:22:21.000Z",
          "Titre": "You must have been on vacation between…",
          "Contenu": "You must have been on vacation between Christmas and New Years because my order just languished.  Even the \"tracking\" inoformation pulls nothing from UPS."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Riy",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:46:14.000Z",
          "Titre": "I have not received my parcel as yet",
          "Contenu": "I have not received my parcel as yet? This is taking too long. Can you let me know where and when will I get my parcel?Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Stettler",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T04:16:36.000Z",
          "Titre": "The memory provided was the wrong…",
          "Contenu": "The memory provided was the wrong voltage for the mother board, resulting in apparent damage that has bricked the machine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deacon Dan Romanello",
          "Nb_Reviews": 5,
          "Date": "2022-12-11T08:43:40.000Z",
          "Titre": "This item took almost a month from…",
          "Contenu": "This item took almost a month from purchase to delivery to arrive and the item was sent without any purchase or installation documentation."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Collin Knox",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:12:01.000Z",
          "Titre": "Disappointing Experience",
          "Contenu": "The website was lacking in several departments. From a bug that caused me to reset my browser data, to inadequate customer support, to inaccurate information from the compatibility test… it is safe to say that I did not have a pleasant experience shopping from Crucial, and will not be taking my future business here again without proper justification.Which is disappointing because the products are of an excellent quality, if only the user face was as well developed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KL",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T13:12:55.000Z",
          "Titre": "Item showed in stock",
          "Contenu": "Item showed in stock, but took 3 weeks to ship with no notification of why.  Once it shipped, took 7 days to arrive.  Never again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T17:40:22.000Z",
          "Titre": "Ordered on 12/21/22 and not arriving…",
          "Contenu": "Ordered on 12/21/22 and not arriving until 1/17/23. Almost a month for a piece of ram. Most companies ship in 2-3 days now, not 2-3 weeks."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stewart",
          "Nb_Reviews": 27,
          "Date": "2023-03-09T22:06:57.000Z",
          "Titre": "Delivery takes forever",
          "Contenu": "As others have said, the product is great and the pricing is good but delivery lead times are abysmal. Don't order if you need things asap!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Upgrading Ram",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T00:13:11.000Z",
          "Titre": "Long shipping time",
          "Contenu": "Long shipping time. Below average communication. Pain to track order. Cheap shipping envelope with no padding. Ram seems to work fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Vega",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T02:44:35.000Z",
          "Titre": "Very slow SSD order deliver",
          "Contenu": "I ordered an SSD from crucial.  It has been 16 days and I have not receive it yet.  I order SSD from Samsung and I got it in 4 days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mickey",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T04:17:48.000Z",
          "Titre": "Order wasn't shipped when promised!",
          "Contenu": "My order was NOT shipped within the timeframe Crucial promised and arrived much later than expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jessica schulman",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T02:30:29.000Z",
          "Titre": "The chips did not fit in my computer",
          "Contenu": "The chips did not fit in my computer, although I used your scanner to pick out the correct chips"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Gavlick",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T15:32:21.000Z",
          "Titre": "Shipping took way too long!!!",
          "Contenu": "You had the memory in stock when I ordered it. It took 10 days to get it. If you had used UPS… instead of USPS. I would have gotten them DAYS sooner. They sat in one location for three days in route. USPS is a poor choice for shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan Finnemore",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T17:38:04.000Z",
          "Titre": "Worst experience to date.",
          "Contenu": "I placed my order on 12/22.  I chose expedited shipping because my HDD is failing and didn't want to take a chance on complete failure before the new drive arrived.  while placing the order, there were no banners, popups, or any other indication that there would be a delay in shipping.  Fast Forward to a few chats, I learn that shipping was CLOSED from the 23rd until the 27th. That's fine, I would have had to hunt to find that information out but whatever.... Then, still nothing and find out that my item wasn't even in stock!!  so, AGAIN, nothing in the process that indicated or announced or even flagged that there was a stock issue.  so here we are, 9 BUSINESS days later and my order FINALLY ships. It is suppose to arrive tomorrow but literally 2 weeks from placing an express delivery order.  Sure, I was offered credits on my purchase yada yada, but the entire process was not even close to being good.FYI, The first person who apologised and said it would ship soon, DIDN'T tell me it was out of stock.  I found that out 4 days later in an email."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "christopher blakely",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T02:08:02.000Z",
          "Titre": "the new upgraded hard drive is not…recognized by my pc",
          "Contenu": "the new upgraded hard drive is not recognized by my pc. the memory upgrade was amazing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan Thiel",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:35:44.000Z",
          "Titre": "Still haven't received"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Neal Hardie",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:02:28.000Z",
          "Titre": "I emailed customer service for advice…",
          "Contenu": "I emailed customer service for advice on an enclosure, waiting for a response...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TR",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T04:25:14.000Z",
          "Titre": "I place an order about a month ago and…",
          "Contenu": "I place an order about a month ago and I still haven't received my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kurt Spitzner",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:24:29.000Z",
          "Titre": "Love the product, shipping is a mess",
          "Contenu": "Love the product, hate the shipping. Every time I order from Crucial, I wind up having to chase down the package all over town because of Crucial's insistence on using 'last mile' shipping hand-off, which always winds up being mis-directed, or sent back to Crucial as undeliverable. Either pick one, or let the buyer choose what is best for them.  What Crucial is doing currently is a colossal pain."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gordon Bruce",
          "Nb_Reviews": 8,
          "Date": "2023-12-20T16:55:30.000Z",
          "Titre": "Good products, terrible delivery.",
          "Contenu": "I've purchased several memory modules from Crucial over the years and all have been delivered within a couple of days. Most recently, I ordered an external SSD. The product itself is good, but the delivery was painful. Almost immediately after ordering, I received a Royal Mail tracking code, telling me that my parcel was on its way. This turned out to be next to useless as the product was actually shipped from the EU and couldn't realistically be tracked until it got to the UK. In all, the delivery took 9 days which, in today's competitive marketplace, is far too slow - even if it was 'free'. Crucial needs to really up its game on this front or it will lose out to Amazon et al."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Rosenberry",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:09:22.000Z",
          "Titre": "Good product poor shipping",
          "Contenu": "Good product.  Poor shipping.  Package was sent by carrier that said item would arrive on Tuesday.  Tuesday evening carrier site updated and said package to be delivered on Wednesday.  This was repeated on Thursday.  Package finally arrived on Friday."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:32:34.000Z",
          "Titre": "Quality products - Not Quality Shipping",
          "Contenu": "Quality products. Prices when on sale are competitive with the big online sellers such as NewEgg.  Shipping takes a long time and I absolutely hate UPS Mail Innovations, tracking is practically not available until the Post Office receives the package on the day of delivery.  Use USPS Priority mail, much faster and reliable and not that expensive for large accounts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Watson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:24:59.000Z",
          "Titre": "Great product, processing/shipping turtle slow",
          "Contenu": "Great product ordered 8GB DDR4-2400 UDIMM 1.2V CL17 memory upgrade for wife's computer, would have given 5 stars if it wasn't for the very slow processing & shipping. Ordered on 12/4 (am) wasn't processed and shipped till 12/7 (pm) started via UPS however got switched to USPS item received 12/13 (pm)....only shipped in large envelope with no packing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Forde",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T05:09:58.000Z",
          "Titre": "I had a very difficult time completing…",
          "Contenu": "I had a very difficult time completing the purchase. I found that the only system that could work to complete the purchase was a windows machine with the edge browser. I use other OS's and browsers, that makes purchases extremely difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T04:37:12.000Z",
          "Titre": "Crucial gear is great, shipping horrible",
          "Contenu": "Crucial gear is great. But the shipping dept is horrendous. Made my order Nov. 26th. Didnt get a tracking number for 5 days after order. Finally received my order Dec 9th. 2 sticks of 16gigs of ram. Envelope size package. I'm in central Oklahoma. My order shipped from Salt Lake City, went to Idaho, back to Salt Lake City, to somewhere in Texas, to Tulsa, a few small towns in-between then finally made it to my mailbox. Should really look at different shipping options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T18:18:18.000Z",
          "Titre": "We have problems with our US Post…",
          "Contenu": "We have problems with our US Post Office sending items back, loosing them, etc. When I ordered my last package from Crucial, it was assigned a UPS tracking number. All good until UPS handed it off to the USPS in Arizona. My stress went through the roof. My package was stamped with my PO Box number and a bright red stamp reading, UNABLE TO DELIVER TO STREET ADDRESS. Just a suggestion for you: please allow us to enter PO Boxes on your shipping to address form, maybe as an alternate or backup address. You say you don't deliver to PO Boxes, yet that's what happens after it left your facility. This also happens with Amazon orders, so it's not just happening with your orders. I was very lucky to have received my order this time. Thank you and yes, I love my ram upgrade and the X6. - Todd"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cyber Pro",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:10:14.000Z",
          "Titre": "Memory Works",
          "Contenu": "Memory Works, does not run at rated speedShipping was super slow, was ordered before thanksgivingCustomer service sluggish over email"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BP",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:53:54.000Z",
          "Titre": "The UPS tracking number provided for my…",
          "Contenu": "The UPS tracking number provided for my order wasn't valid, so I had no idea when my order was going to arrive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Coley-Neal",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:43:37.000Z",
          "Titre": "Placed my order on 11/20 and still have…",
          "Contenu": "Placed my order on 11/20 and still have not received it.  The chat bot thing is horrible and almost makes it impossible to talk to a live person.  I can’t give a review on the product itself"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis DelValle",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T00:26:46.000Z",
          "Titre": "When I first attempted to track my order could not be found.",
          "Contenu": "When I first attempted to track my order, I received a message that my order could not be found. On the shipper's website, I was sent around in circles trying to find information about my order. I finally contacted Crucial's customer support, and I was told that Crucial would make good on my order, which made me fell at ease. I finally received my order a week later than promised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Holt",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:09:10.000Z",
          "Titre": "Over charging sales tax",
          "Contenu": "Over charging sales tax by 4% and the lead time prior to shipping seemed longer than purchases in the past."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex B",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T03:33:09.000Z",
          "Titre": "I bought the drive to eventually…",
          "Contenu": "I bought the drive to eventually install in my desktop computer but before I did that I wanted to try the drive before I installed it. However I couldn’t get the new drive to boot up the the desktop and when I called customer support the support representative said to open up my desktop and if it doesn’t work to call back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reginald White",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:26:47.000Z",
          "Titre": "I had an issue because the tracking…",
          "Contenu": "I had an issue because the tracking link that was sent never worked.  I had a couple of chats, but no one could tell me if my package was delivered or how it was shipped.  I finally checked my mailbox, which I don't check often and the package was there.  So, if the package was shipped via USPS, the don't tell me it was UPS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:22:34.000Z",
          "Titre": "Excellent product, Tech support needs support.",
          "Contenu": "I did like that you have a knowledgeable sales department. I am not satisfied with the response from the level/tier 2 tech support though. I do understand the need to outsource tech support to India but I don't like it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T16:13:19.000Z",
          "Titre": "The product was fine",
          "Contenu": "The product was fine, the delivery was fine, but the \"seller\" on PayPal bore no relation to the Crucial company, and I had for a while no idea who or why the payment was made to a company called \"Digital River\"... really, you can't make it obvious?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:48:30.000Z",
          "Titre": "Issues with order processing",
          "Contenu": "1. The web site promised me a discount for using the automatic system scanner. However, the scanner failed to run so I didn't get my discount. I have tried this scanner several times over the past couple of years, and I have never gotten it to work.2. I received a shipping confirmation on 11/3/2023. However, the package wasn't actually given to the shipper for at least another 4 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T17:23:14.000Z",
          "Titre": "You didn't have the product in stock…",
          "Contenu": "You didn't have the product in stock when I ordered from you. It is a pain to cancel the order. This should be much easier to do if needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Karlick",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:14:45.000Z",
          "Titre": "Super slow shipping",
          "Contenu": "Super slow shipping. I could have ordered it from Amazon for a few dollars more and had it in 2 days. Not 2 weeks!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Fitzpatrick",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:52:54.000Z",
          "Titre": "Support said they were sending me a…",
          "Contenu": "Support said they were sending me a link for a newer version of Acronis, which should of been in the original instructions. The email did not come for a long time. I rebooted my computer and redownloaded Acronis. Once re-down loaded, got message that it needed to repair the file. It finally did that and then it moved forwarded to clone. However the instructions were slightly different from the tutorial, but now in the process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pierre V.",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T03:12:21.000Z",
          "Titre": "Good Product, Scanner not working and excessive ship time.",
          "Contenu": "AS always your product is great!.  I have been using Crucial to upgrade my computers for years.  This time two problems, your system scanner does not work!!  I had to manually input my model number to upgrade my pc.  Also, 13 days waiting to receive an item is ridiculous.  Nowadays many companies offer a free shipping option but 13 days from order to delivery is unheard of. Come on you can do better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Milton Okayama",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:26:42.000Z",
          "Titre": "Bought kit with caddy for my…",
          "Contenu": "Bought kit with caddy for my application and the caddy did not work. I had to spend extra time and money to get the drive installed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:28:54.000Z",
          "Titre": "Too long getting here",
          "Contenu": "Too long getting here. Customer contact sloppy. Said it was coming UPS, no USPS no FEDX. tracking number didn't work. Product works fine at a good price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Ward",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T00:34:50.000Z",
          "Titre": "3-star at best",
          "Contenu": "Did not like the fact that you processed my payment at least 2 days before my purchase was \"shipped\". Then it took several days for UPS to acknowledge it had my purchase ready to ship. When I called Crucial customer support I talked with a guy who barely understood English and did very little that was actually helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sophie",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T20:33:24.000Z",
          "Titre": "Good product but shipping snafu",
          "Contenu": "Good product, but company made a mistake.The company took my payment, sent a shipping confirmation, but didn't actually ship the product.  Waited a week for them to figure things out on their own.  They didn't.  They just responded with generic emails about delivery.  It took several back-and-forth emails with customer service before they poked the shipping dept to actually send the product. Things were fine after that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Claudia A",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:49:52.000Z",
          "Titre": "Although Crucial has great products",
          "Contenu": "Although Crucial has great products. I bought a SSD and it took a long time to be delivered. The product was shipped on a envelope."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brad B.",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T00:46:27.000Z",
          "Titre": "Drive works great, shipping and support poor",
          "Contenu": "The drive works great, give that 5 stars, but it took them almost 2 weeks to deliver it. Also, I have tried several times to register my purchase on the Crucial site but, each time, the site says something went wrong or they cannot find my email--even though I use my email address to log into the site and to access my crucial account. So, still haven't registered it. Finally, when I had problems with tracking the shipment--when a week had passed and I still hadn't been able to track the package--I used telephone support and ended up talking to some fellow obviously from some call center in India. Really?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T15:10:47.000Z",
          "Titre": "Delivery did not go as I expected",
          "Contenu": "Delivery did not go as I expected. First day, I received an email stating item shipped with a tracking code.Next day I tried the tracking code and it said invalid. I called Crucial and was told to wait two business days before tracking code would be activated. After two days it worked but said item would not be delivered until the ninth day after my order!I paid by credit card and believe shipment was not started until my payment cleared.Item arrived eight days after I placed the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T09:17:48.000Z",
          "Titre": "The hardware works perfectly.  That's the good news.",
          "Contenu": "The hardware works perfectly so far, and the online videos were excellent.  But finding and using the cloning software was problematic.  The instructions on crucial.com and Acronis do not make it clear that you must find and use a specific version of the cloning software.  If you don't know that (I didn't) you will waste a lot of time.Also, the hardware was slow to arrive after I placed my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "robert clayton",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T03:59:45.000Z",
          "Titre": "your shipping company is worse the the…",
          "Contenu": "your shipping company is worse the the post office next time send my orders to post office it will take a week less"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T03:25:35.000Z",
          "Titre": "Tracking the shipment was impossible",
          "Contenu": "Tracking the shipment was impossible.  Received a tracking number and it was not tracking by the USPO until the day it was delivered 2 weeks later"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Keil",
          "Nb_Reviews": 7,
          "Date": "2023-09-20T23:38:43.000Z",
          "Titre": "Quality Products, Horrendous Shipping",
          "Contenu": "The item I purchased was excellent, and I am extremely satisfied with the quality of all of Crucial's merchandise. However, the shipping was so poor.  I ordered my item on Sep 6th.  It was delivered on Sep 16.  You used UPS MAIL INNOVATIONS expedited service, and it was a total joke.  Next time I buy a Crucial item,  I'm going to purchase it locally, even if it costs more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas A Tatimus",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T04:52:29.000Z",
          "Titre": "Not quite there",
          "Contenu": "I liked the cloning software. However, Crucial should remind buyers of ssd's for upgrades to get the migration kit--I just lucked out that I had a way to connect the ssd to my pc to clone it.  What I did not like, however, was not knowing I was replacing a full-size 4\" x 6\" hard drive in the original pc so I could purchase a mounting kit.  Fortunately, I was able to fix the ssd to the larger drive bay with a zip tie.  This is not a job for a novice as it requires very careful disassembly of the pc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hugo Andres Zapata",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T00:15:52.000Z",
          "Titre": "Good product bad support",
          "Contenu": "The product is very good, but the support to assist the installation isn't. The instructions on the paper need to be updated as well as the videos.  Had to exchange multiple emails with your customer service in order to get the correct software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wyatt Smith",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T02:37:34.000Z",
          "Titre": "Great product, poor shopping experience",
          "Contenu": "Crucial has a great product that I wanted (X8 2T), but ordering it off the website was clumsy with slipping ship dates. By the time mine was close to being shipped Crucial lowered their price but did not adjust the price for ones that were delayed in being shipped. The arrival time of the product was delayed another couple of days due to the Post Office misrouting the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Bellowitz",
          "Nb_Reviews": 3,
          "Date": "2023-01-17T23:07:12.000Z",
          "Titre": "I ordered supposedly \"In Stock\" items…",
          "Contenu": "I ordered supposedly \"In Stock\" items on Jan. 03. My items were not shipped until Jan. 11th. When I called around the 8th to see about my order, I could hear kids playing and yelling in the background and the rep kept putting me on hold, I would imagine a mom working from home, not very helpful at all. This used to be my \"Go to\" company for SSDs and Ram but I may have to reconsider. A very disappointing experience this time!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LETICIA KENNAR",
          "Nb_Reviews": 3,
          "Date": "2023-01-21T05:18:26.000Z",
          "Titre": "The hardware was great",
          "Contenu": "The hardware was great. However the software Ivwould not recommend. After 4 attempts to clone the drive, I gave up and used another software. I did call support and that was a nightmare.  Could not understand the first 2 techs. I finally requested someone in US but that didn't happen, however was able to understand the 3rd tech better. The other software worked without a hitch on the first attempt.  The computer is running great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T02:22:21.000Z",
          "Titre": "Pricing was great",
          "Contenu": "Pricing was great, ordering was easy. Product is AWESOME. However, the shipping time seemed like it took forever.I know it says \"takes approx 8 business days\" (which it actually did) but, I was really hoping that was just late case scenario. None the less the drive arrived and I was happy. I should mention,on Crucial's behalf, it was being shipped around Christmas and New Year holidays) . Soo I should actually give it a 4."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAIME A BERMUDEZ",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:56:40.000Z",
          "Titre": "Ups delivery service is too slow",
          "Contenu": "Ups delivery service is too slowPlus they don't do the delivery , package was transfer to usps and took 3 days for the transfer right at the final destination?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danny Bass",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T20:28:14.000Z",
          "Titre": "Too slow to receive",
          "Contenu": "Too slow to receive. It took almost 2 weeks from the date of order to receive the product. The shipping was ok, but it took a week to ship the product after I ordered it. If that was going to be necessary, it should have been made clear at the time of order so I could decide if I wanted to order it somewhere else. Unacceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dn",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T05:34:30.000Z",
          "Titre": "product is fantastic",
          "Contenu": "product is fantastic, thats why i ordered it. shipping is a yard sale. i dont remember being asked how, but how it came through was long and drawn out. other than that, i wouldnt buy any other ram for crucial work than crucial ram. precision workstation, in a business environment running high end analysis. it helped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cody cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T20:07:16.000Z",
          "Titre": "First Time Upgrading",
          "Contenu": "The scanner was amazing and easy to use and gave great suggestions for a beginner into the upgrading my laptop. I just wish there was more information on the site or a live person I could talk to while looking at upgrades and ask questions like the difference between DDR4 and DDR5 and if it would be compatible with my laptop or could be. Overall great service. Definitely pay for the faster shipping though."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Christopher Walsh",
          "Nb_Reviews": 38,
          "Date": "2023-01-18T12:28:27.000Z",
          "Titre": "Long delivery time.",
          "Contenu": "Order Number: 1709179154439, I'm a long-time user of Crucial, and it has always been my first choice and recommendation.  I don't know what has happened to the company but something has!  My delivery still hasn't turned up, not even arrived in my country yet!  Won't be using them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T04:11:57.000Z",
          "Titre": "Need to work on shipping estimates",
          "Contenu": "I would have given it 5 stars if it didn't take 2 weeks to get here.Love the site , product selection and suggestions on what is needed. I was excited to have the parts, then they didn't show up. Like I said 2 weeks to deliver.  Now a long time, just not the time quoted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Loba's Grandpa",
          "Nb_Reviews": 6,
          "Date": "2023-08-27T22:17:23.000Z",
          "Titre": "I like the device but your systems and customer service need serious work..",
          "Contenu": "I like the device.What I didn't like was:1. The shipping information was all wrong and left me with the impression that you never shipped my order.2. When I spoke to your customer service agent, he was VERY difficult to understand (accent and connection quality) and finally made me understand that the shipping information would be available within a week.  So, he is incompetent.Also, Trustpilot is displaying my profile image 90 degrees off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 4,
          "Date": "2023-07-22T22:30:56.000Z",
          "Titre": "Failed to notify me of the availability…",
          "Contenu": "Failed to notify me of the availability of XPS 8940 memory that was on back order.Could not accept my order to a PO Box for 2 x 64GB memory kits.Failed to respond to my request for shipping info.English was not understandable on phone support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bozopriester",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T21:00:47.000Z",
          "Titre": "The system scanner does not work for…",
          "Contenu": "The system scanner does not work for me.  I have tried it on 2 different laptops, and 3 different browsers on those laptops.  It doesn't return any results.  I tried everything that support suggested, but it still fails. Support was able to point me towards compatible products, but the ease (and former reliability) of the system scanner had no equal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roderick Young",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T22:04:05.000Z",
          "Titre": "Product fine, delivery slow",
          "Contenu": "First of all, the memory is tip-top.  Crucial memory has always been good.The delivery was slow for this day and age.  Order made on 6/9.  It was tendered to UPS Mail Innovations on 6/14.  Delivery to my metropolitan California address was on 6/20.  Part of the problem seems to have been their choice of carrier, but still, they took 5 days to ship the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hoang",
          "Nb_Reviews": 4,
          "Date": "2023-04-07T23:27:06.000Z",
          "Titre": "Standard transaction, mediocre experience",
          "Contenu": "Standard transaction, mediocre experience. Free shipping is dreadfully slow. I think I received three Prime deliveries in the same time it took me to get my Crucial delivery. Also, The USPS Innovations delivery offering is awful. It goes from UPS to USPS. And, the tracking code provided doesn't update often. If in doubt, prepare for the LONGEST processing and delivery time.This is in contrast to the service and delivery I've had years before where it was two business days. And that was free, too.Overall, I'd forego the 10% off to get faster delivery. In this competitive market, your offering needs to be a lot more attractive than a few dollars off your order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis And Glenna  Nanni",
          "Nb_Reviews": 3,
          "Date": "2023-04-29T18:31:05.000Z",
          "Titre": "Offer the Solid State Drive and Connector as a Package",
          "Contenu": "When you sell the solid state drive you should tell the customer they can't install without the special connector for the drive. I still haven't installed my drive as I'm waiting for the connector, it should be a combined package offer. Hopefully all goes well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Welker",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T14:32:46.000Z",
          "Titre": "I still haven't seen my order 2 weeks…",
          "Contenu": "I still haven't seen my order 2 weeks later.Every day when I click the email link to check UPS tracking it opens a blank window, then when I manually open it, it tells me \"on the way\" and every morning the delivery day changes to the current day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L. Charles",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T16:07:29.000Z",
          "Titre": "Opt for paid shipping, NOT free shipping.",
          "Contenu": "Updated:  After finally receiving my order after nearly 3 weeks since ordering and being issued a partial but small refund, I will upgrade from 1 to 3 stars.  The customer service could be much better.  A replacement item should be shipped much sooner when its clearly obvious that the order is lost, especially when the shipper has not received the package in a week.  Other than that, my advice is to opt for paid shipping instead of the free shipping option.  You'll be treated better as a customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve X",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T04:40:33.000Z",
          "Titre": "Incompatible memory, poor returns process",
          "Contenu": "The memory I ordered was found on crucial.com to be compatible with my motherboard, but it did not work.  Their returns website did not work (tried 2 browsers).  Attempt to contact support via chat was unreturned.  Response to Facebook chat was several days later.  Finally got in touch with support via phone number on the Facebook site and they promptly emailed a return label.  In the end I don't doubt I'll get a full refund, but it was a pretty hassle-filled experience.  I might be willing to give them one more shot only because this happened during the Christmas/New Year holidays and they were probably short-staffed."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Nicholas Jeanty",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T17:30:08.000Z",
          "Titre": "Nobody contacted me about the package…",
          "Contenu": "Nobody contacted me about the package that hasn’t arrived yet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshaven Potter",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T15:34:23.000Z",
          "Titre": "The product was good",
          "Contenu": "The product was good, the delivery time wasn't fast but that was fine.  The issue was communication.  I received a notice about shipping and a few days later it still didn't show up under the tracking number and the web showed the order as complete.  I had to contact support to be assured I didn't have the wrong tracking number.  There is a blind spot in the process when it comes to transparency."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "R. Miller",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:59:08.000Z",
          "Titre": "Stop using UPS",
          "Contenu": "I dislike that Crucial uses UPS for transborder delivery to Canada.  UPS charges for filing customs paperwork is expensive for Canadians; double the cost Canada Post / US Postal Services charges.  And, the delivery time between USPS and UPS is the same for regular delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "matt pipke",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T17:49:07.000Z",
          "Titre": "Weekend and after hour service stinks",
          "Contenu": "I needed to make a change to my order, but crucial, cancelled it.I had hoped to just make a simple change to it and keep the order moving, but instead, crucial cancelled my order, made me reorder everything."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Trevor",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T21:14:36.000Z",
          "Titre": "Haven't yet got the item",
          "Contenu": "Haven't yet got the item.  UPS shipping is a bit of a sham.  UPS turned it over to USPS.  Crucia to UPS on the 3rd, UPS to USPS took till the 9th, then USPS to Vancouver took till the 13th, and Canada Post says I'll get it on the 20th."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick JT",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T08:07:44.000Z",
          "Titre": "over 2 weeks to ship",
          "Contenu": "Over 2 weeks to ship an item that you manufacture?? I get it if retailers were out of stock or something but you're the primary source of these drives. And zero updates about it until it shipped. Then the tracking # doesn't even work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Keiser",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T21:49:04.000Z",
          "Titre": "I have used Crucial products several…",
          "Contenu": "I have used Crucial products several times in the past all it worked great...So far I have tried several times to clone an SSD   to a larger SSD but to no avail I even paid for another cloning program an still failed...I guess I will have to wait on the phone until my call gets answered..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T18:27:37.000Z",
          "Titre": "Poor Shipping Decision by Crucial",
          "Contenu": "Good = RAM (when finally received).Bad = shipping. Why have shipping turn over the package to the USPS for final delivery? My RAM was delayed for 3 days as the USPS sent the package to NJ just to return it a few days later and deliver."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Sicura",
          "Nb_Reviews": 6,
          "Date": "2023-07-22T02:04:03.000Z",
          "Titre": "Crucial is one of the more trusted names",
          "Contenu": "I like that Crucial is one of the more trusted brand names in the industry, but I was disappointed by the way it was shipped to me, you sent a tracking number, but neither the first carrier & the second carrier knew where the package was for a few days. Your customer service guy didn't offer much help either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trish",
          "Nb_Reviews": 3,
          "Date": "2023-10-04T03:45:00.000Z",
          "Titre": "Great company and variety of memory, but it didn't work in this laptop.",
          "Contenu": "The free shipping took forever!!The memory that I finally got, did not work in the laptop. I will never order another memory chip with free shipping. It took way too long before it was shipped out. My customer was waiting on her laptop for over a week. Sad.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise Helton",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T19:59:43.000Z",
          "Titre": "Do better research, don't just trust what they say~",
          "Contenu": "Packaging and delivery as well as pricing was fantastic.  But the parts that I bought according to your recommendations were wrong.  The hard drive is too big for my computer to handle, and the 2 ram sticks to get 16 Gigs should have been a single stick for my computer.  So I was able to upgrade my 4gig to 8, but not to 16 as I had hoped. Luckily I have a friend who can use the other parts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rock Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:16:48.000Z",
          "Titre": "I was unable to even register my…",
          "Contenu": "I was unable to even register my products, much less check the delivery status. I will try again to register before the end of the week. It's difficult to review a product that you haven't received."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abigail L.",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T00:22:01.000Z",
          "Titre": "I ordered but then I received an email…",
          "Contenu": "I ordered but then I received an email a few days later that my item was out of stock. I even paid for fast shipping. Set me back longer than I thought. Customer service was responsive, so that bumps up my experience rating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim T.",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T16:04:39.000Z",
          "Titre": "Express shipping: NOT",
          "Contenu": "My payment for my Crucial order cleared PayPal on Dec. 31, 2022 including cost of 2 day express shipping. My order arrived on January 10, 2023. Granted, my express shipping was refunded (after 2nd call). Learned: fast service, NOT."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MICHAEL CARDEN",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T18:56:59.000Z",
          "Titre": "First did not ship it until 3 to 4 days after you said it was shipped",
          "Contenu": "First did not ship it until 3 to 4 days after I got notification of shipment…Shipping tracking is useless, never updates, You guys need to work on that.  Makes it appear to hold befor shipping just to add vaule to expited shipping??? since you offer expedited shipping and elevated charges that had to wait to get people to pay extra money excessive amount of time to ship pricing way out of market, knowing you’re one of the few providers of memory for a lockdown bios from HP You state wil will charge only after shipped.  So I got charged, then 3 days in a row, click on the tracking link... does not come up,,,as in never shipped!showed no progress till it came and I gave feedback,  then I got notifited it was here!Slow shipping, over charge for basic memory, bad shipping and tracking, bad chat support, no tracking........  Other than that it was great.the ram works..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Vitalis",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T17:20:16.000Z",
          "Titre": "Scanner tool IDd wrong RAM. Good follow up though.",
          "Contenu": "I used the scanner tool to help upgrade my PC's RAM.  The tool promises 100% compatible RAM and the price was right, so I bought some.  When I installed the RAM, my PC wouldn't start.  Not even a beep.  I did a little checking.  My chipset allows for a maximum of PC4-2133.  Crucial's scanning tool specified PC4-3200. Update: Crucial tech support contacted me to see if we could work through the problem.  Once he confirmed that the memory they sent was incompatible, they sent me a UPS return label so I didn't have to pay shipping.  I appreciate that.  Just use the scanning tool with caution and validate the memory it identifies is actually compatible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "linda wilke",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T23:43:17.000Z",
          "Titre": "One of the two DIMMs was defective and…",
          "Contenu": "One of the two DIMMs was defective and had to be RMA’d…The process involved swapping out DIMMs and flashing the latest BIOS.  I doubt that other members of my family could have done these things - especially flashing the BIOS - without my help.  I imagine that most people are like them and not me.Aren’t these tested before being released for sale?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T18:06:19.000Z",
          "Titre": "I'm assuming the order might have gone…",
          "Contenu": "I'm assuming the order might have gone ok.  Not Crucial's fault, but I never received the memory.  I will have to assume that UPS didn't get it right.  I will have to re-order it.  Can't give a positive or negative review"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lloyd Brown",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:15:28.000Z",
          "Titre": "I placed an order for an in stock RAM…",
          "Contenu": "I placed an order for an in stock RAM upgrade and many days later the order was still pending with no actions taken. On the website there is no method available to cancel the order. I therefore called customer support. Customer support said they would attempt to cancel the order although they could not tell me if they could cancel the order, they also said that I would not know for 2 days weather the order was cancelled or not. If the item is actually in stock it should not take 4 days to ship the item. Additionally, when the customer is tired of waiting it should be possible to easily cancel the order. These are all problems. It has been a while since I ordered from Crucial. I used to always order RAM upgrades from Crucial. I must say I am surprised at how bad the online experience was with this RAM order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "surf",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T08:55:40.000Z",
          "Titre": "Upgrades always introduce new problems.",
          "Contenu": "Every time I purchase RAM and/or and SSD from you to upgrade a system, I encounter hardware problems I didn't have prior to the upgrade.  This is very frustrating, prompting me to refrain from doing this every again.  It's just not worth the ensuing troubles."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MFG",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T14:53:23.000Z",
          "Titre": "Great product, poor order processing",
          "Contenu": "Great product, great price.  However, the order processing was terrible.  Items showed as in stock (with high quantity levels - more than 1,000). Got a backorder notice. Called and was told the items were in stock and would ship that night. Items did not ship that night. Called the next day and canceled the order (and ordered from someplace else). Order then shipped the next day (even though I had canceled it)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Bellini",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T02:33:58.000Z",
          "Titre": "I ordered the memory on 1/4",
          "Contenu": "I ordered the memory on 1/4, received shipping confirmation on 1/9. It took 13 working days for the memory to arrive. The memory was initially shipped via UPS then handed off to USPS. This created unnecesary delays."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T20:35:46.000Z",
          "Titre": "Requested a warranty replacement",
          "Contenu": "Requested a warranty replacement. Crucial Order and Delivery processes went smoothly. The SSD product unfortunately contained corrupted partitions which made it inaccessible and unuseable as received out of the box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian k Walton",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T17:53:10.000Z",
          "Titre": "while the memory did work it did not…",
          "Contenu": "while the memory did work it did not work with the existing memory. System would not boot with both memory pairs installed, could only use one pair or the other. This was the recommended one from the scanner. Existing pair was \"Ripjaws S5 G,Skill\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Napier",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T19:30:54.000Z",
          "Titre": "Delivery problems",
          "Contenu": "My only issue was with the delivery, the date was missed twice and I thought the package might have been lost due to the lack of information on the tracking page. It finally arrived 3 days late."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Sarabjeet Singh",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T13:22:14.000Z",
          "Titre": "The order took too long to ship out",
          "Contenu": "The order took too long to ship out. On the website it said immediate shipping if in stock. But I hat to wait till the holidays for America was over before shipping. I had to purchase an alternate while waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Korpi",
          "Nb_Reviews": 5,
          "Date": "2023-03-02T21:27:42.000Z",
          "Titre": "Did not get tracking or package",
          "Contenu": "Did not get tracking or package. Big bummer. Please advise ship to address and confirmation it was put at my house and not some other house.  Now I learn it did not ship yet.  Y’all can do better with your tracking.  Get er done. LOVE your products. Pisser is getting help about existing orders.  Put an email somewhere and do not have us go thru hoops to get an answer."
        },
        {
          "Note": 3,
          "Lieu": "KH",
          "Pseudo": "VTS-VKK VTS-VKK",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T06:15:25.000Z",
          "Titre": "As I see it's read speed 6000mb/s and…",
          "Contenu": "As I see it's read speed 6000mb/s and write 5000mb/s but in physical ssd both speed are under 4000mb/s but yeah it seem pretty good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T22:06:58.000Z",
          "Titre": "Confusing vague shipping",
          "Contenu": "I have purchased memory from Crucial in the past and when Microcenter didn't have what I needed I went to Crucial. I didn't have any issues in the past but their shipping was very poorly tracked and I had no idea when the RAM would arrive. I contacted customer service and they didn't seem to care. They simply said if it doesn't arrive in the next 2 weeks we'll issue a refund and send it again. I ordered it a week prior so that would have made it 3 weeks. Not exactly stellar service. One day it just showed up in the mail. I haven't installed the memory yet and I'm hoping there won't be an issue with the poor customer service I received just on the shipping problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T22:18:02.000Z",
          "Titre": "Very slow shipping",
          "Contenu": "Very slow shipping. Good customer service. Inaccurate tracking number. Purchase verification email lacking after purchase. Product is good but web site could be improved for navigation and ease of use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gregory Binduga",
          "Nb_Reviews": 4,
          "Date": "2023-03-19T01:47:59.000Z",
          "Titre": "I believe it is rare to have a…",
          "Contenu": "I believe it is rare to have a defective product from Crucial as I have ordered from them before and had no issues.  However, I ordered several DRAM units this time and one was defective.  I was able to get an RMA, but had to pay for the shipping to send it back.  I wasn't my fault that the unit was defective so why did I have to pay the return shipping?????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 13,
          "Date": "2023-03-08T19:11:48.000Z",
          "Titre": "Quality product but frustrating purchase experience",
          "Contenu": "Excellent product quality but the purchase experience was less than great. I used customer service to get the exact product I needed, though took a little effort it was worth it. Crucial offered a 10% discount for using their scanner but didn't get it. Back to customer service and after 30+ minutes they told me it didn't apply to the memory I bought. Got a welcome email with a 10% discount so tried that. Of course, that didn't work either. So a little bait and switch and took almost an hour to purchase 64GB of RAM. Then the shipping they choose, UPS Mail Innovations, was terrible. Tracking that didn't give good data. Had it sitting in Salt Lake City for 5 days with no expected delivery then all of a sudden it was out for delivery. Still got a quality product, in a reasonable time, at a reasonable price, just wasn't as easy as it should have been."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Holt",
          "Nb_Reviews": 6,
          "Date": "2023-03-01T23:40:44.000Z",
          "Titre": "I have used Crucial for years",
          "Contenu": "I have used Crucial for years, and for the first time, they let me down. I purchased ram and an SSD; they said one of my ideas was back-ordered. Did not say which. Two weeks later, I tried to contact them to find out when it would come, and they said I could use one of their partners. Their partners were seventy dollars cheaper for their brand. I canceled my order and purchased elsewhere, and from another brand. Not only was there a lack of communication they were price gouging me. Just about every company in America seems to care less about its customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Hickman",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T15:24:49.000Z",
          "Titre": "Crucial products are top quality",
          "Contenu": "Crucial products are top quality. You are my go to company for memory and SSDs. However, it took almost 2 weeks to get something I needed for a customer order. I’d like to see better delivery times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Preston Page",
          "Nb_Reviews": 8,
          "Date": "2023-04-04T23:10:18.000Z",
          "Titre": "Product was OK, but the web site not",
          "Contenu": "The product is good, but the the web site leaves quite a bit to be desired.  For instance, the order status has no real information, and the shipment tracking number displayed was not valid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T01:01:15.000Z",
          "Titre": "Crucial Experience",
          "Contenu": "I am not able to find my order online. I put in the order # and password provided via email from Crucial. I also have not heard anything back about my order. The overall experience of finding compatible RAM for my PC was easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ray Sutherland",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T21:46:58.000Z",
          "Titre": "The memory upgrade went well, but...",
          "Contenu": "The memory upgrade went well. The most difficult part of the process was getting the danged packaging open.  My hands are not as nimble as they used to be and glued or heat-sealed clamshells present a problem. The PCle M.2 did not go well. Despite reading and rereading the Crucial support site and other help sites, I could not for the life of me get the danged thing installed properly in order for it to work. I decided to quit and put the original equipment back in place, as I was getting frustrated and was afraid I'd break something. In my past, I have actually built computers from scratch and thought I could handle what seemed would be a straightforward installation.  It did not work out that way. This installation probably should be handled by a professional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eddie Escobar",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T04:07:46.000Z",
          "Titre": "The cost of shipping for a decent…",
          "Contenu": "The cost of shipping for a decent turnaround is too expensive.  This is RAM, not PC cases or heavy power supplies."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M Clark",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T00:20:48.000Z",
          "Titre": "Although pricing is exceptional",
          "Contenu": "Although pricing is exceptional, lead times are extraordinary.. I think it took a week and a half to get my items? That being said, I would've just gone to an Office Depot or Staples to get what I needed."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Vincent Roper",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T23:36:45.000Z",
          "Titre": "Order took so long to shipped after…",
          "Contenu": "Order took so long to shipped after purchase on Aug 7 and then no effort was made on their end to expedite the process. They shipped the items August 17"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "wmlipe",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T07:25:46.000Z",
          "Titre": "Lot less performance then i thought",
          "Contenu": "Hooked up to a Thunderbolt 3 port through a external enclosure I'm only getting about 1000k transfer speeds at best. Expected a lot faster"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hal Ludwig",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T01:09:24.000Z",
          "Titre": "I bought memory and an SSD for my…",
          "Contenu": "I bought memory and an SSD for my laptop. The memory installed without a problem. The SSD install hasn’t been successful. I am following the video install instructions. I keep getting different error messages. I tried to clean the disk using the Acronis disk cleanser after the initial cloning failure. I have tried to follow the hot links with error message and they failed to take me to the knowledge base where the error code and resolution are stored. Going to the Acronis site knowledge base and pasting in the error code didn’t help me either. It is not clear from the crucial website that there is a help desk number or chat I can use to get help. Right now I am very frustrated and may return the SSD as a dissatisfied customer if I can’t figure out how to get help soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Dziejman",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T11:43:27.000Z",
          "Titre": "Placed order. And wait wait wait",
          "Contenu": "Placed order, order received, in stock…next day told not in stock.  Then told shipped on 17th…nope…did not ship till 22nd according to ups. Now still awaiting till tentatively should receive on 28.   Will see…. Amazon supposedly had it in stock but your price better….get what you pay for I guess."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T16:23:53.000Z",
          "Titre": "Great Product. Sub-Par Shipping Experience",
          "Contenu": "Product was good but shipping was extremely slow. It took 11 days for the item to arrive.  The issue with that was the fact it took about 5 or 6 days after I ordered to even ship in the first place. When I can order their product from Amazon,  BestBuy, etc. and have it within 2-4 days the 11 day time frame was disappointing. Great product but sub-par shipping times"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DANIEL S",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T07:34:02.000Z",
          "Titre": "Shipping",
          "Contenu": "Companies that do business on the internet should know that shipping of the product is as important as the product. The information provided by your shipping company was totally useless and incorrect. Your emails to me indicated the product was shipped but the shipping company said they DID NOT have the package. Spent a lot of time on phone with your customer service and got no answers. Said they shipped it/shipping company said they never had  the package. DUH..sad customer stuck in the middle ....mailing innovations is the very bottom of the shipping barrel..I will no longer buy from internet companies that use this mailing company.  I have had many previous problems with this shipping company, so all customers beware."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Real Crypt",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T03:59:18.000Z",
          "Titre": "I think the product is solid and the…",
          "Contenu": "I think the product is solid and the support team are friendly , but I ordered a 1 tb SSD for my rog zephyrus laptop on the 10th of February, it is the 17th and it just showed as shipped with an estimated delivery on 22nd of February... That seems a bit much for an in-stock item (it showed 4-8 business days for free shipping, but still) if you want/need something quickly either prepare to pay extra for shipping or look elsewhere"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DDoud",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:47:52.000Z",
          "Titre": "Very Pleased",
          "Contenu": "The online ordering process and delivery updates were excellent. The SSD drive dramatically improved my laptop performance.  The install videos were helpful but I had an issue with Windows not recognizing the Crucial drive initially. The video did not address this problem and I had to research it online but I finally figured it out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L Brittain A Brewer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:51:57.000Z",
          "Titre": "Owner",
          "Contenu": "Ordering, product - great. Just installed - great! Delivery tracking - not so great. The UPS / USPS partnership is no something I knew about. The online hep person I spoke with was, apparently in another country or so new to the US that he did not know the difference between UPS and the USPS. Perhaps if I had known about the shipping method earlier, I would have understood - because I did not know - the tracking was not clear - it seemed to take a long time shipping - I got two delivery dates that were wrong - the third try was right. So, you may wish to work on that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Some Iowan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:46:21.000Z",
          "Titre": "Easy shopping, good price, slow shipping",
          "Contenu": "What's important is that Crucial offered easy shopping, a straightforward and helpful tool for selecting the right memory, and a fair price. But I should mention that a surprisingly long time passed before shipping. Even when Crucial's order status showed \"complete,\" it took several days before the tracking number even showed up as valid."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:47:39.000Z",
          "Titre": "Your product is great",
          "Contenu": "As a repeat customer, their products and online website are always great to use. I used Crucial's free online System scanner to assess my computer's upgrade options, then accordingly purchased 64GB of DDR4 Ram to speed up my aging Desktop PC.  Reasonable price, Excellent compatibility and nice performance boost; once again, a reliable, quality product that delivers.I'm sure the warranty would be good too, if I ever needed it...never been the case. :)The only thing preventing a 5 star rating is that, for Canadians, there is additional Duty to pay when UPS hands off to Canada Post, plus there can be confusion in tracking the package, because even signing up for txt/email alerts on the UPS app does not ensure you get them.  I didn't....But, overall, still worth buying from these guys if you want a solid product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer John DiLeo, New Orlea",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T02:50:50.000Z",
          "Titre": "product fine; shipping not so much",
          "Contenu": "The product is fine, but the shipping was problematic. For nearly 4 days the supplied tracking number for UPS was not recognized by the UPS site. Crucial support could only offer patience. When the tracking number was accepted by UPS, it appeared that UPS handed it over to the USPS and delivery was delayed by 3 days from anticipated date. Finally got it, but...The memory installed fine and is working."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Yves Bourassa",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:14:01.000Z",
          "Titre": "I had additional and unexpected fees",
          "Contenu": "I had additional and unexpected fees. First, I don't believe the pricing on your website was clear about the fact that even after selecting my address in Canada, the price listed was still in US $. Also, customs was not figured in the final price. As far as the RAM chips I bought, they so far seam to be working OK."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:53:03.000Z",
          "Titre": "system scanner identified the correct…",
          "Contenu": "system scanner identified the correct memory.  Problem is my Dell does not run faster and or offer XMP overclocking so it is just as slow as before the addition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JimD",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T18:51:27.000Z",
          "Titre": "I was really given incorrect…",
          "Contenu": "I was really given incorrect information about how to put RAM in an iMac. It was suggested I needed to remove and put the battery back in to reset the system to acknowledge the new RAM. That means taking the Mac apart. All I need to do was to restart with the Command, Option, P, and R Heald done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Szynkowski",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:09:15.000Z",
          "Titre": "Slow Delivery",
          "Contenu": "Was wondering why it took so long.  Could see in delivery, but unable to track with the numbers given.  Finally arrived and simple install.  All is good with the product.  Have used crucial multiple times fir memory update."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:25:07.000Z",
          "Titre": "Good Hardware & Shipping - Support Chat not so much.",
          "Contenu": "The hardware arrived sooner than promised. Got around installation issues eventually. Might have been more straightforward if Support Chat actually worked. Technicians (yes, two) ghosted me after I described the issue. Fortunately I had another system that I could use to do a Google site search on Crucial for deeply buried documentation for a fix."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T16:59:03.000Z",
          "Titre": "Memory worked great",
          "Contenu": "Memory worked great. Plug and play.I think a little over 2 weeks is a wee bit too long for the shipping. It was about a week after the order before it was shipped and then plus in transit. Can't blame that on Crucial.  A littler better with communications and I would have given 5 stars.This was not my first purchase over the years and their speed was a lot better in the past.Their product has always been excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. R. Marin",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:39:34.000Z",
          "Titre": "Great service",
          "Contenu": "I am very satisfied with my product experience. I will note, I was quite worried when the package was said to arrive in 4 business days then arrived about 10 days later. Regardless, very great service with a comforting buying experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike J",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T02:51:03.000Z",
          "Titre": "Website was a big help & made huge improvement!",
          "Contenu": "Website was a big help in finding the correct RAM and SSD Hard Drive for my laptop. I would rate 5 stars except while navigating the site a pop up claimed I would receive a 15% discount for using the automated upgrade tool. Pretty sure I paid full price. Don't know what happened to the discount offer. In any case I upgraded from 8 gig of RAM to 20 gig and replaced my 1 Terabyte mechanical Hard Drive with a 1 Terabyte SSD Hard Drive. Wow! Huge difference in speed and performance in general. Parts fit perfectly and changing out took about 15 minutes. Well worth the effort and cost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:41:59.000Z",
          "Titre": "The Gen4 SSD works like a charm and the…",
          "Contenu": "The Gen4 SSD works like a charm and the performance/price is off the chart.  The only downside is the included cloning software (Acronis Crucial Edition) is very tricky to use and has several caveats as compared to their Samsung competition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Mulvey",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:05:13.000Z",
          "Titre": "Excellent product Needs better web advice.",
          "Contenu": "While the product is really good I had an issue with the wrong memory ordered that was supposed to be compatible with my system. My mistake but it was what was recommended by the pick upgrades for my system. Re-Ordered the correct one and sent the wrong one back for a credit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T01:05:36.000Z",
          "Titre": "Good products good service.",
          "Contenu": "Generally your web pages are good and your order process is relatively easy...Technical help is pretty good.   If you would ship USPS to a PO Box in Alaska i would be a 5*."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Jewart",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T19:52:09.000Z",
          "Titre": "The memory and SSD drives I purchased…",
          "Contenu": "The memory and SSD drives I purchased work just fine. I was a bit disappointed in the amount of time from my purchase until I received them.  Additionally, until I received the drives I did not realize the interface was USB-C.  My Mac computers have that interface but the PCs do not which necessitated the purchase of adapters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T16:27:31.000Z",
          "Titre": "Old Windows software not accepted",
          "Contenu": "Products were accurate to what I ordered and shipping was speedy.  I did experience a problem: nowhere was I informed on the site that the cloning software they provide with the purchase of a Solid State Drive and needed to make a duplicate of my HDD, did not support Windows 7. The purpose of these drives is to speed up old systems; why wasn’t this on their site?  Crucial did respond when I asked for help over email, but their solution was a bit more complicated. In the end, and with much time consumed on my part, I sought out other cloning software. Thankfully I was able to get everything working with the new drive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Raja Rangwani",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:30:10.000Z",
          "Titre": "Delivery was too slow and ups didn’t…",
          "Contenu": "Delivery was too slow and ups didn’t give me updates despite signing up for it multiple times on their website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Graham",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:46:20.000Z",
          "Titre": "Had difficulty getting the discount…",
          "Contenu": "Had difficulty getting the discount price for running the scan.  The [phone] help desk was able to resolve the problem.  The videos for installing the SSD and RAM were very instructive and their hardware installation went well.  The web instructions for using Acronis to clone my hard drive to the SSD were clear and that process went well.  Some Windows knowledge was required for setting up the boot order in the bios, and I did web searches to glean this information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Balaban",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T09:13:05.000Z",
          "Titre": "Very reliable memory but was surprised…",
          "Contenu": "Very reliable memory but was surprised it took a week to get."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T. W.",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:00:56.000Z",
          "Titre": "The hardware is great",
          "Contenu": "The hardware is great, but the website doesn’t work half the time, & communication with customer service people is difficult at best"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G. P.",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:39:56.000Z",
          "Titre": "Generally good",
          "Contenu": "I bought RAM for my computer. The Upgrade Selector was quite good; you enter make and model info about your computer and it lists a couple of compatible options. But there are sub-options, not all of which are compatible. You have to check each one. I didn't realize this and bought the wrong RAM. But return and refund were hassle-free."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Z.",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T14:39:59.000Z",
          "Titre": "The right memory",
          "Contenu": "I though the process of picking memory was easy, although there was a gap of time from purchasing, to shipping where no info could be seen to estimate the delivery date. But the memory worked well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Jennings",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:22:17.000Z",
          "Titre": "the site really helps you to select the correct memory for your pc",
          "Contenu": "he site really helps you, to select the correct memory for your pc"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-06T18:57:12.000Z",
          "Titre": "Need temperature threshold",
          "Contenu": "I ordered DDR5 RAM from crucial web site for the first time and got a nice discount. however, I can't find the temperature threshold info for the RAM anywhere on the site. It's an important info particularly for laptop RAM. Otherwise the RAM fits well for my gaming laptop and performs quite well."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Gray McLaren",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T04:06:03.000Z",
          "Titre": "The item arrived quickly from the US…",
          "Contenu": "The item arrived quickly from the US which was great!  However, I then found out that to do my data backup prior to installation of the SSD, that I would need a USB to SATA adapter which I could have ordered from Crucial at the same time as the SSD.  So, I then needed to look around and purchase this adapter locally which was a bit annoying.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimmy D.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:09:53.000Z",
          "Titre": "Product is great",
          "Contenu": "Product is great but the shipping took a long time to get here. Especially when it was shipped and received in the same state."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R.J.",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T20:42:23.000Z",
          "Titre": "Overall Smooth Experience",
          "Contenu": "Hardware was easy to choose in regards to compatibility for my computer and the online purchasing experience was smooth. My only reason for not five stars is the shipping. It said it would ship UPS, which is started as, and then UPS sent it to USPS where it was lost for a bit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cary Orlandi",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T23:02:10.000Z",
          "Titre": "New SSD installation",
          "Contenu": "Purchased a SSD to improve the performance of a desktop.  Acronis software does a good job cloning but isn't real user friendly initially - it doesn't tell you it is working, just has an icon with a spinning object.  Also, the cloned drive didn't start until I attached the Win 7 backup/system image/rescue disk, but now all is working fine.  Very happy with the improved performance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T04:08:05.000Z",
          "Titre": "Memory and Storage Upgrade for Acer Nitro 5",
          "Contenu": "I needed to bet more RAM for my computer so I got two 16GB sticks to go from 8GB to 32 GB, the memory arrived safely along with my 500GB NVMe SSD and 2TB SATA SSD. The shopping experience was easy and intuitive. I ran the crucial computer scan and quickly found what I needed. Everything fit and worked properly just like Crucial said it would. One thing I wish they had put somewhere on the site is in order for Windows to recognize the drives you need to download Acronis True Image for Crucial, I was able to find a download when I searched in Google. Overall a great shopping experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "john gower",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T08:39:51.000Z",
          "Titre": "Delivery sucks",
          "Contenu": "Memory stick is great; great price; shipping sucks; you don't deliver to USPS boxes.  But U.S. postal service is last mile delivery to our village for UPS.  They end up delivering to our po box in another city but they have to look us up.  Takes extra days and there is always the possibility that the shipment will get lost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ethan",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T10:15:42.000Z",
          "Titre": "Happy buyer, will use again",
          "Contenu": "Awesome product.  My one complaint is probably something out of your hands.  Digital river notified me that if I received a specific email my order was paid for and ready to ship.  When it arrived that was inaccurate, my card wasn't charged for another 4 days.  Minor but communications about billing/shipping should be on point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mikhael Lee",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T23:56:21.000Z",
          "Titre": "Shakey shipping process, but Excellent product",
          "Contenu": "This RAM kit and a few other parts unrelated to Crucial was my first experience upgrading a PC.Due to the length of time for it to arrive, I was worried about damage and the package being lost. However, it got here safely. Install went smoothly and now my desktop runs beautifully. I have noticed much better performance.This paired with a GPU upgrade has been a thoroughly worthwhile investment in a possibility of starting to stream games and such.I am already considering ordering an SSD from Crucial in the future.Thank you so much!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Waldrop",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T01:16:33.000Z",
          "Titre": "I'd rate Crucial 5 stars except for…",
          "Contenu": "I'd rate Crucial 5 stars except for their return process.  I accidentally ordered 3 storage cards/blades and need to return one of them.  The package is unopened and in original condition.  I filled out the online form but haven't heard anything since.  Without a Return Authorization I cannot return the blades."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T00:36:09.000Z",
          "Titre": "I was able to purchase the correct…",
          "Contenu": "I was able to purchase the correct memory for my computer based on the website finder application. The memory came and it worked properly. The shipping took longer than anticipated, though."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Matthew Sampson",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:12:19.000Z",
          "Titre": "Product was as required and in good…",
          "Contenu": "Product was as required and in good condition.However the delivery was left at the wrong address and I had to chase it down my self. nor was there a proof of delivery provided to help me do so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin O’Neill",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:07:03.000Z",
          "Titre": "Shipping took 2 weeks when the order…",
          "Contenu": "Shipping took 2 weeks when the order told me it would be around 5 days"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:00:22.000Z",
          "Titre": "Good Price, Slow Shipping",
          "Contenu": "Good Price, Very Slow Shipping. Other places were sold out so it is what it is. I got the drive at the right price so I can't complain too much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Giovanni Valle",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T23:34:51.000Z",
          "Titre": "Good quality product",
          "Contenu": "Product is good quality. Would have given 5 stars if it didn't take so long to arrive. That said, customer service did correct the situation and mailed the product expedited after two weeks of not receiving it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fredonia Mountain Technologies",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T19:31:56.000Z",
          "Titre": "My third MX-500 Purchase",
          "Contenu": "This current purchase is a replacement for the same SSD MX-500 model which proved to be defective while trying to install Win 10 three times.The new MX-500 appears to be operating just fine, as does the first (of three) MX-500 SSDs purchasedBuyers should be aware that SSDs shipped free from Crucial.com are shipped via UPSMI (UPS Mail Innovations) service, which is quite slow. My latest purchase was on April 24, and arrived two weeks later. Tracking was not possible until two days prior to delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert DeFord",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T13:45:55.000Z",
          "Titre": "The Crucial app that was supposed to…",
          "Contenu": "The Crucial app that was supposed to scan my computer to determine compatible SSDs was either too slow or was broken. However, I was able to find my computer model in the list of supported computers on the web site and found the correct SSD for my computer from there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 6,
          "Date": "2023-07-17T22:27:32.000Z",
          "Titre": "Great product (SSD for my laptop)",
          "Contenu": "Great product (SSD for my laptop), good price and reasonable shipping speed.Had a hiccup with the clone software they provide-had to do a full backup to a 3rd drive and then recover from there to the new drive instead. (Clone function wouldn’t work due to different sector sizes between the two drives).Other that that a great experience. Laptop boots and runs things way faster now-about 50-60% faster!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Novice Installer",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T06:26:07.000Z",
          "Titre": "Website gives good info. and product works well",
          "Contenu": "Website gives very good information on which Crucial product is most suitable for our computer. Installation was a cinch with good website videos and advices. The DRAM works well from the start. Only improvement needed is speedier shipping and better tracking. Order was made on Friday and shipping didn’t really start until the next Wednesday."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mikayla Vernom",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T14:21:31.000Z",
          "Titre": "I bought 2x 16gb ram, darn good experience",
          "Contenu": "I bought 2x 16gb ram, the product so far is great. The crucial site found a ram that works perfectly in my computer, and with the videos explaining how to change a ram- the whole process was fairly easy! It was my first time, so having those videos really helped. I was a bit nervous I’d end up with an incompatible ram, so I’m very happy with the accuracy of the program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Mann",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T23:44:51.000Z",
          "Titre": "Good product",
          "Contenu": "Good product. However, I paid extra for fast shipping, but Crucial didn't give the shipment to FedEx for a couple of days, so it arrived a day later than I had hoped for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johanna Park",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T20:10:25.000Z",
          "Titre": "Website easily navigated, great price.",
          "Contenu": "Website was easy to navigate, follow up by company through emails was prompt and timely updates after shipping was nice. Shipping took longer than I expected but I am not in a hurry to install the part and didn’t choose expedited shipping. I haven’t installed the part yet but it came in perfect condition."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Richie",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T01:51:21.000Z",
          "Titre": "The RAM works with no problems",
          "Contenu": "8GB stock RAM to 16GB Crucial RAM, improvement can be seen on some games. (Stock RAM speed = Crucial RAM speed) When I turned my Dell on after I installed the new RAM, I was told there was new hardware present and was suggested, by my Dell, to run a hardware check by Dell and they found nothing wrong. I have not been questioned about the new hardware again, never saw any problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "That Daily Deal Customer",
          "Nb_Reviews": 7,
          "Date": "2023-06-08T14:43:31.000Z",
          "Titre": "I used your app to purchase a SATA ssd…",
          "Contenu": "I used your app to purchase a SATA ssd drive. I used your app recommendation and was delivered a NVME ssd drive. Customer service representative did process an RMA and refund and reorder the correct item. My only complaint is that they do not provide a prepaid return envelope. I will order any crucial products in the future from Amazon, since returns are free, especially if you drop it off in a local drop off point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Saleem Godoy Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T06:57:28.000Z",
          "Titre": "Acronis is really bad",
          "Contenu": "I found a great product on Crucial. My laptop is so much faster now. I got a ssd and crucial recommended Acronis. Never worked. Complete dogsh*t. I used disk genius to copy my hdd to my new crucial ssd. It worked perfectly find. It's not crucial's fault that Acronis was so bad, but it would've been nice if crucial would have recommended something better. My laptop starts very quickly now. Everything opens like in less than a second when it used to take 10 minutes to open chrome (not exaggerating). Very happy with the overall experience. Definitely worth the price. I also bought other things off of crucial and they really improved my computer's performance. Highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T16:03:08.000Z",
          "Titre": "Quality Products",
          "Contenu": "Great price, high quality product. I would have given 5 stars, but it was difficult to find what I needed using your search tools. Also, shipping was a little slow compared to other retailers. Overall, I recommend your company and have bought from you several times over the years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kathialexis",
          "Nb_Reviews": 13,
          "Date": "2023-05-20T06:27:55.000Z",
          "Titre": "I didn't receive any delivery estimate…",
          "Contenu": "I didn't receive any delivery estimate at the time I placed my Crucial order or any time after, and when I check your website, I get nothing except an invoice. It is bad business to leave your customers in the dark about delivery. I have placed two orders recently with you and I don't know which one I am reviewing. But my complaint applies to both. The delivery is much too slow also. That makes the lack of delivery notices worse."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 6,
          "Date": "2023-08-14T00:16:33.000Z",
          "Titre": "Good SSD; cloning software is still not great though",
          "Contenu": "I bought an SSD for my desktop PC. I got the expedited shipping this time-way better, came FedEx--no more of that UPS/USPS shared nonsense. The downloadable Acronis cloner still didn't work (I just did this same process with my laptop last month)-it just hangs when you try to clone. And yes, I'm booting clean from a USB directly into the cloning product, not from within Windows. I started it at 8am, came home at 10pm and it said \"16 hours to go\". I started over, and the next morning it said \"3 days to go\". No bueno. I ended up doing an image backup, and then swapping drives, and restoring from that image. That works, just takes longer--a few hours for 1TB. You need a better cloning product partner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T20:39:04.000Z",
          "Titre": "Good product",
          "Contenu": "Good product. Chat folks could use a little coaching. The RAM is working flawlessly. The 'help' making sure that I was buying the right RAM was somewhat unreassuring. After a 20 minute chat where I was seeking confirmation that the RAM I was buying could co-exist with the RAM already in the server, all I really got was a reiteration of \"We guarantee compatibility, so if it doesn't work, you can just return it\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Uribe",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:31:49.000Z",
          "Titre": "Price and quality good, delivery tracking BAD!",
          "Contenu": "The price and quality of the RAM/memory that i purchased was top notch! The only downside was that the transaction email that i received upon purchase had a broken mail tracking link! Furthermore, there was no other follow-up email with a fixed link, etc. Luckily, the product arrived within a few days, and as noted above, was totally fine. But it was such an obvious issue with the broken delivery tracking link...that, until i received the product, i was fearful that it would never get delivered! Otherwise, the product itself is great!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dev Anand",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:13:19.000Z",
          "Titre": "Reached out to customer service when I…",
          "Contenu": "Reached out to customer service when I had not recevied my order and they shipped out a replacement on a expedited basis. Not wasting too much of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alvits",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T05:25:21.000Z",
          "Titre": "Dell Inspiron 32 GB. RAM",
          "Contenu": "Great selection of parts. Order was quick, price reasonable. Shipping, unfortunately, longer than expected. So far so good. It works great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:33:42.000Z",
          "Titre": "The SSD I ordered is fine so far",
          "Contenu": "The SSD I ordered is fine so far, it's been working just one day so far. It took over a week to get it after purchase, not real thrilled about that. The support pages are a nice touch. they're pretty thorough for explanations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis PC",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T21:04:26.000Z",
          "Titre": "Service and Refund policy",
          "Contenu": "Service and Refund policy honored in a timely fashion.   I was disappointed that my new Lenovo Computer didn't allow the Crucial System Scanner to work.  ( I tried multiple search engines, different times and dates, to no avail.  i never had this problem before, so i can only point the finger at Lenovo?"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Gene Atkins",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T03:49:39.000Z",
          "Titre": "Great price for great items",
          "Contenu": "I was looking for the best SSD Hard drive offer and found it directly from Crucial. I have some issues placing the order. My only real complaint is the tracking information, it was wrong at the beginning and after almost a week, I had the tracking info right from the UPS page. Hope this is fixed for my future purchase, other than that all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "de Hendrix",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T02:14:46.000Z",
          "Titre": "Provided info to get the right product",
          "Contenu": "Provided info to get the right product, at a reasonable price, delivery was good but a day off because of the mail system . came in hard plastic see thru cases but you should consider additional packaging protection  when using the plastic envelopes as the USPS has been know to cram stuff into mail boxes and throw packages around ."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "djdado",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T20:08:04.000Z",
          "Titre": "Same as all, deliver slow - still not recieved-EDIT:recieved",
          "Contenu": "same as other guys, i ordered 4.5.2023 its seems like deliver was sent 5.5.2023, now is 16.5.2023 still nothing, their tracking number is showing nothing,2023-05-07 22:37:29\tEND OF TRACKING UPDATES\t2023-05-07 22:27:29\tACCEPTANCE\tPRAGUE, 252 61, CZ2023-05-04 14:11:00\tPARCEL CREATEDEDIT:My first order got lost, i contact support and they sent me replacement this time with fed ex, it came really fast and all good..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 6,
          "Date": "2023-07-11T21:10:16.000Z",
          "Titre": "4 laptops-all work great!",
          "Contenu": "This is the 4th time I've purchased from Crucial. All RAM and SSD's work great! The first two times the Acronis cloning software worked fine, but the last two times it wouldn't work.( I've done 2 HP laptops and two Asus laptops.) Crucial tech support was great, but we still couldn't get things to work. Upon his suggestion I got a 3rd party software program and it worked easily. All computers are working, very fast! Will encourage others to buy from Crucial!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David C Stead",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T17:51:36.000Z",
          "Titre": "Reliable quality memory, good price",
          "Contenu": "Reliable quality memory at a good price, the only thing I didn’t like was the shipping; “UPS Mail Innovations” is slow, and tracking is unreliable. It’s guesswork trying to figure out when it will arrive. In contrast, AMZN gives you regular email updates, and you can track your packages easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T06:13:59.000Z",
          "Titre": "Shipping a bit slow and may not have…",
          "Contenu": "Shipping a bit slow and may not have been informed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "That Daily Deal Customer",
          "Nb_Reviews": 7,
          "Date": "2023-06-27T00:36:34.000Z",
          "Titre": "The cloning software corrupted the ssd",
          "Contenu": "The cloning software corrupted the ssd. The sad drive did not fit with the bracket. The ssd needed to move to the right side 1-2 mms and the bracket did not allow the space. According to customer service a bracket is not needed. Previous, on another computer, software and installation was a breeze."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ira Hart",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T04:27:47.000Z",
          "Titre": "Everything except the shipping was…",
          "Contenu": "Everything except the shipping was great.  The downloadable app worked to correctly find the proper items for my equipment.  The web purchase was easy and quick.  Shipping was slow, information such as tracking was terrible.  I had to contact customer support to find out about the status of my order.  They were great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tien Nguyen",
          "Nb_Reviews": 7,
          "Date": "2023-10-23T17:42:17.000Z",
          "Titre": "good solid state (SSD) hard drive",
          "Contenu": "It is very small and compact which is convenient and the data transfer rate is anywhere from 10 to 30 Mbps so fast enough for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tarael Thorpe",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T04:46:52.000Z",
          "Titre": "RAM and SSD M.2 upgrade",
          "Contenu": "Recently ordered RAM and SSD M.2 upgrade for a Latitude 3520. They arrived quickly, and work great. I did have to adjust the BIOS to get the new SSD to be recognized. An instruction from Crucial would have been nice about that probability before I installed it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Reese",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T01:28:14.000Z",
          "Titre": "Good",
          "Contenu": "Good, would apreciate a bit more bubble wrap for shipping but im sure you guys are experienced enough to know it wont get damaged in transit, which it did not. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Sims",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T23:38:08.000Z",
          "Titre": "The new 2TB SSD has been installed in…",
          "Contenu": "The new 2TB SSD has been installed in my Desktop PC, replacing my standard HD. The results are an amazing increase in speed! Startup is a few seconds and opening most email is one or two seconds.I gave only 4 stars because delivery took 10 days when I paid for \"3 day\". They have refunded  that fee!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zulk",
          "Nb_Reviews": 5,
          "Date": "2023-08-11T00:46:14.000Z",
          "Titre": "Quality Products, Excellent Website!",
          "Contenu": "Website is very user friendly and helps you find items that are compatible with your device. I would have given another star but the delivery is painfully slow; in this day & age."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHANE WALKER",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T14:33:18.000Z",
          "Titre": "Great item research and ordering…delivery time could use improvement.",
          "Contenu": "Great item research and ordering experience, and so far the install and product performance is likewise great and great value.  Only stumble was the length of time it took to deliver to my door…a week and a half seems an eternity when you need the upgrade capability."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noel Crawford",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T18:34:45.000Z",
          "Titre": "Very good",
          "Contenu": "Received refund and got good support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julian Stark",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T23:08:19.000Z",
          "Titre": "Overall, Great!",
          "Contenu": "The website was easy to follow (the videos are a big help, and a good reference), and the system scanner is very helpful.  The Acronis software worked well.  The only reason I didn't give 5 stars is that I would have liked a few more options and documentation on Acronis.  I have to find out now how to get my programs accessed on the SSD.  I was able to get the system to boot from it, but there should be a way to rename the original C: drive (HD) so that the SSD can become the C: after Acronis is finished.  I think I could have done this with Acronis, but things weren't spelled out enough (for me) in the program windows."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DR ROGER BROWNE",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T21:15:00.000Z",
          "Titre": "Although I had to return one of the…",
          "Contenu": "Although I had to return one of the parts I find the whole Crucial experience worth trying. I will continue to use them as long as I have a computer issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Kormanik",
          "Nb_Reviews": 5,
          "Date": "2023-09-15T08:04:12.000Z",
          "Titre": "A LITTLE SLOW ON DELIVERY",
          "Contenu": "A LITTLE SLOW ON DELIVERY, JUST HOPE IT INCREASES THE COMPUTER SPEED & THE SSD LASTS FOR MANY YEARS!!  THANKS FOR YOUR ASSISTANCE IN CHOOSING."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chrystelle Fortin",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T16:55:09.000Z",
          "Titre": "When you pick a country in shipping",
          "Contenu": "When you pick a country in shipping, the cost should be in that country currency, otherwise you don't even know you're actually buying in US$. Plus, newegg had it cheaper so I paid 100$+ than I thought, so bad price. Good product though!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erol B",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T18:37:08.000Z",
          "Titre": "Great Experience with memory upgrade !",
          "Contenu": "Memory gotten works great and the install was easy.  Your software did a good job finding the memory needed to fill the slots with maximum amount possible.shipping was a little slow but worth the wait."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "Sonny Marquez",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T03:01:46.000Z",
          "Titre": "The ordering process was straight…",
          "Contenu": "The ordering process was straight forward but encountered bugs in the system.  When order was placed. the confirmation part of the webpage just froze."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Cadle",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T22:44:22.000Z",
          "Titre": "Love the memory both sticks work great…",
          "Contenu": "Love the memory both sticks work great in my machine.  32 gb appears to be the sweet spot.My only issue was the shipping.  I'd have preferred to pay shipping to be able to have known when I was gonna get it. UPS Mail innovation wasn't the best option for shipping updates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RaeAnn Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T12:47:16.000Z",
          "Titre": "Crucial is awesome",
          "Contenu": "Sales great. Service and delivery great. Parts great. Support great except I wish you offered or support or referenced a better (free) tool or resource for repartitioning SS drive after cloning."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Seth",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T05:40:38.000Z",
          "Titre": "the product was good over all",
          "Contenu": "the product was good, but it was in US dollars, and I thought it was canadian dollars, and it didn't say otherwise anywhere. and when I went from shipping to Canada instead of to US, it took a sale off of one of the products in my cart."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harry A",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T23:26:18.000Z",
          "Titre": "I followed Crucial's  web instructions…",
          "Contenu": "I followed Crucial's  web instructions and they worked perfectly.  My only glitch was not formatting the new MX500 SSD before starting the process.  It would have helped me if that had been the first instruction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Vance",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:46:56.000Z",
          "Titre": "2tb nvme m2 drive",
          "Contenu": "I ordered 2 2tb m2 nvme drives, they came in good time and were what I ordered. They were well packaged, and worked with no issues. Only issue I had is it took 2 days for the tracking number to actually work past the stated 24 hour period."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "larry pfeifer",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T19:00:31.000Z",
          "Titre": "Customer Service",
          "Contenu": "The items I ordered were lost in the mail. The CS Rep understood the urgency and issued a replacement order immediately. I received the items next day."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "nathan",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T04:53:05.000Z",
          "Titre": "The shipping updates can improve",
          "Contenu": "Hello, It was fine but the shipping updates can improve, on the other hand, I receive a billing for taxes that weren't calculated during the order process. The product is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leo Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T04:42:36.000Z",
          "Titre": "The memory selector was very good and…",
          "Contenu": "The memory selector was very good and the memory was a perfect match. However the shipping left a lot to be desired. Tracking information was limited and it took too long. I should have used the selector and purchased from Amazon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Graham McC",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:13:01.000Z",
          "Titre": "Great product and exceptional value",
          "Contenu": "Great product and exceptional value!  This drive has reinvigorated an old laptop in combination with a small RAM upgrade.  My only complaint is the software that Crucial made available to clone the old drive was cumbersome and didn't work for me even after multiple attempts and reviewing the comments of others with similar experiences.  The instructions for use need to be updated and/or another product made available.  I used another highly recommended product and complete the cloning process without issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Subramaniam Arasakesari",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T19:40:54.000Z",
          "Titre": "Memory recommendation by Crucial's…",
          "Contenu": "Memory recommendation by Crucial's software was accurate. It recommended more memory than the manufacturer recommended. The memory worked the first time I installed it without any compatibility issues.The package took an unusually long time to delivered by mail. Much more time than that I am used to with other suppliers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LarkB",
          "Nb_Reviews": 4,
          "Date": "2023-04-02T13:05:34.000Z",
          "Titre": "Excellent product but slow order…",
          "Contenu": "Excellent product but slow order processing and shipping.  If your purchase is time sensitive, I suggest you purchase elsewhere.  It took over a week to receive my items, even after paying for expedited shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian H",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T21:05:26.000Z",
          "Titre": "3 of the last 3 orders ...",
          "Contenu": "3 of the last 3 orders .... late delivery by 2 to 4 days.Update:June 12 Good they replied fast.Please review the prior orders if this one was within 10 days (didn't see it very clear that it was 10 days on the order form)Is it 10 business days or 10 calendar days?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 6,
          "Date": "2023-08-09T03:34:14.000Z",
          "Titre": "Good company The entire ordering process was…",
          "Contenu": "The entire ordering process was excellent. I haven't received my drive yet so I can only give it 4 stars I will update this after I receive and install it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miguel Soares",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T00:47:06.000Z",
          "Titre": "The download able tool removes any…",
          "Contenu": "The download able tool removes any guesswork regarding which DIMM to order. I would suggest a link to directions on how to replace it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J J Sloan",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T23:10:38.000Z",
          "Titre": "Great buying experience overall",
          "Contenu": "It was easy to find the parts I needed, the price was good, and when they got here, they were easy to install and worked perfectly.The  only drawback was having to wait 10 days for the order to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benny",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T16:08:35.000Z",
          "Titre": "Great Selection of Products",
          "Contenu": "Crucial has great selection of products at a affordable price. Whatever RAM or hard drive you need to upgrade your computer is available with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Kusnierz",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T18:52:24.000Z",
          "Titre": "I wanted to rank 5 out of 5.",
          "Contenu": "I wanted to rank 5 out of 5 but I was so confused by the UPS tracking link that crucial sent took me straight to the UPS website only to tell me my products hadn’t been shipped yet. Luckily the tracking was incorrect and they came in USPS. Upgrades worked great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill P",
          "Nb_Reviews": 4,
          "Date": "2023-11-29T08:03:49.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery. However instruction for SSD instrctions does not advise to Chkdsk HD before cloning!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHARTRESS ENGLISH",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:07:45.000Z",
          "Titre": "Product was exactly as described",
          "Contenu": "Product was exactly as described. Shipping was pretty slow. Great support throughout the process. The products are working great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward York",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:21:11.000Z",
          "Titre": "Nice product",
          "Contenu": "Products fine love the product but the shipping sucked"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim C",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:15:06.000Z",
          "Titre": "The memory I needed was affordable and…",
          "Contenu": "The memory I needed was affordable and is working the way I need it to. Appreciated the tool than scans your system to help you purchase the correct memory type as well as give pricing and various option levels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tomas churizoe",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:39:14.000Z",
          "Titre": "I upgraded a 27\" iMac Pro with more…",
          "Contenu": "I upgraded my 2019 27\" iMac Pro with more ram and it's operating faster now. The first attempt didn't go so well from another manufacturer bc my system started crashing randomly so I returned their ram and bought new ram from Crucial. All's well that ends well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Salvo",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T00:06:23.000Z",
          "Titre": "Bought a new PC with min RAM and…",
          "Contenu": "Bought a new PC with min RAM and storage; bought your upgrade parts, did a quick 'clone' with software you provided, and installed 32GB RAM and 2 TB SSD. System came right up with no problems at all.Gotta love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krissy ONeil",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:33:58.000Z",
          "Titre": "I bought RAM for my son",
          "Contenu": "I bought RAM for my son. I really didn't understand what I was purchasing but my son did. According to him it was easy to see what it was he wanted. Once it was ordered and payed for, I was kept in the loop every step of the shipping process. I also received my product within the 3 day window that was promised on the site for shipment.  I was weary but in the end I give Crucial.com 10 thumbs up. I recommend this site for your computer needs"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Freddy Maria",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T01:28:23.000Z",
          "Titre": "My laptops skyrocketed the boot up…",
          "Contenu": "My laptops skyrocketed the boot up speed and shutdown as well, the over speed went up to a 200% speed after upgrading just the HD with this Ssd from crucial"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Sterlacci",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:12:00.000Z",
          "Titre": "Amazon Blew This, Crucial Saved Me",
          "Contenu": "I ordered on Amazon before this but they never could ship order.  I waited 2 weeks before I had to cancel the order and ordered from you guys (Crucial) and the SSD arrived on schedule. Sometimes it is best to order from the source.  Thanks Crucial."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walt Neff",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T20:08:28.000Z",
          "Titre": "Excellent service on two recent orders",
          "Contenu": "Excellent service on two recent orders. Quick shipping and excellent products make it easy to order from Crucial. The memory modules were easy to install and gave an instant boost to the level of performance on both my laptop and desktop PC's. Great value and a real bargain in being able to so easily improve the quality of my computers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Prashant Vadhadia",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:39:18.000Z",
          "Titre": "Shop crucial.com without any regrets!",
          "Contenu": "Crucial website scanned and recommended suitable RAM for my slow computer. I have also done my research and choose crucial for better performance and price. I purchased 8GB DDR4-2400 SODIMM 1.2V CL17 RAM and shipping was free!! Also, received 15% discounted price to use online tool at crucial website. I see improvement on my laptop with upgrade. RAM was easy to install and so far has no issue on performance of laptop. I am really happy with this purchase and recommend this brand of products to other shoppers. Shop this brand through crucial.com without any regrets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Weisenfeld",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T07:43:11.000Z",
          "Titre": "Crucial to a refugee’s success…",
          "Contenu": "Your upgrades of memory and hard drives keep not only my family’s laptops running at peak performance, but they also help me tune up some laptops for a refugee education center (thriveatb5.org) that I volunteer at. Thank you for fair prices, excellent selection, and  prompt service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:27:55.000Z",
          "Titre": "Super experience overall.",
          "Contenu": "Upgrade tool worked great. Memory sticks arrived earlier than they initially said it would, which was great. Sticks came packaged nicely in a bubble mailer and secured in plastic cases. Memory fit perfect. Will use them again for sure if I ever need to upgrade my PC memory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Maltas",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:30:20.000Z",
          "Titre": "4 TB NVME P3 PCIe 3.0 M.2 SSD works…",
          "Contenu": "4 TB NVME P3 PCIe 3.0 M.2 SSD works great in XPS8940 when BIOS setting changed from \"RAID ON\" to \"AHCI\"; Crucial 32 GB DDR4 Pro (2 sticks of 16 GB RAM) also works great in XPS 8940 that already contained 32 GB RAM (with 2 sticks of 16 GB each).  Also suggest getting a Seagate Enterprise 12 TB (or larger) drive to replace the tiny 1 TB SATA drive in the XPS 8940 --- it's quiet and offers plenty of storage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Braden",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:10:21.000Z",
          "Titre": "Items were easy to find and narrow down and select",
          "Contenu": "Items were easy to find and narrow down to the one I wanted. I placed my order and am awaiting shipment now. Crucial, while being offered on other sites, has the most complete information than other resellers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike L",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:35:06.000Z",
          "Titre": "A+++ company to deal with!",
          "Contenu": "The web site is extremely clear and easy to understand. Ordering was quick and neat.  Fast delivery.  A+++ company to deal with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Bruno",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:12:58.000Z",
          "Titre": "Great service!",
          "Contenu": "Great service! Great product!  I recently upgraded my DRAM for my laptop and have seen marked improvements. This purchasing experience went really well and delivery was received ahead of schedule."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:53:52.000Z",
          "Titre": "Great website",
          "Contenu": "Great website. Easy to use, even for a noob like me.Customer service in outstanding, the prices are the best around and the products are top of the line. I will defiantly order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Heiliger",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T01:41:00.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, easy to install additional RAM. My computer is running much faster"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick-OR.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:36:55.000Z",
          "Titre": "Nice,Quick and convenient.",
          "Contenu": "It was nice to shop in one place and not have to be outsourced to another website to purchase your product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kevin flowers",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:41:47.000Z",
          "Titre": "For longest I've been playing on my…",
          "Contenu": "For longest I've been playing on my laptop doing the things that keep me updated on my hotspot so just reason I bought memory cards for that laptop now my Internet time was working a lot better thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Norton Customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T16:54:49.000Z",
          "Titre": "Ease of ordering",
          "Contenu": "Ease of ordering. I was able to find the correct memory upgrade for my laptop without any problems, the black friday sales promotion had it at an awesome price and it worked great. Delivery took some time but I was not in a rush to get it so it all worked out great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack McCurdy",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T15:22:26.000Z",
          "Titre": "Easy returns",
          "Contenu": "Easy returns. The scan tool did not select the correct product twice. Must be an issue with the product documentation provided by the computer company. Very good customer service and excellent reps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omid",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:59:57.000Z",
          "Titre": "No regret of purchasing Crucial",
          "Contenu": "Crucial makes the best in class memories and storage devices, and the idea of crucial.com for creating a database of hardware compatibility is wonderful for newbies in the field."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T01:53:44.000Z",
          "Titre": "Works",
          "Contenu": "Ordered, arrived about what was expected this time of year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce",
          "Nb_Reviews": 12,
          "Date": "2023-12-10T20:09:14.000Z",
          "Titre": "Worth the Money",
          "Contenu": "Fairly easy to put in (I'm 74 and was able to do it though I did have to press down pretty hard on the ends to make them snap into position).  Once in, everything else was easy and the computer booted up as usual and I now have more memory!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walt Neff",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T00:18:15.000Z",
          "Titre": "Excellent Service Again with Follow-up Purchase",
          "Contenu": "Excellent service again with a follow-up purchase of additional memory for another laptop. Easy install, fast shipping, and the memory added unexpected speed to the lazy laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:32:56.000Z",
          "Titre": "The Best Memory",
          "Contenu": "In my opinion, Crucial makes the highest quality memory modules. The memory system selection tool is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:21:10.000Z",
          "Titre": "The gui to select my ram was correct",
          "Contenu": "The gui to select my ram was correct.  Installed my cards and all worked seamlessly.  Very pleased.  Will buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Meyer Topeka KS",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T21:54:26.000Z",
          "Titre": "Laptop Speed Improvements",
          "Contenu": "Acronis True Image application made it a breeze to transfer my operating system off the hard drive onto the new SSD that I bought from Crucial a breeze on my laptop. I can now use the hard drive for backup purposes. The new memory gives me 34GB instead of just 8GB of RAM making the laptop a real speed demon of a laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenden Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T11:32:48.000Z",
          "Titre": "Great Products!",
          "Contenu": "Ordered a 1TB P3 Plus SSD and a 32GB DDR5 Ram kit, both arrived right on time which surprised me being Black Friday and worked perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "Sharat Faqurudheen",
          "Nb_Reviews": 15,
          "Date": "2023-12-21T10:25:54.000Z",
          "Titre": "Reliable, prompt & great pricing",
          "Contenu": "Highly reliable, prompt delivery & great discounts.Buying from Crucial directly ensured a better pricing with reliable shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohanraj Jayakumar",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:26:38.000Z",
          "Titre": "Crucial brand I trust it blindly",
          "Contenu": "Crucial brand is the one I trust blindly . They are pioneer in the storage area. The products of crucial live up to their promises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VICTOR RODRIGUEZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:02:18.000Z",
          "Titre": "Quality, excellence, and reliability",
          "Contenu": "I’ve purchased tech products from Crucial on multiple occasions. Excellent service, excellent products, and excellent prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willaim Bakel",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:42:26.000Z",
          "Titre": "Exactly what I ordered!",
          "Contenu": "Exactly what I ordered!Ordered 2 ram sticks and a 4TB SSD. Overall super satisfied with the parts. This install was easy but the only thing that was a bit rough was the instructions that were provided. Other than that great overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:21:39.000Z",
          "Titre": "Simple and fast",
          "Contenu": "Website info to select the required product was accurate and simple to use.  Order process was simple and fast.  Delivery was fast.  Product installed easily.  Product work as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer HarryByTheSea",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T01:26:39.000Z",
          "Titre": "perfect fast TC for Mac Studio",
          "Contenu": "I needed a fast, large SSD to use as a time machine backup for my Mac Studio;  Crucial X10 Pro 4TB Portable SSD is a perfect solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:46:48.000Z",
          "Titre": "Couldn’t be happier with Crucial",
          "Contenu": "To be honest, I was a little worried about doing my own HD upgrade.  Crucial made it so easy.  The price was great for a 1TB hard drive.  It did take a few weeks to come in.  But once it did, it only took 20 min to install and have running.  Crucial's cloning software couldn’t be easier to use.  And the videos make the transition seamless.  I couldn’t be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Dashifen Kees",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T16:07:36.000Z",
          "Titre": "First and last place I go when upgrading a machine!",
          "Contenu": "Crucial has remained an excellent resource for parts and upgrades for as long as I can remember.  They're the first and the last place I go when I'm upgrading the disk space or memory on my machines and their upgrade finder is the best there is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Waldemar Montalvo",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:42:51.000Z",
          "Titre": "It's a Crucial product, so it will be reliable, fairly priced, has excellent support.",
          "Contenu": "Amazed by the speedy shipping. On my PS5 I got 6111 MB/s transfer rate, which is outstanding. The price was fantastic. Installation was a breeze."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Gettens",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T20:25:12.000Z",
          "Titre": "Make it easy to get the correct ssd update!",
          "Contenu": "when I went order an SSD, they asked about my computer. When I put in the info into my computer they said it was wrong for my configuration and told me which was the correct choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:58:33.000Z",
          "Titre": "Finally was able to upgrade my RAM on…",
          "Contenu": "Finally was able to upgrade my RAM on my HP laptop. Very good price and fast shipping! Worked perfectly!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mark N",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:08:49.000Z",
          "Titre": "Very fast",
          "Contenu": "Very fast. Excellent service, incl a return I needed for stupidity on my part.  Would not hesitate to use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Meyers",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:18:03.000Z",
          "Titre": "The product was correct and worked",
          "Contenu": "The product was correct.  I was adding Ram and the other companies did not have the correct information. You had the information... the product was reasonably priced.  It worked immediately after installation. Very well designed site keeping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Gruetzmacher",
          "Nb_Reviews": 5,
          "Date": "2023-12-22T02:00:06.000Z",
          "Titre": "Always a great shopping with Crucial!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Kilgore",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T00:18:01.000Z",
          "Titre": "Best choice I could’ve made!",
          "Contenu": "I received my purchase well before the expected delivery date and at a better price than everyone else out there.  My item was well package and has performed above all my expectations! The added memory has my four year old laptop running like it’s fresh outta the box!I highly recommend doing business with the folks at Crucial!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T05:26:21.000Z",
          "Titre": "Because it is so convenient",
          "Contenu": "Because it is so convenient, I use the scanner to let me know what I can do to upgrade my storage and memory. I've used it on several computer now and it has always worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 7,
          "Date": "2023-12-15T06:11:39.000Z",
          "Titre": "I have several Crucial memory units",
          "Contenu": "I have several Crucial memory units. They all work well. The Crucial compatibility evaluation site is extremely useful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Pittman",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:42:03.000Z",
          "Titre": "I've used Crucial for quite a few years…",
          "Contenu": "I've used Crucial for quite a few years and always found their products to be of the highest quality and their recommendations for upgrades have always been accurate. I appreciate how easy the website and utilities make the upgrade process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BW",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T20:50:17.000Z",
          "Titre": "Nice website that was very helpful.",
          "Contenu": "Nice website that was very helpful in choosing the correct memory chips for my computer, along with installation guides.  Ordering was easy with free prompt delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lind",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T01:35:50.000Z",
          "Titre": "Easy to search website with sufficient…",
          "Contenu": "Easy to search website with sufficient information to be able to make an informed purchaseQuick shipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hodgie",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:18:17.000Z",
          "Titre": "Crucial has been my go to for years for…",
          "Contenu": "Crucial has been my go to for years for hard drives and memory. Their system Scanner, recommendations, pricing and delivery are all 5 stars. Been a few years since I had the need to use them, and happy to find out still great service, pricing and delivery as in the past. If you have an older laptop or desktop with a non solid state hard drive,  they make the process of do it yourself upgrade to make your machine run soooo much faster and like new, very easy and descriptive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mirek B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T03:04:21.000Z",
          "Titre": "Excellent service and hardware assesment wizard!",
          "Contenu": "You don't need to know what hard drive or RAM is correct for your machine. The Crucial wizard will examine your hardware and will give you recommendations. No guess work!Thank you Crucial!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JD Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:15:32.000Z",
          "Titre": "Specific to my equipment...",
          "Contenu": "Finding the components I need specific to my equipment is paramount and the search engine Crucial uses is the best around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Jacchino",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:59:53.000Z",
          "Titre": "Fast delivery -- great price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sapphire C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:50:04.000Z",
          "Titre": "Good Product",
          "Contenu": "I had received a laptop from my school when taking online classes. After 1 yr, it began to lag and took several minutes just to complete one action. So I decided to see if I could upgrade any if the components because I can't afford a new laptop at this time. So I ran a pc check per the website and it told what parts I needed and so I ordered them and install and now my laptop is running smoothly.  I will definitely be buying from this company again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Old Retired Guy",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T05:18:44.000Z",
          "Titre": "Crucial Is There When an Upgrade is CRUCIAL...!",
          "Contenu": "The items I ordered were delivered on time and I was kept informed as to the status of my order... The product is performing well... I will be ordering more computer upgrade items in the future..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Mattern",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:02:36.000Z",
          "Titre": "Selling me the correct RAM Cards and…",
          "Contenu": "Selling me the correct RAM Cards and doing it for a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "FRANÇOIS Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T07:56:41.000Z",
          "Titre": "fast deliveryand great product",
          "Contenu": "fast delivery , and the most important the memory modules are working perfectly in my amazing PC Desktop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZACH",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T16:53:12.000Z",
          "Titre": "Reliable Memory Modules",
          "Contenu": "Crucial makes a great product in my hometown, so I'm admittedly biased. I appreciate the fact that I can put in my computer model and get memory I can trust. The only drawback was that considering I drive by their headquarters at least once a week, it took over a week to arrive. I found that a little curious."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adrian Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T00:46:31.000Z",
          "Titre": "Most memorable black Friday deal",
          "Contenu": "My son is off to join the Navy and I wanted to ensure he had plenty of storage in his laptop. Thank you very much for making it an easy decision!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Galina Semilyak",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:59:58.000Z",
          "Titre": "It fit perfectly on an ancient laptop",
          "Contenu": "It fit perfectly on an ancient laptop, which speeded up its operation several times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "In-Sheng Cheng",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T05:00:18.000Z",
          "Titre": "Good product and excellent customer service.",
          "Contenu": "It takes a long time to receive my order. The product is good. Customer service is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim McRae",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T18:37:06.000Z",
          "Titre": "Been a customer for 20 plus years",
          "Contenu": "Super easy to select the correct memory very quick to ship at an awesome sale price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:55:53.000Z",
          "Titre": "Memory worked excellent and I got it on…",
          "Contenu": "Memory worked excellent and I got it on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Tran",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T23:12:24.000Z",
          "Titre": "Great price and as advertised",
          "Contenu": "Great price. As advertised. Good shipping time. Installed 64 gigs in Dell 9530 XPS 15. Works and good to go."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:49:09.000Z",
          "Titre": "Excellent pre-checks and delivery",
          "Contenu": "Excellent pre-checks and delivery. It was delivered on time and with exact specs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Sweeney",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T04:06:59.000Z",
          "Titre": "Crucial: Scanner Results",
          "Contenu": "Crucial:What I like about Crucial is their online scanner that allows anyone to determine the most compatible ram memory and SSDs for their system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Guillory",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:53:43.000Z",
          "Titre": "Product came in as described and fairly…",
          "Contenu": "Product came in as described and fairly quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PCL",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:46:44.000Z",
          "Titre": "easy to order",
          "Contenu": "easy to order. DRAM works as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HR Hanes",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:32:24.000Z",
          "Titre": "Our go-to site for PC memory",
          "Contenu": "Crucial always has the PC memory products I need at a good price.  The website is easy to navigate, and shipping is quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Stuart",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:44:50.000Z",
          "Titre": "Delivery could have been faster than the slow",
          "Contenu": "My experience with ya'll was slow and it felt like our order would not be delivery faster"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Mazur",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T14:47:39.000Z",
          "Titre": "Easy to place order",
          "Contenu": "Because my laptop only has 1 ram slot and 4 gb installed and because it has window11 home. It only had 1 gb left for apps. It needed at least 8 gb to run normally so I replaced the 4 with 8 gb. It improved the speed to aceptable levels. It was very easy to use the Crucial website and to place my order. It is not the first time I ordered from Crucial each time it has been easy plus I have not had any issues with the memory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saeed Anwar",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:48:53.000Z",
          "Titre": "Awesome products!",
          "Contenu": "great website. great selection. great prices. I always buy memory and NVME's here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roland Leppanen",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:49:42.000Z",
          "Titre": "The memory works flawlessly at…",
          "Contenu": "The memory works flawlessly at advertised speeds, who could ask for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Panyard",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T12:34:44.000Z",
          "Titre": "Flawless buying experience",
          "Contenu": "Ran the app, ordered the memory, when the memory arrived installed it. No problem whatsoever, couldn’t have been happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:32:56.000Z",
          "Titre": "Good ram for good prices",
          "Contenu": "Upgraded my nitro 5 laptop from the stock 2x8gb to 2x32gb and I’m very happy with the performance increase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Sloane",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T16:02:27.000Z",
          "Titre": "Speed of delivery and it works as…",
          "Contenu": "Speed of delivery and it works as described, more than I can say about at least two of your competitors' products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samson Loo",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T07:47:09.000Z",
          "Titre": "Quality of the product and easy to installed.",
          "Contenu": "Easy to order, excellent price, on time delivery, and easy to installed. But, tracking your oder system is horrible, I can't access to tracking, the email stated, UPS as delivery, delivered by FedEx, which is miss leading or fault information. 🤔"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "frank azzinaro",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T20:14:59.000Z",
          "Titre": "Memory sticks are good quality",
          "Contenu": "Memory sticks are good quality, fairly priced, easy to find what fit my system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T20:28:40.000Z",
          "Titre": "Perfect Match",
          "Contenu": "I did not have problems matching my computer with the memory as I've had while purchasing from others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zeidoon Al-Nashi",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T03:18:53.000Z",
          "Titre": "Best rams and ssd's I have been using…",
          "Contenu": "Best rams and ssd's I have been using since about 25 years"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew F",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:37:31.000Z",
          "Titre": "Easy and accurate ordering",
          "Contenu": "Easy to find the proper memory based on the system selection tool, very reasonable pricing and everything installed and worked great (3 different laptops were upgraded)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen Miller",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T06:45:33.000Z",
          "Titre": "Quality products",
          "Contenu": "Quality products - Excellent web site makes it easy to identify products that will work with my laptop.   Another great experience ordering and using Crucial products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard G",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:04:51.000Z",
          "Titre": "always keep customers in mind",
          "Contenu": "always keep customers in mind. Great service and products. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damon Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:58:23.000Z",
          "Titre": "Great company and great products",
          "Contenu": "Great company and great products. I have used Crucial a few times and never been let down"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Omahoney",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T21:26:43.000Z",
          "Titre": "Easy to choose correct components",
          "Contenu": "The ability to use their software to analyse my system and choose the correct ram and ssd for my pc is extremely useful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T18:32:18.000Z",
          "Titre": "Lower prices on SSD",
          "Contenu": "Lower prices on SSD. Free and quick shipping. Computer scan sofware is perfect. I love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Muchnik",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:12:11.000Z",
          "Titre": "good product",
          "Contenu": "good product, smooth trsaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FD",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T06:26:47.000Z",
          "Titre": "Need RAM or SSD upgrades? Crucial is the place!",
          "Contenu": "Extremely convenient to find RAM and SSD upgrades for your PC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Herman",
          "Nb_Reviews": 19,
          "Date": "2023-12-19T21:50:09.000Z",
          "Titre": "Everything went smooth",
          "Contenu": "Everything went smooth.  I placed the order and had it very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T16:12:55.000Z",
          "Titre": "Easy to select the correct RAM memory",
          "Contenu": "Easy to select the correct RAM memory. Product arrived in perfect condition. A breeze to install. The product works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harvey Glazer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:54:27.000Z",
          "Titre": "Good products",
          "Contenu": "Good productsGood PriceSpeedy delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Picard",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:59:33.000Z",
          "Titre": "Exactly what the computer needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald S.",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T18:55:30.000Z",
          "Titre": "Quality products delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack J Takemoto",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T22:51:48.000Z",
          "Titre": "The web site and the information is…",
          "Contenu": "The web site and the information is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Heath",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:53:27.000Z",
          "Titre": "First time buyer",
          "Contenu": "iPad recently died and needed to get an old laptop working again. Install was easy but the drive didn't fit in the sled? The drive fit fine without it but would've been nice if I could have used it. I've only used it a few times since installing but so far so good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erick Omar Mosqueda Cortes",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:17:42.000Z",
          "Titre": "Good service",
          "Contenu": "They are ver helpful with the orientation even after finish the purchase you are able to find additional information"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Neal",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:00:11.000Z",
          "Titre": "Great product and super easy…",
          "Contenu": "Great product and super easy transaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Lynch",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:47:40.000Z",
          "Titre": "Product priced competitively which was…",
          "Contenu": "Product priced competitively which was considerably less than what the OEM provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T07:50:43.000Z",
          "Titre": "Nice",
          "Contenu": "Nice and informative website  > all the products I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Bielski",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T22:40:24.000Z",
          "Titre": "Can't be any easier",
          "Contenu": "Can't be any easier than to scan your system, be presented to your available upgrades, and then add to cart."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Axel Anders",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:24:52.000Z",
          "Titre": "Great discount on a quality product"
        }
      ]
    }
  ]
}