{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.simplybits.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa LaValle",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:34:28.000Z",
          "Titre": "I am trying to cancel my internet…",
          "Contenu": "I am trying to cancel my internet service. It is the most intermittent and slow internet I have used since dial-up back in the 90s!!! After 4 phone calls and sitting on hold for an hour…finally get a call back. After giving the rep. my info he tells me he can’t cancel my service, and someone will get back to me shortly….right! I guess I am gonna have to call my bank and tell them not to allow auto payments for Simply Bits. Worst customer service ever!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T19:52:49.000Z",
          "Titre": "No call to install.",
          "Contenu": "I never got a call to schedule installation. I since had to leave town for a week or so so I may be paying for nothing. I am having surgery on September 12 and will then be unavailable for at least a week to meet any installation personnel. Please advise how to resolve this issue. Larry Klose529-603-3498"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2022-03-28T19:25:41.000Z",
          "Titre": "Poor service over weekend",
          "Contenu": "I was WITHOUT service for whole weekend!  Over the weekend their technicial service dept told me several times that it was a maintenance issue.  FINALLY, Tucson office answered their phone at 11:00am Monday   & transferred me to customer service who told me I needed to upgrade my rooter monthly.  I called back & was told they would look into it & call me.  Service immediately came on & they never called back.  Use ANY OTHER service company.  They are soooo disfunctional & unprofessional!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Ogram",
          "Nb_Reviews": 1,
          "Date": "2021-05-15T18:47:55.000Z",
          "Titre": "Service?",
          "Contenu": "If you don't need your internet connection for business, then Simply Bits might work.   We had three different businesses trying to run when the system went down and we didn't even get much more than a call back for two days.   Customer, be wary."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy Tatman",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T16:32:29.000Z",
          "Titre": "Lack of Customer Service",
          "Contenu": "I was to have service set up on Dec 2nd and when the installer got to our house and spent a good 30/40 mins trying to connect to your tower I was told that he couldn’t install today and that someone would call me and fill me in on why I it wasn’t installed..I’m still waiting for that call…."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Minor McDaniel and Pamela McDa",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T20:36:47.000Z",
          "Titre": "Simply bits is not fully functional in…",
          "Contenu": "Simply bits is not fully functional in my home I don't believe it was finished installing. We need someone to help finish the installation. The young man who installed it was very good but he was having trouble getting my phone to connect and we also  have bought a new printer since then.Is there anything you can do that will not cost us any more than we have paid already. We appreciate your help thankyou. Pamela McDaniel and Minor McDaniel."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas MacLeod",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T23:19:30.000Z",
          "Titre": "Management is beyond terrible",
          "Contenu": "Management is beyond terrible. Client for several years but a billing issue and customer service mismanagement  caused me to cancel service. Problem started in May and is not resolved and without refund. Rude personnel. Terrible!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 3,
          "Date": "2022-07-31T16:08:49.000Z",
          "Titre": "We got Internet installed last Monday…",
          "Contenu": "We got Internet installed last Monday for my 86-year-old dad so we could put video cameras in his house because he wants to continue to live alone. Simply Bits Internet only worked for two days and it’s been off ever sence. It says that there’s not enough Internet strength to run the cameras. There’s only two. And he doesn’t have Internet for anything else in the house. The staff had me make an appointment for Monday for us to come back to Tucson go to his house and reset some things. This is not gonna work for us. If it was working before it should work all the time with  No problem. We have Simply Bits with six cameras at our summer home and they work all the time and we’ve had that service for three years. So this is definitely disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cella core",
          "Nb_Reviews": 6,
          "Date": "2023-07-15T18:41:40.000Z",
          "Titre": "i have had intermittent internet for…17 days",
          "Contenu": "i have had intermittent internet for the last 17 days. their support is worse then dog crap, their service is no service at allstay away far far far far away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susannah Castro",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T16:54:38.000Z",
          "Titre": "If I could give them 0 stars I would",
          "Contenu": "If I could give them 0 stars I would. I was a customer for over 12 years. They have now fraudulently charged my card for fees that they cannot explain. Customer service is terrible. Beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Buckert",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:41:48.000Z",
          "Titre": "No one called"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T16:56:08.000Z",
          "Titre": "I am unable to work from home with your…",
          "Contenu": "I am unable to work from home with your system. I have left messages and no one calls back. I talked to a tech in Toronto 2 weeks ago and he was a jerk. Likely I am going to have to turn your service off if it will not work with the company I work for. Someone needs to call me asap. 5208506027. Thank you. Tina"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T12:13:46.000Z",
          "Titre": "I still haven't received a call",
          "Contenu": "I still haven't received a call regarding service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T04:34:12.000Z",
          "Titre": "Place a order a week ago I haven't…",
          "Contenu": "Place a order a week ago I haven't heard nothing back yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T00:55:36.000Z",
          "Titre": "Never received a call back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suz Thor",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T17:28:06.000Z",
          "Titre": "Just be aware there is no support on…",
          "Contenu": "Just be aware there is no support on the weekends."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T01:15:25.000Z",
          "Titre": "Frustrated",
          "Contenu": "I was able to set up my appointment easily no problem. But I am unable to review the service because you cancelled. You told me that there wasn’t enough to go around and you are unable to provide service. Pretty sad since there are few options in the rural area. No cable or DSL, satellite is horrible service. I’m still waiting for a callback on becoming a hub home. Your website states that you contact the owner within 2 business days. Day 3 and still waiting..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd P",
          "Nb_Reviews": 6,
          "Date": "2020-05-05T22:16:18.000Z",
          "Titre": "Very Unreliable Support",
          "Contenu": "Simply Bits has been unable to provide the internet service we pay for since Feb 14th, 2020.  We have repeatedly called and emailed and have been told someone will contact us within 24rs.  We have now been waiting several days for a technician to fix their reoccurring problems. Every time we call them, we have to start back on the bottom on their queue, go through all the questions again, only to be promised someone from a higher department will call us in 24 hrs.  I used to love 'em... not anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Inman",
          "Nb_Reviews": 2,
          "Date": "2021-02-02T16:36:36.000Z",
          "Titre": "False advertising i called on a friday…",
          "Contenu": "False advertising i called on a friday and was told service was available placed my order on the following monday and recieved a call on tuesday saying service was not available yet they continue to advertise availability on line and with signs place in front of our neighborhood"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2016-11-02T22:32:38.000Z",
          "Titre": "Unprofessional Installation",
          "Contenu": "If you want things done poorly and incorrectly, look no farther. There is literally a hole in my wall with a cable running out of it. No wall plate option available, which is a very inexpensive part to offer. Step up to what cable installers have used FOREVER. Dishonest when describing install over the phone & unapologetic after several phone calls expressing dissatisfaction. Go somewhere else and save yourself the hassle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Inman",
          "Nb_Reviews": 2,
          "Date": "2021-02-02T21:19:54.000Z",
          "Titre": "I called and verified service…",
          "Contenu": "I called and verified service availability on Friday and ordered the following Monday only to be told on Tuesday that service was in fact not available in my area this is after i had already canceled my existing internet provider you guys suck sweaty balls 😢"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2017-01-17T23:11:20.000Z",
          "Titre": "I'm not happy that I have a 2-year contract I was not aware of until I tried to cancel my internet service.",
          "Contenu": "I'm not happy that I have a 2-year contract I was not aware of until I tried to cancel my internet service. The cancellation fee is atrociously high and I'm very unhappy about continuing to be charged monthly until I could pay the \"cancellation fee\" which I cannot afford being homeless now and without a job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 5,
          "Date": "2017-01-12T19:18:10.000Z",
          "Titre": "Lacking",
          "Contenu": "As a company there is zero concept of customer service while the advertise high speeds the number of bottlenecks that occur are extreme one is lucky to get 2 mb not the 20 they claim.   When one tries to engage to get the problem solved they dont care just tell you can go elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J. Millet",
          "Nb_Reviews": 1,
          "Date": "2020-07-18T20:23:59.000Z",
          "Titre": "My service?",
          "Contenu": "My service?? was installed Monday July 13th and appeared to be working but Tuesday July 14th , I tried to use the internet but could not get the server Simply Bits to respond!  I called your tech? service and we took pictures and got four number codes to send to the main office !! They were supposed to contact me on Wednesday but no call!  I contacted the Tech number same routine but the main office was supposed to contact me ASAP!  Still no contact or internet.  I called today July 18th,  the main office is supposed to contact me on Monday!! I am not impressed with your company and having people to resolve problems!! Judy Miller"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elijah Kuntz",
          "Nb_Reviews": 1,
          "Date": "2019-06-21T09:14:40.000Z",
          "Titre": "Worst internet I’ve ever had",
          "Contenu": "Honestly, this is the worst internet service I have ever had. It is slow, disconnects often, and their support is useless. Unless your only other is option is satellite, go with anybody else and save yourself many headaches."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T10:29:33.000Z",
          "Titre": "Excuses",
          "Contenu": "Extremely disappointed in the skill of the installer.All he could dp is find excuses why he couldn't do the install. Then had the nerve to try amd charge me for something he didn't do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2018-02-27T17:33:53.000Z",
          "Titre": "I originally signed up for 25 mbps",
          "Contenu": "I originally signed up for 25 mbps, was told I could only have the 10 mbps plan. However, in reality, I typically only ever get 4-5 mbps ... if even that. I’m very disappointed in the speed of this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cory",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T01:00:42.000Z",
          "Titre": "pricing and packages",
          "Contenu": "pricing is too high for the speeds offered. They have monopoly in the area.  When I did have issues. They would not listen to the customer.   and after months of complaining and replacing routers.  THEN they finally fixed their equipment.No compensation to the customers was given....Oh wait there was that free 30 period that the gave us,,,,  but we had no internet service during most of that time........is that customer service?I would drop them in a second if I could find better prices and speeds....in fact  cable is 200 yards away and I'm thinking about paying the $2000. to get it ran to my house.Not once have they offered to upgrade my equipment to \" better faster\"....thanks  for asking my sidedo not share my email address with other business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teri McGuire",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T15:36:32.000Z",
          "Titre": "Appt issues",
          "Contenu": "I set up an appt for install on 2/7/2020. Got a call that they couldn’t install so they were going to come on 2/8/2020. I had to work but my husband would be home. I had told the girl several times that we are at unit 11. I get phone calls while I’m at work asking where we are. When I called back at my first break, they had left & the girl did not record our unit number. I had to take off work again to reset up install date because your business hours aren’t very flexible. Then I get told by a rep install won’t be available until 2/21. I have to wait because of someone’s screw up. At this point, I have been late to work twice because you aren’t open outside of 8-5 mon-fri & I’m not going to have working internet for 2 weeks because of someone’s mistake. This is now how to start a business relationship. In the meantime, I’ll be looking elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T01:53:59.000Z",
          "Titre": "Extremely poor internet service",
          "Contenu": "I can't wait for my contract to be up.  Simply bits has proved to be the worst internet possible provider I've ever had.  I will definitely change in the spring."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Djmelrock",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T02:45:45.000Z",
          "Titre": "Horrible",
          "Contenu": "Couldn’t get service at my house. And the guy just left and wouldn’t tell us anything. Horrible service . Why advertise if it doesn’t even work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marilyn Myers",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T16:09:09.000Z",
          "Titre": "Worst internet service ever",
          "Contenu": "Worst internet service ever. Started out great two years ago now we cant get anything. Sporadic and sketchy internet. When I did the speed check that their tech told me to we got download of 0.5 and an upload Mbps of 0.0 . They just billed me 90 $ and provided no to little service at all. Their service Desk is even worse I called 3 times in the same day was told it required a higher level of technician and I would be called back in 2 hours To resolve the issues No one ever called after 21/2 hours I called them back . Response was oh don’t know why they didn’t call you we'll have them call you within next 2 hours. Still no call I called again got the exact same response . It has been over 48 hours and I have not received a call from their service dept. This is fraud ! They are known to throttle back service intentionally to old customers while providing new customers adequate service. What a terrible way to treat your loyal customers. Shame on you !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clinton",
          "Nb_Reviews": 2,
          "Date": "2020-07-11T17:09:49.000Z",
          "Titre": "what the hell",
          "Contenu": "Still waiting contacted on Thursday no contact back on Friday it is now Saturday I have no Internet I would like Internet what the hell"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2019-10-25T05:31:34.000Z",
          "Titre": "If I could give it zero stars I would",
          "Contenu": "If I could give it zero stars I would. I highly suggest you stay away from simply bits Internet. Their service is excessively unreliable. Technical support is only available from 8 to 5, in other words, during your working hours. Therefore when your Internet isn’t working (which you don’t notice until you are home after work) there is no one that can help you. If you call them during your lunch it’s pointless because you need to be home to troubleshoot. There has not been a week in my last 4 months that my Internet doesn’t go out. Worst part is that you get locked in to a contract. Honestly, all I want is to revoke that contract and just go back to cox. This service is absolutely pathetic and I will not stop putting this terrible service on blast on every community Facebook page until my contract is over. Ironically, as I am writing this review, I am without internet and using my cellphone hotspot. It’s just terrible. Please, do yourself a favor and stay away from Simply Bits."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-11-02T16:46:21.000Z",
          "Titre": "Not available in my area"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T17:43:09.000Z",
          "Titre": "Terrible!!!!!!!!!",
          "Contenu": "They have terrible service very inconsistent and they have data caps so if you have children this is NOT the company to use!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2016-11-11T20:21:06.000Z",
          "Titre": "signal",
          "Contenu": "We cannot access a fast enough speed to use this service on our smart tv.poor speed on laptops and smart phone using router."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia Reed",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T20:48:09.000Z",
          "Titre": "Was great until the equipment quit working.",
          "Contenu": "We've had Simply Bits for over 10 years now, and overall had a good run with infrequent outages, UNTIL we started having huge problems the past 3 weeks from old equipment that is now malfunctioning so rarely working and we cannot get any resolution. We have called over six times, and never gotten a call back. The internet is only working less than 20% of the time, and it flickers on and off which prevents any page from loading correctly or any zoom call from going through. It's a huge problem during this pandemic as work requires a consistent connection for an internet based program and frequent zoom style meetings so I am having to use my cell as a hotspot (and I am definitely not looking forward to getting that inflated phone bill.) At this point we'd be happy to increase our service plan and sign a new contract IF they would just give us a whole new set of equipment as if we were brand new customers, but we can't even get an answer on that. I don't know if covid is what has them all discombobulated, but I cannot afford to pay for both a \"non\"-internet plus a cell phone hotspot at a premium cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Long",
          "Nb_Reviews": 2,
          "Date": "2019-08-25T03:44:55.000Z",
          "Titre": "Worst internet around",
          "Contenu": "Worst internet around. Won't return calls. No service in till 9 am and drops at 8 pm. Don't use them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T21:23:12.000Z",
          "Titre": "You did not show up Friday and…",
          "Contenu": "You did not show up Friday and rescheduled for Wed. I will write another review then if you show up. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-29T04:13:05.000Z",
          "Titre": "If you cant deliver an installation for…",
          "Contenu": "If you cant deliver an installation for a month, you need to do something to fix it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kerri Smeltzer",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T20:14:43.000Z",
          "Titre": "Cancelled",
          "Contenu": "I loved the service they provided!! Unfortunately when I bought a new house they didn't service my area I was bummed out.. but I understood I moved to a rural area. So I had to cancel my service and much to my surprise they charged me the full cancellation fee for breaking the agreement.. I could understand charging the fee if I just decided to cancel but I didn't I bought a new house and can't control where you service and don't!!! So I canceled and told them to bill me the cancellation fee as I just moved and didn't have the 200$ upfront nor was I going to pay for a service I wasn't using!!! So I was told I would be billed and to my surprise they automatically charged my credit card 100.00 I called them to find out how they did that and why and the card they had on file was expired... I never gave them my new information there billing department changed the expiration date until the card went through... talk about fraud I never authorized that payment!!!! Then I told them to not charge the other hundred dollars to call me so I can authorize the payment... guess what they never called they sent me an email saying they charged my account!!! Once again I never authorized the payments!! I was heartbroken to see this kind of business being done after the Internet service was so wonderful!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DLee",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T23:24:59.000Z",
          "Titre": "Too soon to ask",
          "Contenu": "You are asking my opinion of something I won't have yet for over a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T01:44:25.000Z",
          "Titre": "Works great",
          "Contenu": "Works great ⭐️"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2017-11-15T15:24:52.000Z",
          "Titre": "Download speeds too slow.No receiving …",
          "Contenu": "Download speeds too slow.No receiving the speed I paid for!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Belissa",
          "Nb_Reviews": 1,
          "Date": "2018-06-28T06:46:46.000Z",
          "Titre": "Internet",
          "Contenu": "Could not get in area and waited a week for nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T16:14:29.000Z",
          "Titre": "Can’t review if you did not get me…",
          "Contenu": "Can’t review if you did not get me service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer Len paradise",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T18:39:48.000Z",
          "Titre": "No follow up on tower problem from sales-follow up",
          "Contenu": "No follow up on tower problem from sales"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Lacinski",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T02:22:08.000Z",
          "Titre": "Simply Bits No-Show",
          "Contenu": "The Simply Bits Tech was a no-show for a apptmt today (11/06/23). I never rcvd an email, text or phone call. I left work early so I could meet the tech at 3:00 PM…to say I’m upset would be an understatement!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T00:19:34.000Z",
          "Titre": "After waiting for at least 15+ minutes…",
          "Contenu": "After waiting for at least 15+ minutes the support person said she could not reset the modem because our router was not Simply Bits. We have trouble setting up our computer and smart TV and was working with Google support because it’s their router. Their suggestion was to have the modem reset. So our internet, except to our iPhone, doesn’t work and we can’t get help from you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T05:26:23.000Z",
          "Titre": "My service guy Oscar was amazing",
          "Contenu": "My service guy Oscar was amazing.  He was very professional.  Unfortunately, he left because he could not get a signal from any of the towers.  Sadly, Simply Bits did not come through with the plan I thought I was getting.  Needless to say, I still do not have internet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T21:38:37.000Z",
          "Titre": "No service for us",
          "Contenu": "No service for us. We called to ask if it was available, they had us hold so they could make sure we could get service and we were told yes. A couple of days later the technician called to tell us we were not eligible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Almost Customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T20:58:45.000Z",
          "Titre": "Awesome customer service, no service",
          "Contenu": "Awesome customer service, but wasn’t given the service promised to me. Tech sent out to my place didn’t explain much. Just left after not installing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Irene",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T08:28:49.000Z",
          "Titre": "Was really disappointed that your…Disappoing",
          "Contenu": "Was really disappointed that your services would not work at my residence.  I cannot come up with a 6 foot pole!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T12:35:22.000Z",
          "Titre": "The installer was unprofessional",
          "Contenu": "The installer was unprofessional. He constantly complained about prior customers and caused damage to our siding when drilling through it. Not impressed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Martin",
          "Nb_Reviews": 2,
          "Date": "2021-04-14T02:24:40.000Z",
          "Titre": "Local ISP but outsourced support, also carrier-level NAT",
          "Contenu": "The Good: service is reliable so far; getting speeds close to advertised (25/7 mbps). More upload bandwidth than the other WISP (Bluespan). Friendly install technician (Justin) wore a mask inside and did a clean professional job. No long-term contract or cancellation fee means it's low risk to try.The Bad: Simply Bits has chosen to put your router in jail behind carrier-level NAT with a private IP address that is not routable from the rest of the internet. This means that if you want to connect to devices on your home network from somewhere else (e.g. using VPN or port forwarding), you need to use some other workaround (like a Wireguard tunnel to a publicly routable server somewhere else). SB does not warn you of this, you only find out once you buy the service and see that your router gets a WAN IP address in private (RFC 1918) space. Yes, the world has only 4 billion public IPv4 addresses, but $100/month service should get you one of them, or at least a public IPv6 address. SB will sell you a public, static IP address for an extra $15/month on top of service that is already more expensive than the cable company. Nearly every other residential ISP (including Cox) gives you a dynamically-assigned public IPv4 address as part of their basic service offering, no extra charge.The Ugly: SB has outsourced their tech support to the lowest-bidding call center whose primary job is to prevent you from talking to anyone local who knows what they are doing. On day one, I called to ask for help diagnosing an ethernet duplex mismatch between SB's CPE radio and my own network gear. I had a simple request for SB: try manually setting the network port on their radio to full-duplex, let me test, then set back to auto-negotiate, and let me test again. To anyone who has dealt with computer networks for a living, this is a basic, easy request, but it greatly confused the outsourced CSR who was hesitant to escalate it. Among other chaff and flares, he told me it was after hours and I would need to call back tomorrow between 8 AM and 5 PM... at 3:08 PM, on a Monday! After being told to contact my network equipment vendor about 6 times, he finally transferred me to a local Simply Bits engineer, Cody, who immediately understood the request and helped me resolve it. I wish SB would just let me speak with someone like Cody when I need it. The outsourced tech support is unprofessional and insulting, especially for a local company that might ostensibly care about local customer support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-24T15:55:15.000Z",
          "Titre": "Have not heard back from Simply Bits…",
          "Contenu": "Have not heard back from Simply Bits regarding a my fixed IPplease respondthanksPaul"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T18:50:04.000Z",
          "Titre": "Your representative was very helpful…",
          "Contenu": "Your representative was very helpful and professional. However, even though we had a very strong signal. when he tried to activate our service he was denied because the tower was filled to capacity. This should have been determined when we first called. Instead everyone's time was wasted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T17:34:23.000Z",
          "Titre": "Simply Bits gave us a great deal and a…",
          "Contenu": "Simply Bits gave us a great deal and a fast internet! With five children attending school it is crucial to have a good signal. Jay came to do the installation and he stayed past his shift to make sure we had internet in every single room. I will definitely be recommending Simply Bits."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tucson Dad",
          "Nb_Reviews": 1,
          "Date": "2016-11-07T16:23:27.000Z",
          "Titre": "Simply Bits is okay, but not great",
          "Contenu": "The data rates are low for the price they charge, connection seems to go down about once per week, and they force you to sign a new contract even if you want to INCREASE your data rate.  I can't think of the last time a company wanted to punish me for trying to give them more money.  If I had a better alternative that didn't involve a significant up-front cost, I would take it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raul",
          "Nb_Reviews": 1,
          "Date": "2016-11-02T00:38:47.000Z",
          "Titre": "Cost is high compared to data speed offered. Iffy connection",
          "Contenu": "Connection is inconsistent. Tech support service hours are horrible if you are a home user. If you call after 5 p.m., you have to wait to get someone to call you back. If you open a ticket, you may or may not have someone call you back and let you know the status.  I honestly wish there were another game in town, but Comcast is not an option, so I'm stuck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frederika",
          "Nb_Reviews": 1,
          "Date": "2016-11-18T02:17:31.000Z",
          "Titre": "Too slow for multiple devices",
          "Contenu": "For one user the service is great, but as soon as a second user connects to the network, the internet signal becomes very slow. For example, watching videos with a decent resolution becomes impossible and web pages take ages to load. All of this, while we purchased the second best package for \"above average\" internet usage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T21:48:41.000Z",
          "Titre": "Internet Provider - no other choice",
          "Contenu": "We have no internet through cable or telephone lines in our area (yet).  This product works however the speed is not sufficient (we are at the highest price/speed level)It works for email and surfing/shopping but we cannot stream HDTV as easily as other providers products.  Need more speed for lower price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T01:03:12.000Z",
          "Titre": "All good except for one thing",
          "Contenu": "We had a positive experience except for one thing: the technician pooped in a box and left it in our trash can for us to find. And he didn't even try and put it underneath anything but just stuck it in there. We understand, sometimes there is an emergency. However, since he was already obviously prepared with napkins and a box for it, the least he could have done was take it to a dumpster or to a gas station to dispose of it, instead of leaving it to stink up our front yard. This was just a very strange and gross experience that hopefully is not something he does often. Aside from this, we had no complaints."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Panchie",
          "Nb_Reviews": 2,
          "Date": "2016-11-01T02:04:58.000Z",
          "Titre": "I called  about an issue, i felt brushed off.",
          "Contenu": "The after hours tech wasnt listening. My needs were never met, and after some frustration, I was  told I'd get a call back from  someone during  business hours. Never happened.. I  feel I  was conned into a contract. We live and we learn I guess.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vadim",
          "Nb_Reviews": 1,
          "Date": "2016-11-09T22:40:12.000Z",
          "Titre": "Limited \"unlimited\" internet",
          "Contenu": "They do not tell it but do limit data volume you can receive/transmit. It is not written in any customer contract. Very annoying. Will immediately switch away as soon as Cox or some other high speed internet becomes available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2018-06-27T03:31:29.000Z",
          "Titre": "Tanya is not the right person to talk…",
          "Contenu": "Tanya (the person that manages the installation technicians and sets install appointments) is not the right person to talk to potential customers. On the phone, she enumerated every possible problem we could have, along with every possible way the service would not work.At one point, I thought she was turning us down as potential customers, or that we would need to do more work on our house to provide more slack of the CAT5 ethernet wire for her technicians.The phone call was a frustrating experience.Further, we scheduled the install appointment for a Friday AFTER noon. However, for some reason, the technicians came to our house at 8am!Very poor experience with the first steps of getting your service installed. We went with a better (lower-hassle) alternative and we are happy with it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2016-11-01T05:28:01.000Z",
          "Titre": "Disappointed in the reliability of the data rates vs what I pay for.",
          "Contenu": "I am happy with the response I get when interacting with the service tech, but the problem with the data rates is a recurring one.  Don't feel I am getting my money's worth."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James M",
          "Nb_Reviews": 2,
          "Date": "2017-01-12T20:42:50.000Z",
          "Titre": "Fluctuating download speeds are a severe problem",
          "Contenu": "Speed Test based measurements vary wildly and are especially low evenings.  Promised download velocity RARELY met.  Problem has accelerated and intensified last two months."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T20:08:19.000Z",
          "Titre": "Simply Bits",
          "Contenu": "It took me over an hour to contact Simply Bits with many hang up from their end!Also does not appear that one hand knows what the other one is doing!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2017-10-31T20:04:02.000Z",
          "Titre": "A is for effort",
          "Contenu": "Our internet speed is somewhere close to dial up. Numerous attempts to fix this have failed but they are still trying and I give them credit for that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-23T23:58:04.000Z",
          "Titre": "It happens...",
          "Contenu": "Not that your service isn't great but your tech came to install and couldn't install because you couldn't read a steady signal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renae",
          "Nb_Reviews": 5,
          "Date": "2017-05-15T21:08:07.000Z",
          "Titre": "Unable to use my laptop on the wifi",
          "Contenu": "I'm happy that I am able to get Netflix with my service but disappointed because my wifi signal isn't strong enough to use my laptop."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Georgina",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T17:47:11.000Z",
          "Titre": "1st time customer",
          "Contenu": "Not happy with service overall.  Inaccurate info provided pertaining to service and installation from the get go.  Will not recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn Q",
          "Nb_Reviews": 2,
          "Date": "2020-01-16T22:09:16.000Z",
          "Titre": "Installation was great",
          "Contenu": "Installation was great, guy was wonderful but this is not good for gaming systems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-01-21T23:01:38.000Z",
          "Titre": "the size and height of the disc was not…",
          "Contenu": "the size and height of the disc was not compatible with our home."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2016-11-01T22:33:08.000Z",
          "Titre": "lots of outages at all hours of the day and night"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 5,
          "Date": "2023-11-03T01:20:43.000Z",
          "Titre": "Gone Downhill!",
          "Contenu": "I've been with this company for over 10 years, they used to be great, but since they were bought by Ting they have gone downhill. I am currently on hold now trying to cancel my service. I have been on hold for over 2 hours, just like last time I called. They need to scrap this new horrible phone system.I will say the longtime employees that are still there are still the same friendly and helpful people and the system is reliable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:21:42.000Z",
          "Titre": "Great customer service, connectivity not so great!",
          "Contenu": "The customer service portion is excellent, we have ongoing issues with connectivity"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T23:55:59.000Z",
          "Titre": "I was not able to get the service but a…",
          "Contenu": "I was not able to get the service but a neighbors attenua could have been adjusted to accommodate. Company said they were too busy to entertain doing this in the short term."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wendy Bailey",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T17:55:35.000Z",
          "Titre": "Still no installation scheduled",
          "Contenu": "I started the process of signing up for internet services through Simply Bits about 2 weeks ago.  They still have not contacted me to schedule the install or to explain or apologize for the delays.I would also like to suggest that they adjust their associates hours at least two days per week to 10 am to 7 pm so a larger amount of their customers and potential customers can call them.  The current hours are 8 am - 5 pm and so are my hours.  This is not practical."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monica Castillo",
          "Nb_Reviews": 3,
          "Date": "2022-10-18T16:45:32.000Z",
          "Titre": "I am hoping this Internet service is better than the last one we had",
          "Contenu": "Everything went well up into installation. Now the technician was early. Which wouldn't be a bad thing except for we were not home. The fact that he did the work outside before my husband came home was not OK. And the communication between The scheduler and the installation was not clear cut-and-dry. But we have Internet. I am hoping for the best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T15:16:21.000Z",
          "Titre": "The technician was on time and very…",
          "Contenu": "The technician was on time and very polite. I was not happy that after I initially signed up and received my confirmation email I never received the phone call to schedule installation. Almost 2 weeks later I finally had to call in and find out what was happening.  They said a glitch in the system. That’s probably true it’s not a great start."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mt Lemmon service",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T18:26:27.000Z",
          "Titre": "We tried to get service on Mt Lemmon",
          "Contenu": "We tried to get service on Mt Lemmon.  The line of site for the tower was visible but the frequency could not be found.  Technician did everything he could to get  the signal.  He deserves five stars for working hard to get it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-09-25T01:11:39.000Z",
          "Titre": "Just bought the house and converting…",
          "Contenu": "Just bought the house and converting the account. Unsure if the rate is the best, seems a bit high according to the Dish installers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T23:15:53.000Z",
          "Titre": "Lost no status update.",
          "Contenu": "I'd really like to get service from Simply Bits, but Ive yet to receive an email or call about what my status is? Currently I'm lost and still waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T00:13:17.000Z",
          "Titre": "No signal",
          "Contenu": "I tried to get simply bits installed at my cabin but could not get a signal so it was all for nothing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T03:59:24.000Z",
          "Titre": "Unable to hook up to coax.Would have…",
          "Contenu": "Unable to hook up to coax.Would have had to drill holes & lay cable across the great room floor so decided against the install."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shari Scott",
          "Nb_Reviews": 2,
          "Date": "2021-11-27T17:46:17.000Z",
          "Titre": "This service is pretty good during the…",
          "Contenu": "This service is pretty good during the day, but at night the service is terrible!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T14:57:10.000Z",
          "Titre": "Slow",
          "Contenu": "It works, but very slow and flickers out sometimes. Wish there was a better option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paola",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T22:23:10.000Z",
          "Titre": "Simply Bits has a great price, but they have trouble with customer service.",
          "Contenu": "My husband and I had to call them every other day for about a month to get them to send a representative to our house to fix our Internet connection. All the representatives we would talk to said our signal was fine, when in fact, we had no Internet access. Once someone went to our house though, he was very apologetic and couldn't believe it took the company so long to contact him and send him to our house."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2016-11-08T22:53:02.000Z",
          "Titre": "Lacks Customer appreciation",
          "Contenu": "I signed up with them when my only other choice was phone wire Century Link (1.3mps) and was happy to get the service ( 4+mps) for the about same money. That was the good part. However, when I moved, Simply Bits charged me $130 when I was moving to an area with about 3 other choices. Guess who I'm dropping when my contract runs out?  (Direct TV took $50 off a month for a year when I moved for staying with them)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Augustin",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T03:08:49.000Z",
          "Titre": "Rio Rico, Arizona",
          "Contenu": "Typically very reliable with extremely limited down time except for this past summer. Their service became overloaded over the summer and speeds were down to ~1M while we were still being charged $89 for 12M. Ended up getting some credits and the customer service team was very responsive. They all seemed to know that their service was overloaded and their equipment was outdated. It's been back to normal with consistent high speeds lately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T23:16:56.000Z",
          "Titre": "Acceptable alternative",
          "Contenu": "Even though we live in town we can't get cable internet. We're pretty happy with the speed and bandwidth of simply bits. Our router has to be reset often which they say is likely a router problem as opposed to the internet and I'm sure that's likely. The price is right on the high end of what I'd be willing to pay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renato Wong",
          "Nb_Reviews": 2,
          "Date": "2016-11-09T22:35:21.000Z",
          "Titre": "A good but expensive service",
          "Contenu": "There aren't a lot of ISP that could deliver the service in my home area. I haven't look into it, but I think Simply bits is the only ISP that offer no caps in the service.However they hook you up in a three years contract, maybe a little expensive for the speed they offer. Since they use antennas sometimes the services is not that good.If there is a cheaper/better ISP in my area when the three years have passed, I don't think I would keep the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Milligan",
          "Nb_Reviews": 3,
          "Date": "2020-06-16T20:36:06.000Z",
          "Titre": "Slow to respond, Installer with Attitude!",
          "Contenu": "It took you longer that I would have liked to set-up installer, installer arrived and wanted to take easy way out on install, not acceptable to drill holes through my block walls.Communications were almost non existent. If you want my business please show a bit more respect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobbi",
          "Nb_Reviews": 1,
          "Date": "2017-11-01T14:55:16.000Z",
          "Titre": "Service is satisfactory",
          "Contenu": "Service is satisfactory. We had some issues about a month ago. Called the tech and the problem is now corrected.  I kind of expected a small credit on our bill because we endured the  problemishes for almost 2 weeks (lack of signal getting through). This problem was \"in the office\", so was not due to anything on our end, but was an issue at Simply Bits. But did not receive any compensation for the lack of service we are paying for.   In addition,  we believe the price is a little high, but are willing to live with it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Hickey",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T19:55:39.000Z",
          "Titre": "Simply Bits did not work out at my residence",
          "Contenu": "Simply Bits did not work out at my residence, could not get reception, not their fault. My issue is that I paid about $134 and because of not being able to get reception, I have nothing to show for this monetary outlay. I did not think this was fair so I contacted Simply Bits about this several days ago and was told someone would get back to me that day to discuss possible bill reduction and here we are on day 7 and nobody has contacted me from Simply Bits. Not cool on their part, lack of follow through leads one to believe that they don't care since I'm not a customer anymore."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T01:04:06.000Z",
          "Titre": "Been with them for about 7 years, but could be better",
          "Contenu": "Speeds are not competitive for the price. Service has been good overall. But it is really hard to pay 50 a month for this speed. I am hoping other options come soon or bump my speeds. I should be able to have at least 20MB download speeds for $50 a month.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T20:21:05.000Z",
          "Titre": "Had to move",
          "Contenu": "We enjoyed our Simply Bits account but got a new house without stairs. Not in Simply Bits area anymore, they charged me $200.00 for early contract closing. They also charged me for another month of service.Read the small print."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T23:27:36.000Z",
          "Titre": "Unclear Billing Practices",
          "Contenu": "Not clear on their billing practices. Charged me on the 5th of February for 1 month of service then charged me again on the 25th of February before I got payed. They then dinged me $25 fee for a declined payment when it's been only 20 days from my last payment. They then send me an email after the late charges are assessed and state they \"always invoice\" the 20th of every month. This only after I sent them an email asking why I was being charged twice.I gave 3 stars bc other than the shady billing practices I have no complaints on the performance of the internet thus far. Sadly, I really wanted to share a good review for this company but this issue can not be overlooked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 4,
          "Date": "2016-11-09T22:04:46.000Z",
          "Titre": "Decent provider when you have few options",
          "Contenu": "I live where I have no higher speed internet options, and only a few similar speed options.  If I had access to cable or high speed internet through anyone else I wouldn't use Simplibits.  This doesn't mean that Simplibit isn't any good, it means they are okay with reasonable, but not great, speed.  I've found the service to be quite reliable in terms of lack of service interruptions.  I find throughput to be a bit lumpy at what is likely their prime time, as I'm a residential customer.  I also run voice through Simplibits without QOS.  The majority of the time voice quality is fine.  It is nice that someone actually answers and speaks to you when you call either their admin or service organizations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T17:52:58.000Z",
          "Titre": "I received this request for a review…",
          "Contenu": "I received this request for a review after the initial phone call, so not much to evaluate.  We will have to wait 10 days for a visit to set up service.  Sooner would have been great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melanie/Goldstein",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T20:11:35.000Z",
          "Titre": "Slow",
          "Contenu": "The speed is slow streaming shows/ movies.  It has to buffer way to often.  Never had this problems glen w  DSL.  We unfortunately don't have access to other providers r other than satellite"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eduvigis",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T21:58:57.000Z",
          "Titre": "Access is lost at least once a day",
          "Contenu": "We loose access at least once a day ,,close to mid-night ... Also lately we have to reset the modem for a couple of minutes to regain access and when we call support \"ALL is OK\" !!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail E",
          "Nb_Reviews": 4,
          "Date": "2017-07-31T22:23:11.000Z",
          "Titre": "I love the service support",
          "Contenu": "I love the service support, but feel losing internet and speed have happened too often - like had to call in June & July.  Still not getting the speed that I expected/desired."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 2,
          "Date": "2017-07-25T18:26:48.000Z",
          "Titre": "Review",
          "Contenu": "Installation was pretty good. Service is pretty much was I would expect with a few outages / speed slowing about 10%. Automated billing works great. Overall I am satisfied."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 2,
          "Date": "2017-05-12T17:25:44.000Z",
          "Titre": "Slow speeds for a business account …",
          "Contenu": "Slow speeds for a business account fees.  Tucson needs fiber optic speeds to be competitive.  I had faster internet on an island in the middle of the Pacific ocean!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T17:54:20.000Z",
          "Titre": "INTERMITTENT OUTAGES",
          "Contenu": "Experienced intermittent outages approximately once per month. Service has been responsive. Nevertheless, concerned about inconsistent reliability."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-05-11T00:00:56.000Z",
          "Titre": "Still waiting .....",
          "Contenu": "Still waiting ...... 2 weeks for soonest appt  so I have no reviews yet.  Keep getting email to rate so here it is."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T20:39:03.000Z",
          "Titre": "Called numerous numbers which gave a…",
          "Contenu": "Called numerous numbers which gave a recording indicating I was number 1 in line then it would hang up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2016-10-27T00:44:17.000Z",
          "Titre": "More choice",
          "Contenu": "Should provide higher speed Internet for residential customers and thère are times when Internet slows"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2017-10-31T20:09:07.000Z",
          "Titre": "Average to good service",
          "Contenu": "Overall, a fairly good internet experience. It can be painfully slow at certain times of the day though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael H. customer",
          "Nb_Reviews": 2,
          "Date": "2020-05-05T23:39:21.000Z",
          "Titre": "Customer service person was pretty much…",
          "Contenu": "Customer service person was pretty much worthless on answering questions but did get me signed up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2017-05-12T17:52:13.000Z",
          "Titre": "Thus far so good ...will not to service …",
          "Contenu": "Thus far so good ...will not to service with anycable companies...great alternative!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T21:24:46.000Z",
          "Titre": "Alright",
          "Contenu": "It's alright but there are times in the day where it is slower than dial up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelby M.",
          "Nb_Reviews": 5,
          "Date": "2016-11-10T23:10:52.000Z",
          "Titre": "Connectivity Issues",
          "Contenu": "At times it is really slow or no connection at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-20T00:24:16.000Z",
          "Titre": "So far excellent customer service",
          "Contenu": "So far excellent customer service! Thank you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lois and Gary",
          "Nb_Reviews": 2,
          "Date": "2017-01-12T20:50:56.000Z",
          "Titre": "download speed",
          "Contenu": "Inconsistent download speed-often extremely slow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nelson",
          "Nb_Reviews": 1,
          "Date": "2017-01-16T22:38:53.000Z",
          "Titre": "Review",
          "Contenu": "Average service (bandwidth) at higher cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 1,
          "Date": "2016-11-10T00:14:15.000Z",
          "Titre": "Inconsistent speed",
          "Contenu": "Speed drop off,was faster before upgrading"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-21T19:04:08.000Z",
          "Titre": "Poor Customer Service sales Reps"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T13:52:43.000Z",
          "Titre": "No one showed up to install"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet R Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T15:41:49.000Z",
          "Titre": "He was very helpful seting it up and…",
          "Contenu": "He was very helpful seting it up and did not mind our dogs inspecting his work..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T18:25:35.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service. Our signal is somewhat sporadic and not consistent. The installation is lacking in quality and untidy.We are near Josephine Canyon in a valley. That may be part of the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-02T14:35:50.000Z",
          "Titre": "Very pleased with the installation…",
          "Contenu": "Very pleased with the installation process as a whole, but would have preferred to know in advance that the installer could not penetrate the roof while doing the installation. We got hooked up for the time being, but were advised that a return trip to move the cable at a future time would result in a charge of $150 for 15 minutes of time. Rather excessive when the entire installation is valued at $50. Other than that, we are pleased with the service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "June Woodman",
          "Nb_Reviews": 2,
          "Date": "2021-10-12T14:27:21.000Z",
          "Titre": "The Second technician who came to…",
          "Contenu": "The Second technician who came to install my system was professional, helpful and patient in explaining the process. He installed the equipment and set up the system, was polite and helpful.  Great service and the internet is much faster than my previous service. All around a great change."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jules",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T18:53:27.000Z",
          "Titre": "Switch",
          "Contenu": "I recently switch to Simply bits from Century link So far so Good only been a week but haven't had any outage as we did with Century link."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lisa",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T06:29:34.000Z",
          "Titre": "You do not throttle the internet like…",
          "Contenu": "You do not throttle the internet like most companies do.  Unlimited gb."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer JD",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T16:50:51.000Z",
          "Titre": "Very glad to have this internet…",
          "Contenu": "Very glad to have this internet available in my area.  Installer was capable and very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob McGinty",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T09:52:07.000Z",
          "Titre": "Seeking a Reliable provider",
          "Contenu": "I was seeking a internet provider that was dependable and offered consistent service compared to CenturyLink. So far service is far more reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T15:59:55.000Z",
          "Titre": "The installer did an excellent job",
          "Contenu": "The installer did an excellent job. He was friendly and knew what he was doing. Its to soon to rate the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Doorley",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T20:03:53.000Z",
          "Titre": "The Installer is a professional",
          "Contenu": "The Installer is a professional. Went above and beyond. Rare."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tucson Mnts Customer",
          "Nb_Reviews": 2,
          "Date": "2020-06-03T21:58:56.000Z",
          "Titre": "Great customer service and install... have I hopes for service.",
          "Contenu": "Customer service was very knowledgeable and helpful. They were straight forward and honest. Installer was great to work with and did a very nice clean job. Have had internet for only a short while, but already it is a significant improvement over satellite. Only negative is that they are running out of available bandwidth so couldn't get as fast as speed as I would have liked - applaud them for not overselling their capacity! Hope the FCC will let them build new towers soon!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maggie",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T18:15:49.000Z",
          "Titre": "Only feedback is when I had to call the…",
          "Contenu": "Only feedback is when I had to call the 24/7 support desk following up with internet connection issues through new residential service.  Representatives were very apologetic but did not provided any clear answer and level of frustration kept going up to the extend that I was already searching for another provider. Thankfully Sabrina reached back to me with more knowledgeable background and expedite in person technical service released to my home and service was in place in the next few hours.  So far very happy with service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "potential customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-06T00:31:03.000Z",
          "Titre": "I appreciated the honesty of everyone I…",
          "Contenu": "I appreciated the honesty of everyone I worked with at Simply Bits.The sales person was kind in setting up a schedule that fit our needs and their resources. Unfortunately their tech guy couldn't find in signal from their tower in our area. Anthony, the tech guy, did a good job of answering my questions and the other options that might be available to us. Please keep me on the list of potential customers when you put up a new tower that will bring service to our area."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R.Ross",
          "Nb_Reviews": 3,
          "Date": "2018-05-31T03:17:49.000Z",
          "Titre": "I'm ultimately happy with my choice",
          "Contenu": "I'm ultimately happy with my choice. The only thing that caught me off guard was paying twice in one month; everyone's bill generates on the 20th with payment due on the 25th. I just misread the terms. A bummer for my intentions with the other portion of my funds but I was happy I got such a quick call back after I requested an explanation of how billing works. These guys are amazing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duane Johnson",
          "Nb_Reviews": 1,
          "Date": "2017-11-05T00:13:46.000Z",
          "Titre": "I was satisfied but they brought the …",
          "Contenu": "I was satisfied but they brought the coaxial cable from the dish into my junction box with six connectors and took one out and pulled their wire directly thru the hole to my computer. It should have been connected to the connector so I could screw on a short length of coaxial cable to connect to the computer. Not very professional and I will have to redo it soon.Never asked me or said anything. I discovered it the next day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-17T15:04:00.000Z",
          "Titre": "My Simply Bits service setup",
          "Contenu": "The tech who came out to get my service up and running was excellent.  The process of getting my service up and running was challenging but to be fair my mountain home has poor cell service and the tech told me that he has noted that the type of cell phone I have is challenging to use when starting my service.  He pointed out that my eero router/WiFi system only has one ethernet port (which he wasn't very happy about) but that the WiFi system is strong.  Overall I am happy with the system so far using only the WiFi for all my internet devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T13:46:45.000Z",
          "Titre": "Signed up with Cheryl",
          "Contenu": "Signed up with Cheryl, very helpful and scheduled my install. Installer Jay showed up as scheduled and went to work. After quite a while, came down off the roof, apologized and said he was unable to find a signal. Great service from this company, too bad I couldn’t get a signal....."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashok",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T20:03:22.000Z",
          "Titre": "Flexibility",
          "Contenu": "Product was installed well but there are limits on where installers can go. For example cannot go in attic to make connections. I had to do this myself. Product operating very well with no drop in service over one year. Contract does not allow for vacation mode if gone for extended period of time. My ISP in another town provides this flexibility with appropriate limits."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T04:39:28.000Z",
          "Titre": "Overall satisfied; occasional outage which seems to be short and fixable",
          "Contenu": "Mt. Lemmon usage, overall satisfactory and good speed.  I only have my Tucson local connection to compare, and it's comparable.  I appreciate the opportunity to support a local business and their willingness to be available if I have a question or problem which happens only infrequently.  The couple times I had to call for service, the staff was very personable and helpful and competent.  I appreciate Mike Bernstein's enthusiasm for our mountain!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 1,
          "Date": "2016-11-10T17:05:49.000Z",
          "Titre": "So far so good",
          "Contenu": "We use Simply Bits because we live outside of the Cox and Comcast areas. It has proven to be a reliable alternative and we have had no problems to date. We have been customers for over 3 years so I would recommend using Simply Bits to anyone who is dissatisfied with their other internet providers. The monthly cost has never increased either!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenia",
          "Nb_Reviews": 1,
          "Date": "2018-06-19T18:46:40.000Z",
          "Titre": "Gets the job done",
          "Contenu": "Internet works great, customer service was good when calling for installation. Haven't had any issues yet! I live in a rural area and there weren't many internet providers to choose from. Super happy I went with Simply Bits. Price is a bit high but I would definitely recommend to anyone with limited options!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-08-21T23:02:49.000Z",
          "Titre": "I am providing a review only on the…",
          "Contenu": "I am providing a review only on the process of phone conversation to quotes services, explanation of plans and installation date. The customer service agent was polite, explained plans in detailed and received my business.  I hope the install and service are just as great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BAT",
          "Nb_Reviews": 2,
          "Date": "2016-10-28T14:20:05.000Z",
          "Titre": "Static IP - cost outrageous 300% Increase!",
          "Contenu": "I've been with SB for over seven years and i wanted to add a static IP to my account to view my security cameras outside my LAN. To my surprise for many years the fee was additional $5.00 per month but today they want a outrageous $15.00 per month or 300% increase.  ISP Bluespan charges only $5.00 for their Static IP but there fee's (Plans) are instructors differently then SB. Maybe it time to consider their competitor if security is important to you or me!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 4,
          "Date": "2016-11-02T01:11:57.000Z",
          "Titre": "Good customer service; reliable",
          "Contenu": "Can recall only one short, storm related outage in over seven years. Resetting credit card payment info when the card expires has been very easy. Speed is good. I've recommended Simply Bits to friends who are also happy with their service. I am glad that There is a great alternative to the big companies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T19:37:48.000Z",
          "Titre": "Good Internet provider",
          "Contenu": "I have been on Simply Bits for over two years.  During that time I have had only two outages and neither lasted over about 5 minutes.  Any calls to find out why mine is operating slow received very courteous and knowledgeable help and all problems were with my router.  Good service at a pretty good rate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debidew",
          "Nb_Reviews": 2,
          "Date": "2019-12-06T15:15:04.000Z",
          "Titre": "So far the sales team has been very…",
          "Contenu": "So far the sales team has been very patient with me calling to insure I have compared all the competitors options correctly. The soonest installation is a bit farther out than desired at 2 weeks. Won’t be able to review quality and speed of internet for a few weeks yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Future Customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T15:39:46.000Z",
          "Titre": "Hoping for a tower closer to my residence",
          "Contenu": "The Simple Bits technicals were unsuccessful setting a good signal. They were very professional. One of the technical's told me, I would be notified when a tower was accessible to my residence. I hope it happens soon. Thanks for trying"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EF",
          "Nb_Reviews": 2,
          "Date": "2018-05-30T17:53:31.000Z",
          "Titre": "Very good after 2 months, hope SB keeps up.",
          "Contenu": "We switched to SB because Sprocket could no longer provide the bandwidth we were paying for, and their customer support had deteriorated. We are in a semi-rural area 40 mi S of Tucson, where there are few ISP options, and SB was one of them.It's early, just 2 months since we switched, but SB bandwidth has been what we pay for without any dropouts, which were common with our previous provider. A big advantage is that we have a clean line of sight to one of their repeaters.My only reservation is that I wish SB were a little less expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 3,
          "Date": "2016-10-27T01:10:52.000Z",
          "Titre": "Overall better than any other option",
          "Contenu": "Simply Bits gave me an option of higher speed service than any other provider in my area. It has been good service with only occasional glitches, outages, etc. My only problem has been a persistent blip on my VOIP which I cannot seem to track either to Simply Bits or OOMA (my VOIP provider.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T Hamm",
          "Nb_Reviews": 2,
          "Date": "2019-05-25T00:45:21.000Z",
          "Titre": "Installation issues.",
          "Contenu": "I live in a remote area and had no internet at all.  At my install they were unable to install the router because I could not download the app that was required to set it up without internet. The technician tried everything to no avail. If they advertise setting up internet and cannot complete the install that is not good. That being said after I drove into the main town and purchased a router, I now have internet that works quite well. Simply Bits just needs to make a few installation changes. Luckily, my son knows about these things so he could buy the router and finish the install."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ginger",
          "Nb_Reviews": 2,
          "Date": "2016-10-31T21:42:01.000Z",
          "Titre": "Pretty Darn Happy",
          "Contenu": "The customer service has always been great. We did have a short period of time where our service kept going out but the problem was found and fixed rather quickly. Even that was not nearly as bad as our daily experience with our previous provider. We have not had any issues since."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T03:12:45.000Z",
          "Titre": "Sneaky",
          "Contenu": "I am generally very satisfied with the service. My only issue was with the increasing of bandwidth without my knowledge, then being told that unless I upgrade at the contract term, my speed will drop to my old plan. Simply Bits should have told me they were doing this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 5,
          "Date": "2017-01-12T19:37:08.000Z",
          "Titre": "Weekend tech support is a problem but service is very reliable.",
          "Contenu": "I'm a residential customer, have been for 10 years.   Service is very reliable but if you have a problem on a weekend, tech support is hard to find.  My internet service seems better than that of CenturyLink, the only other broadband in my neighborhood."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron and Leah",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T23:11:34.000Z",
          "Titre": "Overall Opinion",
          "Contenu": "We really love Simply Bits the only thing we struggle with is when our bandwidth falls short.  This usually happens during peak usage IE nights and weekends and its hard to get support due to your hours for support.  Other than that we love Simply Bits."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T19:58:29.000Z",
          "Titre": "The service can get slowed in the evening.",
          "Contenu": "The 20g was put into affect after I became a customer so when they changed to a limit I was greatly suprized I was never told about this prior to the change nor properly explained to this date why they put the limit and throttle back my download's."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendan",
          "Nb_Reviews": 1,
          "Date": "2017-01-14T14:31:00.000Z",
          "Titre": "pretty good, better than Cox",
          "Contenu": "I like Simply Bits. They are local, friendly and a decent value. We live in a \"Bermuda Triangle\" for internet and electronics, so, for example, Cox would be very very slow sometimes. So, even though not perfect, Simply Bits is pretty solid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T23:46:39.000Z",
          "Titre": "Unfortunate",
          "Contenu": "Serviceman was very nice and tried to accommodate. Unfortunately, due to limitation in placement that would meet my satisfaction I was unable to move forward with installation.  Equipment was monstrous and needed to be placed in highly visible area, very unappealing. Did not approve of penetrating my roof for installation and would not agree to a nonpenetrating mount that is held down with bricks.It would serve you to provide better ability to mount on fascia board.More detailed communication regarding installation during initial call may have saved the poor technician time.Very kind service technician."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T22:14:45.000Z",
          "Titre": "Good, basic service",
          "Contenu": "We've been happy with Simply Bits. It provides good internet connection for a fair price.  Customer service has been friendly and helpful. Our only complaint is occasional slow speeds that interrupt a video or prevent linking to a web site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2016-10-27T02:07:40.000Z",
          "Titre": "Always there, wish it was faster",
          "Contenu": "Simply Bits is a huge upgrade over the phone company internet which was painfully slow and down frequently.  Simply Bits is always there, great service, and decent speed.  Hope they can up the speed over time for improved streaming, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis L",
          "Nb_Reviews": 2,
          "Date": "2019-07-09T15:12:11.000Z",
          "Titre": "I'm ordering service from Simply Bits",
          "Contenu": "I'm ordering service from Simply Bits, so I'm not actually a user, yet.  But I soon will be.  At this point in the process Simply Bits has shown me nothing but professionalism and courtesy.  A GREAT beginning!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2016-11-10T01:19:36.000Z",
          "Titre": "Need faster speeds",
          "Contenu": "Countries much smaller than ours are light years ahead of us. I'm not that far out and with technology where it is faster speeds are not only wanted but necessary  with 4K and all. Step it up SB and stop making excuses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T21:04:41.000Z",
          "Titre": "good company but marginal connectivity",
          "Contenu": "Hi, I like these folks - very responsive.    I just wish their service was a bit more reliable from where I am located - I get spotty coverage, and there is not other alternative at the moment (eg. cable or fiberoptic)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "new customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-02T15:29:10.000Z",
          "Titre": "Changed my internet provider to Simply Bits",
          "Contenu": "I just changed my internet provider to Simply Bits after years of poor internet speeds and service from a provider that was the only choice for my location.  I began to hear good things about Simply Bits through my neighbors and so far have been very satisfied with the service.  Signup was easy - their app shows you the plans available for your area (there were several choices for me on the Far East side of Tucson) and a single phone call led to prompt service and installation.  So far my internet speeds approach what my plan promised and the internet is working well. I only give 4 stars because I have no long term history to go by, but so far I see no reason not to be able to give 5 stars in the future,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2020-05-13T22:40:55.000Z",
          "Titre": "As a new customer I am quite happy with…",
          "Contenu": "As a new customer I am quite happy with the service I have received from Simply Bits.  The service technician was polite and efficient.  My questions were answered without hesitation.So far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randolph",
          "Nb_Reviews": 1,
          "Date": "2017-05-24T23:14:59.000Z",
          "Titre": "Getting service a Breeze",
          "Contenu": "I am new with Simply Bits but getting installation and service was a breeze. I appreciate not getting mail from them like some other providers in town that spam mailboxes daily with their advertisements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2017-01-13T20:34:37.000Z",
          "Titre": "good Internet service",
          "Contenu": "Wiring for DSL in our area is very old, and we have no cable providers. Terrestrial microwave service from Simply Bits is reliable.  It would be great if the cost was a bit more competitive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Cataldo",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T22:54:58.000Z",
          "Titre": "The sales service was very…",
          "Contenu": "The sales service was very accommodating and much easier and friendlier than any big cable company.  I like the feeling of a community-oriented company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "charlene",
          "Nb_Reviews": 4,
          "Date": "2016-10-27T03:16:23.000Z",
          "Titre": "Faster service",
          "Contenu": "Wish the service was faster.  We have been with simplybits for more than 10 years and they never let us  know when the price changes and if  we could be on a better plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-19T14:38:34.000Z",
          "Titre": "The staff have all been very nice and…",
          "Contenu": "The staff have all been very nice and we would love to have the service but the tech was not able to find a clear line of site from our house to their towers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sierra",
          "Nb_Reviews": 2,
          "Date": "2018-01-22T19:44:51.000Z",
          "Titre": "Love the service",
          "Contenu": "Love the service, way better than century link. Still wish we got a little faster speeds, but where we live I understand why we don't. Price isn't bad."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beatrice",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T02:25:48.000Z",
          "Titre": "Definitely recommended",
          "Contenu": "Highly recommended for people with little option of high speed internet providers. We have had no troubles with the internet since signing up with simply bits."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzie",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T02:44:53.000Z",
          "Titre": "Evaluation of service",
          "Contenu": "Not sure at times if it is your service or our security system that is giving us problems....but when you are called you always respond quickly.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy or Dan",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T19:26:29.000Z",
          "Titre": "very reliable service",
          "Contenu": "Only 2 outages in year and a half of services, but back up quickly.  Only issue, on occasion, is slow streaming; problem might well be with the DVD player."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregg",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T00:20:46.000Z",
          "Titre": "Few problems - often fixed quickly -- but light on Apple Knowledge",
          "Contenu": "I am still using their slow, very spam infused mail system -- as last time they checked they had no-one to help me set up my Mac's 10.12.1 Mail System."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2017-01-13T04:40:39.000Z",
          "Titre": "Service",
          "Contenu": "Service has been generally great however there are times particularly weekends when speed  donload more than upload drops to a minlimal unacceptable level"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T16:00:28.000Z",
          "Titre": "Overall, great experience.",
          "Contenu": "The installation tech, Austin, was wonderful. He explained everything he was going to do beforehand and installed the equipment as explained. He was on-time, professional, and courteous. He made sure we were up and running before leaving. This would have been a \"5 star\" review, but I am paying for the ultimate plan (25 Mbps) and have not reached that speed yet. Before Austin left, he explained that the tower from where we are receiving the signal is pretty full. So, he had to put us on tier 2 instead of 1. That's totally fine and I completely understand; however, I am still paying for 25 Mbps. I'm hoping the speeds will improve over time, but if not I may have to switch to a lower plan. With the exception of the speed issue, Simply Bits has been great and our internet has never been faster even at the lower speed. We were only getting 3 Mbps through our former internet company, so  even 10 Mbps is a huge improvement for us and we certainly notice the difference."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2021-01-28T03:19:52.000Z",
          "Titre": "No Service but Friendly",
          "Contenu": "Unfortunately, Simply Bits was unable to provide my home with internet service. Nevertheless, everyone was kind and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 4,
          "Date": "2017-01-12T22:17:21.000Z",
          "Titre": "Good price for service.",
          "Contenu": "We live out in the middle of nowhere.  Simply Bits gives us the access to internet at a reasonable price.  Not many problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T20:59:42.000Z",
          "Titre": "Best available",
          "Contenu": "In our area we are very limited with quality internet providers and simply bits is the best. They provide good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Alice Theroux",
          "Nb_Reviews": 2,
          "Date": "2017-07-25T22:29:05.000Z",
          "Titre": "I have much better internet service …",
          "Contenu": "I have much better internet service than I had on Century Link.I am so grateful that someone told me about you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T22:44:55.000Z",
          "Titre": "Once I actually got to talk to someone…",
          "Contenu": "Once I actually got to talk to someone they were great, very knowledgeable and answered all my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Armando R Lopez",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T06:46:51.000Z",
          "Titre": "Very good customer…",
          "Contenu": "Very good customer service,friendly,attentive  and knowledge of services you providing.👍🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raemor",
          "Nb_Reviews": 2,
          "Date": "2016-10-27T20:06:26.000Z",
          "Titre": "Good Service",
          "Contenu": "A good service.  Only a little slow sometimes at peak usage times. Would not change service.  Great price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2017-11-01T01:36:05.000Z",
          "Titre": "Still have a little fluctuation on …",
          "Contenu": "Still have a little fluctuation on speeds but a lot better service than we had with TransWorld Network"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcia",
          "Nb_Reviews": 4,
          "Date": "2017-10-31T21:47:46.000Z",
          "Titre": "Works great",
          "Contenu": "Works great, sometimes download times are a little slow, but no problems with streaming service on tvs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sacena Frank",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T23:52:21.000Z",
          "Titre": "QUIK SET UP AND ANSWERED ALL MY…",
          "Contenu": "QUIK SET UP AND ANSWERED ALL MY QUESTIONS GAVE ME ADVICE ON WHAT OPTIONS TO GO WITH- THANK YOU!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blaise",
          "Nb_Reviews": 2,
          "Date": "2018-05-30T19:14:08.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great. Service is sometimes unreliable, but overall I am a satisfied customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2016-10-31T23:31:41.000Z",
          "Titre": "Switched from HughesNet due to unfair billing/access policy.",
          "Contenu": "Overall good, occasional unexpected slow-downs or service interruptions, usually resolved quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T18:10:06.000Z",
          "Titre": "Website is very friendly",
          "Contenu": "Website is very friendly, contract as usual is difficult to understand and too long to read."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2017-10-31T22:07:52.000Z",
          "Titre": "Service is good but need more speed",
          "Contenu": "Service is good. I wish they had faster download speeds at lower prices available in Rio Rico."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 5,
          "Date": "2017-10-31T19:09:16.000Z",
          "Titre": "The service has been very good and my …",
          "Contenu": "The service has been very good and my only issue is the occasional slow loading of some files."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gay and Bruno",
          "Nb_Reviews": 1,
          "Date": "2016-11-21T20:17:53.000Z",
          "Titre": "Great ISP",
          "Contenu": "Better than any other service we had before. Consistently high down-and upload speeds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2016-11-10T03:19:36.000Z",
          "Titre": "Occasionally drops off line.",
          "Contenu": "Other than occasional disconnect and occasionally being a bit slow,  no problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2018-05-30T17:10:20.000Z",
          "Titre": "All is good with services",
          "Contenu": "All is good with services. Price is high.  Other than that all is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Redpath",
          "Nb_Reviews": 2,
          "Date": "2017-01-13T17:47:48.000Z",
          "Titre": "Local team supportive",
          "Contenu": "Some service inconsistency, but the local team tries to correct quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nance Crosby",
          "Nb_Reviews": 3,
          "Date": "2016-11-01T03:26:17.000Z",
          "Titre": "Fairly reliable no blow ups at least",
          "Contenu": "Satisfied except no improvement in their speed capacity that I know of"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eugene Moreno",
          "Nb_Reviews": 1,
          "Date": "2017-05-12T17:24:33.000Z",
          "Titre": "no issues of service",
          "Contenu": "no issues of service, happy with help for problems that have arised"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jami Dennis",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T16:29:45.000Z",
          "Titre": "Friendly people, decent Internet connection, but their communications could use some work",
          "Contenu": "Everyone I talked to was friendly and mostly helpful. The main problem was that after calling to arrange installation of my new service, the day for installation came and we were not on the schedule. It took me 4 tries to reach someone on the phone - I was disconnected 3 times - twice by the system transferring me to a number that rang and rang then just ended the call and once by someone transferring me to a wrong number. I'd say the phone system needs work. When I finally spoke to someone it took a bit because for some reason they thought our house was not in the service area, despite the fact that the previous owners had been using Simply Bits for years. And another thing - the previous owners, when they disconnected their service, both emailed and called Simply Bits to tell them to keep the equipment on site as the new owners (me) would be setting up service. Nope. they took the equipment anyway. (perhaps this is a policy - but seems odd - and maybe we ended up with newer equipment?  communication seems to be an issue). Renee, in sales, was able to work with the folks who do the installs to get us scheduled for install right away despite the fact that we somehow got dropped from their calendar. Brenden - the install tech - was friendly, knowledgeable, and efficient.  So far the service has been fine.  We are in a remote area so the speed is not the fastest, but told they should be upgrading the equipment in our area over the next year. I do hope this happens because my husband and I both work from home and often have to deal with large file transfers, so having faster speeds will be great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tex or Pat",
          "Nb_Reviews": 1,
          "Date": "2016-11-02T01:58:05.000Z",
          "Titre": "I have had positive experiences with Simply Bits.",
          "Contenu": "Tech support has helped me because I'm not a computer person!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vincent",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T05:02:41.000Z",
          "Titre": "Getting service started OK",
          "Contenu": "Minor billing concerns at start of service, cleared up later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARK A NAVARRO",
          "Nb_Reviews": 2,
          "Date": "2019-07-31T18:16:33.000Z",
          "Titre": "Switched from century link to simply…",
          "Contenu": "Switched from century link to simply Bits . So far so good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Javier",
          "Nb_Reviews": 1,
          "Date": "2017-11-01T13:29:13.000Z",
          "Titre": "Great service but the speed slows at …",
          "Contenu": "Great service but the speed slows at times when streaming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2017-01-14T03:18:19.000Z",
          "Titre": "Good service",
          "Contenu": "Good service for my limited choices on Internet providers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2018-05-30T23:58:12.000Z",
          "Titre": "Sure beats Centurylinks 1.5 that I used…",
          "Contenu": "Sure beats Centurylinks 1.5 that I used to get."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T03:46:08.000Z",
          "Titre": "Fast connection for upgrade",
          "Contenu": "Fast connection for upgrade. Friendly staff"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2017-05-12T17:45:48.000Z",
          "Titre": "Occasional buffering affects streaming …",
          "Contenu": "Occasional buffering affects streaming video."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:02:39.000Z",
          "Titre": "Needed help setting up router / Neil…",
          "Contenu": "Needed help setting up router / Neil Lemme"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2017-05-17T14:49:20.000Z",
          "Titre": "No problems  with internet service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2016-11-02T13:33:19.000Z",
          "Titre": "No problems",
          "Contenu": "Have had no problems with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T23:48:53.000Z",
          "Titre": "Good",
          "Contenu": "Good, courteous service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T20:11:31.000Z",
          "Titre": "Service Dept was helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T01:50:03.000Z",
          "Titre": "Great billing department"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 2,
          "Date": "2017-11-29T20:43:08.000Z",
          "Titre": "Great customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Armando",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T00:46:21.000Z",
          "Titre": "Life changing",
          "Contenu": "Better than expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Witschicustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:47:35.000Z",
          "Titre": "response",
          "Contenu": "response , friendly and verky helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alphagirl",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T16:06:29.000Z",
          "Titre": "Excellent Service",
          "Contenu": "The installation was smooth and competent.  My internet connection is great and way, way better than Century Link.  I wish I had upgraded sooner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T06:15:23.000Z",
          "Titre": "The installer showed up on time and…",
          "Contenu": "The installer showed up on time and installed the new antenna.  The signal is very strong and we have had no problems using Zoom as both the audio and visual is working well.  The cost of the service in a bit on the high side, but not outrageous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eudene Lupino",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T19:17:47.000Z",
          "Titre": "Simply bits is simply wonderful",
          "Contenu": "Tonya, who initiated transaction, was patient, helpful, and friendly. Installer was knowledgeable, competent, and creative. Todd devoted hours to seeing that we’d get the signal in a tricky situation. Service/reception is so far beyond what we’d had: we’re flabbergasted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T07:39:26.000Z",
          "Titre": "Amazing service!!",
          "Contenu": "Amazing service!!! We finally can enjoy streaming without the annoying buffering! From the great phone customer service to our wonderful tech Donny, we are beyond pleased to be part of the Simply Bits family. Thank you all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:12:34.000Z",
          "Titre": "Very good",
          "Contenu": "The installer was prompt, friendly, and worked quietly and efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T01:34:05.000Z",
          "Titre": "Great, friendly and efficient service!",
          "Contenu": "Ms. Masters listened to my issue (temporary need to shut down the 5 GHz channel on my eero mesh network to connect security camera), called a colleague who could perform the temporary shutdown which only Simply Bits could do, and stayed on the line until her colleague reported shutdown successful.  I was able to connect the security camera and the 5 GHz channel restarted 15 minutes after the shutdown as promised.  On top of that, Ms. Masters called me back later (as she said she would) to confirm everything had worked out OK for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T19:41:43.000Z",
          "Titre": "Simply Bits came promptly to install…",
          "Contenu": "Simply Bits came promptly to install service, technician Donny was thorough, helpful and extremely competent.  My system is working well--two computers, two tvs, 2 cell phones and some small devices.  We were able to speak to people when we called, to check on progress, etc.  In other words, we had service!!! we were not just trying to glean info from an unhelpful machine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Shapiro",
          "Nb_Reviews": 13,
          "Date": "2022-10-07T22:29:46.000Z",
          "Titre": "Today was my first appointment with a…",
          "Contenu": "Today we had two excellent installers come out and install our new antenna and modem. Donnie and Justin were gentlemen and got us going with three times the band width of Bluespan, same price and no contract. Thank you, Simply BitsToday was my first appointment with a Simply Bits salesperson name Shaun. So far, my experience couldn't be better. Shaun was calm, clear, authentic and friendly. My install will happen within the next ten days. If everything goes like today, I'll be a very happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annette McPheeters",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:29:47.000Z",
          "Titre": "My Positive Experience With Simply Bits",
          "Contenu": "Let me begin by saying that I am not a tech savvy individual; however, from my initial inquiry to the day of installation I encountered complete answers and courtesy.  This was such a glorious contrast from my experience with our previous provider.  On the day of installation our daughter came over to help me understand. Our installer was really informative and answered all our questions.I would recommend this company to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Therese Griffin - rejected cou",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T18:14:30.000Z",
          "Titre": "Jason was very professional in his…",
          "Contenu": "Jason was very professional in his presentation by his mannerism and working on my roof.  But unfortunately, we couldn't make the connection.  I live in Swan Lake Estates that another resident is proud to be your customer.  I'm towards the back of out Swan Lak Adult Community - Manufacture homes. Too many trees in-between not able to connect.  If you ever get a higher reach please contact me because my friend loves your service. I need help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel H",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T02:28:49.000Z",
          "Titre": "My first time using Microwave internet…",
          "Contenu": "My first time using Microwave internet but it delivers the goods. No buffer at all. I like the fact it is just like CenturyLink bcz the Brand names that use cable slow down on weekends but not this service. 5 stars so far. Keep up the good internet service Simply bits. It’s a tad more expensive but blows away Hughes Net and the other Satellite companies by far far far. Don’t get stuck with slow satellite! Get something that will perform everyday! Simply simply Bits."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UF Rodgers",
          "Nb_Reviews": 3,
          "Date": "2022-05-04T20:12:56.000Z",
          "Titre": "The installer found a signal!",
          "Contenu": "The installer came out, looked around the property and figured the best place for us to receive the signal.  Prior to his visit we had been told we couldn't receive a signal from our location.  We had called 3 separate times over the past few years with hopes there was a new tower or a stronger signal we could connect to with Simply Bits.  We are really please with the reception we are receiving!  The past 14 years with Century Link has been HORRIBLE.  The installer was professional, cleaned up after himself and was considerate of our space.  We highly recommend Simply Bits!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean-Marie Bunney-Lytton",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T23:11:06.337Z",
          "Titre": "Suzette was EXCELLENT helping to solve…",
          "Contenu": "Suzette was EXCELLENT helping to solve issue with TV hookups.  She listened to my issue and made a very reasonable suggestion to fix- don't use the same WiFi name ... TVs were stuck on the prior name and password.  TV Customer Service didnt suggest that.... THANKS Suzette!Installation went very well..VERY happy with SP so far !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken V",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T21:12:35.000Z",
          "Titre": "New Provider",
          "Contenu": "I was ready to switch providers and Simply Bits caught my eye.  They had good reviews and the real plus was free installation.  The person that scheduled me was good and patient with all my questions and the service tech that did the installation was very professional.  Overall, Simply Bits made a good first impression and hope this will continue during my use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T23:06:28.000Z",
          "Titre": "Customer service by the installer was…",
          "Contenu": "Customer service by the installer was done efficiently.  The installer took his time to ensure that the system worked and that we were able to connect our devices.  He spent a lot of time trying to get our lap top computers to connect to the wifi system, but to no avail.  It was determined that one computer was outdated and wouldn't connect to the system while the second lap top did finally connect. Our internet speeds have greatly improved over the previous provider who would not correct the exposed phone lines in our back yard after 4 years of negelect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T18:52:03.000Z",
          "Titre": "Great customer service!!!",
          "Contenu": "Talked to real people. Tanya, in the sales dept., was very friendly and helpful. Jay, the technician who came to do the signal signal sighting and installation was friendly, helpful, listened to the guidelines provided, and did his best to do meet my needs!! Very knowledgeable and insightful! Thank you, Simply Bits!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T19:51:28.000Z",
          "Titre": "Call them!",
          "Contenu": "We tried the usual suspects for internet service but found them to be woefully inadequate for a myriad of reasonsCenturylink offers 3 mbps……really?…….3?Useless for streaming tv etcHughesnet throttles after data allotment is used up…(2 days) which renders the ‘service’ useless for streamingThere are other service providers but the story is pretty much the sameThen we found Simplibits……not easy to find but worth the searchingFast speeds…..reliable connection…..very well priced…..If you get…..I should say WHEN you get the runaround with the usual providers give this company a callYou’ll see getting internet service doesn’t have to be a demoralizing, mind bending experience BTW I am not getting compensation for this review nor is anyone aware I’m writing it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason R",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T20:08:38.000Z",
          "Titre": "Amazing Customer Service",
          "Contenu": "Customer service was amazing all the way around. From the phone conversations setting up install, to the phone call moving up my install to an earlier date, and the tech who installed our service. Everyone very friendly and professional. The service has been amazing so far. Night and day from our previous provider Centurylink."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Stanford",
          "Nb_Reviews": 4,
          "Date": "2022-04-13T20:54:21.000Z",
          "Titre": "Over 20 years of terrible internet service....SOLVED!!",
          "Contenu": "My neighborhood does not have cable. Hence, for 2 years I had Hughes.net. It was very slow and expensive. Then for 20 years I had US-West/CenturyLink. Slow internet (12 MBPS) and rainstorm outages. NOW I USE SIMPLYBITS. Fantastic reliability and support (Suzette and Daniel). They are sincerely concerned for your satisfaction, and no doubt give you the feeling of a 'hometown' business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus Corella",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T15:09:10.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, I’m new to this internet service and had Century Link previously. I decided it was time for a change since my internet kept dropping and the price increased. We decided to get Simply Bits to test it out and my experience with them have been awesome. Worth every penny, to this point my internet hasn’t failed at all. Even with the mansion season I don’t notice a difference, the signal never drops. I would definitely reccomended it for someone who’s had the same problem in the past like I did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacquie",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T09:46:46.000Z",
          "Titre": "Wasn’t sure on how great the internet…",
          "Contenu": "Wasn’t sure on how great the internet would be as all companies would say I live in San area where it’s hard to get a signal Simlpy Bits came outran test set up and I can say it’s one of the fastest home internet I’ve ever had plus low monthly payment can’t complain will be referring over family. Thanks Simply Bits"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frustrated with CenturyLink",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T21:36:58.000Z",
          "Titre": "Frustrated with CenturyLink? You need SimplyBits",
          "Contenu": "I had two options out here in God’s country. I’d Simply Bits had been my first call, it would’ve saved a LOT of aggravation. The competition may promise several times the speed, but unless you’re within 500 yards of their switch station, they’re blowing smoke at you.Simply Bits answered my call with a minimum of phone tree up front that got me immediately to a real person who actually knew what they were doing. They had someone out within 36 hours in a 4 - not 9 (looking at you, CenturyLink) and got the job done right resulting in flawless service, which I really appreciate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Zepeda",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T16:59:07.497Z",
          "Titre": "Good service speaks for itself",
          "Contenu": "The person who took the order was knowledgeable and was able to take a next day order when another provider failed to meet my needs. The technician that installed the service was able to bring a line into the house with minimum interference with my normal routine. Beyond that, he helped me on board as my internet skills are basic.At all times he was efficient and pleasant to have in my home.  I am a 25 year retiree from the telephone industry and I know good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": ".Heather.",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T18:42:17.000Z",
          "Titre": "I will definitely be recommending your service to friends and family😊",
          "Contenu": "Great customer service, quick and easy to get set up with an appointment for a technician to connect service at my address. The technician was very knowledgeable, professional, and courteous. He called with an eta and arrived at the estimated time I was given and was at my residence for no more than an hour. He also explained to me in detail what he did and walked me through the app set up.  Thank you Simply Bits!!! I will definitely be recommending your service to friends and family!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T14:51:14.000Z",
          "Titre": "Simply Bits is great!",
          "Contenu": "I have been a customer of Simply Bits for many years. From day one, the company has always been responsive to my concerns.During a recent upgrade to my service, I had the opportunity to work with Suzette, Jay, Tonya and Mike G. What a great experience to work with a positive, \"get it done\" staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Kane",
          "Nb_Reviews": 2,
          "Date": "2022-09-07T22:29:16.000Z",
          "Titre": "Suzette went above and beyond",
          "Contenu": "Suzette went above and beyond her duties to find a way to re-establish my connection to the internet. She even called me back with a fresh idea about resetting the router after the routine checks failed. I feel lucky to be a customer of a firm with employees like that...Ed Kane"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deomuir",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T23:33:13.000Z",
          "Titre": "Great Service",
          "Contenu": "Spoke with Shawn. Explained process, billing,etc.and set up installation for 12-16. Jay was great too. Installed antenna,  hooked up service and we have real internet!!! Couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Liebich",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T04:28:19.000Z",
          "Titre": "awesome service",
          "Contenu": "Sean, the residential account manager, was amazing in his ability to pinpoint my family's needs and quickly provided whatever we needed.Jay, the installer, worked tirelessly to install our connection, resolve problems and come to solutions. His attention to detail was amazing and his finished product was a work of art."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica M.",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T23:13:24.000Z",
          "Titre": "The customer service that Simply Bits…",
          "Contenu": "The customer service that Simply Bits provides is great from the set up to the installation. Their pricing is very comparable and the internet service is great! I was geared towards the right products through amazing sales reps for both commercial and residential. Our technician, Todd, really showed out and was great, helpful company during the time he was here. I recommend getting your internet services through them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thunder & Ice Ranch",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T17:22:04.000Z",
          "Titre": "Thunder & Ice Ranch Approved",
          "Contenu": "Although we have not had simplybits for longtime we have been completely satisfied. Even during a storm in the desert we have kept everything going. When we have customers at the ranch even they have been impressed with the quality and speed of simplybits. Thank you simplybits for making our lives and Thunder & Ice Ranch move smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KVOI Admin",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T00:26:57.000Z",
          "Titre": "Great service",
          "Contenu": "Needed some help reprogramming numbers in our office phone system Suzette really went above and beyond to help.  She has great personality and a wonderful energy.  I'm extremely happy with the help she provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-17T03:13:25.000Z",
          "Titre": "Since I've subscribed to Simply Bits it…",
          "Contenu": "Since I've subscribed to Simply Bits it has made the internet much more easier and faster to access. And making work at home much more easier. Instalation was quick and easy and technician was very knowledgeable in his work.. Informative.  Thank you ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID AND DENISE HENSON",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T17:02:23.000Z",
          "Titre": "THE GENTLEMAN THAT DID OUR INSTALLATION…",
          "Contenu": "THE GENTLEMAN THAT DID OUR INSTALLATION ARRIVED RIGHT ON TIME, INTRODUCED HIMSELF, TOOK A LOOK AT THE PPLACEMENT OF THE EQUIPMENT AND GOT RIGHT TO WORK. HE EXPLAINED EVERYTHING THAT HE WOULD DO, ASKED IF THAT WAS ALRIGHT WITH US, THEN PROCEEDED WITH HIS WORK. EVERY ONCE IN A WHILE HE WOULD EXPLAIN WHAT HE WAS GOING TO DO NEXT. WHEN HE WAS DONE WE CHECKED THE WIFI CONNECTION WITH THE COMPUTERS AND iPHONES, THEN HE HARDWIRED THE TV FROM THE ROUTER,CHECKED IT, HAD US SIGN AND WE EXCHANGED PLEASANTRIES AS HE LEFT. GREAT EXPERIENCE, GREAT RECEPTION. wE WERE VERY PLEASED...   THANK YOU"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T15:40:40.000Z",
          "Titre": "The person who helped me transfer our…",
          "Contenu": "The person who helped me transfer our renter’s account into our name, was very helpful and understanding. Her name was Sara. She was patient with all my questions and explained all that we needed todo to successfully continue the service at our house. She was great! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Ryans",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T16:14:25.000Z",
          "Titre": "Boy did they deliver!",
          "Contenu": "Boy did they deliver!! From my first contact with Sara who checked to make sure there was room for us on the tower, to Jay who did the install, to the amazing internet service!!  We can use our cell phones for the first time in the 3 years that we’ve lived here, via the WiFi assist function.  Should have kicked Hughes satellite service to the curb long ago!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-08-03T19:58:16.000Z",
          "Titre": "I contacted SimplyBits to arrange for…",
          "Contenu": "I contacted SimplyBits to arrange for an installation. The lady from the service department was extremely knowledgeable and very friendly. I spent about 15 minutes on the phone and she arranged start dates, where I need to pick up equipment, etc. Very professional and excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BJM/KJM TUCSON AZ",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T01:32:29.000Z",
          "Titre": "We are so happy to improve our internet…",
          "Contenu": "We are so happy to improve our internet service with Simply Bits.  Our initial phone contact (Sarah)  was handled professionally.  Our installation was scheduled quickly and our technician, Donnie, was efficient and knowledgeable.  Our download and upload speeds are consistent with the package we purchased and is such an improvement from Centurylink.  Our prior  frustration has disappeared !  Thanks, Simply Bits!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T18:03:49.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Installers Justin Lewis and Austin Romero provided 💯 customer service and should be recognized. They were patient when asked questions and made sure all was in place before leaving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T04:28:11.000Z",
          "Titre": "Escape from DSL",
          "Contenu": "Installer came on time. He was polite, neat, and efficient. Service got up and running without snags. Big improvement from DSL that had me captive in our neighborhood."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandie",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T01:45:35.000Z",
          "Titre": "Wonderful service overall",
          "Contenu": "Everything with this company is great!! All the way from the first call, down to installation! Customer service was wonderful, my installer Justin was very kind and knowledgeable and my actual internet service has been great! Very happy that I decided to get connected with them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Very Happy Customer in Catalin",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T19:50:01.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service - When I called to inquire about service, a very friendly and personable rep help me decide what was best for my household.  She was knowledgeable and in no time I finally felt I found the service I was looking for.  She looked up my location to insure I was in line with a receiving tower so as to not waste any of our times.  The tech came out and installed my internet while explaining how everything worked to my husband.  He was also friendly and knowledgeable.  Since coming to AZ from a state that the question of good internet service wasn't never an issue, to the southern part of a state that can not seem to provide any reliable nor fast service, it was refreshing to find Simply Bits"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karol",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T19:33:02.000Z",
          "Titre": "I just purchased Simply Bits internet…",
          "Contenu": "I just purchased Simply Bits internet and so far it is EXCELLENT!  Great reception!  All my electronic devices/phone working very well!!!  Thanks, Austin, for being so professional, kind, great listener, and all around super technician!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2021-06-15T15:50:31.000Z",
          "Titre": "New Installation",
          "Contenu": "I called them out to see if my location had higher speed than I was getting from my previous service provider.  The installer was on time, professional, courteous, and quick.  My installation was relatively straightforward as it was already wired for a different provider, and I had my house routers set up.  But the job was done, speed is high, and customer service is good so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James S.",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T04:07:25.000Z",
          "Titre": "Great service reps",
          "Contenu": "Great service reps! They were friendly, knowledgeable, efficient, caring, and good natured. Provided quality setup service. I couldn’t have asked for a better install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T21:56:55.000Z",
          "Titre": "I just moved my internet service to Simply Bits",
          "Contenu": "I just moved my internet service to Simply Bits. The technical did a wonderful job a few days ago and so far the service is working beautifully. I'm really glad to get fast internet, save money, and support a local business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen K.",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T02:17:13.000Z",
          "Titre": "Great Service",
          "Contenu": "Reception agent and technician were great at explaining everything in detail and spending time to do so.  Everything went as scheduled and service working well.  Happy Customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marthat Retallick",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T16:25:04.000Z",
          "Titre": "Getting it DONE!",
          "Contenu": "For nearly two decades, I got my Internet from a national company that isn't renowned for its customer service.I experienced this during Easter weekend. On Holy Saturday, my Internet died.Oh, goodie. Another outage.Easter Sunday dawned bright and sunny. But my Internet service had yet to experience a resurrection.So, I called National Company’s local number. After I navigated through a lengthy voice mail trail, a recorded voice told me that the office was closed and I should try my call again later. No mention of when “later” was. The voice mail said nothing about office hours.On Easter Monday, I called National Company again. Got a live human! Who transferred me to tech support!Which was overseas.Although I had difficulty understanding the lady, she reset my modem.As soon as I was back online, I went to the Simply Bits website and signed up for local service. What a difference. Unlike National Company, which sent a whole team of installers to my house, Simply Bits sent one guy who got the whole installation done in a couple of hours.Count me as a fan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mer",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T16:44:42.000Z",
          "Titre": "We couldnt be happier!",
          "Contenu": "We couldnt be happier.  Don did the installation and was very knowledgeable, courteous, and  he explained everything that needed to be done.  He was also very willing to answer any questions we had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robbie",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T23:05:07.000Z",
          "Titre": "All went well and on schedule at the…",
          "Contenu": "All went well and on schedule at the installation.Donnie, the installer, was efficient, competent, and tidy.We are now awaiting our first bill, and months of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RogerG",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:35:45.000Z",
          "Titre": "Your service personnel go out of their…",
          "Contenu": "Your service personnel go out of their way to help resolve any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Schmidt",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T17:42:23.000Z",
          "Titre": "Our service was having issues",
          "Contenu": "Our service was having issues, and my bedridden mother-n-law lost service   I called the Simply Bits service line.  Susan was a wonderful help!    Because, as you know… “ If Mama ain’t happy, Ain’t no one Happy!   Thanks for making her happy!Mike & AnnMarie"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T20:09:53.000Z",
          "Titre": "Getting service established was easy…",
          "Contenu": "Getting service established was easy and straight forward.   The woman handling the phone for getting the service was knowledgeable and very helpful.  The installing technician was prompt, freely discussed how the system functions, and helped customize the service for our needs.  Everything connected like magic and we are very satisfied customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurence Fair",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T19:44:29.000Z",
          "Titre": "Kindness",
          "Contenu": "Everyone I have spoken to or been in contact with has been positive and helpful. I am very appreciative! That's hard to find in our society these days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delores Grayam",
          "Nb_Reviews": 3,
          "Date": "2021-05-26T18:26:39.000Z",
          "Titre": "We are so happy with Simply Bits",
          "Contenu": "We are so happy with Simply Bits, our new internet service.  The service is superb - everything as promised.  The crew sent to install the service was knowledgeable, professional and respectful.  Thank you Simply Bits!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rich p",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T04:13:33.000Z",
          "Titre": "Great support and followup!",
          "Contenu": "Our internet was down this morning and I called support. Suzette took the call, noted that there were lots of errors on the line. We tried a few things and the problem remained. She mentioned that the cable from our router could be the problem.. I just happened to have another cable, popped it in and I was off and running.  I was so surprised when she called me a few minutes later to report that I was back on line.  Great customer support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T23:49:17.000Z",
          "Titre": "Fantastic Technician!",
          "Contenu": "Jason and the other technician who came to our house were fantastic! They did a super job and educated me about my Internet service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brown",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T18:03:40.000Z",
          "Titre": "Justin was very professional",
          "Contenu": "Justin was very professional. He listened to our needs gave suggestions went over and above to make sure they were met. Great work ethic and personality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alvin Ottum",
          "Nb_Reviews": 2,
          "Date": "2022-07-29T01:06:40.000Z",
          "Titre": "Happiness",
          "Contenu": "Tech was very professional and spent some time on my roof getting the best possible signal. In my stubbornness I wanted to use my own router. It took some time to connect but once that was done there have been no issues so far. I am quite happy with the speed I'm getting.  Prompt service thanks to Tanya."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T18:18:09.000Z",
          "Titre": "The installers were great",
          "Contenu": "The installers were great - quick, helpful, and friendly. The service is a much improved state from 'other' bigger companies. Thanks to my neighbor for the recommendation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-03T01:23:13.000Z",
          "Titre": "The installer was professional and…",
          "Contenu": "The installer was professional and spent hours resolving issues with my devices, not Simply Bits. Performance has been better than quoted at sign up. Love it. Best decision I've made in a while."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessie",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T02:53:46.000Z",
          "Titre": "Austin was very professional",
          "Contenu": "Austin was very professional, explaining everything, cleaned up after he was done.  If all your employees are like Austin, we are happy already!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele R Tubac AZ",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T01:35:37.000Z",
          "Titre": "From my initial phone call",
          "Contenu": "From my initial phone call, to the service technician, Jay, everyone gave me excellent customer service. Their internet service has been terrific and I love knowing that if my needs mean I need more bandwidth, they can provide it easily!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T00:55:36.000Z",
          "Titre": "Justin was great",
          "Contenu": "Justin was great. Informed us about every step he will be taking to set us up with internet .. Internet with simplybits is wonderful fast and 100% reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn  Wang",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T05:13:23.000Z",
          "Titre": "It is worth trying out",
          "Contenu": "It was a smooth process from setting up the account to installation. Every person I have contacted and communicated with is professional and competent. No installation fee is a big plus. Nothing is hidden, as advertised. The Internet is up to speed. I am a very happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanque Verde Valley",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T23:50:47.000Z",
          "Titre": "Simply Bits is great",
          "Contenu": "Simply Bits is great.  Good and fast service, quality connection and best internet speeds, especially for those unable to get broadband internet.   Thank you Simply Bits."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T18:26:15.000Z",
          "Titre": "Thank you",
          "Contenu": "There were some communication errors in the beginning, but received a call and had service set up the service the very next day. Thank you for making it right! I really appreciate it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T13:21:09.000Z",
          "Titre": "We are extremely happy with the service…",
          "Contenu": "We are extremely happy with the service provided by simply bits. We did have issues with my older laptop but purchased software that corrected the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T23:00:24.000Z",
          "Titre": "The installation service was Great!",
          "Contenu": "The installation service was Great!They had to come back twice because a monsoon caught him the first tme bit it was easy to reschedule. great customer service and quick install"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty Van Horne",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T18:18:24.000Z",
          "Titre": "Jaye the installer was personable and…",
          "Contenu": "Jaye the installer was personable and informative. Although we are not able to access your current towers, maybe we can be a hub home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Humphries",
          "Nb_Reviews": 2,
          "Date": "2022-09-15T01:06:26.000Z",
          "Titre": "Shaun was awesome!!",
          "Contenu": "Shaun was awesome!!! He was very knowledgeable and asked me what my needs were for my internet and if I had security cameras and told me what to expect. I had called him after canceling with Hughes Net!! They sucked!!! Shaun should get a raise!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T18:29:33.000Z",
          "Titre": "Great customer service",
          "Contenu": "Called in because I wanted their service for internet. The gentlemen was very helpful and efficient. The  installation service was pushed out to the earliest appointment. He answered all of my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T11:15:29.000Z",
          "Titre": "Simply Bits so far is simply perfect",
          "Contenu": "Simply Bits so far is simply perfect!  Had a glitch the first 24 hours as lightening struck the transmission tower, but SB called us to check up on our service and it was up and running in no time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loree",
          "Nb_Reviews": 4,
          "Date": "2022-07-31T03:51:28.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience.  Easy to schedule. On time install. Very thorough explanation of what they were going to do, and then a test of everything after they left. Nice guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Crockett",
          "Nb_Reviews": 2,
          "Date": "2022-01-02T15:17:08.000Z",
          "Titre": "Prompt service",
          "Contenu": "Prompt service, ease of installation. Technician provided overview of system and app. Coverage can sometimes be spotty on a laptop but using a local company is paramount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cella core",
          "Nb_Reviews": 6,
          "Date": "2022-06-13T14:51:54.000Z",
          "Titre": "so far so good",
          "Contenu": "so far so good! customer service is on the ball. Installation technicians are polite, friendly, courteous and know how to get it installed without issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerjudy",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T15:50:29.000Z",
          "Titre": "GOOD SERVICE",
          "Contenu": "GOOD SERVICEI appreciate the prompt help from people instead of automation. If this is how you address all problems I will be a happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JANET S",
          "Nb_Reviews": 2,
          "Date": "2021-11-02T16:51:30.000Z",
          "Titre": "They delivered everything as promised",
          "Contenu": "They delivered everything as promised, the women I booked with was polite, informative The installer was also very friendly knowledgeable and politeThe wo fi service is amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly Minter",
          "Nb_Reviews": 2,
          "Date": "2021-04-22T00:32:57.000Z",
          "Titre": "Great experience",
          "Contenu": "My first call for help with a new internet provider was toSimply Bits.  I spoke with Cheryl who was so kind and helpful.After dealing with another company for two years, she was abreath of fresh air.  The installer was kind as well  as instructive.I am very pleased with my new service and look to the futurewith good expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas B. Tuc.Az",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T06:38:15.000Z",
          "Titre": "WIFI For Dummies made easy",
          "Contenu": "The sales representative, Ryan was great and answered all my questions. My installer made the setup and App. System easy on me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr.Jay",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T19:42:05.000Z",
          "Titre": "Excellent service!",
          "Contenu": "Oh I live in San Manuel Arizona and I have been on a hunt to get good Internet service. I have been through about four providers and all the services I get do not work very well at all. I saw the ad for SimplyBits and thought I’d give it a car and I have to say it is the best Internet that I have received up here in San Manuel. It works extremely good and I am very impressed. The technician that came out was extremely kind friendly and helpful. He explained everything he was doing and was just a great help all together. So I’ve only had this service for about a week and I have nothing bad to say about it at all. All positive. I work from home and do a lot of streaming and this Internet has worked perfectly! I will be recommending this Internet service to everybody up here in San Manuel! Thankyou Simply Bits!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvette Villamana",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T18:30:38.628Z",
          "Titre": "SERVICE!!!!!!",
          "Contenu": "I spoke with Tanya and Derek..both were helpful, friendly and professional!  I am so anxious to start My service with Simply Bits..they actually answer the phone.  Good bye Century Link!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Zuern",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T05:39:57.000Z",
          "Titre": "Jay did a great job installing and walk…",
          "Contenu": "Jay did a great job installing and walk me through all that needed to connect with the SimplyBits WiFi, Jay was fast and very professional.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andres",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T04:26:31.000Z",
          "Titre": "Outstanding",
          "Contenu": "Simply bits service has been outstanding. I am extremly satisfied with this service. Best service provider in rio rico, AZ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T05:17:39.781Z",
          "Titre": "Service",
          "Contenu": "The technician was very professional and installed the satellite dish quickly and with no mess. The service has been great so far; no problems whatsoever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reikijo",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T00:07:57.000Z",
          "Titre": "Great technician",
          "Contenu": "Technician on time, professional, answered all my questions. Started my setup. Changing all my connected items was simple and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabiola Montelongo",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T18:52:11.000Z",
          "Titre": "Professional and know legible technician",
          "Contenu": "The technician did a complete analysis of my residence to confirm the service could be provided.He was very knowledgeable and took his time to explain in detail the process of installation and also answered questions and concerns to the installation.He was very respectful and professional the whole time."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Douglas Oakes",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T14:04:02.000Z",
          "Titre": "Showed up on time",
          "Contenu": "Showed up on time.  Were efficient in the installation and answered any questions that I had.  The modem integrated into my existing system without any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerry detty",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T21:23:18.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised. Beats the hell out of Century Link! You can get a real person to talk too. Spent two weeks trying to get Century Link to come out and restore service with no luck. I'm saving $50 to boot!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Hutcherson",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T18:40:06.000Z",
          "Titre": "Don did an excellent job with the…",
          "Contenu": "Don did an excellent job with the install very pleased with his work he was quick polite inefficient would recommend him to all my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Inv",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T00:34:33.000Z",
          "Titre": "Installer when above and beyond to set…",
          "Contenu": "Installer when above and beyond to set the dish properly, not an easy task.HIs extra effort was much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PRC",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T17:14:24.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Technician was great and customer service was just as super.  Very knowledgeable and efficient in their service.  So far no outages which I experienced with my last provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya and Racy Clark",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T23:09:55.000Z",
          "Titre": "Best Experience By Far",
          "Contenu": "It was nice to just call make an appointment they came out a couple days later. The tech was friendly and quick. The tech went through everything with us and made the experience very easy. Thank you for the great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2021-10-13T17:04:51.000Z",
          "Titre": "Pleasantly surprised!",
          "Contenu": "I was concerned that the speed would not be enough for my family, but everything has been working well. Install was painless and the service is working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tubac Cowboy",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T15:59:35.000Z",
          "Titre": "Easy Setup and Great Customer Service",
          "Contenu": "Easy Setup and Great Customer Service. Simple options and no hidden fees. Appreciate a smart company that puts the customer first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T16:05:06.000Z",
          "Titre": "It was great that they tried to find a…",
          "Contenu": "It was great that they tried to find a signal from various locations but unfortunately there was no signal to be found."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Vidal",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T22:10:33.000Z",
          "Titre": "Pretty Simple and to the point",
          "Contenu": "Pretty Simple and to the point, I am Happy that everything worked out, moving is very stressful and the whole experience was Great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Winn",
          "Nb_Reviews": 2,
          "Date": "2021-04-14T13:51:03.000Z",
          "Titre": "Helpful great service…",
          "Contenu": "I recieved a call from your employee she was helpful, answered all of our questions and gave us good instruction to get our service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N Campuzano",
          "Nb_Reviews": 2,
          "Date": "2022-01-24T17:56:57.000Z",
          "Titre": "My service with Simply Bits",
          "Contenu": "Interaction with my phone call to Simply Bits and speaking with the sales rep was excellent and the person who came and installed the Simply Bits dish and router was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T17:52:53.000Z",
          "Titre": "Simply Bits customer service was very…",
          "Contenu": "Simply Bits customer service was very easy to deal with and very friendlyAlthough they were hard to get in touch with at timesSo far the service has been excellent"
        }
      ]
    }
  ]
}