{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.istripper.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Janosch Brunnmüller",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:40:13.000Z",
          "Titre": "What is Not good",
          "Contenu": "I Have Played the Game „Black friday sale“ and i won 3 Keys to Open the treasure-Box > and i won Only 20 credits. But in the Description Write: 1000 credits.The Shows Not working all day.One xxx-show is without Sound."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "memberLawrence Quattrociocchi",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T12:39:16.000Z",
          "Titre": "They never OK my credit cards"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Rodgers",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T01:59:30.000Z",
          "Titre": "You did this to me before",
          "Contenu": "I ordered credits and it gave a free trial of something i didn't want. Then i looked at my bank statement and was ticked off because i was charged $2 on top of my credit purchase for the \"FREE TRIAL\". Then i had to go to the website to cancel it before it started ripping me off monthly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lewis",
          "Nb_Reviews": 6,
          "Date": "2023-08-23T15:15:41.000Z",
          "Titre": "No Sound of Music",
          "Contenu": "I reboot the modem/ internet connection and reboot my computer,Clear browser cookies, check firewall and turn off my anti-virus software,Open browser and download istripper.com, I didn't uninstall it.Re-download it again and still NO SOUND in the Music, but have sound in the Show,I Only hear the Show sound, the cards voices, but not the music in the shows and the back grounds 2D. But still don't hear the music that I install to the 2D background. and or all of my mp3 files,The cards that I place into the Previews Column, don't stay in the column.This the worth software That y'all ever design. The graphics is okay. But the technology within the software is insane it doesn't work.I've been trying for weeks to get my mp3 music to play and still haven't got a solution from your Tech support team.Tell me how the model can dance without the sound of music?YES, the volume button is open and no sound in music, the volume botton is open in show I hear cards talkingYes, install in the directory and add the according zip file to this folder: C: \\ Users \\ [User] \\ AppData \\ Local \\ vghd \\ binVersion 64 bit : istripper/multimedia/dll_openGL_x64.zipSTILL NO SOUND IN THE MUSIC - BUT HAVE SOUND IN THE SHOW"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Petesnd56",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T01:23:39.000Z",
          "Titre": "it took me multiple times I mean…",
          "Contenu": "it took me multiple times I mean multiple times to purchase creditsthat never happened beforeI almost give up but I kept on trying ( about 2 hours+)I won't be so persistant next time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrian Black",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T03:29:22.000Z",
          "Titre": "Credit Card Fraud",
          "Contenu": "I paid hundreds of dollars to buy shows on the istripper mobile platform. I am now being asked to pay a monthly fee to access shows I have already purchased. They claim to have changed their business model. What they have done is try to charge twice for the same thing. They continue to lie and obfuscate what they have done. They have offered me a month of free membership (worth 12.99) to compensate me for the hundreds of dollars they have scammed me out of.For those of you who continue to purchase shows on their desktop app, how long before they do exactly the same thing and lock your shows behind a paywall and demand a monthly fee to watch them? As the saying goes: “The best predictor of future behavior is past behavior”. Save yourself from being scammed and find a site to give your money to that isn't run by crazy liars, there are thousands of good ones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-02-19T05:09:29.000Z",
          "Titre": "This 2 app nonsense is ridiculous",
          "Contenu": "It went fine, I just hate that to Mobile app and the desktop app aren't connected. It's ridiculous that I can't see the content I paid for on the other platform. I've been collecting cards for years, only to be robbed of access to them on the mobile app."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T20:42:44.000Z",
          "Titre": "I paid $49.99 and received no credits…",
          "Contenu": "I paid $49.99 and received no credits so I am going to have to dispute the charge. Also apparently I have 2 accounts and maybe the credit went to the wrong one. I would very much like to see if I can merge the two accounts as I have credits and titles on both accounts and don't know how to switch between the two. Can you help me?"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Robert Gawron",
          "Nb_Reviews": 5,
          "Date": "2023-02-07T00:59:15.000Z",
          "Titre": "Trustpilot do not block Przelewy24",
          "Contenu": "since last year until now, nothing has changed when it comes to payments... unfortunately, epoch and trustpilot prefer to promote paysafe.card rather than give a choice as it was before, i.e. if I want to pay via Przelewy24, then don't change to paysafe.card.I did this simulation to see if anything has changed...unfortunately you are still stubborn. I chose \"Direct\" and all the time, despite the change from paysafe.card to Przelewy24, it returns to paysafe.card.... I have an account with you and I still have 229 cards bought... because you don't want or are unable to fix the error when choosing a payment. ...so the purchase boycott continues."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Robert Gawron",
          "Nb_Reviews": 5,
          "Date": "2023-03-19T21:49:29.000Z",
          "Titre": "Problem downloading purchased shows",
          "Contenu": "there was an error during sync and so all the time, i can't watch the 30 second shows because it doesn't download e.g. Lana Lane, just error all the time, i bought the full show, it downloaded the credits and i can't download or watch and that's why i give you 1*"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Kesner",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:37:20.000Z",
          "Titre": "Nonexistant Support",
          "Contenu": "I was initially quite impressed with the product and enjoyed it. I accidentally opened an ad that took me to the landing page for this and I decided to give it a try when a small promo offer popped up offering a free show for new users.  So I went to the regular download page for the app and installed it.  Then went back to click the promo link which was actually a full installer.  Since I had an existing copy of the app running I got no show.  I figured it would be easily resolved with help from support so I went ahead and spent $45 within a couple days to start my collection. Also, beware the stupid games you have to waste credits playing. The rules are not very clearly explained and its all just a ruse to make you waste your credits.  Tried 1 play on two different events; lost both for a total of 65 credits. Those were minimum bets.  Keep in mind you only get 25 credits for $5.  Long story short: After contacting support three times about the missing promo, I have not even received an acknowledgement that my message was received.  My experience has made clear that they just want your money and don't care about the product or being fair to customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T21:42:28.000Z",
          "Titre": "Not my thing.",
          "Contenu": "Not my thing. Technical bugs and glitches, variety and quality is lacking. Just overall not what I expected and was disappointed."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Sergio",
          "Nb_Reviews": 5,
          "Date": "2023-02-03T12:02:16.000Z",
          "Titre": "App is unusable",
          "Contenu": "App is too complex, completely unusable.It does what it wants, it does not allow in the simplest and most basic function, choose what you want.Utterly irrating >:("
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Корпус Корпус",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T23:18:00.000Z",
          "Titre": "I have 300 Mbps download speed and this…",
          "Contenu": "I have 300 Mbps download speed and this thing drops it to 0 or increases my package loss, even when its closed, had to delete it for that"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T19:18:55.000Z",
          "Titre": "It's porn and I shouldn't be buying it",
          "Contenu": "It's porn and I shouldn't be buying it.  It's shameful but I still do it and I am embarrassed that I treat women this way and that it is offensive to others dear to me."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "elpalapala",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T20:42:55.000Z",
          "Titre": "can't buy what I want",
          "Contenu": "the shows that I want I can't buy, because apparently I need to buy at least 40 shows ( that I'm not interested in) before I'm able to buy those shows that I want...In my opinion this don't make sense"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "iPhone user",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T20:41:42.000Z",
          "Titre": "Is there mobile access to istripper content",
          "Contenu": "I am frustrated that I can’t get access to my previous purchased online content on an iPhone or iPad. Is there any way to do this!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T22:15:50.000Z",
          "Titre": "Could not use paypal.",
          "Contenu": "Could not use paypal.A Paypal popup asked me credit card information instead of using my paypal credit.I finally had to use my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stan K",
          "Nb_Reviews": 3,
          "Date": "2023-03-12T00:10:35.000Z",
          "Titre": "yosomething is wrong , your new formate allows me to purchase…",
          "Contenu": "your new formate allows me to purchase models but leaves no way toaccess my collection so I cannot view what I purchases,"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T16:10:21.000Z",
          "Titre": "dont go near this site!!!!",
          "Contenu": "paying to this site is a pure waste of money,one charge advertised and a much higher charged plus you get a sneaky charge for a subscription to another site you definitely dont want or need,no customer support,they give you the running and nothing is fixed and ,if that was not enough you cant even download the show you want before you have done so with previous charge for other forties,you dont get to download it ,you dont get to own it but you pay through your nose...basically:a scam"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T10:51:15.000Z",
          "Titre": "Going for NFT's",
          "Contenu": "I dislike NFT's and its just sad to see them going with it, all the \"Cards\" they trade on Dolz would sell without a doubt in the normal program, they alredy have a money grab with special event cards + a supscription option, and now they also lock shows behined a limited number, it wouldn't be as big of an deal to me if i could turn promotion for it off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe P.",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T18:40:03.000Z",
          "Titre": "Works as advertised!",
          "Contenu": "Everything works fine!I recommend it if it’s what you are looking for."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T16:19:47.000Z",
          "Titre": "Never recived an extra code for my test…",
          "Contenu": "Never recived an extra code for my test months for a sex site with hot videos thats just crap"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T01:43:25.000Z",
          "Titre": "loadingg issues",
          "Contenu": "I was trying to get several different ones and there were loading issues.  This was not the first time."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T00:47:53.000Z",
          "Titre": "stop the greedy auction nonsense",
          "Contenu": "stop the greedy auction nonsense, creating a limted supply while its digital"
        },
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T14:27:05.000Z",
          "Titre": "I want to know why sergepay took…",
          "Contenu": "I want to know why sergepay took additional 19.99usd from my account"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Thecle",
          "Nb_Reviews": 3,
          "Date": "2023-01-21T20:50:21.000Z",
          "Titre": "Mobile version must now be paid even if…",
          "Contenu": "Mobile version must now be paid even if we already bought the show.  Poor commercial move."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-23T16:17:32.000Z",
          "Titre": "I can't get into my account for 1 and…",
          "Contenu": "I can't get into my account for 1 and the other has all my girls the other does not"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Kunde",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T23:54:13.000Z",
          "Titre": "The promotion-games sucks as hell",
          "Contenu": "The promotion-games sucks as hell. It`s a good method to make much money. same as gambling...only for special cards. oh damn"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sonnyblu",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T21:50:19.000Z",
          "Titre": "The resolution sucks..",
          "Contenu": "The resolution sucks... 3K? Not at all... No access to or anyway to play the files you purchase. No control over your files... If I could have these files in 4K and I could play them whenever and however I wanted to, I would be happy. Also... What's with the way over exposed photos... AND It turns off my HDR... Everybody has HDR now... Get with the program. iStripper sucks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN UNKLE, JR.",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T04:02:36.000Z",
          "Titre": "To difficult to navigate hard to find…",
          "Contenu": "To difficult to navigate hard to find what I purchased"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Rami Tchaikovski",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T21:02:58.000Z",
          "Titre": "I could not download models after…",
          "Contenu": "I could not download models after buying credits."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shyck",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T02:32:19.000Z",
          "Titre": "promotional product scam…",
          "Contenu": "Purchased what was promotional product but was billed several hundred dollars by an unknown company"
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T16:52:53.000Z",
          "Titre": "Did payment and didn receive credits",
          "Contenu": "Did payment and didn receive credits. Why?"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Michael Didsbury",
          "Nb_Reviews": 2,
          "Date": "2023-01-08T23:31:35.000Z",
          "Titre": "Trying to pay for credits",
          "Contenu": "Trying to pay for credits, keeps failing"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "TREVOR",
          "Nb_Reviews": 7,
          "Date": "2022-09-02T21:31:25.000Z",
          "Titre": "Everything Gone",
          "Contenu": "As I have said not happy with I Stripper lost all my girls when I upgraded the site a while ago you told me how to get them back but not being a computer wizard haven't had any luck as to date, but I bought my first girl yesterday and that has gone this morning as well,  what is going on so you can understand why I am not to happy"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T13:37:24.000Z",
          "Titre": "too many money to become a special Card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Drew Jones",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T18:16:34.000Z",
          "Titre": "I purchased credits and when I went…",
          "Contenu": "I purchased credits and when I went back to my home page all my models were gone. 120. It still says that I own those 120 cards though but they do not show up. I’ve tried uninstalling and reinstalling the program. Resetting my computer. Rebuild library and nothing works. I’ve also submitted a ticket and had no response."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Robert Gawron",
          "Nb_Reviews": 5,
          "Date": "2022-09-21T15:12:44.000Z",
          "Titre": "where are my 250 purchased credits?",
          "Contenu": "Today, by internet transfer, I bought 250 credits in Istripped ... money has arrived, no credits ... I have a lesson not to trust this form of payment ... and I was disappointed with Istripped"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T00:50:18.000Z",
          "Titre": "Can’t access the shows I already bought…",
          "Contenu": "Can’t access the shows I already bought would give 0 stars if I could"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T07:55:17.000Z",
          "Titre": "Poor payment method",
          "Contenu": "Good day, I had a truly awful experience with your method of purchase, where there was an unbeknownst checkbox that I thought was merely complying with your terms of service, I had find out very rudely that the checkbox was for a subscription THAT I DID NOT WANT. This practice of yours of automatically checking subscription boxes is highly upsetting and inconvenient, and it really killed my drive for exploring your content. But really, I cannot believe I spent money on being treated in such a terrible manner, I should really just have refunded and got my money back and not bought anything, losing money probably would have gotten through to you a lot better."
        },
        {
          "Note": 1,
          "Lieu": "PS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T16:36:42.000Z",
          "Titre": "expensive the price must be lower"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "M KING",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T19:37:35.000Z",
          "Titre": "This App is a complete waste of time",
          "Contenu": "This App is a complete waste of time. First of all seeing women naked in a computer screen is not satisfying at all.  the real pussy is ten times better.  this app is nothing but  living in fantasy world and really a delusion. and a distraction . its not providing real value. therefore i'm not spending my money on it. .also jerking off to porn is disgusting. i had just un-installed this app from my computer. and deleted. . not worth my time."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2022-03-12T01:18:40.000Z",
          "Titre": "Ever since my last purchases",
          "Contenu": "Ever since my last purchases, the site hasn't been working properly. The problems are too numerous to mention. I can't always call my girls, I can't move them to different locals. I get glitches and sometimes everything goes white and I can't do anything. I regret my last purchases because of this. As far as the girls go, if they would just behave themselves everything would be great!"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T11:25:33.000Z",
          "Titre": "Very confusing",
          "Contenu": "Very confusing - I received a mail from invitations@trustpilotmail asking me HOW DID WE DO, after a recent purchase.But you did not do anything - I did all the work - I chose the product - I uploaded funds - I chose the time and date to make purchase.Therefore, since you were not involved, there is nothing to review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-20T03:12:28.000Z",
          "Titre": "I added 25 credits for $4.99 and tried…",
          "Contenu": "I added 25 credits for $4.99 and tried to down load a new girl and got the same error message.  An error occurred during synchronisation   and all security programs are turned off.                                                                                Nothing has changed. I still do not have all the girls pictures back. I want the $4.99 refunded back.   Still on pictures. Do I need to remove iStripper From my computer and Re-install if so I need the PASSWORD I forgot it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "long time customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-19T16:27:14.000Z",
          "Titre": "I see nothing but complaints on special…",
          "Contenu": "I see nothing but complaints on special cards no one can buy.I have asked customer support more than once how one goes about buying them, never an answer. So dont actually believe customer opinions are important to you. End the special cards, put a price on them. Behave like a business.Does anything in your response change the fact that your customers DONT LIKE THAT?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zac Youngblood",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T13:45:18.000Z",
          "Titre": "It's not really worth the money",
          "Contenu": "It's not really worth the money . The whole set up of the app is just ridiculous.  You can't skip through without missing good parts and it takes forever to get to the point . I can get free stuff that is better than this ."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T13:51:40.000Z",
          "Titre": "I hope you guys understand why 1 star!",
          "Contenu": "Well the reason i give you guys just 1 star is because you guys took about 9 or 12 girls of your program, but i did pay for does girls and i have now about 9 or 12 empty spots! Why didn't you guys give the People a choice to get new girls or money back on there account like the price they have payed for the girls. Or just the new gilrs would be fine too, but i hope you guys understand what i mean with what i just said! Because this is just BullS**t! But the girl i bought a few weeks ago is perfect. O and Btw free choise of pick on the new gilrs!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-24T22:34:20.000Z",
          "Titre": "Stop scamming people",
          "Contenu": "iStripper is excellent but i dont like being subscribed for other services when i purchased credit.If i wanted a SexArt sub i would buy one.Its dishonest and sneaky.Stop it!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T16:23:10.000Z",
          "Titre": "I purchased two shows for 25 credits…",
          "Contenu": "I purchased two shows for 25 credits each. I got to see one show and then within 3 hours they both disappeared from my collection and I was not able to see the second show.  I have uninstalled your program from my computer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2020-05-24T22:33:57.000Z",
          "Titre": "So far terrible",
          "Contenu": "So far terrible. I purchased 4 cards and none of the 4 downloaded. Not only that, the 16 cards I already had no longer work since i made yesterday's purchase. They worked great before yesterday. So I opened a ticket with support and haven't heard from anybody yet other than you guys who want a review. So for 15 dollars, the whole program is completely shot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jknight63 & i27775217(new one when I download app",
          "Nb_Reviews": 2,
          "Date": "2020-08-31T02:10:48.000Z",
          "Titre": "I have an account which I purchased a…",
          "Contenu": "I have an account which I purchased a stripper but the show doesnt show everything because when she starts to take off her top it resets. I contacted support and they said to download the app and when I did I got some default ID instead of my original ID and the purchase wasnt on there. So just be careful when you purchase this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T21:44:58.000Z",
          "Titre": "Program not user friendly"
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Andros",
          "Nb_Reviews": 1,
          "Date": "2019-08-09T20:32:23.000Z",
          "Titre": "I joined around 2014",
          "Contenu": "I joined around 2014. I'm a gay man, and this was and still is the only desktop stripper that has also male models. FOR THE PAST % YEARS THEY KEEP PROMISING US THAT THEY ADD NEW MALE MODELS! Guess what never happened, the last one was added 4 or 5 years ago, nothing ever since just empty promises... #disappointed At least be honest if you never going to do add new male strippers! Liars!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "memberWTF",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T16:36:25.000Z",
          "Titre": "My application doesn't work on my…",
          "Contenu": "My application doesn't work on my computer, asking for password and doesn't accept one all the time. even after I purchased a premium app it doesn't change anything. The website doesn't have directions how to upgrade to \"Premium\" and it doesn't happened automatically."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Grow",
          "Nb_Reviews": 2,
          "Date": "2020-03-16T16:35:35.000Z",
          "Titre": "Total ripoff,",
          "Contenu": "I have yet to see anything from you except the fact that you took my money. How can I rate a ripoff. Judging from your guidelines I'm certain you have a history of conning customers. Have as much fun as you can with my $15 bucks. You won't get anymore. And if I could, I would find you and kick $15 out of your butt."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T20:27:05.000Z",
          "Titre": "enrolled to 3rd party without visible check mark.",
          "Contenu": "Was enrolled to an 3rd party for an autorenewal not displayed on the PayPal purchase screen, and was never even given access to said 3rd party so I'm not sure if I have to unenroll and if I do how I go about it.Most unerving..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T03:23:52.000Z",
          "Titre": "Annoying and Frustrating",
          "Contenu": "Annoying and Frustrating(a) Model pop-ups appear on screen of those that I have not chosen and there is no method of stopping these annoying pop-ups.(b) Once installed and registered with a valid password, I am unable to enter into iStripper even with a current, valid password."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T07:54:10.000Z",
          "Titre": "you changed i lost all of my  cards"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "i27450027",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T17:53:05.000Z",
          "Titre": "Hello..only few days member..have to…",
          "Contenu": "Hello..only few days member..have to login each time after quit website...not at all interactive or interaction with girls...difficult tofind out menu and settings..full screen always display another girl and dissappear when you click on it to do setting...notreally what I was expecting from this site..hmmMP"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "andy1098",
          "Nb_Reviews": 1,
          "Date": "2019-03-26T06:27:06.000Z",
          "Titre": "I couldn’t find the download",
          "Contenu": "When I downloaded the girl I chose I couldn’t remember her name and took me ages to find her in my collection to make sure it was working is there a way doing this quicker other than writing down the name which I should’ve doneI know the name is on the card but I forgot the name when it downloaded to check the download was ok"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2021-08-11T01:53:18.000Z",
          "Titre": "Doesn't keep the dancers i pick",
          "Contenu": "Doesn't keep the dancers i pick, Gives me dancers I don't' want. I paid for a show from Mia Malkova and even though I have a emailconfirmation of receipt, it says I don't have the credit. Well what did I pay for then?ID i28358771"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Gerhard Otto Aksdal",
          "Nb_Reviews": 4,
          "Date": "2021-07-01T22:23:07.000Z",
          "Titre": "I  have  over  3000  cards  in  my …",
          "Contenu": "I  have  over  3000  cards  in  my  collection.   When  they  are  presented,  only  a  part  of  the  strippers  are  presented  again  and  again.  This  is  a  question  of  Indexation  and  Radomsation.   What  I  want  is:  If  I  e.g.  chosse  Strippers  and  StrippersXXX,  I  want  these  girls  loaded  ready  for  presentation,  one  after  the  other.   I  have  not  purchased  all  these  cards,  and  only  have  a  small  number  of  them  presented.  I  have  made  numerous  complaints  about  this,  all  complaints  beeing  totally  ignored  by  Manue.  This  is  not  the  way  to  treath  your  costomers."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Jorjohn",
          "Nb_Reviews": 1,
          "Date": "2019-03-29T12:34:06.000Z",
          "Titre": "Half hour download to show anything",
          "Contenu": "I bought a show that took half an hour to download, however the show takes only 12 minutes, and almost shows nothing, I did not like.--------SOLVEDThe customer service department answered me very well, guided me, I needed to configure the duration of the videos, I did it and I solved the problem."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Stephan Richter (DJRoadRunner)",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T06:01:53.000Z",
          "Titre": "istripper is not that it was once.",
          "Contenu": "istripper is not that it was once.What bothers me about istripper are the specialcards and what I have seen now that the paysafecard payment was taken out.even worse for me.My conclusion, I was once a customer of istripper, not now because istripper has become more and more worse."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Lucas C. S.",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T00:08:20.000Z",
          "Titre": "Asked for a refund on a regret purchase…",
          "Contenu": "Asked for a refund on a regret purchase and the developer kicked me out of steam and replied with: Ask your dad for a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-13T05:45:31.000Z",
          "Titre": "I renewed my account when I got the…",
          "Contenu": "I renewed my account when I got the email you finally got your technology to work on mobile devices. All I use anymore are the iPhone and iPad. I’ve downloaded the models mobile profile and none of them work, so no, you are not meeting my needs or expectations"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gary   Taylor .",
          "Nb_Reviews": 1,
          "Date": "2020-01-07T18:45:46.000Z",
          "Titre": "I give you one star,in protest",
          "Contenu": "I give you one star,in protest, as i purchased Paula Shy last night, and i still cannot get it to  play, i can get into my account, she is in there, but i cannot seem to download her, or get her to play, what am i doing wrong, i have also sent you e-mails to try to fix the problem, so far you have  not replied, and you have not been of any help whatsoever, you have my £4.01 penny, i have my i stripper girl, but how do i get her toplay, not at all satisfied, hence the one star, WHICH I BEGRUDGE, and there will be NO FUTURE TRANSACTIONS, NOT AT ALL HAPPY Gary ."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "v25094137",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T13:21:52.000Z",
          "Titre": "I buy the package 500 credits +100…",
          "Contenu": "I buy the package 500 credits +100 credits ( black Friday deals). I buy 5 models ( about each 22.50)  iStripper deducted ALL my credits and left 1 credits.Very  very suck !!  Wrote complaint no response.I am genuine buyer and hope can return my balance credits about 490 credits.I did NOT buy the adven package. I click on the model I want to buy. Why just deducted the package 540 credits without I knowing. Isn't it suck!  I checked my purchased history. Why the advent2019 package charged to me. I don't even purchased it. Please returned back 540 credits."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-02-17T01:34:42.000Z",
          "Titre": "They are fine with their customers' accounts being hacked and credits used fraudulently.",
          "Contenu": "So, usually within a day of me logging into my account, after having to reset my password, someone else asks for a password reset and logs in, locking me out. I even get notification from iStripper telling me it was done. The email provides a link to contact customer service so I can contact them in the event it was done fraudulently. I have done so a handful of times, with no corrective action taken. Not even a response. Since whoever else is accessing my account has been using my credits, I feel I am due a refund from iStripper due to their negligence."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.rankin",
          "Nb_Reviews": 2,
          "Date": "2021-04-12T16:04:05.000Z",
          "Titre": "WONT EVEN PLAY ENTIRE SHOW! 🤬",
          "Contenu": "My first purchase was of the very sexy and sensual Belka, Springing to life, I believe was the name of the show and all it lets me watch is like the first minute to minute and a half! I barely get to see her sexy ass nude! NOT HAPPY!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T22:41:25.000Z",
          "Titre": "Don't Give Out My Info!",
          "Contenu": "Normally, the reload process is fine. Sometimes, there's an offer, but no big deal if you are not interested. This time, without my consent, my information was given to a third party site, who then emailed me that I had been opted in to a recurring monthly payment. I had three days to figure out how to cancel what was going to be a $40 per month charge, for a service I did not sign up for nor want. I got it sorted, but it required talking to a representative, as the website cancellation just loops around between three sites and does not actually cancel anything. I will continue to use iStripper, but reloading is now fraught with difficulty, as I do not want a repeat of this misuse of my information."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "maverick007nz",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T19:57:30.000Z",
          "Titre": "1 star is being generous",
          "Contenu": "Well for a start, I used to be a VirtuaGirl subscriber, and I had tonnes of girls which I purchased... So now I have rejoined iStripper (they are one and the same), and I can't load my VG girls into it? That is a blatant ripoff.... to have to repurchase the same stuff is just not on I am afraid.To be honest, I don't know why i joined iStripper... I looked through all the girls and I can only see a few that actually interest me... most are just ordinary... at least in VG days there was some gorgeous babes.... these ones are not worth the money....Sorry iStripper, 1 star is all you earn in my books"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T.Miller",
          "Nb_Reviews": 2,
          "Date": "2020-05-12T05:00:33.000Z",
          "Titre": "If I could give it zero....",
          "Contenu": "If o could give it zero, I would. Crashes my system, can't find the downloaded card. I seriously figured it was just me being technically inept, but theres no communication between the running program and the online connection, it's like chaos trying to navigate I haven't even bothered to uninstall it because it just crashes my laptop anyway. I was looking for a reason to get a new laptop, thanks to istripper now I have to. (and being IN the adult industry myself, I really wanted it to work! I'm sure I'll find you guys at AVN eventually, which is why I'm saving this laptop as it is til then)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T04:25:16.000Z",
          "Titre": "Hope This Helps",
          "Contenu": "I love the content yet when you take my credits for a scratch ticket kind of lose interest next time make sure you warn a person..Not that hard to figure.(Side note booty shaking has to come back only see a few girls do so and it is not even long enough)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "zasha",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T21:49:47.000Z",
          "Titre": "lost the charm these days no erotic…",
          "Contenu": "lost the charm these days no erotic video , just some random girls walking naked on ur desktop.the have to increase the quality of modelscurve and bb are always better for these kind of videos"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-08-04T06:17:10.000Z",
          "Titre": "Selected girl will do four brief…",
          "Contenu": "Selected girl will do four brief segments, then the same segments start over again. tt says this girl's program lasts 43 minutes, yet all she does is the same 4 brief segments (lasting about 10 minutes). Then the same segments start all over again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2019-12-10T14:04:18.000Z",
          "Titre": "Stop gating premier content behind rng…",
          "Contenu": "Stop gating premier content behind rng paywalls, it's disrespectful and dishonest.Reply - I'm not talking about the memberships. I'm talking about cards that cannot be purchased and require a member to play RNG games to obtain, i.e. gambling. To make it even more obtuse there is no schedule to when the \"game\" can be played so unless you check the site every single day you'll have no way to get something you actually want. You can apply whatever label you want, but if the only way to get a certain card is via playing an RNG game on random days, then your service requires members to gamble to get content."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T16:53:56.000Z",
          "Titre": "Server issues",
          "Contenu": "Was able to purchase credits, but for 2 days have had an error message while trying to download anything. I tried using the site's troubleshooting page, but received another server error message"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jfr",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T16:07:55.000Z",
          "Titre": "can't get the shows that I purchased",
          "Contenu": "I just purchased 2 shows,one was added to my collection but won't download the other says it is in my collection but it is not there"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2019-08-08T04:27:23.000Z",
          "Titre": "disappointed could not get to cards to…",
          "Contenu": "disappointed could not get to cards to down load for the men .I sent a latter to  them to delete my account   and refund my money.I  have not heard from them  its a big rip off  I would have gave no stars if it had been there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-06T05:42:40.000Z",
          "Titre": "This app sucks i was a member and it is…",
          "Contenu": "This app sucks i was a member and it is a great app but if you forget your pass word and user name then your out of luck i might as well go to a real strip joint like a man not a pussy"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "v22603723",
          "Nb_Reviews": 1,
          "Date": "2019-03-09T15:18:00.000Z",
          "Titre": "After the purchase lost 10 credits just like that.,",
          "Contenu": "After the purchase my I won A special event card but it is not added to my collection & yes I lost my 10 credits just like that.Contacted customer support no response from them even now.So my Experience? Terrible."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T01:09:09.000Z",
          "Titre": "First",
          "Contenu": "First, I used app for several months. It was perfect. However, I could not enter app anymore because of Server timeout error. I live in Turkey and they Said me it is restricted in my country. What would I do?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Member",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T15:28:11.000Z",
          "Titre": "I think the site is not good when istripper",
          "Contenu": "I think the site is not good when I purchased for funds the funds never showed so I would like me funds back and my email verification never came through."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T13:40:39.000Z",
          "Titre": "Refund of remaining credit from 2…",
          "Contenu": "Refund of remaining credit from 2 separate transactions request not responded to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tio Loco",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T18:35:07.000Z",
          "Titre": "I lost all my girls",
          "Contenu": "I lost all my girls! I pressed the re build button and nothing! i can't even see the girls I just now purchased,  I have been through this before and had to open a new account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-02-17T19:53:12.000Z",
          "Titre": "Paint event not firing for GUI",
          "Contenu": "Still having technical problems that have not been resolved.Paint event is not successfully firing.  Having to manually force paint eventby click and dragging window."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Rouven Rothenbusch",
          "Nb_Reviews": 1,
          "Date": "2019-03-08T16:56:44.000Z",
          "Titre": "Gambling promos and exclusive cards",
          "Contenu": "Gambling promos and exclusive cards you have to pay thousands of credits in the gambling games for is not the way to keep this customer happy. Can't recommend this company anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MAT HORNIK",
          "Nb_Reviews": 2,
          "Date": "2019-09-20T04:59:44.000Z",
          "Titre": "Doesn't work after an automatic update!!",
          "Contenu": "I've enjoyed istripper since before it was even istripper, but the last time I started the software, it did an automatic update and now it doesn't work. Very disappointing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evasmallard",
          "Nb_Reviews": 3,
          "Date": "2020-10-27T21:40:45.000Z",
          "Titre": "I am very unhappy with istripper",
          "Contenu": "I am very unhappy with istripper.  i got a subscription just because i wanted to see Gwen Polanska but apparently she has been removed along with anything older than 2010."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T22:26:10.000Z",
          "Titre": "I am unable to spend the credits…",
          "Contenu": "I am unable to spend the credits purchased. i Stripper returns and error, \"An error occurred during network communications."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T20:05:43.000Z",
          "Titre": "Deceptive",
          "Contenu": "Deceptive purchase. The \"free\" trial with a recurring fee is automatically checked. I'll never purchase anything from this company again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T00:22:00.000Z",
          "Titre": "I purchased a stripper but didn't get her",
          "Contenu": "I purchased a stripper and was charged, yet I never got access to the stripper. I contacted support, but nothing was done.  All they did was reset my password."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T16:56:51.000Z",
          "Titre": "Decent but lacks polish",
          "Contenu": "The software is decent and the content is generally good. However, there is often a lack of polish/quality control. I often see shows which are jittery, have flickering lines along the taskbar (due to the jitter), or are too large causing part of the model to extend above my screen. The jitter is usually very minor, but with a bright background sometimes still very obvious.I can't reply to iStripper's reply, but in case you read this: I will, but very reluctantly because as a developer I know how it is going to end, I can see what is likely the problem and I think it is unfixable without processing all clips again. It is just going to cost me a ton of time to send all the boilerplate system info.Final edit:I did not get a response for over a week after filing the above bug report. Changing to 1 start for wasting my time for the last time."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Redfiero",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T15:24:51.000Z",
          "Titre": "I had a great collection of babes in my…",
          "Contenu": "I had a great collection of babes in my virtua girls , an to my surprise all desaperñar Its no fare. I trusted in your program and you betrayed me."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Survey harassed user",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T00:07:28.000Z",
          "Titre": "Stupid rating request",
          "Contenu": "I hate this \"was I good in bed?\" Anyone who actively asks for a rating gets 0 points from me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "YOUR MOM",
          "Nb_Reviews": 1,
          "Date": "2021-09-12T05:04:31.000Z",
          "Titre": "Cant merge my accounts from old account…",
          "Contenu": "Cant merge my accounts from old account no HD cards but refuse to combine them although I am only owner of both accounts just sad."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T20:08:19.000Z",
          "Titre": "Recent gambling trends... Bad",
          "Contenu": "Recent trends towards full blown gambling are just plain scummy. I am very likely to stop using your site and software if this trend continues."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Master-level customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T11:30:31.000Z",
          "Titre": "Frustrated mini games",
          "Contenu": "I don't feel getting any value after losing a lot credit in the mini-game.Updated: Thanks for the reply, but I got my frustation from a lot of Lost (around 18 times as I remember) from the Trill Spin Game, really not a fan of that game and the new quest system.I do love the software and the shows, and I wish to see more consumer friendly features in the future."
        },
        {
          "Note": 2,
          "Lieu": "SK",
          "Pseudo": "haluzzak",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T15:57:33.000Z",
          "Titre": "Frustrated mini games",
          "Contenu": "I like Istripper, but since you turned it into a \"casino\" I'm starting to hate it! Spent 1600 with credit and for what? That I received a lot of cards that I already have, or that I would never buy in my life (except maybe two).Probably the last credit I recharged."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 10,
          "Date": "2023-11-18T16:45:39.000Z",
          "Titre": "The models have seriously degraded in…",
          "Contenu": "The models have seriously degraded in quality. They’re mostly shapeless small breasted models more like twinks than girls. I used to buy a card almost every day. Now it’s maybe one a week. The little games often lead to cards I’ve already discarded as options so what’s the point?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T20:38:48.000Z",
          "Titre": "The program does not fully communicate…",
          "Contenu": "The program does not fully communicate with my account online.  I won't download my collection, making the program worthless.  I can view some of the previews but that is it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald burton",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T18:54:12.000Z",
          "Titre": "i recovered my account titled…",
          "Contenu": "i recovered my account titled booblover66 i need to get into my collections for that account.can you help me do that?"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T10:45:10.000Z",
          "Titre": "The introduction of NFT's...",
          "Contenu": "The introduction of NFT's has widely affected the quality and the standards of the current iStripper.Not only has the quality of the shows gone down, the 64bit version update is rife with bugs and horrendous crash after crash after crash, I would gladly give this a one star but since they have been active with the community and on the forums, atleast they plan to fix things... I hope..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T16:41:22.000Z",
          "Titre": "There's beautiful women out there, that will strip,",
          "Contenu": "Seems like you have nothing but porn stars, most of them are not attractive.i dint mind watching a beautiful women strip for me, it very beautiful thing. Like I said, waste of my money. I'm not picky. Don't take me wrong, none of your women are ugly, there pretty."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T06:25:40.000Z",
          "Titre": "Credits took too long to process and I…",
          "Contenu": "Credits took too long to process and I thought that an error had occurred so I made the purchase again about 5mins later. After the second purchase was made both sets of tokens populated in my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T12:19:02.000Z",
          "Titre": "Deceptive pricing at its finest.",
          "Contenu": "The fact that purchasing a show and getting it in the quality being payed for is locked behind a paywall is very deceptive. After seeing that fact I lost interest in buying anything else from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T22:57:30.000Z",
          "Titre": "I dislike the overall speed of…",
          "Contenu": "I dislike the overall speed of navigation. I also dislike how difficult it is to move forward or back during a show. There are not enough cards available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T22:41:35.000Z",
          "Titre": "There are dancers I bought",
          "Contenu": "There are dancers I bought, that I can't access, and dancers I would like to buy, that I can not buy.  I would like to get more content from some performers, but there is no option.  I would like to download all pictures/videos, but there is no option."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T09:29:04.000Z",
          "Titre": "CANT never COULD do NOTHING!!!!!",
          "Contenu": "can't upgrade to premium won't except PayPal takes me to a package purchase screen...like everyone else i have given a s@#t ton of money...WT$!!"
        },
        {
          "Note": 2,
          "Lieu": "AR",
          "Pseudo": "JS",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T19:55:06.000Z",
          "Titre": "Lately the costumes used by several…",
          "Contenu": "Lately the costumes used by several models were not good to my taste. I like lingerie and high heels and not a lady dressed as Pikachu."
        },
        {
          "Note": 2,
          "Lieu": "AD",
          "Pseudo": "JPRC",
          "Nb_Reviews": 8,
          "Date": "2023-03-07T08:58:35.000Z",
          "Titre": "Mixed feeling: Good product, BUT some flaws.",
          "Contenu": "Istripper is a nice product. There are really many many very attractive ladies (+5000 I think, with different resolutions from 480p to 4K), and for all tastes. The models are most of the time crème-de-la-crème.If I stop here, it is 5/5.But I reduced my current score by 3 points:-1: Lately, they produced and sold – or about to release - rather many cards with a lower than expected resolution quality because of production problems: the 4K looking like a 3K and in some cards almost 1K. And it is not the first time (3rd time when I look at my +1700 cards in my collection). The problem is that they keep charging full price, with a lower quality product. When you know that you have to pay extra for getting this extra 4K resolution quality (called “Premium”), you feel uncomfortable with their commercial practice.-0.5: because they have problem understanding and listening to clients. Some “moderators” are perfectly ethical, but some others in forum are very eager to censor any “dissident” and react really abusively. They are even more vocal than the istripper staff (\"plus Royaliste que le Roi\") Very Russian style sometimes: not neutral in behavior, deciding without quoting any rule, they behave like fan-boys and lack a neutral ethic and clear acting rules.-0.5 : the internal QA does not exist. Quality control is done externally by clients/moderators, often on very short notice from istripper, and they are simply unpaid volunteers and long-time clients. It was probably ok before, but this unprofessional quality control shows its limit, especially now that istripper ventures into the NFT world and their small team is under extreme work load and pressure.-1 : because I registered with istripper using a private email address. But I receive emails from istripper and this trustpilot site using my official email shared by other persons. Very unwelcome and so much for privacy!... ALL communication should have gone to the registered email box associated with my istripper account, or at least use the name \"Totem\" (the company), rather than the product name. Breach of trust."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T19:53:33.000Z",
          "Titre": "Loyal customers not listened to",
          "Contenu": "this site has not listened in over two years I am most likely not going to renew my membership the constant games and special events that members that have all the card can never win / get when you have competitions that require you to purchase 10+ cards in a week when I have no cards available other than the new cards issued each day shows that this site does not care about keeping customers only about getting them to spend more points not provide them a better service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mikeydwsr",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T07:21:52.000Z",
          "Titre": "The product itself is fine",
          "Contenu": "The product itself is fine, but diversity in models is seriously lacking. The very vast majority of models are rail thin eastern Europeans. Would love to see more racial diversity and more body types than just what is on offer. The gambling. My goodness, the gambling. I get it. You want to make a quick buck. Fine. However, if you're going to shameless do it, at least introduce something new. Something that feels (even if it absolutely will not be) more fair and fun. Make it engaging rather than just pressing two buttons to find out how much money you lost and how bad your gambling addiction is."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "KrisBe",
          "Nb_Reviews": 3,
          "Date": "2022-10-21T16:35:56.000Z",
          "Titre": "We pay to much compared to other countries",
          "Contenu": "I dislike the fact that it states $49.99, but when I do my transaction $49.99USD which is $83.64AUD. This to me is a discrimination, I am not buying a manufractured product. but a digital one, I should be able to pay $49.99AUD the same as any one in the USA does. Just because I live in Australia I have to pay more for my credits."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T02:12:26.000Z",
          "Titre": "it ok but need people more to come back…",
          "Contenu": "it ok but need people more to come back on in"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MIKE BAJEMA",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T15:39:06.000Z",
          "Titre": "Couldnt find the play & unmute buttons…",
          "Contenu": "Couldnt find the play & unmute buttons on laptop.  Phone play was fine,"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 5,
          "Date": "2022-06-25T15:05:17.000Z",
          "Titre": "Expensive",
          "Contenu": "Expensive. Complicated site to understand. Not all cards show after downloading.Live chat is a waste of time as no one replies. Get your act together! And support is non existent! Just paid for 11 cards and only got 6 to download. CHEATING SCUM"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Eduardo",
          "Nb_Reviews": 2,
          "Date": "2021-12-27T00:29:37.000Z",
          "Titre": "Was good when was VirtuaGirlHd",
          "Contenu": "back in 2008 was good  because with a Paid membership (29.99) you received many cards during the month, I think I received like 5 cards every day during the month. Now the membership is 59 USD but I see no benefit for us, for you yes, because you get 59 USD and give nothing in return.When was Virtuagirl the quality of the girls where great, now with iStripper the quality of girls is way below average."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "i.s.User",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T18:04:16.896Z",
          "Titre": "Decent over all but has some issues",
          "Contenu": "I do enjoy the app on my computer. However there are constant issues playing cards that i have purchased and when i reach out to customer service i have not head a response. Decent app overall and decently amusing but does have some bugs"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tumescent member",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T02:42:29.000Z",
          "Titre": "The mobile content only runs in the…",
          "Contenu": "The mobile content only runs in the browser. So it has none of the allure of the old VirtuaGirl that used to run in the foreground of your desktop screen. It would be better if it was an app that like before played on the top of other apps."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T21:58:13.000Z",
          "Titre": "I think the idea is great",
          "Contenu": "I think the idea is great.  The issue is that it is not particularly functional and the controls don't work well.  The instructions are poorly written.  The functionality needs to be addressed and make sure that EVERYTHING works and is CLEARLY LABELED so that you know what works what.The software is not quite ready for primetime yet and it is a disgrace that when you by something on the desktop version it doesn't transfer to the mobile version."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T00:02:20.000Z",
          "Titre": "Could be great if only…",
          "Contenu": "The content and models look amazing however the format on iPhone is not user friendly and does not work well. Impossible to go full screen and if you try to zoom most times it will cause the scene to skip to the next model. Also the only sound available seems to be when the models talk during the free portion. Not sure if there is supposed to be sound but it would seem like there should be some sort of music when the models are dancing etc. update the interface for iPhone and the ability to scroll or fast forward/rewind during playback of the scene or pause would be great. Thank you"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-06-08T22:59:18.000Z",
          "Titre": "Yes.... but no.",
          "Contenu": "Your app is great but there are definitly some improvement that you have to do in my opinions :- No way to stop downloading previews- No way to stop seeing previews for good- Looks like all the clip from the same person are the same- No way to keep seeing all the clip from the same person all over againNothing is clear and that's a shame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T17:24:59.000Z",
          "Titre": "I do not like the aggressive and explotive 'selling' that goes on when you try to purchase credits.",
          "Contenu": "As it says in the title, I don't need to sign up for cams, and the sight is purposely confusing to make it look like clicking on the cam sights are the way to end the transaction.Edit: In reply to your comment my issue is with the software, after purchasing credits to acquire shows on Istripper, there is an 'advertisement' at the bottom for a 'cam' or other adult sight but it is designed in such a way as to invite accidentally clicking on it when you try to finish your transaction purchasing credits."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon J.",
          "Nb_Reviews": 2,
          "Date": "2019-07-14T21:37:30.000Z",
          "Titre": "Untrustworthy & hard to use",
          "Contenu": "Once you've paid, you discover that there are \"levels\" of the strippers, and some (including the one I signed up primarily to see) are available only after you've purchased 40 others. So I felt scammed. Also, on an operational level, the site is very difficult to use. The only way this site could be worse would be if it used an automatic recurring payment program."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Isoloated Experiance",
          "Nb_Reviews": 2,
          "Date": "2020-02-05T22:46:33.000Z",
          "Titre": "Unable to use slot machine",
          "Contenu": "Purchasing credits was easy and at a value I consider outstanding.  And they showed up right away on the account.  However, I had made the purchase to use to take advantage of a discount offer from the slot machine feature.  The credits never made it to the feature and I was unable to take the offer.  I'm further disappointed by it being three days since I contacted support about the issue and still haven't received a response of any kind.  Otherwise the product is great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-07-06T22:09:30.000Z",
          "Titre": "The video quality on VR is laggy and slow",
          "Contenu": "The video quality on VR is laggy and skips even when downloaded and played on PS4, the audio is off because the video skips. Then there is the video set, or lack of why is every VR video taken in front of a private screen and every show is taken on the same leather couch! Step up your VR videos please!  As for the models they are amazing! So sexy and breath taking! Address these issues and keep adding videos every week and your VR program will take over!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Lewis",
          "Nb_Reviews": 3,
          "Date": "2020-10-19T21:54:05.000Z",
          "Titre": "Disappointed",
          "Contenu": "I love this on my screen but its more of a burden then a reward. It's constantly slowing my browser and  computer down with the lag, it keeps crashing,signing me out out hundred times ridiculous. I spent hundreds of dollars on content here just for you guys not to play your part kinda sad ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2018-12-31T09:27:54.000Z",
          "Titre": "An semi-ok product that has potential for the improvements it needs.",
          "Contenu": "Overwhelming majority of the models are not that appealing. There is very little control given to the user in terms of what can be viewed. There doesn't seem to be a pause button and no way to select the exact clips that will play of a specific package. The playlist function is somewhat nice but doesn't remedy the aforementioned issues."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "BigBrother38_Wim (Wim Key)",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T01:40:09.000Z",
          "Titre": "My collection gone which I paid for.",
          "Contenu": "Accidently I pressed rebuild collection button in my collection and now all my cards are gone (about 270), even after the complete downloading process which by the way took hours!!Only 4 cards I see with downloading errors but all is gone. I've paid for each card in my collection!! I'm very angry"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-06-23T16:23:54.000Z",
          "Titre": "Quality seems to have gone down",
          "Contenu": "Quality seems to have gone down. Less shows with sound, and when they do have sound you can clearly hear the crew having conversations in the background, walking around, cell phones going off. Don't think i can recommend this service any longer, and will probably be uninstalling soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PCJP",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T11:27:50.000Z",
          "Titre": "The models cards are too expensive!",
          "Contenu": "The models cards are too expensive. The models are fair to poor looking. There are beautiful models out there in the world. Please start choosing better looking models that have experience dancing, stripping and posing."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-08-01T14:45:02.000Z",
          "Titre": "Confusing",
          "Contenu": "This is a terribly confusing product to use. Not user friendly, non-intuitive and puts the user's privacy at risk by being forced to have software titles \"iStrpper\" on their computer.I don't want the girls dancing across my screen which I suppose is the reason for the software download."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T00:09:08.000Z",
          "Titre": "More selection from the gallery perhaps…",
          "Contenu": "More selection from the gallery perhaps other nationality of stripper guys."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2019-03-15T20:29:09.000Z",
          "Titre": "Love the cute dancers but personal…",
          "Contenu": "Love the cute dancers but personal Customer Service greatly lacks. Only way I ever got help was on the \"wings\" of incoming mail monitored by a person and not a machine. I was without svc for several months with no way of contact.. The \"Forum\" is Not helpful. Two stars is me being Generous."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-02-12T06:58:14.000Z",
          "Titre": "Lots of promise that doesn't deliver.",
          "Contenu": "I think it's quite pricey for what you get,the servers are always slow to sometimes not even working.And when you make enquiries into things that aren't working or access to certain things are provoked even though you have acquired access.Very good idea just not done well and very poorly run imo."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "UK member",
          "Nb_Reviews": 2,
          "Date": "2019-08-16T14:28:29.000Z",
          "Titre": "Technically ok but content is generally rubbish",
          "Contenu": "Technically, iStripper is fine, it's the content I am dissatisfied with. I have a particular preference for models wearing boots but, out of the thousands of 'cards' iStripper has on its site, a miniscule proportion contain models wearing boots, and often the few who are wearing boots take them off during the set! The site doesn't even have 'boots' as a search category! This is why I am disappointed every time I browse what is supposedly 'new' on iStripper and very rarely purchase anything from them."
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "Ivan",
          "Nb_Reviews": 1,
          "Date": "2018-12-12T16:07:21.000Z",
          "Titre": "Card quality has decreased",
          "Contenu": "In the last year, the quality of cards has greatly decreased. Very bad color correction of girls. Lips look brown (rusty, dirty), skin color does not look natural. Often the video (in the card, not in the promo) is too dark.At the same time, promotional images look good, which is misleading the buyer."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James Rogers",
          "Nb_Reviews": 3,
          "Date": "2021-05-04T20:18:14.000Z",
          "Titre": "Trust point payment is good but the way…",
          "Contenu": "Trust point payment is good but the way iStripper games and special offers they are poor infect bad, they seems to hide extra facts to get more from you and only only give what is less then useless offers, like the May offer!!!! What is that?"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T13:39:49.000Z",
          "Titre": "Need more male models",
          "Contenu": "Need more male models. The app looks like it’s madre just for straight men, i don’t like seeing women in my feed and my “logros” (i don’t know how it’s spelled in english). Also, the fact this needs to be payed in dollars makes this hard for a mexican person."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Gerald Moser",
          "Nb_Reviews": 2,
          "Date": "2018-12-12T16:05:51.000Z",
          "Titre": "Too large Clips above 150 MB",
          "Contenu": "Too large Clips above 150 MB, specIally Shows described as full nudity or XXX.Lot of XXX Shows are not what it should be, for instance, clips with 5 or 6 mins are more than 60% no nudity, but declaired as XXX.As i have more than 3000 Cards, Quality is getting lower inside the Content."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member/ claudeABC",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T02:00:46.000Z",
          "Titre": "I’ve been a subscriber and I always…",
          "Contenu": "I’ve been a subscriber and I always having problem logging in , and I always ended up starting a new account just to log in , in fact I already have multiple accounts , need help to correct the problem , i’ve spent lots of money already , like I feel being rip off"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2019-02-06T22:47:41.000Z",
          "Titre": "Not enough diversity",
          "Contenu": "Not enough diversity.  Very few African descendants & virtually no hardcore shows by Black females.   No Asian anal shows.  I stripper caters to a select group that prefers Eastern Europeans.  What’s worst is that PayPal is not a viable option to obtain new cards!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick p",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T11:13:17.000Z",
          "Titre": "Made a purchase and the download is…",
          "Contenu": "Made a purchase and the download is unavailable. Technical issue I'm sure but I won't be purchasing anymore until I figure out the problem"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2021-11-11T22:44:25.000Z",
          "Titre": "Too hard to use",
          "Contenu": "Too hard to useWas not able to isolate performer from backgroundFound navigation hard to do and wound up clicking on a performer I was not interested inFound it difficult enough that I cancelled"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T02:10:16.000Z",
          "Titre": "well aint like desktop version at all…",
          "Contenu": "well aint like desktop version at all but the butt here so no complain on that"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T02:47:15.000Z",
          "Titre": "paid for 25 credits but did not get them"
        },
        {
          "Note": 2,
          "Lieu": "QA",
          "Pseudo": "BURUDUGUY",
          "Nb_Reviews": 5,
          "Date": "2019-09-11T20:42:13.000Z",
          "Titre": "Great but lacking a lot of features.",
          "Contenu": "Great but Lacking a lot of features.I love the details of the models. However, year 2019 and still there are only few beautiful models. The only download worthy are Ava, Eva Elfie, and Skye Blue. The rest were average.Secondly, it's year 2019, there should at least be a wider selection of controls for the models like we should at least can point and click on their tits and they'd be squeezing them or click on their crotch and they'd let us choose between butt or pussy action.I'd like iStripper to take it to the next level instead of staying the same for many years.Let customers have more interaction to the models."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stripperman",
          "Nb_Reviews": 5,
          "Date": "2021-04-27T14:22:15.000Z",
          "Titre": "Before the Bugs",
          "Contenu": "Ever since the addition of the upgrade to ultimate for money My I stripper has been performing poorly- I don't know if the server has been slowed down, or overloaded but my downloads have slowed constantly - I have a high speed internet connection and have run speed test to ensure it is not my bandwidth- I have had a problem with my audio portion with the music - i added 100 songs to play and none of them play during the show-I have contacted customer service many times and the problem still exists- I had a fully functional version but with each upgrade  I have ran into problems that did not exist before-I really enjoyed the site for years, however with the problems indicated abouve I can not recommend it"
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "SeaDog",
          "Nb_Reviews": 2,
          "Date": "2021-05-16T21:20:34.000Z",
          "Titre": "I can not open istriper with my first…",
          "Contenu": "I can not open istriper with my first account number (all my credits included) after reinstalling the program. After each reinstallation new account number with 0 credits and w/o purchased models generated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T03:41:08.000Z",
          "Titre": "The app is neat but I'm looking for…",
          "Contenu": "The app is neat but I'm looking for curvier models, bigger butts and big bouncy boobs.  All of the dancers here are young and pretty but lack the hour glass figures that I'm used to in my local club"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Davis",
          "Nb_Reviews": 3,
          "Date": "2021-11-17T18:30:48.000Z",
          "Titre": "I lost my entire collection and could…",
          "Contenu": "I lost my entire collection and could not have it recovered. The system had erased everything in which I had paid for. I do not endorse this company because they could not fix the issue."
        },
        {
          "Note": 2,
          "Lieu": "RO",
          "Pseudo": "Dexter",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T10:12:04.000Z",
          "Titre": "A beautiful dream (Wake up to reality!)",
          "Contenu": "Like most things in life, iStriper is a beautiful dream. Meaning the girls look beautiful, the interface looks great, the growing discount is awesome and so on.But, after you use if for a while, you start noticing the problems:1. It's impossible to tell, from the current informations, if the model has any skill, experience, looks. The staff is trying to show some informations  but it's not enough.Also the previews are too short and ofc very less nudity and very less \"skill\" of the model.So, when you'll buy, be sure to buy a lot of credits - because you'll lose money for most of the models...And, if you will want your money back they will help ONLY for small amounts of money.2. The models sometimes look unnatural because the direction/intensity/color of the light on the models does not always  match with the one from the desktop.3. They will hide the bad stuff from you and will show you only good staff.And, when you'll wake up from the dream, it will be too late!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T17:23:00.000Z",
          "Titre": "Special event cards."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T15:39:51.000Z",
          "Titre": "Most of the women just aren't…",
          "Contenu": "Most of the women just aren't beautiful.  I believe you're owned by the same MetArt company.  So many beautiful woman on that site.  This is the best you have? Currently Sapphira A and Liya Silver are my favorites."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PTBoatin",
          "Nb_Reviews": 1,
          "Date": "2019-05-22T00:46:10.000Z",
          "Titre": "The videos seem to be caricatures…",
          "Contenu": "The videos seem to be caricatures rather than real videos of the model- they look like a created image not real.  Also i could not figure out how to control the show- i could not advance the show or change it any way"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alice",
          "Nb_Reviews": 1,
          "Date": "2018-12-29T15:16:54.000Z",
          "Titre": "App crashes all the time in my new",
          "Contenu": "App crashes all the time in my new computer. Not reliable, it lags when downloading previews and playback is choppy when doing tasks. Like the girls and the concept but just not too great of an experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Your momma",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T14:08:11.000Z",
          "Titre": "The mobile version optimization",
          "Contenu": "The mobile version needs to be optimized guys I mean come on man I have a bunch of girls I can't see because you guys don't make em work on mobile"
        },
        {
          "Note": 2,
          "Lieu": "LK",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T20:33:09.000Z",
          "Titre": "Nothing like it, but nothing new",
          "Contenu": "Used this app from time to time, but there seem to be no improvement of the content provided. It's the same models doing the same things with a bit of a variance."
        },
        {
          "Note": 2,
          "Lieu": "MU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T14:39:14.000Z",
          "Titre": "No ability to use app on android…",
          "Contenu": "No ability to use app on android devices and the web version does not give me access to my old cards. Only the recently purchased ones"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "memberCarl",
          "Nb_Reviews": 2,
          "Date": "2020-03-31T18:08:35.000Z",
          "Titre": "I was only able to download one girl…",
          "Contenu": "I was only able to download one girl dancing and I'm not sure what help happened to rest my credits I will not be buying or wasting my money this site"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Finalfreakq",
          "Nb_Reviews": 2,
          "Date": "2021-04-05T19:14:05.000Z",
          "Titre": "Virtuagirl was awesome, iStripper sucks!!!",
          "Contenu": "Although totem continues to acquire beautiful girls, the outfit choices they place on the wrong girls is HORRIBLE!!! (I’m going to use the terms virtuagirls & deskbabes respectively). A girl on VG just had a scarf as her outfit while a DB had an awesome leather outfit and she was on the floor the entire show. All these new strippers over 1/2 the time, kick off their shoes. I’ve personally never been in a strip club where the girls take off their shoes. Totem used to have awesome shows, but now they put out a good show maybe(and I’m stretching maybe) 3-4 a month. I know totem needs to please all different peoples desires, but in standing & pole clips ALL girls should wear high heel shoes(or their slang name ... Stripper shoes - WOW what a concept!!!) then when the girls wallow on the floor, they should go barefoot. Virtuagirl was awesome! But iStripper for the most part sucks. I play the games more than buy girls. Especially when the girls are way over priced."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Sunnybul",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T18:32:46.000Z",
          "Titre": "Model are costly and stripping part to…",
          "Contenu": "Model are costly and stripping part to be improve"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T15:56:16.000Z",
          "Titre": "The account that I have isn't working",
          "Contenu": "The account that I have isn't working. None of my purchases of shows are being downloaded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-03-06T04:36:17.000Z",
          "Titre": "caveat emptor",
          "Contenu": "1. what you purchase is available on free preview2. cannot buy up without first purchasing 40 lower products3. customer service does not respond"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Samuel Nichols",
          "Nb_Reviews": 3,
          "Date": "2021-07-07T19:27:42.000Z",
          "Titre": "games",
          "Contenu": "i am still having problems with games. i have lost a lot of credits & credits i have won & girls too.    THANK YOU"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-16T01:51:59.000Z",
          "Titre": "There is no return or trade in policy",
          "Contenu": "There is no return or trade in policy. Some models have more hype than show so after you see you got duped you are stuck with them."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T21:13:27.000Z",
          "Titre": "Because Teramo arre not liza del Sierra…",
          "Contenu": "Because Teramo arre not liza del Sierra and adriana chechick. And i want more rebecca volpetti and stella cox"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T17:30:03.000Z",
          "Titre": "I think it should be a little cheaper…",
          "Contenu": "I think it should be a little cheaper maybe like 2.99 or something. Maybe 3.99 for more extreme material."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Vlad",
          "Nb_Reviews": 2,
          "Date": "2021-12-01T03:19:41.000Z",
          "Titre": "Special Event card sytems sucks",
          "Contenu": "Shows are nice, girls are hot most of the time, however the Special Event card system is stupid and unfair"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T06:22:21.000Z",
          "Titre": "cost is high .."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Marthin",
          "Nb_Reviews": 9,
          "Date": "2019-01-23T22:35:44.000Z",
          "Titre": "program crashes frequently",
          "Contenu": "program crashes frequently. Very slow downloads. Is a funny app to have a stripper on your desktop but ouldn't recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "alcibiades",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T02:11:17.000Z",
          "Titre": "too many of your shows are shortened in…",
          "Contenu": "too many of your shows are shortened in length after the first time played..It seems to be five to ten minutes are missing"
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "Diamond customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-14T19:43:27.000Z",
          "Titre": "The terrible video quality of most cards…",
          "Contenu": "The terrible video quality of most cards. Bad colors (color correction or lighting), girls look pale (skin like those of the dead) and have an unnatural color of the skin, lips and eyes.It seems that the one who makes color correction in the video is color blind.At the same time, promo images look very beautiful and tempting, but when you buy these cards (or watch a preview) you realize that you have been deceived!I am very disappointed that the quality has decreased, because a couple of years ago most of the cards looked great, but then the quality began to decline, and the last cards look terrible.I still hope that they will replace a couple of people in the team, especially as regards the color correction and the one who monitors the quality of the final product. After all, if they find more competent employees for these positions, the quality of the product will return to a high level. And I am waiting for this and I really hope so, because then, I will be able to buy new cards again, but so far this has not happened, I cannot recommend this product to anyone."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T07:10:20.000Z",
          "Titre": "Will try to milk you of every dollar",
          "Contenu": "Will try to milk you of every dollar. The girls are hot though and the software works."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Player",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T23:10:35.000Z",
          "Titre": "Skewed rating scores of models",
          "Contenu": "Just like Trustpilot itself, all the review/rating/score are skewed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2022-07-10T15:49:07.000Z",
          "Titre": "The mobile app & or website on the go…",
          "Contenu": "The mobile app & or website on the go is ok but needs a few updates."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "memberCarl",
          "Nb_Reviews": 2,
          "Date": "2019-12-06T21:14:20.000Z",
          "Titre": "Had a difficult time getting to the…",
          "Contenu": "Had a difficult time getting to the actual stripper show after I apply for the credits not happy with it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2020-06-27T22:06:11.000Z",
          "Titre": "Not enough diversity",
          "Contenu": "Not enough diversity: more Asian, Black & Latin women please.  More ANAL SHOWSBig natural tits!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Davidmac",
          "Nb_Reviews": 1,
          "Date": "2019-11-28T22:45:37.000Z",
          "Titre": "Terrible  customer  service",
          "Contenu": "Terrible  customer  service.  I have  a card that  won't  download  and can get  no  help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-20T02:54:24.000Z",
          "Titre": "UI sucks",
          "Contenu": "UI sucks, I understand it's beta so I hope they can make that something they work on"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-06T20:42:37.000Z",
          "Titre": "not to get it twisted love it but i have had my purchases declined for over a year",
          "Contenu": "not to get it twisted love it but i have not been able to buy credits for over"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-26T14:47:33.000Z",
          "Titre": "I have made some purchases but",
          "Contenu": "I have made some purchases but, the ladies do not work.I have emailed but no response."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2019-04-15T19:35:27.000Z",
          "Titre": "I can’t refund",
          "Contenu": "I can’t refund, I bought ugly girl and she is also. She look like cow if on hand and feet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-12T21:59:37.000Z",
          "Titre": "I bought lucky star 2 times",
          "Contenu": "I bought lucky star 2 times, I got nothing ！ What hell ！？"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T14:25:04.000Z",
          "Titre": "20 percent off only for new ones not…",
          "Contenu": "20 percent off only for new ones not other. when it said 20 percent off cards."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T23:42:43.000Z",
          "Titre": "Can't fuse accounts into one",
          "Contenu": "Can't fuse accounts into one. Lousy service, nice product"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Vicky",
          "Nb_Reviews": 2,
          "Date": "2021-11-30T19:08:22.000Z",
          "Titre": "you do not have enough new models",
          "Contenu": "you do not have enough new models, especially the mature ones!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T20:04:13.000Z",
          "Titre": "Not good in making some cards available…",
          "Contenu": "Not good in making some cards available for special event"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Customer2019",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T23:08:52.000Z",
          "Titre": "Somehow nice but with many problems...",
          "Contenu": "All in all it is somehow nice to have the dancers on screen and to get daily new content. They also update the client from time to time.I don't like:They sometimes update old content from low to higher \"quality\" but the quality is not really better as before. They never fix problems with content: Some clips are broken ( fast forward ), some shows are greyed out in overview, sound in many shows is off or broken or too loud or distorted, sound-level from clip to clip is often different so you need to adjust it all manually every minute, models often have dirty sole of the foot ( don't know where they have to walk around ).In the list of clips of a model they added a \"fantastic\" feature which removes the selected item out of the listing. So if you watch a show of the model.. this show is terminated from the listing. WOW. If you search something or if you want check the shows of a model.. you are probably lost in tons of items ( some models have 10 / 20 / 30 shows ) not knowing what you already have seen and what not. All the worse if you check for duo-shows ( 2 girls ).. then the listing contains all single shows from each model and all of their duo-shows.XXX content usually means ( better: meant ) some explicit action.. with other girl, with hand/fingers or toys. You can filter the listings for that. But at a point they decided to show also clips or shows as XXX if there is just a second explicit or even no explicit content. This is absolutely deceptive and you have no chance to get money back. This is just to maximize money income and users are helpless with this."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Bandar Aljedaie",
          "Nb_Reviews": 2,
          "Date": "2018-12-22T16:10:03.000Z",
          "Titre": "Slow full show downloads we want better…",
          "Contenu": "Slow full show downloads we want better servers for istripper"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2019-05-17T17:44:20.000Z",
          "Titre": "I have been charged for trx I didn't…",
          "Contenu": "I have been charged for trx I didn't think I authorized."
        },
        {
          "Note": 2,
          "Lieu": "LV",
          "Pseudo": "mock1801",
          "Nb_Reviews": 1,
          "Date": "2019-02-05T07:06:35.000Z",
          "Titre": "Almost every card is the same",
          "Contenu": "Almost every card is the same. It becomes borring too fast."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kieran",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T16:28:18.000Z",
          "Titre": "Occasionally has good content",
          "Contenu": "Occasionally has good content, but it's fallen a long way for what it is. Used to be it was just pretty girls, dancing. Now it's a softcore experience with dildos and whathaveyou- that's something you can get ~anywhere~, whereas the previous options were more unique. Outfits are really hit or miss, mostly miss, as are the girls, and so few can actually dance. It's become a glorified cam show at times. For a while this was separated, with Deskbabes, but now it's literally the majority of the content.None of this means you won't like the content- you might. For me, it's gone from mostly hit, to mostly miss. They do have some interesting \"auctions\" and \"contests\" for one of a kind memorabilia, if you happen to have Elon Musk money. Those \"auctions\" used to be more accessible, less costly, and the same could be said for the contests with their \"fan signs\" where a fan would win a unique picture.They've added VR content, which is kind of cool if you happen to have the ability to view it, and are willing to go spend more for that.The real issue is that they're so bad at producing content they've moved to using gimmicks they never would have years ago- unique shows that can only be gotten by gambling, for instances. Removing subscriptions for cards, instead you have to still buy the cards, but must subscribe in order to view them in 4k after you've already purchased them. New NFT content. I'm sure it pays well, because it preys upon collectors, and on men and women who have collection or even just buying impulses- often known as Whales in online transactions like this. I really hope the company moves back to where it was years ago, because I used to consider them pretty stand up, with good content. You don't need gimmicks, gambling, and feeding on people's psychological shortcomings. Just make good content and have reasonable prices and policies, or in time, you'll lose a lot of brand loyalty."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T02:36:20.000Z",
          "Titre": "These stupid previews keep coming up…",
          "Contenu": "These stupid previews keep coming up and I cant stop them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-22T00:00:15.000Z",
          "Titre": "If you want to see more cards of a girl…",
          "Contenu": "If you want to see more cards of a girl you can't"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stu",
          "Nb_Reviews": 1,
          "Date": "2020-01-16T17:11:13.000Z",
          "Titre": "It doesn't work very well with Firefox…",
          "Contenu": "It doesn't work very well with Firefox (Mozilla)"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Parks",
          "Nb_Reviews": 5,
          "Date": "2023-12-09T22:37:08.000Z",
          "Titre": "PC version vs Mobile version (non Beta)",
          "Contenu": "I have no issue with the PC version of iStripper, but I’m not happy that, for the Mobile version, I have to pay an additional subscription to access content that I have already paid for. I much prefer the Beta version which, unfortunately, is no longer available."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Geralt de Rivia",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T20:11:19.000Z",
          "Titre": "Good shows, poor app, no mobile.",
          "Contenu": "I like some girls shows and see them dancing and stripping when I'm playing on my PC. I don't like recent versions of the App, losing clearance and putting focus on cryptocurrencies (???). I also miss to have an app mobile (webpage has a really degradate experience, and new version you are forced to pay a subscription for shows you already bought)"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "TheVoyager",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T10:34:08.000Z",
          "Titre": "I appreciate...., but...",
          "Contenu": "I appreciate the huge number of girls to choose from and the costs are okay, but I'd like better control over purchased shows: the clips come randomly which means the girl can start in full nudity sometimes and I can't watch a complete show because after less than ten minutes it stops and starts showing previews instead. This is not what I expected when joining."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:45:47.000Z",
          "Titre": "Programm keeps crashing",
          "Contenu": "Programm keeps crashing, the selection mode during the shows could have a better menu with more options as well as the whole UI."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Tambascio",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T19:58:22.000Z",
          "Titre": "I don't like that I've been a member…",
          "Contenu": "I don't like that I've been a member since the original version of virtual girl, and you guys keep jacking up the prices for tokens and keep jacking up the prices of the models. As person who has almost 2300 cards you would think that you would keep my rate the same at 13 or so tokens per model now they're up to 16 or 19."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Evanes",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T16:54:09.000Z",
          "Titre": "iStripper doesn't listen.",
          "Contenu": "iStripper doesn't listen what the customers want. The new type of cards is a mockery for the majority.You should have the same cards for low budget and for high budget, but the higher cards should have more clips.If we love a girl, we will hate your decision about SEC, NFT or EX cards.We , the majority, don't like you anymore.If you dont believe us, then make your application for one star rating."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T22:05:06.000Z",
          "Titre": "IStripper lost it's way with too much gambling",
          "Contenu": "Too much gambling and exclusive cards hard to obtain for people with a full collection."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Pinky",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T22:44:09.000Z",
          "Titre": "Business as usual",
          "Contenu": "Nothing special about it really, buying \"credits\" to later use. The \"product\" provided is good, great and terrible based on preference. The prices are questionable too, can't really say it was value for money but it wasn't daylight robbery either."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Josh Porter",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T21:56:10.000Z",
          "Titre": "expensive events",
          "Contenu": "wonderful dances events get more and more expensive to earn special card though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Finalfreakq",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T07:57:55.000Z",
          "Titre": "The ONLY reason I purchased anything…",
          "Contenu": "The ONLY reason I purchased anything was due to the fact that you have started to produce more non-xxx shows. Not everybody likes nor enjoys watching women almost always fully naked masturbating rolling on the floor. There are 54,711,990 websites that do just that. You used to have a very unique product. But for the past several years, that's pretty much what you have been producing(the xxx, totally on the floor.)"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer  Bohdan Chomut",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T04:30:36.000Z",
          "Titre": "Good and NEEDS IMPOVEMENT",
          "Contenu": "When you get it right it is spectacular. top models!After 11 years still 3diamond discount, nothing higher ever? Hate 50% of content: models with clothes, hats, boots, sneakers, silly costumes, tattoos. What a waste!Would you see such stupidity at a real strip club? You  would expect beautiful girls stripping down to nothing but their high heels. You're selling skin, not accessories! Add a loop button for favorite scenes. I don't want to be interrupted with playing with my mouse for replay.  Last, if possible upgrade old videos; my favorites are 720 .  I would pay extra to have them 3k"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerA",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T15:25:26.000Z",
          "Titre": "Too much gambling, not enough deals",
          "Contenu": "Like the program and application, not thrilled with price increases and the lack of deals.  The games have a poor return giving lots of unwanted cards and making me regret playing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T23:53:42.000Z",
          "Titre": "iStripper, Is It Worth It?  An Objective Opinion & Evaluation",
          "Contenu": "Dislikes - I hate the Special Event Cards!  The only way to get them is by gambling & throwing away money hoping to maybe get lucky. The newer cards are becoming more expensive & are starting to chew up a lot more hard drive space.Likes - Most of the girls are beautiful, some of the shows are very explicit. Every girl gets completely nude, & they dance for you, some with sound, conveniently placed right on your desktop.  Overall - This is a beautiful program to have running while working on your computer.  The positives out way the negatives."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Mauro Moggia",
          "Nb_Reviews": 8,
          "Date": "2023-06-17T17:17:26.000Z",
          "Titre": "I would love to give a higher rating, but...",
          "Contenu": "I would love to give a higher rating, as I've always found iStripper to be a great site. But lately I'm very disappointed with iStripper's production policies: too much content reserved for gambling and cryptocurrencies. It is true that I am not obliged to participate in these initiatives, but it is also true that I no longer have the interest I once had in this site. I hold on until I'll feel like leaving it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T17:31:53.000Z",
          "Titre": "Here is what I do not understand.",
          "Contenu": "Here is what I do not understand, You Push these silly trading cards, Then you have another membership and only give 50tokens which is nothing. You can not buy special event cards for any amount of tokens, you have to play games to maybe win one. The worst thing you do is still have cards that are 4-5 years old and you still ask full pop for them. I have had this program for well over 14 years and almost 2500 cards. If you need more money, discount older cards, its only software."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T05:48:53.000Z",
          "Titre": "Feedback",
          "Contenu": "I like the windows version but not the  mobile version, all cards i bought are usöess on the mobile version and i have to pay extra if i wanna see the show.Sadly i have two accounts on the same enail adress. But that was  my misstake and on both accounts i have cards.i would wish we could put all cards ln one account if that is possible?And i also hope the mibile version would be the same like the computer version and not diffrent.Regards"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T17:36:28.000Z",
          "Titre": "The experience is good",
          "Contenu": "The experience is good. But the issue is you cannot download shows. PC and mobile experience is very different and you have to shell more money to enjoy both. Apart from that, models are great and hot. If the business model remains the same, then they might lose customers in Asia and specifically in India."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VaerunDrokos",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T06:56:03.000Z",
          "Titre": "Same old, same old",
          "Contenu": "The Featured Sections/Categories always seem to feature the same girls, same routines. Nothing ever seems to change. Like there's no new content to offer. Even after updates have been performed. Very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "innimmitabel",
          "Nb_Reviews": 3,
          "Date": "2023-07-23T16:19:27.000Z",
          "Titre": "They do what they do well, but getting greedy",
          "Contenu": "They do what they do well, but they seem to be getting greedy. When they have gambling games to win special event cards, other cards or credits, they are charging more per bet than previously."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:09:12.000Z",
          "Titre": "Models are Decent, Controls suck",
          "Contenu": "the selection of models is good and i like the games randomly thrown in and the quality of the videos is decent. the problems is that there is next to no control over the videos playing and trying to randomly get to a scene is painful to say the least, so if there was a way to see the scenes and play a specific one or they were played in a order, it would be better. the Duo videos could have some more in them."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Avatar",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T17:43:13.000Z",
          "Titre": "Not satisfied customer",
          "Contenu": "- you wont more and more money from users => special card for which it is necessary invest > 200 credits (you earn it only with participation in events)- implemnted \"trading cards\" => I do not have experiences but it looks ask NFT and it is not whota I am interesting. - type of girls and many of clip is XXX, I whould like to have more videos with evaluation \"no nute/ top less\".- I would like to turn-off the option \"crazy week\" and other.- In case I play longer for get \"Sepcial Event Cards\" I got \"Gift card\"!!!! Really??? I invest hundrets of cradit and I will get \"gift card, which I can exchange for 1 normal card. The most expensive card I think is 22 credit for f0097. So it is not fear. Fear should be \"jocer\" not \"gifrt card\"!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "APLange",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T05:35:15.000Z",
          "Titre": "I liked it the way it was.",
          "Contenu": "Normally I would have given four stars. However, recently istripper mobile has switched to a paid subscription service. Thus I can no longer watch videos from my collection while I am on the road. I have already paid for my collection once. At a premium price in my opinion. I do not want to pay for the privilege to watch them a second time."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T16:24:30.000Z",
          "Titre": "I can't because the application update…",
          "Contenu": "I can't because the application update fails many times.  Application is very heavy.  It seems that the number of girls acting reluctantly has increased, and it's not worth paying for it, and I don't need it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T18:21:01.000Z",
          "Titre": "Long time user.",
          "Contenu": "After 15 years and 1595 cards the experience is getting very stale and started to get stale when you eliminated the duos. All the girls (with few exceptions) come out and do the same thing. They are all starting to look the same to me."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Kunde",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T17:41:33.000Z",
          "Titre": "beautyful girls but a bad busyness style",
          "Contenu": "What I like is that it is simple and clear to use and safe. There are some beautyful girls. What I dislike is, the shows are not really erotic. Acrobatics instead of elegant dancing. Porn instead of hot erotic. But the WORST is, now when I buy a few credits, you activate me a service I did not ask for and if I do not react in time I get monthly billed for. That is a RIPP OFF! It shows me to avoid buying other credits in the future.To the answer, at least be honest on what you say. You no one else granted that offer, activating the account, WITHOUT customers agreement, doesent gives you a password. The customer by him self is to do the changes. For a bit unaware people it is a trap getting money out of it. This is not a serious way to do business. It's cheating and close to a fraud. Don't give responsability to other. Accept your responsability and act in a fair and serious manner"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerqpwoeje",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T23:38:51.000Z",
          "Titre": "Special Event Cards",
          "Contenu": "Special Event Cards. I can understand charging extra for them. But having them unpurchasable isn’t right. Especially if you only want a few cards!"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T09:08:14.000Z",
          "Titre": "Room for improvement",
          "Contenu": "The software isn't as well integrated to the Mac system as to PCs. Also the one data folder on a Mac could be placed in a more private part of the Mac - at least as an option for people who know how to do this."
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Frannn",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T21:29:08.000Z",
          "Titre": "The connection to the server doesn't…",
          "Contenu": "The connection to the server doesn't work many times It would be great to you guys repair this. And the duration of the shows it's not true, the shows doesn't have the length of 39 or 36 mins that they say, they only have 7 or 10 mins"
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Nadziga Lady Gold",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T19:36:39.000Z",
          "Titre": "Not bad for a start",
          "Contenu": "Right stuff right time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wanda Gillis",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T23:20:49.000Z",
          "Titre": "Some of the videos don’t have the…",
          "Contenu": "Some of the videos don’t have the girl’s sounds or voice but that isn’t noted in the description. I wouldn’t knowingly purchase a card without the girl’s voice recording."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CH",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T22:46:16.000Z",
          "Titre": "I wish there was to be more fresh…",
          "Contenu": "I wish there was to be more fresh content posted… it seems that the girls could post more. Just seeking variety. Was going to get another one but couldn’t find a former girl that used to be on there. Where is Eufrats?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T00:59:34.000Z",
          "Titre": "girls problem",
          "Contenu": "when I buy some girls they don't have images for some reason and before we decide to buy the girls I want to see the clip first"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bangry",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T10:18:41.000Z",
          "Titre": "i wish",
          "Contenu": "i love the product i wish there were some bbw's on here i like bigger women"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Roscoson",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T23:43:04.000Z",
          "Titre": "Kept refusing my card details."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 5,
          "Date": "2023-09-05T23:54:26.000Z",
          "Titre": "Updating iStripper",
          "Contenu": "Every time I have to update iStripper it screws up my cards. Last time I had to download all my cards again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Davis",
          "Nb_Reviews": 3,
          "Date": "2023-02-18T05:32:52.000Z",
          "Titre": "I am not interested in women from…",
          "Contenu": "I am not interested in woman from Ukraine and not America. To many from Europe and very few women of color."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:47:27.000Z",
          "Titre": "to expansive for the Product  more…",
          "Contenu": "to expansive for the Product  more spread pussy less masturbations"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T04:23:06.000Z",
          "Titre": "You can't buy tokens for the PC version…",
          "Contenu": "You can't buy tokens for the PC version anymore on mobile."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mahallotron",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T17:49:38.000Z",
          "Titre": "I love this app but",
          "Contenu": "I love this app, but would like more diversity in ethnicity. I would love to see trans models make their way here. Bailey Jay or Chanel santini like"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "member",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T07:04:07.000Z",
          "Titre": "Too much gambling these days",
          "Contenu": "Too much gambling these days. Yes you can avoid it but the app is more of a gambling app than anything else these days. The shows are still good though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T13:20:24.000Z",
          "Titre": "I have no music on istripper but I can…",
          "Contenu": "I have no music on istripper but I can hear the girls when they talk. I can’t get back my old purchases of models. Like they don’t exist anymore."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T22:24:52.000Z",
          "Titre": "More variation of models."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T20:08:50.000Z",
          "Titre": "In the lastTimes your Models are hmmmm…",
          "Contenu": "In the lastTimes your Models are hmmmm not so sexy. I miss Stella Cardo , Sky Blue etc..."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Michael van Runt",
          "Nb_Reviews": 3,
          "Date": "2022-10-05T00:28:26.000Z",
          "Titre": "When I bought credits and was tempted…",
          "Contenu": "When I bought credits and was tempted to look at other sites I was directed to I was without realising signed up for a free 2 day trial after which o was going to be charged 49 dollars a month. Lucky I found out before I was charged. I don't appreciate yhos"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "FernandoRoque",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T18:03:09.000Z",
          "Titre": "I have two desktop devices",
          "Contenu": "I have two desktop devices, I have to buy a model twice, to have them in both...I signed up to the istripper with just one email, in both devices, well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 10,
          "Date": "2022-09-21T22:18:27.000Z",
          "Titre": "This is a wonderful site and I’ve…",
          "Contenu": "This is a wonderful site and I’ve enjoyed it for years. My only downgrade is because of the model choices. Their more twinks than girls. Slim, small boobs. Where are the Nekanes, the Anissa Kate’s’ the Marina Viscontes, the Violas, the Carmins, the Lucy Li’s, even the Sky Blues and Pammela’s? Women that look like women not young boys. I know preferences are different so just giving my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MangoMila",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T20:41:23.000Z",
          "Titre": "The app is okay if a little dated and less-than-user-friendly",
          "Contenu": "The app is okay if a little dated. It includes a beta video card function that (has been in there god knows how long and) is a tad glitchy from time to time, but otherwise operation is fairly smooth. Some operation of the app is a bit confusing, but it has a ton of options, which is great. The potential is there to be a much better platform than it is. Searching for content is a nightmare and content info could be presented in a much more user-friendly manner. But overall the application is solid and usable, if a bit pricey for content and exploitative of the user."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T18:30:25.000Z",
          "Titre": "I would prefer more big natural booby…",
          "Contenu": "I would prefer more big natural booby girls with more actions presented like gymnastik or sports. The live girl link needs more options , like not to login a second time and VR views to choose.The girls in xxx shows would be perfect if there was an opfion to download and load shows in VR.In some shows there is no origin sound, only music. If so, there has to be hint that there is no disapointing when viewing after buying."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rodolf",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T04:41:30.000Z",
          "Titre": "Too expensive for the content",
          "Contenu": "Too expensive for the content. The models are good and entertaining. The game play is a scam ; never give back any reward."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T07:54:05.000Z",
          "Titre": "I didn’t like the shows with no sound",
          "Contenu": "I didn’t like the shows with no sound. The vr vids are very good. I may subscribe for the vr."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Goodspeed's Reviews",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T15:17:41.000Z",
          "Titre": "It's been fairly Good",
          "Contenu": "It's been fairly Good! I've collected almost  1400 cards to date. Needs hairy, naturally bushy and full bodied woman not always skinny ones. Also they should dance more instead standing there being boring like my wife, lol anyway thats why i only can give 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "murphybrown",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T01:27:27.000Z",
          "Titre": "Better Res. would be nice",
          "Contenu": "from low res to high res the choices are hard because the res. does not always come out as expected, when I clicked on the free party, or buy several at a time avast antivirus said no and disabled the program, had to reload. I wish there was better res. on the choices.     Thanks               Chris"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2022-07-28T11:49:59.000Z",
          "Titre": "Fun but too expensive",
          "Contenu": "Overall the software is pretty fun but the special event cards are far too expenisve / difficult to obtain. It would be nice if there was an option to purcahse them at a higher price rather than expecting people to shell out 1000s of credits just to win one card."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Leeland Martin",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T23:37:38.000Z",
          "Titre": "Have lots of problems",
          "Contenu": "Have lots of problems loading the screen saver and have lots of problems logging on to my account"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T09:01:22.000Z",
          "Titre": "If your into chunky girls there's lots…",
          "Contenu": "If your into chunky girls there's lots of choice. Don't get me wrong they're all lovely, but if I click for small busted I'm not looking for a 32B, I'm looking for petite A,AA [Sherice, Lola Reve] You get limited control to start, but as you gain levels you it gets better. Some of the scene drop below base line so the erotic id semi hidden though if its on free play its fine. [bad quality control.] The x rated material is very 80's, small toys girls play for themselves not the camera. [Need to put themselves in the mind set of playing for their boy/girl friends or voyuer.]"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Jimmy Plant",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T21:48:20.000Z",
          "Titre": "More asians please",
          "Contenu": "Thank you for your good work, still could you please film more asian ladies and also bring back the charming ladies from Canada like Isabelle?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dragoon",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T19:30:17.000Z",
          "Titre": "No magic mike in this movie.",
          "Contenu": "They've ignored the guy side completely which os a shame is 2022. I imagine there a decent market. Hell just a handful for the next 3 yrs would be nice -_-If you just want women shows or lesbo shows, your good to go.If you like guy shows theyre still entertaining but not anything granddose last guy was 2011."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T09:44:17.000Z",
          "Titre": "The shows are good",
          "Contenu": "The shows are good, prices are okay, but my biggest problem is that you are unable to open other applications while having a show going on mobile. I haven't used the app on pc, but on mobile, it feels devoid of its purpose."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T18:23:34.000Z",
          "Titre": "Your service is great but the site…",
          "Contenu": "Your service is great but the site itself needs a group by ladies name  and search function . Also I wish it would let me access my old sd cards of virtual girls i  would be ok if they are not remastered but would be available as mobile.thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "pendragon",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T10:44:06.000Z",
          "Titre": "Back ground",
          "Contenu": "All the years I've used Istripper, it still used the same back ground. Maybe it's time to change a few of them.Seriously, You can change some of them with a few click of the mouse button. If any of you guys have any knowledge above basic school it shouldn't be any effort at all to make a few more option when we select full screen."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Alejandro",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T00:46:24.000Z",
          "Titre": "One suggestion. One problem.",
          "Contenu": "I have 14 years on the site.Suggestion: You have many categories but you need urgently an ASS category. Girl with perfect round nice cheeks. Why have you forgot this? You have a category on tits but not in ass? BIG mistake.Problem: In some way the girls has clearly become so skinny. Now you have too many girls that are not attractive. Im not so sure about that...I truly miss the days on Melisa, Ann O fee. Those are two most beautiful girls I have ever seen on your web. The most perfect bodies too. But now...The only reason for me to stay here is Vanessa Mio, Sharon White and Demi Fray. But you should to get back to find the kind of body like Melisa and Ann. Please consider both advises. Best regards, Alex"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T19:51:29.000Z",
          "Titre": "Special event cards are dumb."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T23:49:48.000Z",
          "Titre": "Automatically playing random girls I didn't set to play",
          "Contenu": "Automatically playing random girls I didn't set to play is fairly annoying I have to say. It's a big flaw as I see it. Wish only the girls I set up to play would play. I'd also prefer that you could select which moves/scenes are played for a given model instead of only being able to select ''progressive hotness'' or waiting for the clip to loop around to what you want to see.Also wish that \"hanging clip\" (dragging and dropping model figure) could work without being tied to the function of starting new clips/scenes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T17:02:34.000Z",
          "Titre": "Before I purchase anything it said that…",
          "Contenu": "Before I purchase anything it said that the stripper length/showtime was 39 minutes but it plays for 7 minutes and then stops playing and I have to re set it again and witch is very annoying and also my stripper has no audio at all even when she looks like she should make noise and yes my audio is all the way up because when the previews come up I hear them talk so I don’t understand… besides that it’s a great app and I can’t find any others like it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2021-09-18T07:56:25.000Z",
          "Titre": "Make the main shows downloadable mp4…",
          "Contenu": "Make the main shows downloadable mp4 files so I can play around with them using movie editing software. I like to slow them down and dub my own music over them. Then I can put'em on a flash drive and play'em on my flat screen TV and crank up my Bose sound system. I hate being limited to your software."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Stephan",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T13:16:05.000Z",
          "Titre": "The Games are only to geht Money",
          "Contenu": "The Games are only to geht Money. There ist no Chance to win. So not worth to Play.Update: i cooect myself. You can win. But it is the same Chance as in a Casino. You know who realy win at the end. There is many room to improve 😉"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rob f",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T04:13:48.000Z",
          "Titre": "\" new \"",
          "Contenu": "hi, nothing has been easy for any businesses...I'm tired of the \"new\" nothing is new...I play the games to stock up on the gift card and jokers so when people can be people again. I love the format. I try everyday to make everyone laugh,smile...hold doors open for people ...just be nice! you should come to Maine! I will show you around... got nothing else going on...I NEED A HUG!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobby Harrison",
          "Nb_Reviews": 1,
          "Date": "2021-03-20T22:39:22.000Z",
          "Titre": "When it works its great and really…",
          "Contenu": "When it works its great and really entertains me, but and its a BIG BUT!It constantly crashes I've tried uninstalling it then installing again it still crashes after just a few second of a show most times once in a while I might get 5-10 minutes before it crashes! I've contacted support twice and no response! If it doesn't stop or get fixed am gonna demand a refund for the cards I recently bought"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T17:28:38.000Z",
          "Titre": "Good Product, buggy software",
          "Contenu": "Love the models and the concept. But...the software is getting more buggy and messy. Selecting multiple models gives one an ugly black bar that shows up at bottom. The filter section is convoluted and ugly; belongs in a student programmer's attempt to write office software. \"Levels of eroticism\" filter doesn't function; selecting \"No nudity\" and \"Topless\" has still allows full nudity. The bug not allowing identical computer makes to run istripper under the same network hasn't been fixed. Wish list:1. Allow for global disabling of clip types. To wit, being able to turn off all the annoying \"Top of screen\" clips with a click.2. Ability to save items in \"Now Playing\" as a playlist"
        },
        {
          "Note": 3,
          "Lieu": "FO",
          "Pseudo": "jjmore",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T17:09:52.000Z",
          "Titre": "Great if it wasn´t for the Special Event Cards",
          "Contenu": "It is a great app and the shows are great, but the way to get hold of the Special Event cards, gambling, is ruining the experience. I do not gamble and will not start now.As a premium member and owner of all the cards, I would like there be an option to aquire the cards in normal way, but maybe at a little higher price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Member",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T19:14:11.000Z",
          "Titre": "Amazing selection of girls",
          "Contenu": "Amazing selection of girls, seems like awesome potential. But the control to choose what girls, what show, and what clip of the show are clunky and don't seem to work well on my computer. It looks like there are options to do what I want to do when I google search what I want, but the option in my settings in the program don't reflect the options that I have found in FAQs/instructions for the program."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ontrose",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T04:10:49.000Z",
          "Titre": "Customer service anyone?",
          "Contenu": "Some of girls are hot. Some are hotter. However, where iStripper really fails is in customer service. I ask for help configuring, setting up, navigating the forum and ultimately stumbled on to the solution myself. I wasted a week, wasted money (thinking I was out of tokens - it was not appearing on my dashboard) and then found what actually worked on my own. I sent numerous emails. I posted a couple of questions on the forum. Never heard back from anyone."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Kunde 0815",
          "Nb_Reviews": 3,
          "Date": "2022-03-29T23:23:26.000Z",
          "Titre": "More beauty more professional please.",
          "Contenu": "It would be nice if the girls would be more beautiful. Go to Chaturbate and recruit some of those models who are successful. They know how to move and look and strip. Often it looks like the models doing this for the first time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T01:39:53.000Z",
          "Titre": "Been a long time customer",
          "Contenu": "Been a long time customer, Not sure what happened but I have not had this trouble before I reloaded my account too get new cards. I picked them out and the credits were removed, However they didn't download the full shows. I can download videos from the cards get previews but not the full shows I payed for. Know my intirre collection full shows are gone, And I can not get a message too them to try and fix the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "XDEEPDIVERX",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T23:41:14.000Z",
          "Titre": "Take Phone Rotation of or let it fade…",
          "Contenu": "Take Phone Rotation off or let it fade after 3 secs , if Android Users don't know about Phone Rotation by now your not going to teach them by leaving an icon on the screen , bring more of the classic Vertuigirl/iStripper Models to Mobile , allow purchases to carry over from Laptop to Mobile , if the credits can transfer then the Collections should be also"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2021-07-04T05:30:10.000Z",
          "Titre": "Great programme let down by greed",
          "Contenu": "Great programme let down a little by greed. The frequent games on offer (slot machine e.g.), simply do not give enough back for the cost. €100 worth of credits taken to win one special event card, zero joker cards and zero top credit prize. I appreciate its effectively gambling but come on!"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Kunde 0815",
          "Nb_Reviews": 3,
          "Date": "2020-07-16T23:25:58.000Z",
          "Titre": "A lot of room for improvement not only on the Mac App",
          "Contenu": "The Mac app could be more stable. I frequently gets deleted my licenses for multiple Macs and have to restore them. It is only possible to run my stripper on two of my four macs. The app crashes frequently when I change from model view to overview. I’m completely missing the context menu in full screen view. Next model/next outfit would be nice in full screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T15:27:08.457Z",
          "Titre": "The reason I give it 3 stars is because…",
          "Contenu": "The reason I give it 3 stars is because I have noticed a few discrepancies in purchasing the dances. For instance Poly Pons and Lucy LI. Both sets of pictures show them squatting on a dildo in high heels, In turn I buy the dance because I want to see them riding that dildo in high heels. They do ride the dildo but not in high heels like I expected. This is frustrating and it happens to be this way on many more performances. The only one I have found to be correct is Anastasia Brooklyn. Also please fix your mobile site you can't even search a category, or a girl. Why can't I see the performances I purchased on both platforms? I make purchases on the desktop, why can't I view them on mobile?"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T14:58:20.000Z",
          "Titre": "Too many old content.",
          "Contenu": "Too many old content that are for sale almost at the same price as new content. Most of these older content has poor video/audio quality that are just not up to par with current standard. Yes there are new content every now and then but most of the other contents are old."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Sunny S",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T17:08:41.000Z",
          "Titre": "Needed talking along girls with what they were doing as well",
          "Contenu": "Needed talking along girls with what they were doing as well. Belka shy is good but talking along her shyness would have been great. Some example speeches - I'm shy, I don't know if this is right, we shouldn't be doing this, do you really want to see? (And exposing slowly, seductively, etc along)."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Guyincognito",
          "Nb_Reviews": 2,
          "Date": "2021-04-02T21:13:43.000Z",
          "Titre": "Hi there,",
          "Contenu": "Hi there,as a new Category \"Big Butt\" would be nice, also natural or enhanced Breasts. Maybe some rework on older Shows Graphics. If multiple Girls 2 or 3 could be have their own section on the Monitor without Windows and Masks as Barriers.Keep up the good Work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T00:00:40.000Z",
          "Titre": "Good site but lacks well known Adult stars",
          "Contenu": "Good site, although safe better to be safer by making payment through secure methods.Girls are nice, but would have liked seeing more adult stars that are recognizable from penthouse, hustler, or high society magazines."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2020-12-31T19:25:34.000Z",
          "Titre": "Well the 3K does not look like 3K so…",
          "Contenu": "Well the 3K does not look like 3K so I'm sketchy to pay for the 4K version so I don't know if I want to and you don't even have a 6K version which would be really nice.But you do have some hot models and some great content which is the only reason why I still pay."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Paul Duff",
          "Nb_Reviews": 5,
          "Date": "2021-06-15T19:17:16.000Z",
          "Titre": "Maybe it's my lack of computer skill…",
          "Contenu": "Maybe it's my lack of computer skill but I find it difficult to navigate. As a general rule I can figure out the basics, but I'm tumbling through your site. Adding money, choosing girls nd just understanding. I'll try to re-read . Wish me luck"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-02-23T16:54:37.000Z",
          "Titre": "Great, but..",
          "Contenu": "Great videos but an option to search for certain models and categories would be useful as well as the ability to skip and rewind through the videos to specific moments would also enhance the viewing experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Double Diamond OG",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T18:24:13.000Z",
          "Titre": "BEAUTIFUL, but often a HINDRANCE!",
          "Contenu": "while I love some of the ladies offered, I hate how I cannot make them unclickable. I accidentally click and drag them and they prevent me from clicking vital menus when they stray too far from where I placed them. I have no idea why you removed silhouette mode, I really want that back. I find this application about 70% of the time unusable just because I cannot make them unclickable. also, bring back the ability to prevent them from moving so insanely far away from where I place them. so incredibly annoying when I place them on one monitor and after 10 minutes they are on the other one...blocking menus again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mike buehler",
          "Nb_Reviews": 2,
          "Date": "2020-11-24T20:00:51.000Z",
          "Titre": "The biggest issue i have is with all…",
          "Contenu": "The biggest issue i have is with all the changes that have been made since it was originally installed by me back when it was called virtuagirlhd. Cost for each card has went up conciderably compared to then. As well premium membership used to offer a new girl each week or month cant remember which. But now premium only offers a discounted price and only on new shows for so many days after release. It also gives you a higher quality image but its not worth the 60$ a year ut costs esspecailly since if your a platinum member you a discount thats almost as good as premium membership gets and its free."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Davis",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T05:10:00.000Z",
          "Titre": "Virtual Girl has been great over the…",
          "Contenu": "Virtual Girl has been great over the years. Currently it seems like they are putting underaged girls on there though maybe I am mistaken.  They have beautiful women.  They have disabled the ability to delete previews, maybe the purpose was to make more women to be seen.  The problem is it seems like they have added women on there too young that get pushed to preview, which you can't delete.  So seems like someone has taken a competitive company and turned it into a system of entrapment.  Sounds familiar.  Stay away from Mile High if you don't want to vomit due to the incest crap they are pushing."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T14:25:24.000Z",
          "Titre": "I enjoyed the it alot except for the…",
          "Contenu": "I enjoyed the it alot except for the fact that some cards you couldnt buy because they were event cards. I would think it would be better for the company to actually let you buy what you want instead of making events. I wanna decorate my desktop not do something more similar to gathering rare pokemon cards. Also i would wish for it to be an option to cycle through my purchased shows without it getting interrupted by a preview which i did not want to see. I have to manually go in and stop the previews from playing which was annoying. Over all i like istripper but it could benefit alot from these changes i believe. Also i wished some models had higher quality cameras but maybe thats hard to fix. I rate it 6/10 because it has potential but a couple draw backs"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-27T22:48:52.000Z",
          "Titre": "I am a long time fan",
          "Contenu": "I am a long time fan, still enjoyed some of the earlier released dances, but these super exclusive dances which are impossible to gain feel kinda lame, I just want to enjoy it and if at the time of the event u weren`t there, impossible to get except with stupid luck games like current even, tried a bit, bad luck happens, but the rates are unknown and I feel like its not rlly rewarding, while with a system like this it should be, these games should not be played to punish people but to make people enjoy watching, So I would like you to focus more on that and make certain events come around so u can actually get these skins at some other date"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Max van den Elsen",
          "Nb_Reviews": 2,
          "Date": "2021-03-06T14:47:10.000Z",
          "Titre": "Closeminded",
          "Contenu": "ClosemindedSo the big issue i have with Istripper that they do the same thing over and over again. Their REALLY GOOD at what they do.But they dont like to innovate.Its always females that wear several outfits.They never really branch out to Trans woman or Hentai style or other thingsEven tho i do think there is a market for that.Its not entirely the fault of Istripper tho.Their customors get plagued by old males that are closeminded to and dont want to see anything else on their precious istripper then woman...I just realy hope they'll branch out one day i wouldnt mind seeing Shemales or Perhaps some hentai kind of deal i would be way more in to that"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T21:58:03.000Z",
          "Titre": "Video problems",
          "Contenu": "For the most part I have no trouble using the site. Unfortunately if I decide to watch a video I have trouble exiting. The whole screen goes white and I have to close the site and open it again."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T15:32:18.000Z",
          "Titre": "No true desktop…",
          "Contenu": "No true desktop background/overlay/wallpaper. The PC desktop version is better.No guys, shemale. I prefer the hot ladies😉but I think woman or transgender people miss that in all platform versions🤔"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2022-09-05T15:21:56.000Z",
          "Titre": "I gave a 3 stars because most of your…",
          "Contenu": "I gave a 3 stars because most of your models have fake boobs, I want real big boob models but it's hard to find."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T00:16:05.000Z",
          "Titre": "Have more access to models capabilities and movement",
          "Contenu": "Need more control over models Unable Full screen mode should show more than 1 girl at a time Have more blondes to go brunette and brunettes to go blonde"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T20:29:36.000Z",
          "Titre": "Not enough Veriety",
          "Contenu": "Not enough Veriety. Need models with more assets. Almost all of the girls have the same physic. Not enough thickness in the lower portion of their bodies. Add more models with more assets and you get 5star from me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T17:41:39.000Z",
          "Titre": "No ability to zoom in smoothly",
          "Contenu": "No ability to zoom in smoothly. Music along with action would make for better experience. Ability to mirror on smart TVs with out all the other graphics on screen would also be nice.More like a strip club."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T00:25:21.000Z",
          "Titre": "It was worth a try",
          "Contenu": "The whole site for the mobile devices it's kind of cheesy. The scenes are not fluid and it seems like they're jump around a lot and having to switch your phone from vertical to horizontal over and over again"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Thomas Stenger",
          "Nb_Reviews": 2,
          "Date": "2021-03-24T13:32:42.000Z",
          "Titre": "Stars and angels.",
          "Contenu": "I appreciate with all emphasis the possibilities of this software, for years! What I strongly dislike is this nonsens of \"special event cards\" and some of the restrictions within promotion activities."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Denis Beunard",
          "Nb_Reviews": 33,
          "Date": "2022-08-27T16:04:27.000Z",
          "Titre": "Interesting.",
          "Contenu": "Interesting.Need to think variability in what the girls can do as it is a bit repetitive... A bit lack of imagination"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "HotAdonis",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:00:51.000Z",
          "Titre": "Top Videos, top Girls",
          "Contenu": "The Service about Videos, a good platform, superiors girls, but sometimes I am fedup, because if I want to see only one girl, it changes after one or two shows and a new girl is coming. I can not see the whole show from one girl, yet if I want to look further..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T14:05:33.000Z",
          "Titre": "Beautiful models",
          "Contenu": "Best - Great selection of models to choose from.  Several very beautiful women.Bad - Software is okay, rarely crashes, but features and UI could be better.  They used to let you you \"star\" a models card and that card would appear more often.  One of my favorite features they removed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T02:50:56.000Z",
          "Titre": "I've had fun using the app",
          "Contenu": "I've had fun using the app. Cost is good have had no problems with billing. Always adding new models. Only bad thing I can say is downloads sometimes a bit slow and I wish there was an one click way to make the models disappear from the screen when you are trying to get work done"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Cane from Citizen Kane",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T03:43:34.000Z",
          "Titre": "Gacha and FOMO issues",
          "Contenu": "Special Event cards being locked behind gacha stuff is pretty lame, as well as the FOMO dollz stuff. An occasional customer will eventually find a more palatable business model elsewhere, and you will only have whales left. Please reconsider how you go about doing new releases of certain cards, and consider a way of circulating legacy event cards in a more reasonable way for newer users."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:53:06.000Z",
          "Titre": "11/10 would recommend",
          "Contenu": "For the most part the service is great but if you are going to release multiple special event cards the price to get on should not exceed over $75 for the one card."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:17:32.000Z",
          "Titre": "I would like some more options",
          "Contenu": "I would like some more variety/diversity, with options to eliminate categories. Like, there are no trans women, no midgets, no fat chick's etc. and since those are more niche, it would be nice to be able to exclude categories from searches, and from events. you wouldn't want to win a fat tranny card on a scratcher, if that's not your thing, but if it is, it would be a cool option. I would like to eliminate the oldest cards from my events, and eliminate the non explicit cards, because they're not my thing. also, stop trying to sneak reoccurring payments into purchases. that's shady."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "New Diamond Customer",
          "Nb_Reviews": 6,
          "Date": "2023-09-30T15:31:01.000Z",
          "Titre": "Has been great these past few years.",
          "Contenu": "Simple to use, huge selection of shows - the models are all beautiful, some seem exclusive, others you may know. There are also shows by pron performers past and present.The shows vary in outfits, performances and levels. Once you find what you like there is more than enough to keep you coming back.Cost per show is fair and you get a discount the more you own.Should mention they are starting to release some of the better content as NFTs if that is not your thing.The community (forums / comments section) is helpful and non toxic. Considering what the product is, its either testament to good moderation or just the type of people who use iS."
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "haluzzak",
          "Nb_Reviews": 4,
          "Date": "2023-10-21T12:09:26.000Z",
          "Titre": "Everything is great except...",
          "Contenu": "Everything is great (models, software, support...).Except for the video quality (I don't know how to force them to increase the video quality anymore). The year is 2023 and their video quality is approx. year 2015. 4K is weak and even for an additional fee (premium) and VR is mega poor quality (2700p) - it's a shame to download it!!! (I'm not even downloading it). Please go to a higher level of quality!!!!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mouse",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T01:56:29.000Z",
          "Titre": "It is easy to buy credit",
          "Contenu": "It is easy to buy credit, but the background music is boring and repetitive. The girls are hot and the variety to pick from is great, but my picks sometimes get removed and I'm out my money. I understand someone deciding to end their contract with your company but, I should be reimbursed with the free new pick if that happens. Not just left hanging limp. Also can you add a download all opponent for when I need to redownload all my models? Over all I love this company."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Madblade666",
          "Nb_Reviews": 4,
          "Date": "2023-09-18T16:53:32.000Z",
          "Titre": "Is good to see!",
          "Contenu": "I really like the kind of format of the shows on the PC desktop.The best part is being able to choose each time which shows to buy without necessarily having a periodic subscription.The technical assistance was always kind and punctual in solving the problems that occurred to me.Unfortunately the price of the shows has become high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-09-17T20:22:25.000Z",
          "Titre": "Lots of great models",
          "Contenu": "Lots of great models.  Previews available are almost exclusively of models I do not want to purchase and they repeatedly show up.  It would be nice to see more of what is in my wish list to show up.  Also new version sometimes closes by itself, very annoying."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T03:21:26.000Z",
          "Titre": "The models are great and the overall…",
          "Contenu": "The models are great and the overall quality of the product has been improved. Even though there are a lot of models, it would be great to have more ethnic diversity"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Dave Francis",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T23:03:55.000Z",
          "Titre": "All good apart from the software",
          "Contenu": "The only aspect that lets iStripper down is the flaky programming. The app urged me to download an upgrade, so I did, but it wouldn't work with my operating system - and it deleted the version that did work!I eventually found a version that worked, then found that iStripper had created about a dozen accounts for me. I had to find the account that contained details of my Collection and my money spent. Finally, with help from Lee at the Help center, I got it working - but I must remember to ignore being told to upgrade!"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Anttuli",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T14:15:48.000Z",
          "Titre": "Personal note for Beautiful Eva Elfie with Kiss.",
          "Contenu": "Girls really can dance and they are beautiful. Is possible to Ask Eva Elfie about live Via computer private dance that we see each other, i Haven Been Eva's fan since find her first Time from internet, amazing woman like her May say no for My suggestion even If i pay for private dance. I am on wheelchair that is main reason i use these sites, she propably say no or it Will be expensive If she dance for me, i pay plane and hotel If she come Finland Oulu is where i live please come visit for Weekend like to see her live. Hotel, tickets and dance for me i can pay Eva for her company 1000€ If not enough let me know how much need to play?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "member Jafo",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T19:44:13.000Z",
          "Titre": "The difference between Istripper and others",
          "Contenu": "well there have been alot of wallpaper strippers around for awhile now, the two biggest things you have over everyone elas is: 1. most backround stripper programs are new start up programs and you get a choice of 4-6 girls, were you have thousands being part of met art, and 2. all the options you have on your program, you spent good time and I'm sure money, makin it work for every one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorsai6",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T04:21:06.000Z",
          "Titre": "Dancing girls on your desktop",
          "Contenu": "iStripper puts dancing girls on your desktop.  The girls are lovely and fun to watch.  Over time they've added additional capabilities and more variety to the shows.  The shows are often more explicite than before, which I can do without, but you can control how much you see.   Each show is purchased separately and can be watched as often as you wish.  The price is reasonable.  The user forum is a plus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:08:15.000Z",
          "Titre": "It's getting there",
          "Contenu": "It's getting there. I think they could add more in the way of the kind of dancing being done and more toy variety would be cool. Do a orgy scene. I know you did a foursom."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ndrewmyr",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T01:33:15.000Z",
          "Titre": "4 stars",
          "Contenu": "I like iStripper, but hope for those quantity of models there will be more flash sales with more than 10% discounts in same time, at least for old models"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "LuKart",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T17:23:50.000Z",
          "Titre": "Great job you guys",
          "Contenu": "What can I say..A Big THANKS to the Speakers/Strippers for their Work and for what they offer, really of quality reflecting for some the work behind it, worthy of an artistic representation and/or a professional practice.Also a Thank for the people behind the camera for making the thing possible,Istripper is an convenient and professional site With affordable prices.The only downside to Me :The non-marketing/inability to buy of event cards... and the scarcity of conventional ways to obtain them."
        },
        {
          "Note": 4,
          "Lieu": "LK",
          "Pseudo": "human",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T23:21:37.000Z",
          "Titre": "Everything is great but the auto downloading is annoying.",
          "Contenu": "Everything is great but the auto downloading previews is bit annoying while we download our own content. if there is a way to turn off that function, I apologies for this comment. But most of the time I really enjoy the app. And the PC application itself fells bit old for some reason. Compare to the mobile site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T12:39:47.000Z",
          "Titre": "I gave you four out of five stars",
          "Contenu": "I gave you four out of five stars. And not five stars because I had tried to use my Mastercard but it was being denied purchase wasn't made technical glitch of some sort. So I had to wait until Monday to take same card and deposit money on my debit card in order to make my purchase. Which several times over the weekend I had second thoughts. Other than that you're all doing a great job not excellent but great."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "HellishCustomer",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T21:58:26.000Z",
          "Titre": "Mostly good",
          "Contenu": "Same as before all good but don't like that the price of all the cards have gone up XXX cards should be the only cards to go up in price"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Ben",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T12:31:34.000Z",
          "Titre": "Product is overall great.",
          "Contenu": "Product is overall great.I wish there was some more accurate option to read one card from start to finish, without disabling all the others, and also more progressive nudity. Despite option ticked,  i feel it starts at random point"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T13:04:36.000Z",
          "Titre": "I purchased 500 credits a day ago but…",
          "Contenu": "I purchased 500 credits a day ago but never received those credits on my account. Customer support told me they credited my account and all I had to do was sync with the server but when I did that nothing changed. But thankfully the hard working support team was able to correct the issue. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T20:16:05.000Z",
          "Titre": "Perfect - allmost :-)",
          "Contenu": "I got, what I've payed for - sexy ladies strippin' just for me ;-)It could be nice with an interface in which I would be able to choose more specific shows (each lady has posted several shows, and some are better than others)."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ray andrews",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T23:57:15.000Z",
          "Titre": "once you know what your doing its…",
          "Contenu": "once you know what your doing its straight forward its not completely clear but you get there took me a few miniutes to get it right .i would like to see more girls of different ages and types (dont like skinny girls) .i would also like to know if i can send this prog to other computers on my network"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T19:58:39.000Z",
          "Titre": "Needs a tad more controllability",
          "Contenu": "pretty good, however I think a better way to cycle through individual scenes for each shows would be great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Carpenter",
          "Nb_Reviews": 5,
          "Date": "2023-02-23T21:47:36.000Z",
          "Titre": "Lots of great stuff to choose to…",
          "Contenu": "Lots of great stuff to choose to augment my experience, but not enough directions to follow. For example, I was looking for a mature category and no idea where to find it. Overall an exceptional program that needs just a tweak of fine tuning..."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Valemon",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T08:35:45.000Z",
          "Titre": "What would I like?",
          "Contenu": "A bit expensive?To much dildos and masturbation?More shows like those of Lana Lane, Mara Blake Tatana Coco?I would like more  pantyless upskirts, spreading legs and doggystyle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Locomotive Breath",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T21:36:35.000Z",
          "Titre": "Very nice, but needs more mobile/PC interaction",
          "Contenu": "I've been a member since the original \"Virtuagirl\", low res. version came out. The steady improvements have been great. Very nice girls overall (although, more Asians would be appreciated). Only two reasons I didn't give it 5 stars:1.) The mobile site should be more directly linked to the PC, so you can have all the same cards available and not have to pay an extra 7.99 a month to watch on your mobile device.2.) \"Sexually Explicit\" cards should all have several shows where a \"toy\" is used. Many only have one."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "taxman",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T19:44:45.000Z",
          "Titre": "mix it up",
          "Contenu": "more creativity with the dancers would be cool. different ideas, types of performances, and maybe different camera angles would be interesting? You guys have been operating for years it's time to mix it up a little and see."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T03:37:09.000Z",
          "Titre": "I finally enjoyed lady show offline",
          "Contenu": "I finally enjoyed lady show offline.  It is a better experience then searching in the browser or mobile or buying dvd.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T15:52:39.000Z",
          "Titre": "It's a fantastic service but....",
          "Contenu": "It's a fantastic service, but it the payees are triggered too often to block my accounts. My CC cards aren't being blocked.Also I would like to see it move into M/F hardcore content."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Kunde",
          "Nb_Reviews": 4,
          "Date": "2023-03-26T13:54:04.000Z",
          "Titre": "Offers and Communities",
          "Contenu": "Shows from the Models are very professional and inspiring. - The member community is devided because the forum of the Website and the other one on discord are not connected anymore because the two separate communities only use their own channel. - Games and the Event Cards that no member can buy are beyond any kind of attractivity."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Zorro",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T00:36:35.000Z",
          "Titre": "Yes great sperience",
          "Contenu": "Yes great sperience, but allways same format ... you can create New views like selfy May be?, New interactions dinamic story May be?, grafic novel."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Dark",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T10:01:56.000Z",
          "Titre": "Over all I enjoy using this product",
          "Contenu": "Over all I enjoy using this product. However I have taken a star for being weary of the newly added NFT items. It is painful to see something doing so well fall into such a bad thing and it has marred my over all out look on the people who operate this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cyberdweller",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T20:00:26.000Z",
          "Titre": "Not excited about the new format for…",
          "Contenu": "Not excited about the new format for latest shows, enjoyed the carrousel choices previously used. I prefer dancing ability over all else."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "adamiq",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T08:09:23.000Z",
          "Titre": "Overall expierience like no other.",
          "Contenu": "Hotnes level is great. Playlist option needs improve and interupting youser choice is annoying. Very good quality of video. Overall expierience like no other."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DDLloyd",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T23:51:54.000Z",
          "Titre": "Opportunity",
          "Contenu": "You need to provide a way to purchase multiple packages in one transaction.  I would have purchased 2  $50 packages simultaneously had you provided the opportunity.  Also, access to PayPal Credit for purchases would motivate me to purchase that way as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loventwister",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T16:08:42.000Z",
          "Titre": "Everything's good which one exception",
          "Contenu": "Everything's good which one exception, not all models stay in full size mode when switching from model to model."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Darren Burridge",
          "Nb_Reviews": 8,
          "Date": "2023-02-13T11:47:41.000Z",
          "Titre": "The Girls are gorgeous",
          "Contenu": "The Girls are gorgeous and the actual interface is quite good, it doesn't get in the way of the desktop operations and didn't trigger my antivirus. the only minus is I wish the discounts were more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CalicoClyde",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T03:20:30.000Z",
          "Titre": "Great program",
          "Contenu": "Great program.  I was used to an older version of it, and I miss being able to put the girls on either the left or right side of the screen, and having a simple right-click on the girl or the program icon would stop the show (handy if someone walks by).  Aside from that: everything is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T20:59:35.000Z",
          "Titre": "Easy and Simple",
          "Contenu": "It's easy to get the digital currency and there's a big selection to choose from. The filter can be better, but at the moment it's good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T19:27:16.000Z",
          "Titre": "The lens focus issue recently has been…",
          "Contenu": "The lens focus issue recently has been kinda off-putting. Also some cards are locked behind mini games. Other than that the service and product has been great."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "DanyDan",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T10:42:12.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive. I want New music tracks. I want more brunettes with black lingerie black stockings. I want white lingerie. Dancing bride ... Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl A",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:31:34.000Z",
          "Titre": "Decent App",
          "Contenu": "The App is sound. I wish there was a way to get screen captures of the ladies on videos. The App is sound, not a big fan of the recent UI changes."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rodolf",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T05:59:54.000Z",
          "Titre": "Improve your display to give more flexibility in terme fast forward and also the possibility of zooming models in background zoom of the",
          "Contenu": "models are great and  lingeries super sexy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T03:16:28.000Z",
          "Titre": "A returning subscriber",
          "Contenu": "A returning subscriber. Like the new features, still learning what's new."
        },
        {
          "Note": 4,
          "Lieu": "BY",
          "Pseudo": "Driven",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T19:42:45.000Z",
          "Titre": "We need more curvy models!",
          "Contenu": "Yeah, there are many beautiful models, but I want more curvy girls with big tits & asses, maybe some BBW's!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T21:18:26.000Z",
          "Titre": "The only way I would improve is if I could select more than one category when buying new girls at a time. Aka big boobs and redheads.",
          "Contenu": "The only way I would improve is if I could select more than one category when buying new girls at a time. Aka big boobs and redheads. Otherwise I love everything thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:19:25.000Z",
          "Titre": "Beautiful girls",
          "Contenu": "Beautiful girls, runs great on my machine.  Tokens might be a little expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T01:18:31.000Z",
          "Titre": "Need more girls with beautiful face and big boobs",
          "Contenu": "Need more girls with beautiful face, skills, and big boobs. Viola dancer is perfect example. Need more like her. Lately big boob girls lack skill or not pretty or both."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 4,
          "Date": "2023-07-07T16:24:00.000Z",
          "Titre": "the shows are generally good the girls…",
          "Contenu": "the shows are generally good the girls are gorgeous but i think the shows have gotten a little pricey over the years"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T02:22:17.000Z",
          "Titre": "Plenty of high quality content",
          "Contenu": "Plenty of high quality content. The site is easily navigated and controls are user friendly."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T00:57:05.000Z",
          "Titre": "The experience is good",
          "Contenu": "The experience is good, the only downside is that you can't choose to play a specific clip."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Manuel",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T22:48:40.000Z",
          "Titre": "Convenient for at home or at work",
          "Contenu": "Very nice girls. High quality animations. Highly recommend for anyone who doesn't necessarily want to invest in a strip club."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Csmccoin",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T18:48:31.000Z",
          "Titre": "It I could skip to the xxx on cards I…",
          "Contenu": "It I could skip to the xxx on cards I bought it would be 5 stars easy to use and I like it overall I just do not have a half star option"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Travis",
          "Nb_Reviews": 3,
          "Date": "2022-12-30T00:16:54.000Z",
          "Titre": "The platform could do with more teenage…",
          "Contenu": "The platform could do with more teenage girls & more better cosplay choices. But the platform itself is pretty sweet"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Mr. Z",
          "Nb_Reviews": 3,
          "Date": "2023-02-20T21:39:36.000Z",
          "Titre": "I get what i pay for and the management…",
          "Contenu": "I get what i pay for and the management of those transactions are discret and private :D good stuff´!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Hostetler",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T23:24:18.000Z",
          "Titre": "iStripper is very dependable and user…",
          "Contenu": "iStripper is very dependable and user friendly, but I always have a problem making a purchase, especially with Epoch. My credit card is often rejected with no apparent reason."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Xorpion",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T00:18:11.000Z",
          "Titre": "easy to use",
          "Contenu": "your product is very easy to use.  wide variety of models you have a little something for everyone. i only ask that you continue to do what you do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Just a guy",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T10:19:52.000Z",
          "Titre": "Fantastic girls",
          "Contenu": "Fantastic girls, great sets, decent prices. Easy to find a few favorites."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "justus",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T16:22:58.000Z",
          "Titre": "realistisch no man to real sex her…",
          "Contenu": "realistisch no men pusch his penis in to her mushi or butt or moth or tittes when wis kommes I give this a 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Reid",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T03:01:07.000Z",
          "Titre": "Download it was a little slow but I…",
          "Contenu": "Download it was a little slow but I always enjoy new girls to look atTheir videos"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jeffrey Peever",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T03:21:32.000Z",
          "Titre": "The wide variety of Strippers to choose…",
          "Contenu": "The wide variety of Strippers to choose from."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ike from TX",
          "Nb_Reviews": 2,
          "Date": "2022-12-17T10:34:31.000Z",
          "Titre": "It’s a great app with tons of high…",
          "Contenu": "It’s a great app with tons of high quality content. If I had any feedback for you. Make the selection of races more diverse."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Touchmaster",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T16:23:33.000Z",
          "Titre": "Tragic Upgrade.Recently my computer was \"upgraded\" by…",
          "Contenu": "Recently my computer was \"upgraded\" by Microsoft.  I can no longer access the over 500 vpl files I have from I Stripper.  I have been buying them for over 10 years.I also lost my user name and password.  However, I have been on the forum with the name of \"Touchmaster\".  I downloaded a new Istripper. But it hasn't helped. I Stripper is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:31:11.000Z",
          "Titre": "You need new guys",
          "Contenu": "You need new guys! The ones you have are great, but update them please. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "connor sheavils",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T08:46:17.000Z",
          "Titre": "I need help to unsubscribe from auto…",
          "Contenu": "I need help to unsubscribe from auto renewal on istripper PC can someone help?"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jonathan Watts",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T08:10:49.000Z",
          "Titre": "I was very greafull to be able to…",
          "Contenu": "I was very greafull to be able to easily recover my account .10 out of 10 😃"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T15:09:32.000Z",
          "Titre": "Dark theme update",
          "Contenu": "Could do with a dark theme update, have more options and refine the app."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Cory",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T13:44:16.000Z",
          "Titre": "A lot of beautiful girls",
          "Contenu": "A lot of beautiful girls. A feast for the eyes but not really necessary. That's why only 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T20:01:47.000Z",
          "Titre": "Overall it is good",
          "Contenu": "Overall it is good. I will add one thing. MILFs, Women who ages are between 28-45."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T09:59:07.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, fun website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vidavis",
          "Nb_Reviews": 3,
          "Date": "2022-10-22T19:09:31.000Z",
          "Titre": "I love the variety of girls",
          "Contenu": "I love the variety of girls, wish there were some bigger girls... Also really wish there were easier ways to get SEC's, like maybe after a year they become purchasable... I almost have the full Belka collection, but I cannot ever get her SEC... And I have spent A LOT of money trying... I am almost triple diamond..."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Geert",
          "Nb_Reviews": 5,
          "Date": "2023-06-01T19:28:38.000Z",
          "Titre": "The software is working as it should",
          "Contenu": "The software is working as it shouldBut there could be a little more variation in the shows"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T00:24:52.000Z",
          "Titre": "I would prefer more 2 and 3 minute nude…",
          "Contenu": "I would prefer more 2 and 3 minute nude from start dance scenes with high heels.  All other things really good! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Emery",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:40:02.000Z",
          "Titre": "Good experience with your company"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Tim Moebus",
          "Nb_Reviews": 3,
          "Date": "2022-10-27T09:01:19.000Z",
          "Titre": "Good made",
          "Contenu": "Software works perfect. Effects are really amazing.A lot new high quality cards but also a lot very old less quality. Never updated.Login only possible with a cryptic user name not via email. Could be a problem if lost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Beesley",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T20:56:16.000Z",
          "Titre": "Ladies are gorgeous",
          "Contenu": "Ladies are gorgeous. Love redheads. I would like to see a few thicker ladies though. We had Istripper awhile back. You had a couple of thick ladies then & they were HOTT! Aria Giovanni was one of them. Keep up the good work 🤘🏻🤘🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick A Geeslin",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T05:07:37.000Z",
          "Titre": "More penetrarion shows",
          "Contenu": "More deep penetration shows.  Riding dildos and real visible penetration with toys."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T19:42:54.000Z",
          "Titre": "After update shows costs more credits"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Roberts",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T20:22:54.000Z",
          "Titre": "I love istripper its a great product…",
          "Contenu": "I love istripper its a great product the girls and effects are amazing makes me feel better I hope to put girls I know on this app or do something similar one day"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T22:04:48.000Z",
          "Titre": "the new options areconfusing",
          "Contenu": "the new options areconfusing, especially when what I want was toaccessmy collections.  slow learning curve."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stevecanales",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T18:08:47.000Z",
          "Titre": "The models are diverse",
          "Contenu": "The models are diverse, there's something for almost everyone. Nothing is over the top. The one drawback that I have found is that, there is no way to search for your preferences. You can try reading the reviews but good luck with reading that crap. It's worth checking out though. A lot of beautiful young women who seem happy with their work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Talamuscan",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T20:49:14.000Z",
          "Titre": "The purchase was easy",
          "Contenu": "The purchase was easy.  It did have trouble going through the first time. But that could have been my computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "johnnyjville",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T13:32:26.000Z",
          "Titre": "Love iStripper",
          "Contenu": "Love iStripper. I just want more choices of black women."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "charis",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T18:51:32.000Z",
          "Titre": "1.I like the explicit shows",
          "Contenu": "1.I like the explicit shows. 2. The full nudity shows need two categories- a) full table spreads which are fantastic and b) partial table views that hide and do not reveal. 3.  poor direction a) to many side views on the table- replace with 45-degree angles and more full-on views. b) models with full views on the table need to keep their foot from blocking the view. c) the camara needs to be lowered a bit to stop cutting off the view when sitting on edge of table. d) use more camaras for zoom in and different angles."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "VANNI D.",
          "Nb_Reviews": 8,
          "Date": "2023-08-27T06:57:31.000Z",
          "Titre": "TO GET SPECIAL EVENT CARDS EASIER"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T18:11:26.000Z",
          "Titre": "i liked when when you could go to one…",
          "Contenu": "i liked when when you could go to one girl and check off her set idivigbly?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T03:03:19.000Z",
          "Titre": "video preview",
          "Contenu": "Hello to all....My computer was refurbished and now I cannot have a preview of the video before buying the card. I used to be able to play the videos before,but now,I get the message :cannot play this video....Has something changed in the updates???....it was useful back then because you had a glimpse of beautiful pussy hair which is my favorite....over bare pussy Now I have to search before buying or read reviews....Thanks anyways"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rob f",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T19:35:47.000Z",
          "Titre": "tech scam/idenity theft",
          "Contenu": "Hi, I have a tech scammer and they target me sometimes when i log on to istripper. I did contact FTC and are investigating. also, have a lot of cards that became gray and don't know how to get them all back at once. had to get new card as well...sometimes I get declined..this last purchase took several times to get it approved.you do an awesome job!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Skulfur",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T15:25:23.000Z",
          "Titre": "Detail is really good",
          "Contenu": "Detail is really good. Everything is well done and not sleazy. The only thing that is a down fall for me \"and this is only personal preference\" there is no bigger ladys. I like women with some jiggle to them. But other than that it's a very well done app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EricDeLuna",
          "Nb_Reviews": 2,
          "Date": "2022-07-31T16:02:18.000Z",
          "Titre": "10 years strong",
          "Contenu": "I liked the original system a little better where things were more 1-1 and enjoy the deskbabe content more than the strip teases. Some of the girls are slow and boring because they are unsure of what to do beyond a strip tease so avoid low ratings and read reviews before purchasing content. The tech and resolution has really improved over the years."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T19:52:28.000Z",
          "Titre": "great",
          "Contenu": "great ! need more diversity from around the word plus older ladies"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T20:52:29.000Z",
          "Titre": "Exactly what it says on the tin.",
          "Contenu": "iStripper delivers exactly what it promises - pretty, scantily clad women dancing on your monitor. There are numerous women to choose from, often multiple dancers from any given performer. There is a collector mindset built into the platform, as such frequent purchases of credits are to be expected. Credit packages are not exceedingly costly but do add up. Free previews can go a long way in helping you shop wisely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T06:43:53.000Z",
          "Titre": "Content",
          "Contenu": "Content! It is high quality!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RT in USA",
          "Nb_Reviews": 5,
          "Date": "2022-07-25T07:38:52.000Z",
          "Titre": "iStripper experience",
          "Contenu": "IStripper has been and continues to be a very good experience and value! Continuously adding girls and keep the newest technology to enhance viewing! Love it. Recommend find more girls who have real experience stripping, or dancing in general. Bring back some of the best like, Anastasia Brokelyn, Melisa, Nekane as examples, even try a bit older ladies! They’re sexy too!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T20:35:03.000Z",
          "Titre": "GOOD, could be GREAT!",
          "Contenu": "I really enjoy the iStripper but there are a couple of things that I wish you guys would change. The 1st being all the damn games, I do NOT like all those damn games, and I wish you guys would have more cards for sale and the 2nd thing that I wish you guys would change is when I win a free card and you guys randomly pick the card for me. I would like that changed because I want to pick my free card or have the free card be picked randomly from my wish list. Other than that, I really enjoy the iStripper experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:59:50.000Z",
          "Titre": "The payment went fine for the first time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T06:55:45.000Z",
          "Titre": "The entire experience is fantastic",
          "Contenu": "The entire experience is fantastic.  Love the models, their shows and collecting all of the cards. I was an early member years ago and just recently came back.  I am thoroughly impressed with the changes and improvements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerChuck",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T03:37:34.000Z",
          "Titre": "It's just perfect",
          "Contenu": "It's just perfect!  Great quality of dancers and video.  So many choices of beautiful dancers.  And the price is reasonable!  I have been a customer for years and will continue to be!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T15:48:06.000Z",
          "Titre": "Wish mobile site was beter",
          "Contenu": "No issues,  Really wish the mobile website was just as good as the computer.  I don’t want to pay for a membership to use the machine mobile site.  I just want to watch the girls I already purchased.  Also, I wish I could purchase credits on the Mobile site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T04:33:00.000Z",
          "Titre": "love it",
          "Contenu": "The girls are great and the ratings and descriptions are very accurate and informative. I know what I'm going to get. very high quality."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "W.Pusch",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T20:37:15.000Z",
          "Titre": "Everything is almost okay",
          "Contenu": "Everything is almost okay. But: I miss big XXXL breasts and big busty (OLDER?) women, BIG GIRLS......OKAY."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "member",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T04:18:33.000Z",
          "Titre": "Superb acting/casting, loyal customers rewarded",
          "Contenu": "Great products on offer, superb acting/casting! Generous discounts for loyal customers."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "John S",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T06:21:31.000Z",
          "Titre": "Since 2016",
          "Contenu": "Since 2016, I've been involved with istripper platform, and it's been fantastic. They consistently release updates and modifications to their content. Once you join, it's not just about consuming content; you become part of a community, connecting with others as part of a larger family."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Just Me",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T12:07:54.000Z",
          "Titre": "Nice to see that you fixed the purchase…",
          "Contenu": "Nice to see that you fixed the purchase issue I was having."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rolias",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T03:36:19.000Z",
          "Titre": "All's well that ends well.",
          "Contenu": "The purchase was ultimately completed, but there was some back and forth with me, my bank, & Segpay, attributed by my bank to possible security threats and the international nature of the transaction.  I note it took a while (about an hour) for my new credit balance to show on the iStripper software, even with restarting your app.  The iStripper website at the same time posted it almost immediately (an hour earlier).  It gave me some concern.  I had supposed your software and your website would be better in sync with each other."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cerebral",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:10:50.000Z",
          "Titre": "Fun and Unique",
          "Contenu": "Customer service is awesome, buying cards is easy (would buy more if After Pay were available) but all in all iStripper is fun and unique :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:24:14.000Z",
          "Titre": "I like the photos as well!",
          "Contenu": "I enjoy the shows very much, especially the ones with full frontal nudity where the girl sways her hips or moves in a sensual fashion. But I like sexually explicit shows as well!That being said, I really like that there are photos as well as the strip shows. With the shows, we can't go back \"a little\" to re-watch a specific part or move that the girl made. A good photo doesn't have that issue so it's nice that you provide us with both.About the customer service. Well I never had any big problems so far so I'll say: so far so good! When I want to know something, I usually find the answer I need on the forum."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YerXLNC",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T20:43:32.000Z",
          "Titre": "The software is very easy to download…",
          "Contenu": "The software is very easy to download and set up so Kudos for that. I do have issue with the backgrounds and getting the full shows to play but I guess that comes with experience. The Models are very attractive and make working through the bugs worthwhile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:54:57.000Z",
          "Titre": "The wide selection of models."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T17:13:34.000Z",
          "Titre": "Just a good experience all round"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T00:33:35.000Z",
          "Titre": "easy to use site",
          "Contenu": "easy to use site, the video quality is great, good variety and selection of models and their outfits and shows, downloading is easy, I really like the pause effect and different features and erotic levels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T07:02:44.000Z",
          "Titre": "A job well done!",
          "Contenu": "You guys do it all very well. Hot girl's to the great videos what can I say, Job well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:04:31.000Z",
          "Titre": "Great company really wish i could do…",
          "Contenu": "Great company really wish i could do more to support their work. But i do what i can"
        },
        {
          "Note": 5,
          "Lieu": "ZW",
          "Pseudo": "edward",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T14:45:21.000Z",
          "Titre": "Well on the purchase",
          "Contenu": "Well on the purchase, there is no error on the credits you buy and the credits are priced fairly i think.The most great experience is from the girls  pictures and videos, sexy as ever.In particular Linda baker and Elle mira have made my experience on itsripper worth while.Passionate , confidence and presentable these i love and I see that in them.Its great really. But I would say that the only drawback is the download option, it doesn't have a pause or continue option when you need to download something else which makes it a pain and boring, I would be needing see see first the card I would have seen at the time but I would have to wait until all the other cards , videos,photozip have finished."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kurt",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T06:19:31.000Z",
          "Titre": "I just love all of the girls",
          "Contenu": "I just love all of the girls especially the Redheads with Big Boobs"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robbie Mailman",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T00:10:10.000Z",
          "Titre": "So many beautiful models",
          "Contenu": "So many beautiful models, and new shows all the time. Lots of features to play with in the settings. So tough for me to pick 16 or so shows, I'll have to get more tokens!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T15:22:41.000Z",
          "Titre": "Easy and convenient purchase. Recommended!",
          "Contenu": "Easy and convenient purchase. I received what I ordered, and I'm satisfied with the content. Good service. I didn't need their support, but I quickly browsed through their forums, and they seemed very helpful. Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "i",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:14:18.000Z",
          "Titre": "The products ordered",
          "Contenu": "The products ordered, downloaded, are GREAT. Customer service via messaging in software, could be A LOT better. They don't seem very engaging and knowledgeable. A chat session would be better in fixing problems than messaging. Forum access requires an account with discord in order to create a thread? That is a disappointment. Feedback of ideas, submissions, doesn't exist. WIll have to send an email to deliver my feedback/ideas for product improvements into the future."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "sad",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:54:51.000Z",
          "Titre": "credit card payment",
          "Contenu": "payment w/ epoch failed many times and i received multiple \"google service\" charges on my credit card. The payment finally worked with segpay after more than 10 unnecessary charges on my card. besides this its great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Cole",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:39:36.000Z",
          "Titre": "I enjoy this website very much"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Kohei Hishiyama",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:40:21.000Z",
          "Titre": "Great",
          "Contenu": "Great, this software will give me great experience and all girls are very beautiful and very great graphic quality. So I bought some shows, and I will buy more show when found good girl."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "LuckyXL",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T04:47:19.000Z",
          "Titre": "Good Work",
          "Contenu": "Simple and easy processing."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sven",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T20:02:36.000Z",
          "Titre": "Still a great experience!",
          "Contenu": "After 5 years now i still enjoy the product in all it's glory. The Quality of the Shows has increasedsignificant since my last review in April 2021as well as the selection of the Models.The Customer Support is still very rapid, and the Software still does the job like i would expect from it.No Viruses, No Scams just the beautiful Girlsstripping to fully nude, while you are listening toyour selected favourite Music."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:22:37.000Z",
          "Titre": "Quality VR Strippers",
          "Contenu": "Quite decent value for money as far as adult VR content, the previews and sample pictures gave me a very good idea of which shows I would like, and was only disappointed with one afterwards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T01:23:13.000Z",
          "Titre": "Great product and fast support",
          "Contenu": "I had a problem that resulted in me not being able to purchase 2 \"shows\" because the app said I already had them - I didn't. I submitted a ticket for it late one night. The next day the two were already in my account. And, early in my membership, I purchased several and when I came back they were \"gone\". Later that day I had an email explaining that I had created two accounts and the \"missing\" files were in my other account.I really like being able to select the girls I like and am impressed with the customer support (twice)."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kristof Belo",
          "Nb_Reviews": 7,
          "Date": "2023-08-01T08:20:44.000Z",
          "Titre": "amazing, but models too skinny. BBW please",
          "Contenu": "amazing software , good quality but big file size for modelsyour models are beautiful but skinny . you should consider mature women and curvy / BBW.you will see that trend is not toward skinny . please do a curvy / BBW models / section and mature women welcome too"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Hyron",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T14:38:31.000Z",
          "Titre": "Art & Sensuality",
          "Contenu": "Most of the girls have very sensual and artistic dancing, and that is not only because they have a great knowledge and skills to show such a high level of professional dancing but also their impresive high self-confidence - which is the most important part in any type of dancing - while they're showing their art in performing in front of cameras.Some of the girls are too dynamic and fast in their moving on the table (mostly while they're walking): slower movements are more sensual, so no need to hurry with the performance.In general, I am very pleased with what I get as a customer, and with the level of professionalism of your site. Keep up the excellent work.Hyron"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Urs Niederhauser",
          "Nb_Reviews": 7,
          "Date": "2023-09-03T06:36:49.000Z",
          "Titre": "It's just fun to watch the girls moving…",
          "Contenu": "It's just fun to watch the girls moving arround the screen!!! You can have one girl or two it doesn't matter.As we have no more Strip-Location in town, this is a mature diversification."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Hayazo",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T09:37:50.000Z",
          "Titre": "Best stripping desktop app yet",
          "Contenu": "Great app offering some really naughty shows for your desktop. Customizable numbers and sizes of the clips running. Lot of models and more than 1000 shows to choose from. Prices are reasonable, and quality is great. Personally never had a problem with purchasement or some sort of \"scam\".So far so good, I'm very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T10:34:04.000Z",
          "Titre": "Fun.",
          "Contenu": "Fun, beautiful girls, nice format.  Wish you could click on the background to go to another window or display and then click on a girls to go back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ocimene",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T05:52:11.000Z",
          "Titre": "Great Color",
          "Contenu": "Great Color, Great Backgrounds. I like this one. Ladies still dancing on your desk top while you are searching anything untill you turn the off button, I never do.  LOL!  Easy download on program software to my desktop.  Takes payment easily with only a few seconds on payment transactions."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "pornhunt",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T07:30:45.000Z",
          "Titre": "I gave 5 stars but 5 is the perfect (…",
          "Contenu": "I gave 5 stars but 5 is the perfect ( unreachable yet ), but also 4 stars I think is low for iStripper effort , I want you to know that always there is room for improvement ...Keep up the good work ...I love the most Models iStripper have , the quality of Beauty and Hotness is amazing !I like the user friendly application .iStripper keep going that way ..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CSF",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T22:49:57.000Z",
          "Titre": "it probably just am happy i came back…",
          "Contenu": "it probably just am happy i came back even though i screwed it up when i was on here before i was getting i girl a day new to my collectionand i was working in the field on one job and teaching at a major university much of the time i had you running on the one laptop that i carried around actually it was two"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Cliente",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T10:12:28.000Z",
          "Titre": "I love istripper"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T01:25:09.000Z",
          "Titre": "iStripper is a fun and entertaining…",
          "Contenu": "iStripper is a fun and entertaining application that is a welcome distraction while you are messing around on your computer.  It offers a little titillation and enjoyment to somethings that could just be mundane, such as checking your email or browsing the news or sports columns on a website, or anything else.  Their payment plans have been secure for all the purchases I have had, and they make it very simple to do so, with a wide variety of options on how to pay.  They have a wide selection of ladies and interests, and are always getting more."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "member",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:57:42.000Z",
          "Titre": "I just think it is made Exelent"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "JaguarFonguS",
          "Nb_Reviews": 6,
          "Date": "2023-07-06T06:20:52.000Z",
          "Titre": "Collection the vidéo clips",
          "Contenu": "To easy payments, PayPal is now available in the store. With more that ten years of use this platform I am pleased with the choice offered to me. I like the impact on the desktop of this application that no other do at this level of sustainability."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "xanphre",
          "Nb_Reviews": 6,
          "Date": "2023-07-24T14:43:03.000Z",
          "Titre": "The experience is wonderful.",
          "Contenu": "The experience is wonderful.Beautiful women that you only have to tip once, and you get to watch their shows as many times as you want. No buying expensive drinks in a club, just so you can watch the show. No one picking fights with you because they had too much to drink, and just don't like the way you look. You get the club experience, without having to go to the club, and all the women are beautiful and sexy. And they even speak from time to time...so watch, and enjoy often..."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Robin",
          "Nb_Reviews": 15,
          "Date": "2023-07-23T00:02:25.000Z",
          "Titre": "Istripper",
          "Contenu": "I am a verry long time user of Istripper, when it was Virtuagirl i was already there. The company is verry Thrustworthy. I like the program, and always suprise me with the beautiful girls. Istripper brought me verry much joy in my life. The support is always friendly, ready to help, and solve every problem that you have. Top company! A recommendation to everyone."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "anonyme",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T17:54:22.000Z",
          "Titre": "hot & fun",
          "Contenu": "nice to see all these pretty angels,really erotic and sexy"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "iStripper User",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T11:59:09.000Z",
          "Titre": "Great software!",
          "Contenu": "Being a long term customer for some time now. Still enjoying the software so far. It makes my tedious self study routine more interesting. Appreciating what the iStripper has to offers. Thanks!!!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Cramix",
          "Nb_Reviews": 6,
          "Date": "2023-07-31T18:08:11.000Z",
          "Titre": "Why not…",
          "Contenu": "I like the diversity of the girls who come to do a streep-thease. Some dare more than others, would it be possible to indicate by a logo those who dare more in order to make the difference. It would help to make a choice more easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iamjjas",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:33:50.000Z",
          "Titre": "Excellent program to have on your phone and computer",
          "Contenu": "Excellent variety of women to choose from"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimosabe",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:20:37.000Z",
          "Titre": "You take PayPal again",
          "Contenu": "You take PayPal again.  The transaction went very smoothly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jason Price",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T02:58:53.000Z",
          "Titre": "Love Seeing these Beautiful Women Perform!!",
          "Contenu": "Ran out of credits, had to purchase more, was a fast, easy, quick purchase, no hassles ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "memorylane1980s",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T17:31:06.000Z",
          "Titre": "Nearly 10 Years on",
          "Contenu": "I joined Istripper Jan 2014 nearly 10 years ago and there has been many changes, for the best really although we dont seem to think so at the time!! lol..it has become a very slick piece of software. Adding new girls is very easy and you can use PayPal, they are downloaded very quickly to enjoy. There is also great support in the Forum where the Moderators help you out. You can use filters within the software to control the nudity so theres something for everyone..I love it and have no complaints at all.So from me its a massive thanks and Keep Rockin!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "PAUL VANDENBURG",
          "Nb_Reviews": 9,
          "Date": "2023-08-25T16:08:10.000Z",
          "Titre": "It was very easy to download the cards…",
          "Contenu": "It was very easy to download the cards you want, but it will be nice to make it more easier to highlight the cards at once then download them all at once."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "floridaeros",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T17:56:40.000Z",
          "Titre": "Quality (4k) and Variety",
          "Contenu": "The high quality (up to 4k) and variety of content is worth paying for.  Particularly evident is their own investment in keeping the site's content fresh and enticing for your users."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JesseJaneJacker",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T19:14:18.000Z",
          "Titre": "Foxy Momota!",
          "Contenu": "Bringing some of the best models out there to our desktops! I love that some of my favorite models have come back for more cards! I’m in love with Alissa Foxy & Emiri Momota!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Uncle Frankie",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T19:23:43.000Z",
          "Titre": "Quality Products with Great Service and Software",
          "Contenu": "You have always provided me with immediate gratification of downloads from your store.  Your software works seamlessly with my computer hardware and operating system.  I can always count on the quality of the videos you provide."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Spare",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T12:57:00.000Z",
          "Titre": "A very good and honest company",
          "Contenu": "A very good and honest company. I've been enjoying the sexy Veronica Leal show for a few days now and I'm satisfied. I will be coming back for more. I will add that a big plus is the ability to pay via PayPal. I highly recommend it to everyone."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 6,
          "Date": "2023-06-10T18:50:45.000Z",
          "Titre": "Good shows coming out",
          "Contenu": "Good shows coming out, shame that the games does not give a guaranteed chance of a Joker after playing enough of them. Not happy about the NFT angle but I don't shop there so your business is your business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vidavis",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T06:01:43.000Z",
          "Titre": "I love the shows",
          "Contenu": "I love the shows! They are amazing! I do wish there were more user loyalty rewards tho... and SEC's are a real pain and take way too much money to obtain... but other than that, I love the app for sure!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "member",
          "Nb_Reviews": 5,
          "Date": "2023-08-28T19:04:32.000Z",
          "Titre": "Classy and saucy at the same time",
          "Contenu": "Professional, well done, lots of choice and great variety of choice, there's something for almost everyone and there's largely enough for me."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Lamy",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T04:19:31.000Z",
          "Titre": "The purchase is high efficient and…",
          "Contenu": "The purchase is high efficient and smooth. The quality of girls is high and attractive. The download speed from server is a little bit slow. Overall experience is good!"
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "Zalloum",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:30:58.000Z",
          "Titre": "I think you very much for sent me this…",
          "Contenu": "I think you very much for sent me this letter,and i hope you best comany to sent me creadit 50 for i stay with all time .My profile Zalloum955"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Radrod",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T07:56:04.000Z",
          "Titre": "The Best Site on the Web !!",
          "Contenu": "The Best Site on the Web! Most Beautiful woman in the World!I'm a Member for Life"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buckydufrane",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T22:54:28.000Z",
          "Titre": "The ladies are great",
          "Contenu": "The ladies are great.  User friendly software.  Customer service diagnosed my problem right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Allen",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T20:01:12.000Z",
          "Titre": "Easy to purchase what you want",
          "Contenu": "The models here are gorgeous to say the least. Very easy to find just the right model you want to see. If you want to search by name, breast type (big or small), hair color, etc the choice is yours. Easy to purchase what you want. No pressure to buy things you don't want. Shows are also a decent length. Most shows are over 30 minutes. Also you can choose the level of eroticism from no nudity to full blown masturbation if you so desire. Last but not least some of the shows have sound especially the xxx ones. There is a way to cut off the sounds in the settings if you don't want to hear them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "member scewalls2 ( Luc grandmaison )",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T22:08:23.000Z",
          "Titre": "Bravo !!!",
          "Contenu": "The whole enterprise , is professional!There is VARIATY , and a CONSTANT ,production of new talents!!Congrats!Yours . . .   Luc"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tyco",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:35:50.000Z",
          "Titre": "Hot shows",
          "Contenu": "Allways had hot shows with hot women easy to use i wabt to purchase specal evwnt cards but cant that sux"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "djaddict",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T15:36:50.000Z",
          "Titre": "5 Stars!",
          "Contenu": "I’ve enjoyed this content for years, the fact that you continue to provide new cards, with beautiful girls is what I enjoy most!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "member",
          "Nb_Reviews": 6,
          "Date": "2023-07-01T17:16:21.000Z",
          "Titre": "It does exactly what it says on the…",
          "Contenu": "It does exactly what it says on the tin: beatiful women naked on your desktop providing a pleasant distraction from what ever the hell else is open on your desktop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kc got mojo",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T00:45:13.000Z",
          "Titre": "Solid software! Kudos!",
          "Contenu": "Solid software. Purchases always succeed without issue. Great customer service and support forum in the rare event there is an unresolvable problem with iStripper. Kudos!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:44:25.000Z",
          "Titre": "Love the models",
          "Contenu": "Love the models. In terms of quality/graphics, it’s perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T21:23:31.000Z",
          "Titre": "There are to many XXX but otherwise the…",
          "Contenu": "There are to many XXX but otherwise the site is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DadDrake",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T06:14:59.000Z",
          "Titre": "Good Stuff",
          "Contenu": "Other than a possible increase in the flash-sale's     percentage off, you're doing awesomely well.   Three thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hardonballs",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T17:38:04.000Z",
          "Titre": "i like hot naked beautiful girls so i…",
          "Contenu": "i like hot naked beautiful girls so i guess ur company is doing well to have so many girls to enjoy watching"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "bigpotter",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T09:40:24.000Z",
          "Titre": "Amazing service and a wonderful team to…",
          "Contenu": "Amazing service and a wonderful team to deal with if you need help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T21:24:49.000Z",
          "Titre": "And easy to understand in her face and hot girls. What can you ask for The interface is really easy to…",
          "Contenu": "The interface is really easy to understand. I really enjoyed all of the girls. I thought that most of them were outstanding."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "CoxxxBaron",
          "Nb_Reviews": 5,
          "Date": "2023-11-18T16:27:19.000Z",
          "Titre": "I own allmost 6000 cards",
          "Contenu": "I own allmost 6000 cards. I like the dancing models, but I wish they would do some JOIs :)."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Shao Kahn",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T18:14:04.000Z",
          "Titre": "The card are always made to be the…",
          "Contenu": "The card are always made to be the best.You get a card theme and get the right woman to be with the theme.You re doing excellent job."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "SCREVE PATRICK",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T12:31:16.000Z",
          "Titre": "Striptease easy at home",
          "Contenu": "Un bon moment de détente et afin de mieux choisir donner un degré d'évaluation hard ou fun."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T15:31:14.000Z",
          "Titre": "The purchase itself was fast and worked…",
          "Contenu": "The purchase itself was fast and worked first time.  I like the variety of girls but do enjoy xxx more than the others..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Triple Diamond customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T23:17:24.000Z",
          "Titre": "It is exactly what I want in a desktop…",
          "Contenu": "It is exactly what I want in a desktop dancer.  I have a huge collection which makes me spoilt for choice.  Thanks for keeping up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T23:28:20.000Z",
          "Titre": "I been using this service for years",
          "Contenu": "I been using this service for years.  I haven't been let down yet with the quality of the shows and they just keep getting better with time."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:32:47.000Z",
          "Titre": "Good support",
          "Contenu": "helpful and quick"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joseph Aimé Côté",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T11:01:37.000Z",
          "Titre": "I like to see her dancing",
          "Contenu": "This is new as virtual girl."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Creech",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T17:25:44.000Z",
          "Titre": "the variety of beautiful girls",
          "Contenu": "the variety of beautiful girls to see i would love to see you add  some bigger models to chose rom to"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Taylor",
          "Nb_Reviews": 4,
          "Date": "2023-09-21T15:32:47.000Z",
          "Titre": "I really do not know what to say",
          "Contenu": "I really do not know what to say. All I did was purchase more credits, and the transaction went smoothly. No problems equals 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rex Plant",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T00:32:10.000Z",
          "Titre": "Winner Was playing the slots and won a ton of…",
          "Contenu": "Was playing the slots and won a ton of credits, shows, and  gift cards. Was so excited for all of the bonuses I won!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Squidish",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T20:44:02.000Z",
          "Titre": "Years of use, I love it :D",
          "Contenu": "I've been using istripper since I was a teen, I'm in my mid 20s now and it's only gotten better! It's awesome!! :0"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T19:27:42.000Z",
          "Titre": "Lacking big name stars",
          "Contenu": "I like the girls don't get me wrong but I could do with more big name pornstars aswell"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AdmiralCross",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T17:30:48.000Z",
          "Titre": "Love all the girls wish they would have…",
          "Contenu": "Love all the girls wish they would have more performances with sound and without toys but still awesome."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T07:33:53.000Z",
          "Titre": "Excellent Experience~",
          "Contenu": "Hello, Dear iStripper Staff~ :-)So far I haven't had any issue with the site and the software itself. :-) This software is amazing, I LOVE IT !KEEP IT UP !Cheers~     -Han :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reed3",
          "Nb_Reviews": 15,
          "Date": "2023-07-27T19:25:25.000Z",
          "Titre": "What lovely ladies",
          "Contenu": "What lovely ladies. And, so willing to please. They make my days so much more productive. Cumming is not a chore, it's natural."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T08:10:51.000Z",
          "Titre": "Great Product",
          "Contenu": "This program is really nice, its exactly what you want it to be and works exactly how it should. It has an awesome setup and great variety, you wont be bored. :D"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anodos",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:52:15.000Z",
          "Titre": "ALL the girls are beautiful",
          "Contenu": "ALL the girls are beautiful. All the “outfits” are exquisite. I don’t care what people think xx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa McGuiggan",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:49:25.000Z",
          "Titre": "I love Istripper",
          "Contenu": "This is a wonderful application.Easy to use,beautiful girls. Extremely entertaining and fun. Very affordable."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Arturo Fernandez",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T16:43:30.000Z",
          "Titre": "I love the site content",
          "Contenu": "I love the site content. I like to see beautiful girls regularity. Ando i love the shows in My computer desktop.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Matthew M.",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T18:30:02.000Z",
          "Titre": "iStripper is just the best.   Like, seriously.",
          "Contenu": "iStripper is just the best.   It's been such a great idea from the very beginning.   What in the world is not to love I ask you..."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Alex G.",
          "Nb_Reviews": 4,
          "Date": "2023-07-28T14:11:35.000Z",
          "Titre": "Trustworthy",
          "Contenu": "TrustworthyGreat girls and shows. I never had any problems. They have a discord forum for any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ravenskull",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T22:13:38.000Z",
          "Titre": "Having the option to add my own sexy…",
          "Contenu": "Having the option to add my own sexy music compotes a great plus to watch the dancer interacting with the beats and rhythms of the music I get to add to the desktop application"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T19:28:01.000Z",
          "Titre": "The product and service are amazing"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:16:46.000Z",
          "Titre": "Good trustworthy app",
          "Contenu": "Good trustworthy app. Basically the stripper experience but virtual and on your desktop."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "KARSTEN ALEKSANDER SØNSTEBY",
          "Nb_Reviews": 5,
          "Date": "2023-07-13T10:19:40.000Z",
          "Titre": "Did great work on this program.",
          "Contenu": "Did great work on this program.Broad selection of cute girls hwo did pose on a greenscreen to fit your desktop in a smooth way"
        }
      ]
    }
  ]
}