{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.ucraft.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Ive Evi",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T17:34:31.000Z",
          "Titre": "WAISTING TIME",
          "Contenu": "Create a website just for them without any explanation block your account access with all the time you spend on, all the information you fill in, and create text so you can start all over.  BRAVO, your perfect site cost me just 2 days of my precious time. I am a photographer. I create a portfolio with glamour photos but VERY DECENT nothing to block my entire account without the possibility of copying my data from there or just changing two photos where nipple is visible!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:05:59.000Z",
          "Titre": "I need to sell using a third party link…",
          "Contenu": "I need to sell using a third party link and your site does not have that capability."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Sam",
          "Nb_Reviews": 7,
          "Date": "2022-11-01T00:27:54.000Z",
          "Titre": "they claim to send you an email before…",
          "Contenu": "they claim to send you an email before they delete your website, except they never did. the hardwork i've put into my portfolio website (that i had because i am an art STUDENT who does not yet garner a lot of traffic) gone all down the drain.this policy did not exist when i first signed up for their website, nor did they ever notify me a change to these policies.it is unfair that my website is now gone as i never got the chance to do ANYTHING about it.from the bottom of my heart ucraft is the absolute worst"
        },
        {
          "Note": 1,
          "Lieu": "AM",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-04-29T10:15:33.000Z",
          "Titre": "LAZY ones BAD SERVICE !!!!",
          "Contenu": "Hello, why you complicate the situation when removing the impediment could take until 5 mins???? as a client i am disappointed regarding this kind of stuff! I have to raise my risks and wait for their sleepy answers!!! no matter how much the client pays you, for each client his/her issue is a priority!!!! shame on you, if you think you are professionals in my country or in this world!!!  DISLIKE!This is not abt all the staff, cs there are professionals too, but I am sure, you can filter the LAZY ones: from founders to employees!!!!!Update your company VALUES and follow that VALUES!Be honest and Transparent wt your clients!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anna Bolger",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T22:47:57.000Z",
          "Titre": "go somewhere else",
          "Contenu": "if you use this website, just be aware that you will never get ahold of costumer service. i regret using Ucraft because of how many times i've reached out only to receive no help (even though it says they reply in 20 minutes-thats a joke) with any issue i've had. also, editing is difficult when you have to refresh the page every 2 seconds because the site can't keep up. you're better off using a name brand like squarespace."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "popsickletoes",
          "Nb_Reviews": 38,
          "Date": "2022-10-31T21:04:34.000Z",
          "Titre": "Extortion if this behaviour was for any other service",
          "Contenu": "So you set up a 'FREE' domain- link it to a website and you're OFF!Then you get an email saying 'yes we know it was free but we've deactivate your account now without your permission, but don't worry if you pay us now (and monthly FOREVER) we can recover it for you.'This disgusting behaviour would be called extortion if it was any other sector- the idiotic excuse then given, basically states that someone somewhere didn't think so many people would be interested in something that was free. The facepalm to that was interstellar.To be honest, incompetence like this would have had me leave anyway- I have gone to a competitor."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Vladimir",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T09:44:17.000Z",
          "Titre": "Disgusting service - and especially support.",
          "Contenu": "Disgusting service - and especially support. No one don't solve my problem with the site and I’m not satisfied with the quality of services. The problem is not displaying pictures in the store. I wrote in a support chat, sent a video screen recording and there is still no answer. I’m in Russia and exactly in this region the pictures don't appear in the store, and when I turn on the VPN - for example USA, everything works. Now I demand a refund for this service, but no one isn't answer."
        },
        {
          "Note": 1,
          "Lieu": "AM",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-05-18T10:08:20.000Z",
          "Titre": "VERY VERY PROBLEMATIC COMPANY!!!!",
          "Contenu": "Wen you are charged by unawares, after you request for money back! Even big companies can understand and organize a refund! But this is not abt UCRAFT, just wrote them within 6 hours after purchase, and guess what is the answer: it is NO, cs it is against their policy! I understand that could not cancel subscription on time, but happy customers is not abt u guys! You pay your support team to be polite but being polite is not abt BEST SERVICE, until ur customers are unhappy! Now I will do everything to move my shops from Ucraft to another not local provider ASAP!VERY VERY PROBLEMATIC COMPANY!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mackenzie",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T18:25:39.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "After building multiple sites from ucraft, I was highly disappointed with the customer service upon a need that I had.  They don't care about their customers nor about building long term relationships with customers.  They just want your money...would not recommend this company.  First, they don't have a phone number to talk to someone. Secondly, the person that I chatted with was indifferent to my need and concern instead she just wanted to be right at all cost and demonstrate her arrogance.   She wrote with a constant condensing attitude to belittle her customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T19:43:44.000Z",
          "Titre": "Bait and switch advertising",
          "Contenu": "Bait and switch advertising. During site building was told that I needed to upgrade to the next level in order to continue, and opened a pay screen. Would not let me proceed until I paid and upgraded. Now I am told I lost my 14 day free trial because I upgraded. Nowhere does, or did it say that while I was building the site. Ucraft refuses a refund. Deceptive practice and advertising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Devon Young",
          "Nb_Reviews": 1,
          "Date": "2020-04-20T23:32:48.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service. They use predatory practices and \"gotcha\" tactics to rip clients off. When I tried to contact support, they ignored my email. And when I followed up AGAIN, they were condescending and refused to offer a refund for a year of service I was not planning to use. Not worth getting caught up in this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Luca",
          "Nb_Reviews": 3,
          "Date": "2023-01-29T22:09:47.000Z",
          "Titre": "Free website deleted, no notification (as per other reviews)",
          "Contenu": "Yet another person to whom they deleted the website without notice (as they did in reply to other negative reviews, I'm sure they'll claim here too that they notify: they don't). 30 days of inactivity and your website, as a free user, is gone for good. No grace period, no backup, no notification (and claim they cannot prove they notified me as their email are deleted after a couple months... seriously, as a website hosting company how little space do they have for near-blank emails?!?!). I was also not notified of the domain being disconnected for free users. The staff helped me somewhat fix a couple of design bugs in the website, but that's worth nothing if it all goes out the window. They obviously have a big problem with their notification emails not going out and until they deny this they won't fix it. So, if you're a free user with a little website that may not generate much traffic, BACKUP BACKUP BACKUP (or just go elsewhere really...)."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Alexandre Barret",
          "Nb_Reviews": 3,
          "Date": "2021-06-02T07:12:59.000Z",
          "Titre": "Maintenance not communicated leading to downtime",
          "Contenu": "They do maintenance and upgrade, causing downtime without notifying you so you may send an email to your customer base... and your website is down unless you monitor manually. I asked many times to receive notifications.... but they don't care."
        },
        {
          "Note": 1,
          "Lieu": "SI",
          "Pseudo": "Andrey Khonyakin",
          "Nb_Reviews": 2,
          "Date": "2020-12-07T16:18:37.000Z",
          "Titre": "Maybe good for simple page but not applicable for e-commerce",
          "Contenu": "In fact, service is not good for e-commerce. Google PageSpeed Insights tool giving to simple and pretty much small web page 12 points for mobile and 29 points for desktop. Any SEO tactic will not improve ranking of page created on Ucraft. 4 days I cannot get reply to my request to cancel subscription and return my money back because reply from support means that they are not able to fix their bug. As a conclusion. Sooner I tested several pages created on different platforms: WooCommerce, Shopify and Squarespace. Ranking of pages in the same Google tool gave me from 70 to 95 for mobile and from 90 to 99 for desktop. It is better to invest more and do not have a headache with SEO. Unfortunately, I cannot reply but just put it here: you have deleted all my data without any notice. Well done :(. And after that you notify me about the fact of refund. Anyway, hope my case will be helpful for your new customers from any sense."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Kate",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T22:40:26.000Z",
          "Titre": "It is 5eu/month, not free!!!!",
          "Contenu": "It is free only at the beginning, and then they write you an email that you need to pay 5eu per month, or the website will be deleted!"
        },
        {
          "Note": 1,
          "Lieu": "AM",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-07-27T22:02:10.000Z",
          "Titre": "low speed of website",
          "Contenu": "low speed of website, would be perfect in react js, also no money refund if you do not need the subscription."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Don g",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T06:15:23.000Z",
          "Titre": "They will just take your money and tell…",
          "Contenu": "They will just take your money and tell you no refund even when I didn’t recall switching auto renew ON."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Fire Bird",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T16:39:01.000Z",
          "Titre": "This site…is lying...",
          "Contenu": "This site https:// www. ucraft.com/ #get-started said that ucraft was free, but in the signup option it only gave me 2 options and both of them you had to pay, waste of time."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lionel",
          "Nb_Reviews": 16,
          "Date": "2022-10-16T18:03:13.000Z",
          "Titre": "keep away",
          "Contenu": "another con website - nothing is FREE minimum price to download your logo is $7 ( will be reporting to the advertising standards authority ) sharp practice business keep away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2018-02-27T16:09:23.000Z",
          "Titre": "Very difficult to work with your…",
          "Contenu": "Very difficult to work with your system. Customer Support just blew me off. To make a subtle change you begin to charge me. I am not even sure if I like the template. Bad business.Wow, I just received a quick response & the person berated me typing \"We haven't even charged you!\" With an explanation point. Very rude. Take a class on \"Customer Service\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Talon",
          "Nb_Reviews": 3,
          "Date": "2018-07-12T01:51:23.000Z",
          "Titre": "Incredibly Frustrating. Just go through another site.",
          "Contenu": "This whole experience has been frustrating.  We bought a domain through them, but uh, we don't have access to it.  Our card has been charged and everything.  Don't bother trying to talk to customer support via the website, they're entirely unresponsive during normal business hours.  I still have an unanswered message from 8 hours ago+.  The website is a pain to customize for desktop and a pain to customize for mobile.  We are going to go through another site because honestly? This is a waste of time and a mess."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "SDavis",
          "Nb_Reviews": 2,
          "Date": "2018-07-02T23:11:35.000Z",
          "Titre": "Abysmal experience with Ucraft",
          "Contenu": "Seriously disappointed with this platform. I wasn’t able to utilise the landing pages partly due to a misunderstanding on my part, about how they worked with an existing domain. When I tried to resolve this with support, they didn’t take the time to understand what I was saying and kept on repeating the same sentences. Poor social skills on their part, and the head of their chat support, Lena, was very unprofessional in her last interaction with me.  I very rarely post negative reviews but the service I received  was just terrible!"
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-15T23:18:29.000Z",
          "Titre": "couldnt make a landing page with 2 pics without battling your templates",
          "Contenu": "interface was too slow, I was limited to using templates, I couldn't do some thing as simple as adding images to a blank site, there wasn't an option too add my html code or the button that said html wouldn't press. the free service was completely useless in the 15 painstaking minutes I was there before I deleted my account which makes it all the more interesting that I am still receiving emails...… I now feel as if I shall be haunted by an endless supply of SPAM from this site. You have a lovely looking interface though, I would definitely have suggested it to other people if I hadn't tried it myself first."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-04T01:19:56.000Z",
          "Titre": "Mind numbingly slow",
          "Contenu": "Very slow. Confusing which features are free and which are paid. And because the latency is so high it is hard to design a page. Frustrating even when trying to select a template."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-15T02:35:55.000Z",
          "Titre": "Worst.",
          "Contenu": "Worst..  Landging pages look like website there is no option of conversion too🤒🤒🤒Whene we do any action its ask for money Its so irritating"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-29T23:29:47.000Z",
          "Titre": "The web site builder is so horrible…",
          "Contenu": "The web site builder is so horrible that I wasted almost an entire day for something that could have been done in just about an hour. The support is also very bad"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T01:34:37.000Z",
          "Titre": "Waste of time",
          "Contenu": "A free website that does not allow you to add your own logo or Google Map location to the site without an upgrade. Why would any small business sign up with you?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Hajdu",
          "Nb_Reviews": 3,
          "Date": "2019-09-08T23:40:29.000Z",
          "Titre": "Go with square space",
          "Contenu": "Go with square space. This company is difficult to work with for tech support and billing.  They refuse to refund on something that I won’t use."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T04:35:37.000Z",
          "Titre": "Not user friendly at all!",
          "Contenu": "Not user friendly at all!Unlike Weebly and Wix which there is WYSIWYG editor in free version. I will not recommend this to my friends!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-02-20T07:36:33.000Z",
          "Titre": "Every important thing is paid",
          "Contenu": "Every important thing is paid.  By the time I learnt making website on ucraft,  I could edit the html codes of templates much quicker"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-02-08T22:02:38.000Z",
          "Titre": "Don't even think about it",
          "Contenu": "You can't do anything with it without paying, but they claim that everything is free. And the design options suck."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ilya",
          "Nb_Reviews": 5,
          "Date": "2018-08-10T22:02:54.000Z",
          "Titre": "You have to purchase to make any edits",
          "Contenu": "You have to purchase to make any edits. No point to even try the product if you are not willing to spend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zack Zagranis",
          "Nb_Reviews": 1,
          "Date": "2018-09-18T22:04:22.000Z",
          "Titre": "Very User-unfriendly",
          "Contenu": "So far I've found the platform to be very user unfriendly despite the almost useless tutorial video."
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-13T00:12:33.000Z",
          "Titre": "Very few editing options",
          "Contenu": "Very few editing options. Users need to update their plan for simple editing and basic options."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disgusted customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T16:15:31.000Z",
          "Titre": "Terrible website builder!",
          "Contenu": "Terrible website builder! The free templates are EXTREMELY limited: you can only change the text and the images, nothing else. Any other changes, you must upgrade to a paid plan. I then decided to sign up for the free 14-day trial, thinking that if I liked it I would opt for a paid plan, but still ran into issues: the interface is not very intuitive, despite I've built many drag-and-drop websites both personally and professionally (Weebly, Wix, Squarespace), and the controls are very limited. For instance, you cannot change the placement of the site title in the page header: it's either top of page, centered, or bottom of page. I had an image with mountains and needed to slightly adjust the placement but couldn't. Also, I wanted to use a video header, and the interface asked for a \"mobile image\" (since video headers don't work on mobile). Ok, so I uploaded one...and the still image is what came up first on my DESKTOP site, THEN switched to the video header. NOT the effect I wanted! There was no control anywhere to fix this.Overall, I wasted an entire six hours or more trying to get this site to work, until I finally gave up and went back to Wix. At least Wix has plenty of user controls that work properly and an interface that lets you accomplish what you need to do. Never again, Ucraft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TD",
          "Nb_Reviews": 9,
          "Date": "2018-04-26T12:57:27.000Z",
          "Titre": "If you are going to offer something for…",
          "Contenu": "If you are going to offer something for free, actually offer it for free. b.s."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2018-08-11T22:41:59.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Not user friendly.  Not good options.  Too limited."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T00:12:18.000Z",
          "Titre": "Double billed"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T22:42:38.000Z",
          "Titre": "Please do not spam me to review your…",
          "Contenu": "Please do not spam me to review your product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wes Williams",
          "Nb_Reviews": 1,
          "Date": "2018-08-23T22:12:26.000Z",
          "Titre": "Very hard to use",
          "Contenu": "Very hard to use.  I found another service"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T02:13:46.000Z",
          "Titre": "Don't worth a $"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "VGP",
          "Nb_Reviews": 1,
          "Date": "2018-07-10T01:00:08.000Z",
          "Titre": "Not good",
          "Contenu": "Not good. Too costly for logos."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-17T03:21:43.000Z",
          "Titre": "unacceptable experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Igor Korolenko",
          "Nb_Reviews": 4,
          "Date": "2018-08-26T22:04:35.000Z",
          "Titre": "It is full of bugs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-16T02:14:55.000Z",
          "Titre": "Unsolicited emails"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T01:38:51.000Z",
          "Titre": "Very very very glitchy",
          "Contenu": "Very very very glitchy. I had a paid ecommerce store there for over a year, but the constant hang up include a permanent feedback tab placed along the scroll bar and their chat box expands with no means to retract it so you cannot access your site. They could not fix the problem on their end which made the service inaccessible and useless. If they care to fix issues like these, I would consider going back."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jean-Michel Lambert",
          "Nb_Reviews": 2,
          "Date": "2020-07-21T18:48:07.000Z",
          "Titre": "Customer service is a friendly team but…",
          "Contenu": "Customer service is a friendly team but there are a lot of glitches on this platform.You pay for a plan that includes 'Advanced Elements' and 'Multi-language' pages but then it's not working properly. You can't modify the Font anymore and the multi-language option messes up your pages so that your english page has multiple languages on it.You raise the problem and then it takes days. After a few days, you ask for a status, 'How's it going with the technical support?', they send an email and you wait for days just for a status. Is this going to take a few minutes or days? When will this be fixed? You don't know and you're stuck waiting.In the end, you skip the features you paid for, don't wait for the tech support and just find a way around it, which makes you work twice as hard.Why? Because you wanted the advanced elements, read their posts on it and followed the steps as mentionned, but........ there was a glitch. And their tech support can't keep up so the advanced features are useless.Basically, if you can fend on your own, you'll be ok. Be ready to start things over just to work around their glitches. You'll manage if stuck ucraft but it is not a refreshing and satisfying experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luke Renner",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T22:30:58.000Z",
          "Titre": "Ucraft Websites Are Beautiful and Extremely Slow.",
          "Contenu": "Summary: As each of my Ucraft sites expanded from 5 pages to 20+, I realize that I should have chosen a platform, like Duda, that prioritizes page speed.________________________________________________I went on a Ucraft bender for a while, building out beautifully designed web pages for my clients, including:• garygermer.com• manceps.com• solomon.org• bonniebostrom.com• try.easy2hike.com* meritbadgemarketing.comWhy I'm Happy:1. Customer service is hyper-fast and available via chat on every web page.2. Templates are very well designed and with a little ingenuity, you can do most things without much effort.3. Icons are a breeze and their built-in app means you can choose icons right on the page, without having to find them on a different website and upload them manually.4. SEO is a breeze, allowing you to configure Title, Description, and Social Media Share Images with ease.5. Domain mapping and SSL is also effortless.6. Buttons are easy to customize.Why I'm Not Happy:1. My greatest complaint is that my websites are dreadfully slow. On google page insights (with tracking tags installed), my sites typically come in at less than 20/100 — waaayy slower than Wix or Duda.This, alone, is a major dealbreaker for me and as I build out more and more pages on each of the ucraft sites I manage, I *really* regret choosing this platform.I have been in multiple conversations with the Ucraft folks about specific suggestions they can roll-out to improve the site speeds of their templates but they don't seem to be making page speed a priority.2. As my sites have become more complex, the web design app has become increasingly unstable. It is a rare day that I can get through a design session without getting an \"internal server error\" and have to reload the page. Sometimes the design window is so buggy, it takes minutes to drag one thing to another part of the page.3. The blogging app is dramatically bad. You can embed youtube videos but not other types of content like Twitter posts. Also, there is no rss feed associated with your blog, which makes it difficult for your followers to subscribe to your content (and/or for you to automatically aggregate posts to your other channels).4. No ability to customize CSS Or HTML for those with more advanced web design abilities.5. Ucraft provides free in-app access to creative commons photos. However, the photos go into your site at full-resolution, which means they bloat your webpages and you shouldn't really use them."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sir DrinkTeaALot",
          "Nb_Reviews": 9,
          "Date": "2020-07-03T16:54:28.000Z",
          "Titre": "A few hiccups - Gradually getting there",
          "Contenu": "I have used Ucraft to build a website for a family member's business, not exclusively for myself. I am experienced in building websites, having used many other builders (such as Wix, Squarespace, Weebly and so on).---+ PROS1) Creating a website on Ucraft is easy and very straight-forward. 2) You do not need any experience in building websites in order to produce a professional website.3) Overall, Ucraft is able to produce modern and professional-looking websites, more so than a couple of other website builders which spring to mind.4) Quick on-site customer support. A message on the website states you'll get a reply to support requests in 5 minutes, but I was waiting closer to over 20 minutes. Still can't really complain as most businesses take 2-3 working days usually.(Previously I Googled a contact method to get in touch with support and was redirected to an email address for Ucraft by the search engine. Don't do this - You need to use the on-site support feature, not any support email addresses you find via search engines).- Note that I am currently communicating with support regarding an issue which is mentioned in \"cons\" below. The review regarding support may be updated depending on how it goes ---------- CONS1)  The images on the website all randomly broke within a week of the site being published. Which meant they all painstakingly had to be replaced. This has never happened on any other website builders I have used.2)  Ucraft has recently changed the website's address from a .net domain to a .site domain as part of a recent upgrade to the service.* This change was timed extremely poorly. It was made during a period of lockdown due to the COVID-19 pandemic when the business was not operating. * All of the company paperwork, stationery, vehicle skins and so on may now have to be changed to reflect the change made to the website's address by Ucraft, which will cost quite a fair bit of money.* This change has also caused an ongoing drop in potential customers due to them not being able to find the company through its original .net web address.3) Though most of my queries were responded to regarding the above issue, support did completely ignore the fact that the (poorly-timed) above change to the website made by Ucraft is having a negative financial impact on the business and offered no apology nor rectification for this.--------CONCLUSION (so far)A website builder which is easy to use and appeals to both experienced as well as inexperienced website designers. Websites look very professional and modern.Very quick support response time - minutes instead of days (Wix's support team could learn a lot from this). However, so far, no apology or compassion (so far - support is still ongoing at the time of writing this) has been given regarding the fact that a poorly-timed Ucraft change has negatively impacted a small business.(This review and the star rating may change to reflect the conclusion of my ongoing discussions with support)."
        },
        {
          "Note": 2,
          "Lieu": "LV",
          "Pseudo": "alexey",
          "Nb_Reviews": 1,
          "Date": "2018-05-11T09:43:58.000Z",
          "Titre": "Not satisfied",
          "Contenu": "Not very convenient and not user friendly. Lost connection with server few times. There are much simpler constructors out there...Designer Tools are for free, but there is not much you can change in a chosen layout with a free plan. Would be reasonable to ask for a plan upgrade when user wants to publish a webpage. Why accept a premium plan if I am not sure that result would be worth it?"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-03-17T01:59:38.000Z",
          "Titre": "not very good experience..",
          "Contenu": "not very good experience..accepted a 14 day free trial to upgrade, didnt like what they offered so didnt accept it at end of 14 days..Ucraft then told me that to continue to use their site i had to effectively upgrade because i had accepted the trial offer..almost like extortion..in the end went to WIX, much better functionality and its FREE.."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 4,
          "Date": "2018-08-02T08:57:07.000Z",
          "Titre": "Could be better",
          "Contenu": "Decent but honestly could be much better, the FREE landing page however is another story, you are so limited to what you can do with it, limited to templates, UI is slow. AND i feel like im being spammed by this company after signing up with UCraft"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2018-04-09T22:42:07.000Z",
          "Titre": "Pretty disappointed",
          "Contenu": "To be honest, I'm disappointed. I understand that to offer a service for free is a big step, but if you advertise free landing pages, you should offer free landing pages. Not \"choose from our pre-made templates which you can't edit unless you upgrade\".On the positive side, the editor interface seems quite good. In the end, I made my landing page using Wix, and ultimately upgraded to go-ad free. I know that might seem hypocritical but they give full editing functionality on their free plan so you can at least preview the site/page before you make the jump to upgrade for an ad-free experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lukerenner.co",
          "Nb_Reviews": 1,
          "Date": "2018-03-19T23:01:06.000Z",
          "Titre": "Free — and slow.",
          "Contenu": "UCraft is the only website creator I've found that allows you to map a landing page to your site for free. Good for getting set up right away. However, the platform is soooooo slow that I would never be able to use it as an alternative to Wix."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-18T07:48:10.000Z",
          "Titre": "To give someone \"Free\" landing page to…",
          "Contenu": "To give someone \"Free\" landing page to create and when he sign up he understand that he can basically change nothing its a hoax.I'm owner of more than 20 (paid) websites. This is not the way of making business. Good luck anyway."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-09T06:53:39.000Z",
          "Titre": "Fantastic program",
          "Contenu": "Fantastic program, but after finishing our website we discovered it is not accessible via Internet Explorer.  I understand it is an old browser, but still quite some people using it..."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-09-27T10:46:25.000Z",
          "Titre": "The platform is great but service is…",
          "Contenu": "The platform is great but service is extremely poor. Emails and messages are never returned, which is a shame for such a good product."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-09-07T06:49:04.000Z",
          "Titre": "Stupid limits",
          "Contenu": "Can't add elements to due some limit. Really?I deleted have of the template and still can't add an image. That's stupid"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-29T00:39:39.000Z",
          "Titre": "Slow and very bad webflow",
          "Contenu": "Slow and very bad webflow. Bad user navigation. Confusing fee when ucraft charges designer tool separately."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "jas. O",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T22:29:47.000Z",
          "Titre": "really slow loading so i didn't end up…",
          "Contenu": "really slow loading so i didn't end up using it. the styles, fonts etc are outdated"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T15:34:16.000Z",
          "Titre": "Received another payment update even…",
          "Contenu": "Received another payment update even after canceling the subscription"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "fawk que",
          "Nb_Reviews": 5,
          "Date": "2018-06-17T05:23:55.000Z",
          "Titre": "not user friendly",
          "Contenu": "incredibly complicated to make anything on this website"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-13T22:12:59.000Z",
          "Titre": "Template changes are too difficult"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Archie Jackson",
          "Nb_Reviews": 1,
          "Date": "2018-08-09T16:16:59.000Z",
          "Titre": "Site not compatibile with IE 11"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-17T16:19:40.000Z",
          "Titre": "Meh.",
          "Contenu": "Meh. Not impressed."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Mama",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:36:00.000Z",
          "Titre": "Not helpful enough",
          "Contenu": "Not helpful enough, not really giving a viable option for a matter where I specifically described my request, regarding showcasing a product configurator, with a mandatory upload feature (which by the way it is an option in the dev tab), which simply won't work. I've been referred to use a form type instead of the product configuration from Ucrafts eshop"
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T09:27:15.000Z",
          "Titre": "Very lagging when add or edit products",
          "Contenu": "Very lagging when add or edit products. Wasting too much time.Reply (May 11, 2022)Do you have an email address? It will be easier for me to record a video to show you directly which part is lagging."
        },
        {
          "Note": 3,
          "Lieu": "AM",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-01-22T18:43:44.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, guys just change into react.js everything, it is very very hard to change anything on Ucraft. For example, check wix"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Site Reviewer",
          "Nb_Reviews": 1,
          "Date": "2018-03-11T10:49:16.000Z",
          "Titre": "Don't be deceived by Ucraft's claim of…",
          "Contenu": "Don't be deceived by Ucraft's claim of free web hosting. You can't host a small site there let alone a large one. They only offer a single landing page  for free. You build that page with the Ucraft site builder, but the page has very limited options. You can't add even one video, change the content blocks, etc. You can connect your own domain name but only by using a cname record.  SSL is not available via Ucraft, but you can use Cloud Flare."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-06T14:18:03.000Z",
          "Titre": "Too much of the wrong stuff.",
          "Contenu": "I was interested in building a landing page, something simple and straight to the point. The templates are too bulky, I ended up having to hide a bunch of blocks. It got confusing and ridiculous. I'm going the code route, it is harder but I'll get something clean and that I can host on my existing website host site with Volusion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-02-11T00:54:52.000Z",
          "Titre": "The website wouldn’t respond and it …",
          "Contenu": "The website wouldn’t respond and it kept giving me an error when I was trying to create a domain name and it resulting in me creating 4-5 different domain names. Kept saying the page isn’t responding. This was a bad irritating experience for me."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-08T13:47:27.000Z",
          "Titre": "I would've given ucraft 5 stars",
          "Contenu": "I would've given ucraft 5 stars however, their customer service department isn't that great. Their templates are gorgeous but if you need help with anything.....good luck! They also didn't honour my referral discount (?)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-30T00:09:01.000Z",
          "Titre": "Free logo maker is different from the…",
          "Contenu": "Free logo maker is different from the logo maker in the website tool - therefore the logos are not compatible/consistent, which makes for some pretty ugly attempts at branding. Overall though, its all fairly user-friendly"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-08T09:31:39.000Z",
          "Titre": "Good but room for improvements",
          "Contenu": "The good thing is that they offer a single page for free which we could also connect to our own domain without added cost. But the bad thing is we can’t really change the layout or add things without upgrading."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-30T23:50:27.000Z",
          "Titre": "I understand it's free",
          "Contenu": "I understand it's free, but the lack of customization is an absolute joke. I want a very simple landing page, with a logo and couple buttons to redirect to outside links, and I can't even do this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-16T05:26:29.000Z",
          "Titre": "A template-based WYSIWYG website builder that is incompletely functional.",
          "Contenu": "Does not behave same on every major browsers, including Firefox and Chrome and Opera and IE and Edge, and a different set of tools/functions become non-functional or dysfunctional on different browsers."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Malcolm Ross Hudson",
          "Nb_Reviews": 1,
          "Date": "2019-12-08T02:50:09.000Z",
          "Titre": "Very beautiful templates but,,,.",
          "Contenu": "Very beautiful templates to choose from. However, customer support needs improvement. Staff tend to give ‘canned answers’ to questions. It does not resolve the issue."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2018-01-26T02:19:51.000Z",
          "Titre": "Better the devil you know",
          "Contenu": "Building my second website when my review is average? In my case it's better the devil you know.  Things are not clear nor that easy with UCRAFT, and really their help is tokenistic at best, but I have spent SO much time and energy on navigating my way around that I cant's make myself start all over again with someone else. My major issue is things not doing what they say they will, or freezing up and doing nothing t all. If you stick to the templates which ALL have way too much emphasis on Image and not much on substance ( ie a food site is different to a travel style blog site because of the layout not because of the pictures!  So give us variety in layouts! ) Initailly when I had problems and would ask for help via their chat box, all you get is someone telling you to refer to a list of \"how to\" videos, all a bit robotic. Oh Steve Jobs where are you? Please beam me up to the land of higher standards!!! But I continue on because I shall CONQUER, and I have faith - once I delete all the excess and keep it simple, I will have something honest and reflective of my business. With no help from Ucraft I must add."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Customer Anon",
          "Nb_Reviews": 2,
          "Date": "2018-01-31T22:36:44.000Z",
          "Titre": "Good, but then not so good too.....",
          "Contenu": "The biggest gripe is when you go to my sites and put your website in Edit mode, the page starts to load all aspects, and 90% time gets stuck on starting to build, keeps cycling through and nothing. I have wasted MANY hours just trying to get into my website to edit it, and often given up. Also, I can't apparently have an active site if only just 'working on it'. If I pay for a service, I should be able to build 10% of a site, and finish it at my own time. I have considered switching to SquareSpace, I have trialled their product and it's flawless, beautifully designed pages relevant to industry types, and no loading issues! The plus with uCraft is the Dashboard, it's really easy to navigate & use. The positive is the drag & drop functions, however no space is left between blocks & elements when designing a webpage, meaning often I've had to battle to reposition by blocks/elements as they land in strange places when trying to move them, or they refuse to move to the area I want them to go, at times messing up a layout higher up on a web page.... I've been a bit frustrated with the whole experience.I hope this feedback can be taken positively however as I think the uCraft product has great potential, but more tech work needed to get things working 'smoothly'."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephanie Christie",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T19:48:04.000Z",
          "Titre": "Just looking for more features",
          "Contenu": "Just looking for more features.  The design is excellent though.  Very well done."
        },
        {
          "Note": 3,
          "Lieu": "MN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T04:02:44.000Z",
          "Titre": "SEO is not working",
          "Contenu": "SEO is not working! Google analytics either! Or please make clear tutorial."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zach Flannery",
          "Nb_Reviews": 1,
          "Date": "2018-06-03T17:49:34.000Z",
          "Titre": "It's I cool logo maker but I don't like…",
          "Contenu": "It's a cool logo maker but I don't like the web builder"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-04T05:27:54.000Z",
          "Titre": "Good",
          "Contenu": "The editor is very intuitive but the design options are poor."
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-28T15:52:38.000Z",
          "Titre": "Arabic language",
          "Contenu": "Unfortunately, it does not support Arabic !!"
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Tahj Haase",
          "Nb_Reviews": 1,
          "Date": "2018-08-30T06:49:36.000Z",
          "Titre": "It is a good website"
        },
        {
          "Note": 4,
          "Lieu": "AM",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T12:36:06.000Z",
          "Titre": "Great product!",
          "Contenu": "Overall this is a very nice product, with big value. Crafting the website process was a bit stressful, not everything is intuitive I would like a bit more freedom in the building process. And I will need to contact the support team, for help with payment method setup."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "San",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T14:18:43.000Z",
          "Titre": "Prompt, Professional, and Accuracate information when you need it!",
          "Contenu": "Bedros assisted me in solving a couple of problems I was having with my newly-created website on Ucraft. Unfortunately, while he was unable to deliver EVERYTHING that I needed, he was very helpful in what he was able to offer which got me on the right track. Ucraft definitely needs to hang on to him as an employee because Bedros knows his stuff!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Son of Mars",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T02:18:20.000Z",
          "Titre": "Great service, easy to use",
          "Contenu": "Great service, great website builder. A bit trickier than some other CMS services out there, but once you get it going, you'll be just fine and happy about really great support.I'm currently using it as a landing page only, but I'm definitely interested in their paid services as well down the road.If they'd remove the branding badge on the landing page for $1 a month, I'd give it 5 stars ;-)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "bruce lee",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T21:39:41.000Z",
          "Titre": "Overall a nice experience",
          "Contenu": "Overall a nice experience and a bit challenging but not so much for someone who wants to learn. Costumer service is excellent tho I have to say. Would want to see more customization options for free plan but overall l like it. I would like to see more effects options, social media integration, contact forms. Basics of a website mostly."
        },
        {
          "Note": 4,
          "Lieu": "GU",
          "Pseudo": "Mike & Katrina Sena",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T00:21:20.000Z",
          "Titre": "Free version and Template Pro feature issue",
          "Contenu": "There can be some issues with using templates with the free version that you are not informed of in advance of creating your site.  This can be a problem if you invest time & effort into a design but then have to get their tech support to assist with making revisions.  For example, templates include Pro features that if used block your ability to make some edits.  There is no advance warning that this will be the case.  That having been said once I contacted tech support via the chat, all the staff that helped in diagnosing & fixing the issue were very helpful.  We were able to make the revisions without having to delete the website and start over. :-D"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T14:48:03.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "The customer service is excellent. The website can do most things you want from it. And once you spend a little bit of time trying to understand how this drag and drop works (it's not that obvious) - Ucraft does most everything for you.What I think they should change is to make drag and drop more accessible - more like it is done in Canva. Where you have no limitations of how to get objects to be aligned with each other well - without spending too much time trying to figure that out.Their customer service is definitely making up for the shortcomings of the app itself :)I generally recommend. Much better than some of the competitors that I've tested."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tea",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T00:27:40.000Z",
          "Titre": "Their free website building is OK",
          "Contenu": "Their free website building is OK, their support team is spot on though! Navigating UCRAFT has been a real pain, but any troubles I have, they are more than willing to help out. It's a great website to build and add your custom domain name if you have little money. I started with free and hooked up my domain name, but then chose to pay 3$ to take off the terrible UCRAFT watermark.There ARE other sites that are better sure, but this one is the only one (that I know of) that will let you hook up your domain name for free. I think the only thing that is really frustrating is they charge you to have the button that lets you make your site live or not. Every other site building tool allows this even on free versions. It's very strange that something very essential is only on paid versions."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Hiếu Chung Bùi",
          "Nb_Reviews": 1,
          "Date": "2020-03-14T06:08:54.000Z",
          "Titre": "You should mix up V1 and V2 version together",
          "Contenu": "I'm satisfied about Ucraft. It's just one thing that not work correctly. Why are you trying to make new V2 version instead of improve V1 version. My website can't work correcty with the new version."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crossbuckle Homestead",
          "Nb_Reviews": 5,
          "Date": "2020-09-18T15:41:57.000Z",
          "Titre": "I finally have successfully created a website!",
          "Contenu": "I have had the most difficult time setting up a website until I signed up for Ucraft.  I took full advantage of their 2 week trial period before deciding to pay for the basic program.  I will likely upgrade to the pro shop in short order.  The customer service has been very responsive and able to help.  Some of the ways things work are not complete intuitive to me, but once I know the work around, I am generally able to accomplish what I set out to do.  I will say that their blog platform is pretty terrible.  All their handy page elements and customization goes out the window once you want to format a blog post.  All you are able to do is but a photo above and below a paragraph.  No image editing, no caption capability, no creative layout options.  I have suggested that they make some changes to this portion of their website creator, especially since a blog is an integral portion of any company's web presence and can help sell product (or chase people away).  The blog issue is truly something I hope they improve but the rest of the design process has been fairly pain-free.  I have been able to create a professional looking website with very minimal skills."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Laszlo",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T07:40:26.000Z",
          "Titre": "The tool is nice and featureful",
          "Contenu": "The tool is nice and featureful, support is available, billing part is buggy though (it allowed for some double booking and shut down my site by mistake)."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Lars",
          "Nb_Reviews": 5,
          "Date": "2021-05-04T20:12:10.000Z",
          "Titre": "This is THE ONLY service where I got online real-time 24/7 service.",
          "Contenu": "This is THE ONLY service where I got online real-time 24/7 service. This means I can work 24 hours an get help whenever I have an issue or a question. I LOVE it!"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Ayomide Adeyemi",
          "Nb_Reviews": 1,
          "Date": "2020-03-16T11:04:08.000Z",
          "Titre": "Very useful tools on the free plan",
          "Contenu": "Very useful tools on the free plan! The customer service is also very good. They look into what your needs are and try to see what they can do to suit your needs!The paid plans definitely offer more!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Cheyne Girdler",
          "Nb_Reviews": 1,
          "Date": "2020-11-07T09:04:37.000Z",
          "Titre": "awesome customer service",
          "Contenu": "awesome customer service. the ucraft team are very helpful"
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Shaikha",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T10:09:00.000Z",
          "Titre": "Respond delay",
          "Contenu": "Good service but you are taking alot of time to respond."
        },
        {
          "Note": 4,
          "Lieu": "AM",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T06:55:51.000Z",
          "Titre": "ecommerce part has limited…",
          "Contenu": "ecommerce part has limited functionality even in pro shop. it's definitely needs improvements."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Carla Janse Van Rensburg",
          "Nb_Reviews": 2,
          "Date": "2022-01-30T12:09:44.000Z",
          "Titre": "I have been mostly very impressed with…",
          "Contenu": "I have been mostly very impressed with this service. I do love my website."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "D Aston",
          "Nb_Reviews": 3,
          "Date": "2021-06-24T22:12:21.000Z",
          "Titre": "Great website builder the support is…",
          "Contenu": "Great website builder the support is good 👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-11-27T19:38:00.000Z",
          "Titre": "Once you learn how to navigate through…",
          "Contenu": "Once you learn how to navigate through the site it is fairly easy."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "antonis rountas",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T10:39:21.000Z",
          "Titre": "you are for 5 star but the price is…",
          "Contenu": "you are for 5 star but the price is expensive yet ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T20:03:08.000Z",
          "Titre": "Quick, Simple w/ Modern Templates",
          "Contenu": "Quick, Simple w/ Modern Templates - Overall a great value and a great way to spin up a simple landing page or site without any extraneous bells and whistles. There are some quirks with the editor that make it just as frustrating as any WYSIWYG - but if you can find a way to use the templates with little customization beyond copy/colors then this is a fast way to spin up a site.."
        },
        {
          "Note": 4,
          "Lieu": "OM",
          "Pseudo": "Vee",
          "Nb_Reviews": 1,
          "Date": "2018-07-04T15:20:52.000Z",
          "Titre": "The free landing page could offer a bit more freedom.",
          "Contenu": "I genuinely appreciate having a free landing page. That gets 4 stars. What loses 1 stars is that I find some of the restrictions too silly. I understand prohibiting the addition of new elements or new blocks to the existing free template, but it should allow flexibility with the existing elements. At the very least moving around text boxes or increasing/decreasing space between the existing elements."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "andrew roberts",
          "Nb_Reviews": 1,
          "Date": "2018-06-04T14:41:36.000Z",
          "Titre": "Love this tool",
          "Contenu": "Love this tool. Most beneficial feature is that it allows me to download a transparent background for my logos, free. Finding an online tool which does this was actually proving very difficult! Only reason i gave 4 rather than 5 stars is because i couldnt see a way to upload my own graphics to incorporate into my logo. I could be wrong on that, but im pretty sure that is the case. Otherwise, great product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-11-04T12:10:03.000Z",
          "Titre": "Bad experience- I’m sure it’s not always like that, just a bad time.",
          "Contenu": "Several times told me “time out” on the software. At one point, I thought I had lost what I was working on, but it eventually came back.Edit:  Regarding your response. Thank you for not blaming the problem on my end. I’m a hardcore server/Linux admin and IT Consultant. I know my way around. Takes a real person to be transparent. Noted if I ever need to refer a client/customer to a WYSIWYG web designer. Added 2 stars for customer service!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andre M",
          "Nb_Reviews": 6,
          "Date": "2018-05-20T09:24:42.000Z",
          "Titre": "So far, so good.",
          "Contenu": "Am enjoying the process - and the online customer service are very quick / helpful when there are issues with the website - particularly Ines.It's taken me a little while to get my head around the design process - but I think it's very user friendly and seems designed in an intuitive way in particular the layout templates."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shivaji rao",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T14:18:41.000Z",
          "Titre": "As a starter",
          "Contenu": "As a starter,  little knowledge about free website building. at time time i struggling they came forward instantly to assist me building the website may be i haven't started. they will help me to build and hopefully i will  start with a new domain  from Ucraft and and publish my own website shortly.thank you ucraft"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashbaker",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T03:47:13.000Z",
          "Titre": "Pretty Great!",
          "Contenu": "What you are able to do for free is pretty great. Of course it would be nicer to at least be able to remove individual pieces of blocks or move things around. Or to add a thing or two. However I understand why that isn’t a feature for free. Also I don’t like how a lot of the templates cover the entire screen because it makes it so people don’t know they can scroll down. But like I said what you can do for free is good! I mean you can connect your own salmon for free! And if you pay a little each month you can do a lot more with the design of your website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick McDonald",
          "Nb_Reviews": 1,
          "Date": "2018-05-08T23:38:20.000Z",
          "Titre": "I am new to UCraft and I found their…",
          "Contenu": "I am new to UCraft and I found their support system to be excellent. However because I am new to this site I find the editing of their templates annoying and troublesome. If their editing of templates was easier to understand and use I would have given them a 5 Star rating."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "The UP22 Rider",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T12:53:36.000Z",
          "Titre": "You guys just need to add some more…",
          "Contenu": "You guys just need to add some more #Shapes for needed ones, I have just encountered that there were only four shapes and I have managed my work only taking two of them though I needed more. Overall, A better experience with your plateform. Keep Updating!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Silver",
          "Nb_Reviews": 4,
          "Date": "2020-01-04T16:12:23.000Z",
          "Titre": "Great builder, elements....but no email service!",
          "Contenu": "Ucraft has one of the best user-friendly website building platforms with great elements, ease-of-use, look and site loading time. They also offer good packages for eCommerce. However, I will reserve the fifth star for a time when they include email services. Right now they say they don't offer that. So your company has to remain stuck to Gmail, Yahoo or something of the sorts other than @yourcompany.PS. Thanks Ucraft, I like your quick response. Now that you are working on GSuite, why not include Zoho which you always refer us to integrate. GSuite charges a minimum of $6/mo compared to Zoho at Euro 1/mo. and many more comparative features."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Mathijs Hermans",
          "Nb_Reviews": 2,
          "Date": "2020-03-10T15:05:16.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, great results. Sometimes things don't go completely as I imagined or I can't find exactly what I need, but overall this is no reason to complain, since most things go without a problem and how I want."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "dala prima",
          "Nb_Reviews": 1,
          "Date": "2018-08-07T11:36:30.000Z",
          "Titre": "Really great",
          "Contenu": "Really great. Easy to use - myself not being proficient user. If I needed a full website would definitely upgrade to use their service. For now.. all I need is a basic landing page.. and it ticks all the boxes. Cheers."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rian, RC Bookkeeping",
          "Nb_Reviews": 2,
          "Date": "2018-07-27T09:42:47.000Z",
          "Titre": "This is a great way to create a FREE…",
          "Contenu": "This is a great way to create a FREE logo for your startup.  You can download a .png file free plus there is a vector file that can be purchased at a very reasonable rate. Highly recommended!  Rian"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ailis",
          "Nb_Reviews": 2,
          "Date": "2018-07-23T06:38:21.000Z",
          "Titre": "I like free things",
          "Contenu": "Considering it is free it is pretty user friendly and has a nice result - although think the template should have more important information to the top e.g. event information before gallery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grace Swee",
          "Nb_Reviews": 2,
          "Date": "2018-11-22T21:03:37.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. They were very quick to give me a response and answer my queries. I think their free landing page is also a great feature to have when you are just starting out."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lauren @ Teller Of Tales",
          "Nb_Reviews": 1,
          "Date": "2018-09-20T23:13:26.000Z",
          "Titre": "Happy To Recommend!",
          "Contenu": "I really enjoy the look of these templates, which is why I signed up for the trial. I needed my website to look high end but for low cost! I've tried WIX, weebly, shopify, squarespace, you name it! I am very happy with the outcome. There are a couple of things that annoyed me a little bit and that is the rigidity of the templates, I simply wanted to move a few text boxes and this was not possible. Also, the platform freezes, a lot! I'll be working on something and it freezes, I refresh and have to work on another part of the website and come back to it later. Also the automatic save does not always save!! I ended up having to copy all my text into a word document just to make sure it wasn't lost. Overall I'm really happy. Would recommend if you're after a simple, clean template website."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-02T04:18:10.000Z",
          "Titre": "I like doing a review.",
          "Contenu": "Teach and explain in simple way. on the computer DRAG 157W can be played in any category. And more.Light Link Program That's why I made a blog of the group of people smoke."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T13:02:08.000Z",
          "Titre": "I'm just starting",
          "Contenu": "I'm just starting, but I'm having a nice experience. Is a very friendly interface and I want to keep going, I have used other site builders, but I prefer this."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Please Customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-04T22:10:47.000Z",
          "Titre": "Great landing page designer!",
          "Contenu": "I was looking for a free landing page builder, and Ucraft turned out to be a great solution! They have clean, beautiful, landing page templates that really make you stand out. Even with the free option, they have a lot of customization available (including HTML) in terms of working within the template to suit your needs. It's intuitively easy to use and responsive.It's a bit off that more elements cannot be edited (such as adding blocks or moving things around in the existing template) but I guess it's their way of incentivizing people to upgrade.Their support staff is friendly and responds pretty much instantly. There's also a logo designer which is an awesome option to have! Even so, I won't be upgrading. However, Ucraft is the way to go if you want a free, powerful landing page creator that lets you effectively get your point across in a beautiful way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-03T13:07:14.000Z",
          "Titre": "Very good service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T14:04:30.000Z",
          "Titre": "Would give 5 stars",
          "Contenu": "Would give 5 stars, but the billing and trial period are a bit confusing. The support is top notch and the UI is so intuitive. Very well organized."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Vikas Bhat",
          "Nb_Reviews": 1,
          "Date": "2018-06-04T07:18:27.000Z",
          "Titre": "A nice logo maker...",
          "Contenu": "Its a decent logo maker given that its for free...has nice features.....had making a logo is real quick and easy....Great Job !!1"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Louis",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T11:03:11.000Z",
          "Titre": "This is easy to use and could give me a…",
          "Contenu": "This is easy to use and could give me a good idea of what i want. Pretty much, the easiest and free i found on the web.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2018-08-05T04:54:02.000Z",
          "Titre": "I used jpg file as logo and can't…",
          "Contenu": "I used jpg file as logo and can't picking up color from background of my file, so I need other application to do it."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Francoise",
          "Nb_Reviews": 1,
          "Date": "2018-04-06T18:23:42.000Z",
          "Titre": "quick to create a website",
          "Contenu": "quick to create a website, nice result, lots of possibilities, could gain in quality by having more control on paddings."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Amy McDonald",
          "Nb_Reviews": 1,
          "Date": "2018-03-19T21:58:38.000Z",
          "Titre": "The low star reviews seem to be…",
          "Contenu": "The low star reviews seem to be unfounded, or at least made by self-entitled whatsits, with regard with customization. It's FREE?? And you need to complain when they're giving you a landing page where you can connect your own domain... for free?!If you REALLY need customization for the site, it's $3/mth. If you can't pay that, then you need to rethink your need for a website. Either that, or you can afford to have an ugly subdomain URL because you're obviously not looking to represent your business.I've set up a full, (mostly) customizable website in UCraft for what is STILL more affordable than the other web hosting services (I'm literally paying half what I was with Weebly). The platform is very user friendly and I will definitely be reccommending it to my clients.The team are great, they've helped me with any issues I had regarding domain problems.The only problem I have is that even with design tools, not everything is completely customizable (eg. reducing white space around photos) but having dabbled in a little HTML, I can get around it.So seriously, great job. Keep it up."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2018-03-03T08:55:17.000Z",
          "Titre": "Great website creator!!!",
          "Contenu": "Great website creator and you can connect your own domain for free but you have to pay for a lot of features"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2018-02-12T07:45:46.000Z",
          "Titre": "I didn’t have a clue what I was doing",
          "Contenu": "I didn’t have a clue what I was doing on the but after several live chats with staff I resolved the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dominique Devereaux",
          "Nb_Reviews": 4,
          "Date": "2018-07-29T14:56:34.000Z",
          "Titre": "If you are looking for a quality…",
          "Contenu": "If you are looking for a quality starter logo for your MVP, Ucraft is a great service to start with!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-01T06:57:14.000Z",
          "Titre": "Awesome webiste builder",
          "Contenu": "Awesome webiste builder, had to reload a few times but it could be my internet connection."
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-26T08:46:42.000Z",
          "Titre": "Easy and hipster-like",
          "Contenu": "Easy and hipster-like. Very customizable. Reasonable price. Very good support."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sabrina",
          "Nb_Reviews": 1,
          "Date": "2018-06-03T20:52:03.000Z",
          "Titre": "Very useful and also lovely",
          "Contenu": "So easy to use and lots of options to creat exactly what a wanted. Great tool!"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "customer Natalia",
          "Nb_Reviews": 1,
          "Date": "2018-05-21T18:05:55.000Z",
          "Titre": "Useful website",
          "Contenu": "Useful website. It helped to create an simple free landing page :)Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-02-18T19:13:12.000Z",
          "Titre": "Excellent support.",
          "Contenu": "Excellent support.They claim some features are for free, but they are not..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2018-07-20T00:05:08.000Z",
          "Titre": "Simple and easy to use",
          "Contenu": "Simple and easy to use.  I created a great logo in only a few minutes!"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-13T08:41:02.000Z",
          "Titre": "Good support",
          "Contenu": "Good support, nice design, but limited capabilities in e-commerce"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ceara K",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T17:39:55.000Z",
          "Titre": "Fairly easy to use",
          "Contenu": "Fairly easy to use!  I got my landing page done all by myself!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "SylSoulFood",
          "Nb_Reviews": 1,
          "Date": "2019-09-22T08:04:32.000Z",
          "Titre": "Simply the best",
          "Contenu": "Simply the best! Easy to use and a fantastic helpdesk .."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Breezer",
          "Nb_Reviews": 2,
          "Date": "2018-06-04T11:25:46.000Z",
          "Titre": "Easy As Pie",
          "Contenu": "Great choice for simple logo design. Very easy to use!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-26T23:37:36.000Z",
          "Titre": "It’s free but I wish I had more access…",
          "Contenu": "It’s free but I wish I had more access to edit"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Festus Asemota-Ero",
          "Nb_Reviews": 1,
          "Date": "2018-08-25T21:47:07.000Z",
          "Titre": "Cool",
          "Contenu": "Cool and will introduce others to the site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen House",
          "Nb_Reviews": 1,
          "Date": "2018-08-16T15:04:16.000Z",
          "Titre": "Decent site or landing page",
          "Contenu": "Decent site or landing page. Easy to use."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Keisz Balázs",
          "Nb_Reviews": 1,
          "Date": "2018-07-24T13:45:44.000Z",
          "Titre": "Ucraft",
          "Contenu": "Clean, smart, user-friendly and so on ^^"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-15T22:39:08.000Z",
          "Titre": "Ease of use with drag and drop function"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-22T02:58:58.000Z",
          "Titre": "Sometimes slow to upload pages"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-27T10:43:23.000Z",
          "Titre": "Good",
          "Contenu": "I like it. Better than others"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T06:23:07.000Z",
          "Titre": "Good Experience with them"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2018-02-18T23:39:53.000Z",
          "Titre": "Smooth services",
          "Contenu": "Smooth services, good"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-09T01:37:57.000Z",
          "Titre": "so far so good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:36:32.000Z",
          "Titre": "Ucraft is Affordable, Responsive, and Adaptable",
          "Contenu": "Ucraft has been so affordable, easy to use, and accessible. The site reminds me of some of the first and most helpful website building companies from the early 2000's. While the technology seems like it is not completely fleshed out, and some rare glitches occur from time to time, the customer response and customer service team is swift to reply and help out with anything. The company also has a very complete self-service center that allows you to see if you can fix or change things the way you want them all yourself. Excellent job, ucraft. I hope to be a long-time customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:45:53.000Z",
          "Titre": "A very responsive group of people",
          "Contenu": "A very responsive group of people. Always go above and beyond what I'm looking to resolve. Really enjoy using this site also."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Billy Seaman",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T14:56:13.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service, Easy to make a logo for my business and excellent staff!I wanted to make a logo for my business that was short, sweet and simple, Ucraft did just that. When I went to the customer service to say how thankful I was, the bot was amazing, so helpful, yet not to Bot like, if you know what I mean, then I asked to speak to a human and this lovely, kind, charming man came on called \"Bedros\"! We talked a bit then we started to send gifs to each other, overall, I think Bedros should get a pay rise! Thank you so much Ucraft bot, Bedors especially, and Ucraft in general for making a Loving, Easy, Helpful, Free, Funny, No Hastle website for me, and everyone else in this world to enjoy!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "M.S.",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T14:11:27.000Z",
          "Titre": "Customer service on POINT",
          "Contenu": "Customer service on POINT. Loved the quick responses and the attachment feature so I can clearly show what's going on on my end and the representative can send me step-by-step guides on their end too. Great interface that is perfect for beginners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kingdom Graphic Designs LLC",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T08:09:24.000Z",
          "Titre": "I had several questions and a few…",
          "Contenu": "I had several questions and a few issues that I needed help with. Ani was very patient with me and not only helped to resolve the issue but gave me very helpful links to refer to for help as I continue to develop my website. I truly appreciate the Ucraft team always taking time to assist me whenever there's an issue. They make the entire process easier."
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Elen Arakelyan",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T20:30:07.000Z",
          "Titre": "Excellent",
          "Contenu": "I am extremely satisfied with the level of customer support that has been provided. The team is consistently prompt in responding to my inquiries, and demonstrates a willingness to effectively address any issues that I may have brought to their attention. Also, Ucraft offers a wide range of customizable templates and design options. This allows users to create a website that suits their unique needs and style preferences."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noel Spirandelli",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T22:11:20.000Z",
          "Titre": "Hands down best template site !!!",
          "Contenu": "Being a freelance artist I've used a number of different websites with nice templates BUT none of them compare to the customer service like Ucraft. I've gotten so much help and with all the custom options you have at your fingertips makes you feel like pro web developer. Their simple integrated design to build almost everything and to be able to put in your own HTML codes really has endless options. Don't sleep on it .. check Ucraft.com out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandi Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T17:55:29.000Z",
          "Titre": "I love the templates and customer…",
          "Contenu": "I love the templates and customer service have been A-1. Quick replies and detail directions. Will recommend U-Craft to anyone that wants to create a unique site different from Godaddy or Wix. Ani, Laurie, and Ines were so helpful. Made it easy to navigate and I'm not the most tech savvy."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Ndege Volare",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T09:47:23.000Z",
          "Titre": "UCraft held my hand.",
          "Contenu": "Not only did Bedros literally walk me through my technical challenges with my site as if handling a child just learning to use a computer, but he also ensured to follow up the following day to verify that the problems I was having were fully resolved. Simple, easy and thorough. Great, great service."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Alhamlan",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T14:56:04.000Z",
          "Titre": "WELL DONE GUYS!",
          "Contenu": "back in 2018 i was looking for a platform to create a landing page and i found about UCRAFT! i've never regretted my decision to subscribe since that time.along the way i couldn't find a better option (Except Webflow) which is a bit harder to start with.i noticed that UCRAFT team focus on Design which is great but i feel they are a little behind in matter of the rapid changes that happened in web industry the last 3 years.for example (scroll trigger) and loading animation and many other cool stuff need to be adopted.will that change my mind about UCRAFT? Never! i'm Still all faith that this creative team can do much more and i don't see any alternatives meanwhile. Keep the good work UCRAFTERS :) Love & Respect"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "SNGS",
          "Nb_Reviews": 2,
          "Date": "2021-04-08T01:49:00.000Z",
          "Titre": "Thank you, UCRAFT!",
          "Contenu": "I have to say, when I started my journey in 2017 with UCRAFT, I was very much sure this is going to work since had tried few more website builders previously. It's the ease of navigation, simplicity, and  Now, in 2021, I am operating the website myself, generating revenue (happy to say), selling at an online marketplace in Malaysia such as Shopee. It was made possible by the amazing people at UCRAFT. Truly hope more people would build their online business with UCRAFT. May UCRAFT will become bigger and better than ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Nightingale",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T14:18:55.000Z",
          "Titre": "Support is awesome!",
          "Contenu": "Managed to rebuild my organizations website in a very short period of time with Ucraft's easy to use tools.  It takes a little to understand how everything works and I was rushing so didn't take the time to watch all the tutorials, but whenever I got stuck their support chat was able to help me out quickly, efficiently and kindly. I'm glad I found this platform   and am a happy customer. - okpace"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "aminah pasha",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T14:33:06.000Z",
          "Titre": "Easy to use, friendly staff",
          "Contenu": "Easy to use, whenever I have been stuck on something, staff have been every helpful and very easy to solve my problems. Extremely friendly and quick at responding back. Would 100% recommend using this site builder. I love how there are pre made template where you can adjust and they look very professional :)!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Anu",
          "Nb_Reviews": 1,
          "Date": "2020-09-27T13:57:23.000Z",
          "Titre": "I am completely blown away by the level…",
          "Contenu": "I am completely blown away by the level of support they offer for free users! I am yet to come across a business that can match Ucraft in this space. Just because how they helped me get my website up and running (and yes, I am a free user), I am considering moving to a paid membership for the SEO and other stuffs. Amazing customer experience and kudos to the team at Ucraft for their awesome work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kezia Tan",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T16:21:03.000Z",
          "Titre": "The live chat support team are the…",
          "Contenu": "The live chat support team are the backbone of Ucraft. There is no way I would still be a paying subscriber if it wasn't for that team. Today in particular I had Bedros (everyone I have ever spoken to has been equally as helpful), who although we couldn't fully resolve my issues he gave great insight and knowledge, alternative options and passed on the issue and notes to the wider team to potentially make changes for the future. They really do make it easier, especially as a non website person. Ucraft is not perfect, but they are constantly updating features and tools. Their pricing compared to other places is the most reasonable I have found, making having a website accessible for a new/small business.Again thank you to the support team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyleelise Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T21:40:59.000Z",
          "Titre": "Ucraft support resolves while teaching.",
          "Contenu": "I have relied on Ucraft technical support, and the results of the assistance are always exceptional. Today, I worked with Anna, who spent an unreasonable amount of time solving the problem of my logo posting instead of the story - in this case, an artist's obit. Two things: Anna taught me essential lessons on creating and posting, including using SEO and other features; second, I guess realizing how flustered I was, she fixed the more challenging aspects of the link. Ucraft support is live and unrushed. Anna's support was unrushed and compassionate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Red Msry",
          "Nb_Reviews": 2,
          "Date": "2021-06-23T07:27:30.000Z",
          "Titre": "Excellent customer service and user experience",
          "Contenu": "Firstly, the user experience is intuitive, everything is clear and concise from the get go. It's fun to experiment with their free templates.I did experience a few glitches at times, say, when website's elements were missing from the actual webpage, so I contacted their customer service, and their technical team were swift to remedy the situation.Their user friendliness and helpful staff give me a lot of confidence to remain loyal with UCRAFT; it has been at least 5 years now.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Maria McMahon",
          "Nb_Reviews": 2,
          "Date": "2020-03-13T11:36:00.000Z",
          "Titre": "Recommended if you don't have any tech skills!",
          "Contenu": "I've been using Ucraft for one of my sites for some time now and have always been ABLE to deal with my own website only because of the excellent customer support from the Ucraft Team. They can always walk me through any problem I'm having and they're always really helpful and friendly. I definitely recommend Ucraft if you've got very little tech knowledge yourself because you'll get all the help you need to make a lovely website. Maria"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Louise H",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T12:27:24.000Z",
          "Titre": "Would recommend to anyone starting out with a personal website",
          "Contenu": "I honestly can't recommend Ucraft enough - I'm generally completely baffled by what I need to do to get my website up and running, but the live chat support is always there to help me and put up with any silly & basic questions I have. They are very friendly and patient, and the tool to build a website to start with was great too. So far, I've managed to overcome any hurdles I have faced - thank you Ucraft team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enhanced Priority",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T21:07:09.000Z",
          "Titre": "I love UCRAFT !",
          "Contenu": "Always get the best help and feedback from support team within a hr or less time with any issues or questions i have of changes needed. The customer support team Laurie, Ines, Ninelle, and Vahagn have been the best help in the years I have been happily subscribed. I would definitely refer others."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hamza Sheikh",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T19:24:00.000Z",
          "Titre": "BEST ONLINE SUPPORT TEAM",
          "Contenu": "I designed like a million websites before I actually published 2 Today. I have been using Ucraft since almost 2 years and I say this \"BEST ONLINE CHAT SUPPORT TEAM EVER\". I came across few better options than Ucraft but Ucraft's Customer service is to good to let it go.Thank you all of you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jonelle",
          "Nb_Reviews": 10,
          "Date": "2023-02-18T13:51:15.000Z",
          "Titre": "Super Easy and Helpful",
          "Contenu": "I managed to use Ucraft to create my company's website and it was super easy, even for an old geezer like me. And the great thing was, anytime I had challenges or needed help, I just used the chat box and there was always someone on hand to help within minutes. Thanks so much guys!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Banks",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T11:41:24.000Z",
          "Titre": "Starting a business is hard enough",
          "Contenu": "Starting a business is hard enough. building a website among those is always a daunting task. Ucraft made it easy to get up and running. Customer service was quick and informative there was no stone left unturned to get the correct answer back to me as I asked. If you are looking for an easy and helpful climate I would suggest using Ucraft."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T19:43:17.000Z",
          "Titre": "Reliable service",
          "Contenu": "Reliable service! Never have had issues with my website in 3 years.  Thanks Ucraft."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "A God's Eye",
          "Nb_Reviews": 5,
          "Date": "2021-04-11T13:14:44.000Z",
          "Titre": "Really nice UI and website designer",
          "Contenu": "Really nice UI and website designer. Some parts could be corrected and would be nice like adding video audio to the youtube links etc, but customer support is very helpful. The free plan is great and maybe getting a subscription is worth it too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tia Watts",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T05:45:47.000Z",
          "Titre": "First I would like to say",
          "Contenu": "First I would like to say, I absolutely love Ucraft. I do not have any experience in web design, but with Ucraft having the perfect template and easy drag and drop, I feel like an expert web designer. I ran into an issue. I did not know how to delete the template display on the URL, after connecting my domain. Well, I contacted Ucraft after hours and Vartan got back to me in a timely manner and resolved my issue. He told e exactly where to go and what to do. Highly Recommend! Thanks, Ucraft"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Business Owner",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T21:13:05.000Z",
          "Titre": "Fastest customer service by LIVE PEOPLE",
          "Contenu": "The customer service here is by far the BEST and the FASTEST. While the other company I've been using takes days to respond to my paid account, Ucraft responds immediately even on free accounts. Some of the site building is not as intuitive as other places, but once you get the hang of it it is much easier and quicker to build and make adjustments. I've been experimenting with numerous new companies, and will be moving my websites here to Ucraft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S.Tuttle",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T02:08:39.000Z",
          "Titre": "I'm very pleased with Ucraft overall",
          "Contenu": "I'm very pleased with Ucraft overall. I was able to build a beautiful website at a reasonable cost. I did run into some small issues (as is common with any website building company/software), but the staff at Ucraft was always available to give me the thorough personal assistance I needed to resolve the issues and make my website the best it can be. I do recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Chris Cachia",
          "Nb_Reviews": 4,
          "Date": "2020-12-07T17:43:52.000Z",
          "Titre": "The best platform with amazing SUPPORT...",
          "Contenu": "Using the right platform to build a new website is very important especially if you are not technical at all and are just taking the challenge.  In my experience SUPPORT live when you need it makes Ucraft unbeatable.  They will explain step by step what to do but if you are like me, hopeless, they ask you to log them in and they just do it for you. I don't think I ever came across such exceptional SUPPORT and this is not once, it's hours of support while building and upgrading my two websites. Thanks and will definitely recommend you as TOP CHOICE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T05:45:27.000Z",
          "Titre": "Design Sensibilities and Support",
          "Contenu": "Ucraft has a far superior design sensibility to other website builders I've used. If you care about design, but don't want to code from scratch, this is your platform.Also the support is amazing! When I was getting started I had a few questions and they were always answered quickly in chat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JWade",
          "Nb_Reviews": 4,
          "Date": "2021-04-28T23:32:45.000Z",
          "Titre": "Had an issue and they were on it right…",
          "Contenu": "Had an issue and they were on it right away despite the chat box saying they would be offline until the next morning. Turns out the issue was me but they isolated it and had me questions answered in no time.Been nothing but good experiences so far."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Serge Guenette",
          "Nb_Reviews": 6,
          "Date": "2021-11-02T15:04:58.000Z",
          "Titre": "Was sick for a few months",
          "Contenu": "Was sick for a few months, but  when  I came back, reactivated the website. Since my memory has some issues sometimes (73 years old) learning is not too easy. BUT the expert at Ucraft are absolutely dream people. They  brought my memory back, got  website up to date, added products  etc.  Cannot  have better service."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Jonathan Segers",
          "Nb_Reviews": 2,
          "Date": "2020-12-02T15:52:22.000Z",
          "Titre": "GOAT Customer service",
          "Contenu": "Customer service is super reactive and helpful! Website maker is decent, even the free version, if you can work your way around some limitations. The big plus is the customer service though: they always reply fast and in detail! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gemma",
          "Nb_Reviews": 4,
          "Date": "2021-09-02T13:46:27.000Z",
          "Titre": "I moved our company website over to…",
          "Contenu": "I moved our company website over to Ucraft a few years ago and have had no major issues, however whenever I have needed anything the support team is right on it to fix it and get me sorted. I highly recommend their service is second to none, they have checked my settings and got us back up and running quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bo",
          "Nb_Reviews": 3,
          "Date": "2022-10-15T10:41:42.000Z",
          "Titre": "The best value website designer",
          "Contenu": "Absolutely great deal; I am grateful for using this service and connecting to my domain without any charges; I never see any website designer service like this. As a company, I guess they should think about survival and their employees first. And I am grateful for using the free version for such a long time, and it actually connected to my domain; even with the monthly subscription, it is way better priced than most of the website designer services. And it has enough for me as a designer to use and promote my services. I am happy to have the lifetime plan option. Thanks for supporting, for sure will recommend it to other friends!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Nick Millett",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T08:36:03.000Z",
          "Titre": "The Human Touch",
          "Contenu": "In the end any minor problems with features or UX can easily be corrected if you have quick access to a human being who is clearly on your side. I live in France and have regularly to force customer services to help me. What a relief Ucraft's direct, open, responsive and constructive collaboration is..."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Klara W.",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T15:50:26.000Z",
          "Titre": "Awesome Website Builder",
          "Contenu": "Great use a free website, needs a bit of a workaround to figure it out but it is one of the best Website builders I ever found.The support is very friendly and super fast, solved my problem under an hour.And on top it is very flexible for all my needs, so everyone sure could find the right fit for his website idea."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-07-31T00:35:36.000Z",
          "Titre": "AWESOME WEBSITE BUILDER!",
          "Contenu": "Loving Ucraft! Not too tricky to use, amazing editing capabilities. Reasonably priced which is important if you are a new, small business. I also love the round the clock help via the chat. Quick replies and friendly, useful responses.I have tried a couple other website builders in the past, but this one is by far the best one."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kiauhmitl Junck",
          "Nb_Reviews": 2,
          "Date": "2021-04-22T23:12:57.000Z",
          "Titre": "It is great having on-line assistance",
          "Contenu": "It is great having on-line assistance. I have creative control and know what I want to present.. . . besides the fact that I learn how to do it myself so that I can do it whenever I want, the on-line support makes impossible things possible and real and helps me get to the perfection I seekvery kool"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TAO",
          "Nb_Reviews": 2,
          "Date": "2021-07-30T19:44:28.000Z",
          "Titre": "Ucraft's online chat and email team are…",
          "Contenu": "Ucraft's online chat and email team are very effective and efficient. I am always pleased and surprised how quickly they respond and address my question and also fix issues or help with how to do's - Thank you Ucraft Team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michaela",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T00:55:44.000Z",
          "Titre": "Free version restricted but totally usable",
          "Contenu": "I chose Ucraft because it was the only free builder I could find that let me attach to my custom domain [myname].com instead of [myname].ucraft.com. It still has an annoying sticker at the bottom but it's inexpensive to get rid of. Building the website is very intuitive, though I can't tweak it as specifically as I want, but that's an artist thing. The live chat button to talk to a live agent works perfectly, and they are on often enough the wait time is not very long. They give you options to achieve what you're trying to do with the free version, when possible, and talk about plan options without being pushy, and only in order to fulfil your needs. I definitely recommend giving them a try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Greene",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T16:48:02.000Z",
          "Titre": "Ucraft and customer service review",
          "Contenu": "For someone making a website for the first time I had a great experience. I haven't used other website builders so I don't have anything to compare it to. It is pretty easy to make a proffesional looking website without a lot of experience. Most of all the customer support team is really helpful with any problems you have and you can usually resolve any issue you have in about 10 minutes. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kels",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T02:24:11.000Z",
          "Titre": "Best service ever",
          "Contenu": "After trying out many companies, the live help from customer service (shoutout to Mel, Vartan, Laurie) at Ucraft made my mind up to go with them. I've had one site with them for 6 months and couldn't be happier. When my contract is over with my old company I am transferring all my sites to Ucraft. Thanks for the great service!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Niara van Gaalen",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T22:11:16.000Z",
          "Titre": "Suren helped me to fix a block that was…",
          "Contenu": "Suren helped me to fix a block that was not displaying properly. All I had to do was give access to the website and he fixed it within a couple minutes. I have contacted UCraft customer support several times and have always been helped by professional and prompt individuals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T22:21:57.000Z",
          "Titre": "I was pleased how Ucraft support…",
          "Contenu": "I was pleased how Ucraft support responded quickly to my questions. The instructions were given in an easy way to understand. I do not have a lot of tech experience, and my Ucraft support person was patient and walked me through the entire process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Bilyeu",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T00:24:56.000Z",
          "Titre": "Easy everything!! Solid support.",
          "Contenu": "Easy setup. Responsive and knowledgeable support. Friendly and helpful techs that resolve issues in minutes. Hands-down the best customer service I've received from a hosting company. Well done!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sarah Baker",
          "Nb_Reviews": 3,
          "Date": "2020-09-07T12:36:04.000Z",
          "Titre": "This company is truly phenomenal",
          "Contenu": "This company is truly phenomenal. They go above and beyond to help you, their websites are amazing and they have the best support staff ever. I personally have been dealing with Suren who is truly wonderful and goes out of his way to help"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dylan",
          "Nb_Reviews": 8,
          "Date": "2021-06-26T18:31:56.000Z",
          "Titre": "customer support is excellent",
          "Contenu": "I just wanted to write a review to say their customer support is excellent. Although I'm on a very low subscription tier, they put in a lot of effort to help me, and they are very hands-on at solving problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 3,
          "Date": "2021-04-18T03:20:23.000Z",
          "Titre": "Incredible customer service!",
          "Contenu": "I have never in my life had such excellent customer service. I have three websites with Ucraft. Each one looks amazing. But the customer service is what puts them over the top. Every time I have had a question (and I have lots since I am an amateur at building websites) someone answers within 20 minutes, even at 2am. They have even gone in to fix things for me (with my permission.) And they are so affordable! I recommend Ucraft all the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dexter Simpson",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T22:14:20.000Z",
          "Titre": "The support is 11/10",
          "Contenu": "The support is 11/10 - almost instant answers, usually illustrated with pictures and screenshots, and also so so friendly! I've never build a webpage before but it has been an approachable and rewarding process with the help of the Ucraft team."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T04:26:53.000Z",
          "Titre": "Every website has its flaws but....",
          "Contenu": "Every website has its flaws and quirks, Ucraft is no different. However the support staff are always prompt to answer back. No problem of mine seemed too difficult to solve. I am very happy with Ucraft and would recommend."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Varna",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T12:25:50.000Z",
          "Titre": "I've generally enjoyed my experience…",
          "Contenu": "I've generally enjoyed my experience with Ucraft. I've found new and useful features and they aren't unaffordable. Nice design options and GREAT ease-of-use."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "GOPALAN P. Nair",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T10:27:34.000Z",
          "Titre": "I found Ucraft's web builder awesome, but I found their support team more awesome",
          "Contenu": "I found Ucraft's web builder awesome. But, what's even more awesome is your support team. They truly are a magnificent lot. Always there to provide support for whatever issues and challenges I faced. I never had that level of support from any other providers, with whom I tried to do the same. Especially Ashkhen. She is outstanding in her support. Not that the others I had interacted with. They were excellent in their support too, but Ashkhen was outstanding. She just knew how to engage and manage the situation I was faced with and knew how best to support me. I did not feel alone in this. She was there and that was really very reassuring for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BLVDES",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T00:21:08.000Z",
          "Titre": "Probably the best online support ever",
          "Contenu": "Best customer support experience I’ve had in a long time. I had Laurie, and she was extremely helpful and walked me through everything I needed. She even stayed on the chat way after I was done in case I had more questions, which I eventually did, and she helped with everything."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "C.",
          "Nb_Reviews": 2,
          "Date": "2021-11-12T16:56:13.000Z",
          "Titre": "Excellent Customer Service, Easy Website Builder",
          "Contenu": "Excellent customer service! Their website builder is super easy to work with, clean and modern. I have a free website and they always offer 100% amazing customer service. I love the ease and quickness of their live chat and email support."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Patrick Wittmann",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T08:07:21.000Z",
          "Titre": "The best support I`ve ever seen",
          "Contenu": "It`s a great plattform. Sometimes the building process is a little bit complicated for beginners, but I`ve never seen such an amazing life support. Fantastic job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Mancosu",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T20:58:33.000Z",
          "Titre": "Chat support",
          "Contenu": "Contacted chat support and they responded within minutes.  They were able to quickly pinpoint my issue after I sent them a screenshot and give me a quick fix.  The tech was very polite and it was a pleasant experience!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Racheli Iczkovits",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T12:56:13.000Z",
          "Titre": "Amazing product",
          "Contenu": "Amazing product. Easy to use, easy to customize, perfect for a quick website creation. Customer service is fantastic, I get replies within 10 minutes on their live chat."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Elo Izlo",
          "Nb_Reviews": 2,
          "Date": "2020-03-16T12:50:26.000Z",
          "Titre": "Best website plataform",
          "Contenu": "Best website plataform! Really happy.I have started building my own webside 10 years ago and last year I founded Ucraft checking forums of independent designers, and really has been great! The plataform is very easy to build and also you have 24 hours support. They help you in a chat at the same time you are doing the web! So really happy with all."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlotte Symmonds",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T11:09:37.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service - I can't fault it at all! I have a free website and they still gave me 100% customer service. Their website builder is super easy to work with and you'll be very happy with the results. Not a bad word to say about Ucraft! Superb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T21:55:40.000Z",
          "Titre": "The Ucraft staffs are excellent for…",
          "Contenu": "The Ucraft staffs are excellent for helping with such small things.  Their response time is pretty quick and I had a lot of help from them.  I'll keep using this website builder and finish my website."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Kate Scully",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T19:05:14.000Z",
          "Titre": "Bedros from Ucraft is so helpful! Very good platform to work with!",
          "Contenu": "Super helpful to deal with, Bedros especially has always solved any queries I have & went out of his way to help me, I have 4 sites with Ucraft for different clients."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Arie van der Wijst",
          "Nb_Reviews": 2,
          "Date": "2021-07-20T13:19:06.000Z",
          "Titre": "What an amazing helpdesk",
          "Contenu": "What an amazing helpdesk, of course it was my own fault to begin with, I thought my whole site was lost but amazing Ashken helped me in no time get it back in order, fantastic!!! Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Moe Yusuf",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T09:49:15.000Z",
          "Titre": "Helpful",
          "Contenu": "Helpful, Ucraft are honestly the best, I was previously using Shopify and I moved to Ucraft, Shopify doesn't help customers like myself, but Ucraft do! They are extremely patient and helpful. i highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Raymond Putra Hutama",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T03:09:53.000Z",
          "Titre": "quick response on domain problem",
          "Contenu": "i checked my website was off suddenly. and i need assistance from ucraft. since my location is in southeast asia, when i open ucraft site in the morning (my time) it is mentioned i could only get support in 3 hour time. then what i do is just typing it hoping for the support. which in turn Mel from ucraft save the day for me. she responds all the questions i have in just 5 mins. thank you for the support Mel and ucraft team!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jessica",
          "Nb_Reviews": 10,
          "Date": "2022-02-11T20:07:19.000Z",
          "Titre": "Really helpful!",
          "Contenu": "Really helpful. I had no idea where to start with DNS and connecting my domain, and they helped me so easily through it, and now my website is up and running again, easily designed through their site. Love them so so much!"
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-09T11:18:30.000Z",
          "Titre": "Very reliable!",
          "Contenu": "Better than any other website builder I have tried. Amazing and responsive team. There are minor fixes that can be done with the tools, but overall I am very impressed."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Elo Izlo",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T18:02:37.000Z",
          "Titre": "The best website service",
          "Contenu": "I love ucraft! great and simple way to build your website. For me what it makes the difference is that every time you have a problem or question the team is super nice and help me! I love this because make me feel secure with my website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-11T23:44:27.000Z",
          "Titre": "Great way to design a new website",
          "Contenu": "It Was very easy to navigate and understand how to create my website. I had a ton of fun ideas while creating. And I was able to purchase my domain right after I was satisfied with my site."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "April The Jockey",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T17:11:50.000Z",
          "Titre": "AMAZING TOTALLY GREAT (Would recommend)",
          "Contenu": "Recently I have been trying to find a great website like this. I love Ucraft - Making logos and Websites is now so easy! Would recommend to anyone! No expert experience needed! Simple, great, easy, and I totally trust it! The only bad thing about it is I can’t scroll down on the icons because I use IPad. But there is plenty still to choose from!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah Frasier",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T18:30:30.000Z",
          "Titre": "Wonderful Experience",
          "Contenu": "Wonderful experience, I always have such a helpful person on the other end of the chat. So quick to respond as well. I can ALWAYS count on Ucraft support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bridget Chapman",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T02:43:38.000Z",
          "Titre": "I love the Ucraft team!",
          "Contenu": "I love the Ucraft team, website product, and service.  I have referred them to others dear to me and they love them just the same.  Their website set up is user friendly and hassle free - and their team is AMAZING!  So knowledgeable, helpful, and friendly.  If you're new to designing websites, this is the place for you.  A one stop shop road map to helping you design the perfect site for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chantél Francina",
          "Nb_Reviews": 2,
          "Date": "2021-09-14T19:10:52.000Z",
          "Titre": "I love ucraft and use it for all 3 of…",
          "Contenu": "I love ucraft and use it for all 3 of my businesses (4 soon as I will be moving our 4th site onto here!) They are always helpful and quick to make sure any issue gets resolved!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lola Scarborough",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T14:59:29.000Z",
          "Titre": "I've been working with the Ucraft…",
          "Contenu": "I've been working with the Ucraft websites for about 3 months now and am really happy. You can do a lot with their platform. The Chat help is excellent and the experience I've had with them has been a very good one. They are very helpful and pleasant. :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Artis Venable",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T00:43:13.000Z",
          "Titre": "Amazing Service & Full Features for Less",
          "Contenu": "Amazing. I am a newbie and they consistently helped me for 8 hours today via chat. They even fixed things that I messed up in the background!  Amazing service. Cheaper and better features than Wix and Square!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Aja",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T18:05:21.000Z",
          "Titre": "By far, the best platform for me.",
          "Contenu": "They've been really accommodating with my inquiries and requests. They were able to solve the problem in minutes. By far, the best platform for me."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "hamid hoseinpour",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T20:50:45.000Z",
          "Titre": "Here is a great site that can meet your…",
          "Contenu": "Here is a great site that can meet your needs and what made me most happy was the support of the Persian language and the support of the website who responded sincerely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna Overstreet",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T15:02:17.000Z",
          "Titre": "The greatest logo maker",
          "Contenu": "I have been on other logo makers, and they never had what I needed, but the ucraft logo maker has been a blessing to me, it has everything I need, and it allows me to edit my logo so I can show my creativity."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T11:35:28.000Z",
          "Titre": "Really great customer service",
          "Contenu": "Really great customer service, user-friendly platform, exactly what I needed to start my business. I was up and running in less than a week!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T02:57:37.000Z",
          "Titre": "Great platform to start an online boutique",
          "Contenu": "I think overall the platform is easy to use and the customer service is quick to respond. Most of the Ucraft support people knew what to do immediately and they were very helpful. There's still a lot of room for improvement. I can't wait to have more apps integrated. It's easy enough for me to do everything on my own since I just started my online shop and I am glad I can have the freedom to design/make my website the way I want it to be. The major highlight was that I didn't have to buy expensive themes or need to know how to code - thus I was able to focus on selling my designs and accessories. It's easily integrated with social media platforms and quite easy to create blog posts. The E-commerce platform is also straightforward, has automatic customer/user e-mails, invoices, and I only pay the monthly subscription fee. No other hidden costs made it really helpful especially for people who are just starting a business.Things I'm having a hard time with are having a built-in pop-up, changing the photo size of the blog header, having a bi/multilingual store, difficulty in showing different price ranges when your variations have a different price, the comment box for blog posts are from another app and I haven't really made it show on any of my blog post pages.I have used Ucraft Pro Shop for almost two months now and so far I really like it. I started with a free trial on Pro Website."
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Nicholas Gerhard",
          "Nb_Reviews": 2,
          "Date": "2021-09-14T15:24:20.000Z",
          "Titre": "Assistance is always there",
          "Contenu": "Assistance is always there, and available 24/7... Website creator is excellent and fun to experiment with and I am getting positive results from my website. Thank you ucraft and Vahagn for your help with my technical problem."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Serge Guenette",
          "Nb_Reviews": 6,
          "Date": "2021-08-02T07:03:31.000Z",
          "Titre": "Since I am a neophyte with website",
          "Contenu": "Since I am a neophyte with website, i needed a lot of help. I mean a lot. They have more patience that me and would not give up until it finally cleared my brain.  Really real ¨Professionals.  A great hug to this incredible team."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Detective Moustache",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T21:18:26.000Z",
          "Titre": "An awesome and affordable option for…",
          "Contenu": "An awesome and affordable option for any amateur website creator! Support was also super helpful. The support specialist I was connected to was able to help me out with all the questions I had. Definitely recommend this!!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Zax Horgen",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T06:55:11.000Z",
          "Titre": "Helpful guide on domain connect",
          "Contenu": "HelloMy Name is Zax!I recently created web, and was trying to connect it to my domain (I used freenom). But, because of a few things, it wont connect even tho I already changed the DNS setting.I then, reached out to UCraft team, and Diana guide through it patiently. And now it worked great! Thank Diana and Ucraft Team. You guys are awesome!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Obiageli Akinbule",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T21:17:44.000Z",
          "Titre": "I really LOVE Ucraft Website Builder",
          "Contenu": "I really really love this platform! I used Ucraft to build my website and they made it SO easy for me!! The customer service is superb!! They are always available to chat with you and answer all your questions. and i had many! haha.  They are also so encouraging. I love it so much. I highly recommend Ucraft to anyone. You dont have to be a programmer to build with them. They've got you! :) I am definitely teaching my kids in school Ucraft.'Thank you Ucraft team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Emm",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T14:57:18.000Z",
          "Titre": "I am not the most tech-savvy person",
          "Contenu": "I am not the most tech-savvy person, but Ucraft associates are always here to assist me via the chat!  You guys rock! :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Spiegel",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T18:06:41.000Z",
          "Titre": "Quick easy and efficient.",
          "Contenu": "Quick, easy and efficient. I have few bridges to cross as I work with u-craft, but when I come to one- they help me cross it with ease.  No problem writing a review when there is only positive to say."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "AMaster",
          "Nb_Reviews": 2,
          "Date": "2021-07-19T15:17:16.000Z",
          "Titre": "Fantastics support",
          "Contenu": "Fantastics support, (even on free website!!) it's really nice to work like this. Yes I will definitely tranfer a couple of my sites."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Random Viral",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T06:55:59.000Z",
          "Titre": "great customer service",
          "Contenu": "great customer service! setting up my website and loving it so far! you can still work on your website after the free trial which is great!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Obiageli Akinbule",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T23:55:54.000Z",
          "Titre": "I absolutely love Ucraft",
          "Contenu": "I absolutely love Ucraft! The customer service is EXCELLENT! They are sooo helpful and just awesome! I love the Ucraft experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUPER MAX",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T19:27:47.000Z",
          "Titre": "I am 80 years old and not very adept at…",
          "Contenu": "I am 80 years old and not very adept at websites  - my experience with ucraft has been outstanding and I recommend them highly- they surely make the job easier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Giavanni",
          "Nb_Reviews": 4,
          "Date": "2021-07-16T10:53:49.000Z",
          "Titre": "When I tell you",
          "Contenu": "When I tell you, I have been with the major players when it comes to buying URL, hosting, and all the extra charges, that keep popping up, from time to time over the years. When I made the switch over to Ucraft. At first, it was a bumpy road. Not for Ucraft, but the institutional ways I have been taught from buying url/domain, SSL certificate, hosting, Website tool builders, and the most important customer service.I was hard on them (Ucraft), at first, and they just took it. Ucraft customer service knew if they could please me, and my clients. And bring us back to having a company you can trust. And I trust Ucraft. The customer Service tells you a lot about Ucraft's management, and Owner.Ucraft customer service will never upsell you, send emails to buy other services. If you want something don't be afraid to ask. I love Ucraft! And You should too!Remember, their is no perfect hosting, website tool builder, and yes there are many hiccups in all operating systems, browsers, and the apparatus to which you are connecting to enter the World Wide Web.If something goes down, goes wrong, and it will. I promise You. But when things are back up running better ;than it did when the hiccups or interruptions happened.That's always a good thing! So, don't sweat the small stuff, be creative and use Ucraft. This could be a forever relationship."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coach Jen",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T21:09:39.000Z",
          "Titre": "So very helpful",
          "Contenu": "So very helpful. I needed help troubleshooting my domain and Vartan was so patient and helped me step by step as I navigated through. By far the best tech help I have ever received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Nnanta",
          "Nb_Reviews": 1,
          "Date": "2020-08-08T14:23:26.000Z",
          "Titre": "ucraft is amazing all of them responded…",
          "Contenu": "ucraft is amazing all of them responded to me when i needed help and i know that all of them will try their best and do the same for you"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Ronny Sánchez Merino",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T02:12:39.000Z",
          "Titre": "Best customer service ever",
          "Contenu": "Best customer service ever. They answer all my questions and also help me with the complicated techy stuff. Keep the good work."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Cyd",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T02:37:44.000Z",
          "Titre": "the easiest website builder to use!",
          "Contenu": "I tried a few website builders and Ucraft has been the easiest and faster to help me build mine. The support team is the best: always available and ready to help you with anything. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T16:28:58.000Z",
          "Titre": "Great customer support!",
          "Contenu": "Since launching my website, I've needed to contact customer service a couple of times & they have been veyr helpful & resolved my concern each time in a very professional way :)"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Worldwide Worst Work",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T10:57:14.000Z",
          "Titre": "amazing service",
          "Contenu": "amazing service, they respond in within a few minutes which is great, and give you the proper assistance you need"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T23:01:46.000Z",
          "Titre": "Ucraft is top shelf",
          "Contenu": "Ucraft is top shelf! Site is easy to use, and customer support is exceptional.I HIGHLY recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niki",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T16:16:53.000Z",
          "Titre": "Ucraft is Fantastic!!",
          "Contenu": "Ucraft is fantastic! Always so quick to respond and get the job done. Nothing negative to say from! Love these people."
        }
      ]
    }
  ]
}