{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.sav.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Олег Эспио",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:06:34.000Z",
          "Titre": "They banned and blocked those who…",
          "Contenu": "They banned and blocked those who bought domains from third parties. I lost a beautiful domain. sav support told me to wait until the domain expires to register it again.Do you know what happened on this day? Another person bought it. My site is unknown to anyone, so there are suspicions that they took it for themselves in order to then ask for a lot of money to buy back the domain.For what reason are you blocking third parties just now? Why were they even allowed to register earlier and you didn’t notice them before?It turns out that you yourself did not keep track of them, and people who register with third parties do not know that they are violators.As a result, innocent people suffered,Give me back my favorite domain."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Janat Shunaev",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T12:04:25.000Z",
          "Titre": "The domain was blocked without explanation",
          "Contenu": "My domain oacca.org was blocked without explanation.I didn't do anything illegal. I have asked many times to resolve my issue.I can't change NS and they don't provide a transfer code either. I can't do anything with my domain.There are no reasons for blocking.Registrar InformationName Sav.com, LLCReferral URL sav.com"
        },
        {
          "Note": 1,
          "Pseudo": "BLAK",
          "Nb_Reviews": 12,
          "Date": "2023-11-19T16:54:04.000Z",
          "Titre": "Stay Away",
          "Contenu": "Stay Away! from SAV, this is a pure scam company i lost my $8000 worth domain because of them and they don't even provide me any proof, i usually do not give negative reviews but it is my duty to inform peoples so they can not lose their precious domains."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:44:22.000Z",
          "Titre": "Avoid if you want support or domains released",
          "Contenu": "Lots of errors on the site. Registered some domains with Sav.com (mistake). Whois will not update. Account will not let me release the domains (because the functionality is broken). Sav are themselves breaking their own terms. AND the Registrar terms. \"We've escalated this to Advance Support\" is a regular phrase they use.  No-one else can get in touch with Advance Support. My domains have been locked up and not released (after full payment) for nearly a month.  I need to prove I own the domains but can't. Shocking support / tech from a tech company.  I would say AVOID at all costs if you want tech support. Use them if you want to save some money but don't care about your time or experience."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Pupstime _",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:55:47.000Z",
          "Titre": "horrible experience",
          "Contenu": "horrible experience, I buy 4 .cyou domain for $0.69 each, not knowing that the renewal price is $99 each, stick to well known domain provider, don't follow my foot step of finding cheap domain, and end up losing more money, lose $400 for 4 .cyou domain, horrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T14:10:30.000Z",
          "Titre": "I can't recommend this registrar as…",
          "Contenu": "I can't recommend this registrar as reliable. I registered many domains for my clients. Complaints came in for several domains and they blocked the entire account despite the fact that there are over 700 domains without complaints. So, our clients have lost more than 700 (!) domains, on which there was not a single complaint, people cannot work. Clients lose tens of thousands of dollars, so there is no way to change dns, renew or transfer domains. We wrote a complaint to ICANN, we are preparing an application for filing with the court."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Md. Rashidul Islam",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:50:03.000Z",
          "Titre": "blocked card at the time of bidding.",
          "Contenu": "I placed a bid on an auction domain 4-5 days before it ended. no one was bidding, but before 5 minutes 2 people started bidding. I was outbidding them but certainly, they blocked my card and I lost the domain."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Prasanna Kumar Padala",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T18:57:17.000Z",
          "Titre": "SAV has the WORST SERVICE",
          "Contenu": "SAV is a cheap registrar. Other than that, they have the worst service in comparison to GoDaddy & NameCheap. They have regular issues with payment gateways & with Credit & Debit Cards. Even if a ticket is raised, issues are solved at their convenience without any intimation after the issue is solved. I have been having problem since the past week in renewing my domains, but what is the point when they have such pathetic service. They don't even have a proper customer service no in case of emergency also."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Noah Manscher",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T09:12:35.000Z",
          "Titre": "Awful customer service, shady policies and no ability to cash out",
          "Contenu": "You won't find anyone who cares about the brand image at this company. I was notified that my domain would expire in 30 days if I didn't take explicit action. Not one day later, they charged me for an auto-renewal (even though the previous email had stated that I needed to take action lest I lose my domain). I'm not upset about the money - just the awful customer service that completely dismisses any progressive conversation attempts. This company has some terrible policies, and I don't trust it one bit."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T02:29:51.000Z",
          "Titre": "Can you please answer my message sent…",
          "Contenu": "Can you please answer my message sent to : safety+appeals??You blocked my 3 domains name by mistake I think??!!I host on one of them my videos, 2nd used to share my content, 3rd used for tutorials and not yet alive, I was 3 years using Porkbun and never meet this issues with them, even I was sharing the same content.If you don't back my domains, I will raise a dispute via PayPal and sent them my content screenshot."
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "wenfeng li",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T06:54:56.000Z",
          "Titre": "Not good",
          "Contenu": "Very poor experience,When I needed help, I found no one,No online customer service,Email processing is very slow,The background processing was very poor,You should learn from DAN,DAN should be the best experience among all domain name trading platforms"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Prasanna Kumar Padala",
          "Nb_Reviews": 4,
          "Date": "2023-04-08T20:35:57.000Z",
          "Titre": "SAV is hopeless",
          "Contenu": "I have mailed them again regarding my Payment issues 1 time on the 5th April, 2 times on 6th April, 2 times on 7th April, 3 times today ie.... 8th April, but with the same answer that there is no problem at their end. I am able to make payments at GoDaddy & NameCheap at the same time with the same card, but not at SAV. I spoke to my Credit Card Customer Service Agent & they confirmed that there was no issue with my Credit Card, since I was & am able to use the same card online.SAV is hopeless when it comes to solving any issue, coz they have a very bad technical team who cannot address issues, but blindly blame others & step away. I'm tired & sick of their service. All this while I have not received even 1 call from any Customer Service."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Banjar",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T10:32:58.000Z",
          "Titre": "You Sistem REJECT my Gmail username…",
          "Contenu": "You Sistem REJECT my Gmail username when SignUp because mu email username have \".\" (dot character), really poor script, sad..."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Hussnain Raza",
          "Nb_Reviews": 24,
          "Date": "2023-11-20T15:32:36.000Z",
          "Titre": "not best any more",
          "Contenu": "Sorry to say disappointed with there schemes they blocked backdoor option for my account and forcing me to purchase domain to unban ithttps://ibb(.)co/ZKJDGsYhttps://ibb(.)co/ThS6yvK"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-11-07T04:38:42.000Z",
          "Titre": "We poor Support",
          "Contenu": "Very poor Support and poor panel, 11 Days completed 5+ Domains Issues not resolved."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "omar",
          "Nb_Reviews": 3,
          "Date": "2022-09-23T21:04:24.000Z",
          "Titre": "I registered more than fifty domains on…",
          "Contenu": "I registered more than fifty domains on sav.com and sold on it. I agreed with their terms and policies. After a while, they modified these policies and it was not suitable for me. I had to stay on the site and tried to manage my affairs in order to lose my money, but now they refused any MasterCard on the site and this is causing me to lose Big in buying and selling, I just want to go back to their old system, which I agreed to, this is a great loss for meI want a solution to this problem after your permission"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "mahesh",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T06:17:06.000Z",
          "Titre": "SAV.com fraud domain registrar",
          "Contenu": "I transferred my domain 13 year old vivahmantra.com to them and  is missing, when contacted saying that I listed in marketplace for 0.99 dollar after renewing it for 8.99 dollars, its a premium domain which was listed for 1000 dollars on sedo and now when I decided to launch a matrimonial website it is missing. Like this they  taking control of premium domains. Beware of domain registrar SAV.com, do not register or transfer the domains to them, if you already have domains there immediately transfer out the domains. They are not domain registrar, they are domain brokers who will sell your domain in domain marketplace. I already contacted ICANN to cancel their accredation. Instead of restoring my domain they are threatening that they we will it take it seriously, Very soon your business will come to an end just wait."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Prasanna Kumar Padala",
          "Nb_Reviews": 4,
          "Date": "2022-02-25T18:14:27.000Z",
          "Titre": "I have been having problems with 2…",
          "Contenu": "I have been having problems with 2 factor verification.I have activated 2 Factor Verification to my SAV Account. But, when I try to Login, I receive the code after 60 Seconds only. So the Code has long expired by the time I receive it.  This has been happening since the past 4 days. When I try to find help or file a complaint, there is no option of raising a ticket without logging into my account.There is no Info in Help regarding this issue. It doesn't make sense that I can't raise a ticket without logging into my account, when Logging into my account is the problem itself.I had to search Google & found an email at TrustPilot to forward a complaint. But I receive an Auto reply with the following msg.(Thank you for reaching out to Sav Customer Support. To provider faster resolution to support inquires and improve our security, we are ONLY ACCEPTING NEW TICKETS VIA OUR HELP CENTER. To submit a ticket please visit their website and login to your Sav account.)So, I am back to square one. Isn't this senseless, when Logging into my account is the problem itself ?P Prasanna Kumar"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Flo Vilmar",
          "Nb_Reviews": 29,
          "Date": "2022-02-02T09:20:15.000Z",
          "Titre": "Incorrectly tells people their domains…",
          "Contenu": "Incorrectly tells people their domains won't renew even though they're on auto renew. Support email doesn't work like an email should."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "omar",
          "Nb_Reviews": 3,
          "Date": "2022-09-25T10:03:42.000Z",
          "Titre": "Sav is the only site that when you make…",
          "Contenu": "Sav is the only site that when you make a bid site make authorized for the visa this make a lot of problems with my bank they think there is attempt to stolen the money from my card , why you just make a reserve price like all sites"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T09:11:41.000Z",
          "Titre": "SCAM company! Stay AWAY!",
          "Contenu": "After purchasing a domain the seller talked me into accepting it as a push at Sav.com instead of transferring it to a reputable company. What a mistake. I lost control of my domain. Sav support was slow to respond and when they did they did not acknowledge the problem. They blew it off. Now I am out of my money and my domain!EDIT: If I wasn't still pissed about what I lost due to this I'd find it funny that now Sav wants to try to help. Nevermind they initially ignored me when this was happening. Or that their first reaponse to this review was to instantly mark it as fake. Of course I had all the documentation to show TrustPilot it wasn't fake and to get this marked as verified instead. Then silence for months and now a reply they want to help. Too bad it's way too late the name is long gone. And I've learned my lesson not to deal with a fly by night company like Sav."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Richa Chandra",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T08:45:55.000Z",
          "Titre": "Sav.com denied transsaction asked to raise dispute, later CTO confirmed refund, but later denied framing further narrratives",
          "Contenu": "In the month of october sav.com has website latency, same can be verified by other user reviews on truspilot.com.Credit Card charged, but domains not booked.Merchant sav.com said over written correspondence, initiate c ahrgeback with bank as they can locate transaction.Later they said communication is valid through master card network and memebership banks.In the recent correspondence they have aagain written over the email that I do not have any active domains in my account + the same domin that they are trying to bill over my account, in the written correspondence they have said are available to be booked by anyone in the open market.Looks like either this is a website latency and operational issue within the cnflicting department or company is deliberately involved in credit card fraud.False allegation: The below comment by sav.com CTO nick that user deleted or transferred domain is false allegation. Their staff has accepted over the email that my account seems to have been hacked. The Nick is a man of poor integrity as after confirming return over email he is now framing answers to embezzle customers hard earned money. The company with a poor integrity. Why will I also delete domains that I purchased before these disputed transactions, and were not even under dispute."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Romanenko Andrey",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T05:20:57.000Z",
          "Titre": "The carolinapremierbank.com domain has not been renewed.",
          "Contenu": "Good afternoon.The carolinapremierbank.com domain has not been renewed.I paid for my domain renewal on July 27, 2023. The domain date was renewed on the rdn.name reseller panel. But I noticed that the date is not updated in whois.Wrote a ticket to rdn.name on August 1, 2023. In response, I received that the domain was blocked by the registrar and the registrar blocked the renewal / change of data for the domain.The domain has already been renewed and paid for by carolinapremierbank.com on 07/22/2024.I got a response from rdn.name“The registrar conducts domain checks to prevent fraud, phishing and copyright infringement.To activate the domain, you must provide a banking license, as the domain contains the word bank.\"This domain is not used as a bank, the word Bank in the name is just a domain name, nothing more. The domain uses the payroll application form for the aggregator. This is all spelled out in the disclaimer on each page of the site in the footer. Submit the Epp-Code for transfer, we can transfer the domain.But there is nothing illegal/fraudulent about the domain.I requested a transfer code but never received it.rdn.name canceled the invoice payment and received a response that codes for blocked domains are not issued.I asked to unlock the domain, to which I received the answer: \"We cannot unlock the domain. Try filing a complaint with IANN.\"I contacted SAV Support. The answer was that the issue should be resolved through rdn.name.rdn.name was told that they contacted about unlocking the domain, but nothing was ever done.Please resolve the issue, there is nothing illegal on the domain.In response, I provide information from whois (download from who.is)carolinapremierbank.comwhois informationRegistrar InfoName SAV.COM, LLCWhois Server whois-service.virtualcloud.coReferral URL sav.comStatusclientTransfer Prohibited icann.org epp#clientTransferProhibited"
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Anton Naydenoff",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T13:55:36.000Z",
          "Titre": "Sav.com is a haunted place",
          "Contenu": "As I said before names in your account at Sav.com have the very rare ability to just disappear from your account all of a sudden, and with no reason. I bought WUR.xyz in auction for $37 the other day and they transferred the name to me. Today I tried to find the name in my account because I had to change name-servers. Sadly the name is not there any longer. It has mysteriously disappeared. I guess it has traveled to a parallel universe or became a ghost and just left. Now I have to manually check all my names that are supposed to be in my account at Sav.com - one by one - to see what else is missing. I have to keep doing this on a regular basis in order to make sure I still own the names I have paid for. Hilarious! Try to imagine how safe I feel with Sav when I know that I keep names with them that I have bought for thousands of dollars. Has anyone experienced anything like that with other registrars?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Programmer Jen",
          "Nb_Reviews": 3,
          "Date": "2022-01-18T18:52:24.000Z",
          "Titre": "Horrible, incompetent, fraud registrar",
          "Contenu": "UPDATE:  Within an hour of leaving this review, Sav requested more info through Trustpilot. They still didn't respond to my initial ticket until 8 hours later...their response \"Looks like it's working\"...IT'S NOT WORKING, so I responded....STILL NO FURTHER RESPONSE, NO RESPONSE TO MY ADDITIONAL TICKETS EITHER! This is the main domain for my server, replacing it would require an enormous amount of work, lost clients, lost time. THIS IS UNACCEPTABLE. I'll be calling my lawyer by end of the day if there's still no response on this mess!If negative stars was possible that's what I would give. Where to start, upon transfer in my main server domain, they froze it saying I didn't update whois.. there was NEVER ANY EMAIL requesting this.. when confronting this, they claimed that they was sent TWO DAYS BEFORE TRANSFER REQUEST?? Howv is that possible?? I demanded auth codes for all domains to transfer away .. Never given. Haven't had time to deal with it, few weeks later need to update hosts IP addresses as I'm moving to new server.... Won't update, attempt to transfer out, auth code provided in the account is invalid!! Submit several support tickets, no confirmation email that they are received... Send email to support email for sav... Ticket created but auto reply says they don't accept email tickets and it will be deleted. No phone number, no chat... Customer support non existent. Ridiculous! I'll be filing a complaint with ICANN... In the meantime, I'm screwed with my server transfer because DNS won't update."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Trevor Cohen",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T14:28:27.000Z",
          "Titre": "Seven failed attempts to transfer an io…",
          "Contenu": "Seven failed attempts to transfer an io domain in from Uniregistry as payment form repeatedly issues \"cannot process Gateway error\" having used same account for prior transfers in and same account new registrations. Absolutely no response to my email advising of the issue to their support team."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Sunil",
          "Nb_Reviews": 4,
          "Date": "2023-06-29T15:10:34.000Z",
          "Titre": "Unexpected Rebilling and Misleading Practices From Sav",
          "Contenu": "Here's my experience with one of the most deceptive domain registrars I've encountered in my years-long career in domaining.In 2021, I placed backorders for domains set to drop that day, and those transactions were fulfilled without any hitches. However, fast-forwarding two years to 2023, some of these domains were dropped as per my decision not to renew them. To my surprise, these domains were re-back-ordered and paid for without my express consent.Upon raising this issue with SAV, their response was effectively shifting the blame onto me, suggesting that I should have manually deleted the backorders.I want to clarify that this wasn't a case of auto-renewal. This was a scenario where I deliberately allowed the domain to lapse, yet SAV chose to rebill me for the backorder.I made it clear to them that I was never informed about the need to manually delete backorders post-execution to prevent them from recurring indefinitely. Furthermore, I emphasized that I never granted them permission to use my payment method for any purpose beyond checkout transactions.Another warning sign I overlooked was the inability to independently remove payment options like PayPal or credit card. The requirement to reach out to their support for this simple action, coupled with their prolonged response time, should have given me pause.Having worked with numerous back-ordering services and registrars over the years, this is the first time I've faced a situation where I was charged for transactions that had been completed two years prior, and without my explicit consent.Stay away."
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Thế Tài Tin tức",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T16:33:06.000Z",
          "Titre": "sav.com lost my domain name",
          "Contenu": "sav.com lost my domain name. They did not explain clearly. The domain name I bought for more than $60 sold at auction for as low as $500. So I got 1$. Looks ridiculous. Cheat"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Empower Business",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T21:44:39.000Z",
          "Titre": "Very bad support, comms & domain management",
          "Contenu": "No violations have taken place on either domains as this was only ever forwarding to other websites and then this suddenly stopped without any communication. Unfortunately your response doesn’t solve the situation. Fortunately we have bought other domains for realassets.biz now at reassets.net and abinternational.biz now at abunitedglobal.com. We needed to change all marketing comms at great expense but we have been working with our current domain and web hosting company for over a decade so will continue to do so. Had we received information beforehand from Sav.com and not needed to write to you via support[@]sav.com without a response and then add a TrustPilot to actually get a response. The review will need to stand. As this will need to be the last time we buy any more domains from Sav.com. This will pose as a lesson learnt for your other customers or prevent them from using Sav.com at all. Happy to help...Update reply to an email to Sav:Hi, apparently there has been a violation in respect to spam for abinternational.biz when it has only ever been on a redirect and forwarded to another domain - so remove this ASAP so that serverHOLD can be removed. The same goes for realassets.biz with Sav and this is also on a serverHOLD as shown on ICANN. Remove this ASAP so that the domain can be moved to another registrar who is better equipped to service my business.--------------Original complaint:Perhaps this is the only way to actually get a response. For some reason two domains I have with Sav.com have been put on a ServerHold so this means I cannot transfer the domains out and this also means that the current domain forwarding is not working which I only found out about when clicking on the link. I agree that Sav is horrendous at customer support with no response from submitting a ticket. Please resolve above issue NOW look in your folder for support[at]sav.com about abinternational.biz ServerHold and the same within the submitted ticket."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle Sieber",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T00:52:37.000Z",
          "Titre": "Repeatedly denied me a domain",
          "Contenu": "I tried to purchase a domain name multiple times that was actively available. Sav denied me. So I went to GoDaddy and got it handled for not that much more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adventures & More “T”",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T15:36:02.000Z",
          "Titre": "Never completed purchase",
          "Contenu": "Get your blank together! This is income you are messing with!No respect!"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Robert Heorh",
          "Nb_Reviews": 4,
          "Date": "2022-03-07T09:36:19.000Z",
          "Titre": "My domains don't work",
          "Contenu": "My domains don't work, support don't reply on email tickets.heorh.agencymininglab.store"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Richa Chandra",
          "Nb_Reviews": 2,
          "Date": "2022-04-02T16:03:49.000Z",
          "Titre": "Honest reviews against unfair trade practic of sav.com CTO Nick indulge in unfair trade practice, Confirm return then not processing",
          "Contenu": "In the recent communication their CTO nick wrote: ()“Nick (Sav) March 30, 2022 8:24 AM (UTC-05:00)Hello. I read your Sav review and wanted to look into this personally. I do see that you paid for these domains back in Oct of last year but they are not in your account. I'm going to escalate this to our advanced support team to see what happens and make sure you get a full refund. My sincere apologies in advance. Best Regards, Nick R.CTO, Sav”In the month of October sav.com has website latency, the same can be verified by other user reviews on truspilot.com. Credit Card charged, but domains not booked. Merchant sav.com said over written correspondence, initiate chargeback with the bank as they can locate transactions.Later they said the transaction is valid through the mastercard network and membership banks.That means the company has double standards.In the recent correspondence they have again written over the email that I do not have any active domains in my account + the same domain that they are trying to bill over my account, in the written correspondence they have also said that domains are available to be booked by anyone in the open market.Company changed the storyline many times. In recent times, they were also selling domains that they claimed to be under my ownership on sedo.com. Later they again changed the story stating that it looks like my account was hacked. If for a moment I assume that I was owing the domain then how and when did they get a License from me to sell those domains on sedo.com?Their assumption: Sav.com is/are the smartest people on the internet, and the customer the most dumb.In the recent communication their CTO nick wrote: ()“Nick (Sav) March 30, 2022 8:24 AM (UTC-05:00)Hello. I read your Sav review and wanted to look into this personally. I do see that you paid for these domains back in Oct of last year but they are not in your account. I'm going to escalate this to our advanced support team to see what happens and make sure you get a full refund. My sincere apologies in advance. Best Regards, Nick R.CTO, Sav”Beyond the above correspondence with Nick, the corporation has stoppeed replying that means they won't refund.The corporation in which a CTO confirmed the refund, but later denies it. What kind of corporation is this who will trust w/o they showing any integrity?Whatever I have claimed above I am submitting proof for the same: All 6 PDF here:drive.google. com/drive/folders/1s1_sjnm4VLJkHDQEpARPp-l0FyUi2Q9xMerchant is in United Staes, and the Customer in India, which International body can Intervene? I think ICANN do not take domains disputes."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Zoriel Sto Domingo",
          "Nb_Reviews": 4,
          "Date": "2022-08-12T20:27:51.000Z",
          "Titre": "Very slow Platform",
          "Contenu": "Very slow platform. You got to wait a ling time before anything happens to your changes...."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Ali",
          "Nb_Reviews": 7,
          "Date": "2022-05-21T12:21:47.000Z",
          "Titre": "No Options to remove the Credit card",
          "Contenu": "They don't make any options to remove the Credit Card from the account!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Amiya",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T16:15:38.000Z",
          "Titre": "Unethical Domain Expiry Practices by SAV Registrar",
          "Contenu": "I have been a domain owner with SAV for several years. Recently, I experienced the loss of two of my domains, .io and .com, due to SAV's failure to send timely reminders about their expiry.The situation unfolded as follows:.io: SAV only sent one reminder before the domain's expiry and provided no further notifications. As a result, I unintentionally lost this domain, despite being willing to renew it promptly had I received adequate reminders..com: Similarly, SAV failed to send any reminders about the upcoming expiry of .com. Consequently, the domain expired and was subsequently auctioned off without giving me a fair opportunity to renew it.In contrast to other reputable registrars like Dynadot and Godaddy, who honor auction cancellation requests from current owners and allow domain renewal, SAV has refused to reinstate the domain in my account. This refusal, despite the registrar's clear lapse in providing essential expiry notifications, leads me to suspect that SAV may be purposefully promoting their auction platform by capitalizing on such situations.I am deeply disappointed and frustrated by this unethical practice by SAV, as it has resulted in the loss of my valuable domains and potentially puts other domain owners at risk of facing similar predicaments. I strongly believe that registrars should uphold their responsibility to ensure transparent and ethical domain management practices.I believe that ICANN's role in overseeing domain registration and management is critical in maintaining the integrity and fairness of the domain industry. By addressing this issue with SAV, ICANN can reinforce trust in the domain registration process and uphold the rights of domain owners."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Valantino",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T21:24:45.000Z",
          "Titre": "Sav support was good not now",
          "Contenu": "Sav support was good , but now for sorry no , new support agent ,cris, you not good for sav ."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Guest",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T16:27:27.000Z",
          "Titre": "Ignore abuse reports",
          "Contenu": "The registrar can't see sufficient evidence in abuse reports on domain names that host pure scam with illegal trademarks use and impersonate."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Muhammad Tahir Waqas",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T15:30:05.000Z",
          "Titre": "Not buy domains with Asian Debit Cards"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Huseyin Cemal Coban",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T08:39:17.000Z",
          "Titre": "Nice! But not so Nice!",
          "Contenu": "Nice services!Edit:I can not join bidding on auctions"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T22:25:04.000Z",
          "Titre": "BIG ALERT! DONT GO FOR SAV!! or GET SCAMMED",
          "Contenu": "SAV, which looks good at first glance is a very dangerous register ( indeed for your domains ) everything is good at SAV until I'm managing few domains , because of its cheap rate I started moving more and more domains to SAV from other registers , ( as I'm a domainer managing lot of domains ) domains which moved from other registers started to disappear without trace , which I bought in auction for 1000s of dollars , as soon as I found it I contacted the support , waited for two days , no reply from them , and wrote second mail , waited for 3 days yet no reply , and I found out I'm not the only one came across this scam , you can google \" Be careful with SAV registrar \" you will find similar stories , I have all the proofs if someone needs. DONT GO FOR IT BECAUSE OF LOW PRICE \" You will regret the experience , and if you find any urgent issue to be resolved for example if you forget to renew a domain , THERE IS NO LIVE CHAT SUPPORT , AND THEY TAKES WEEKS TO REPLY TO YOUR MAIL!!"
        },
        {
          "Note": 1,
          "Lieu": "GG",
          "Pseudo": "torr priaulx",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T12:07:14.000Z",
          "Titre": "Absolutely terrible customer support.",
          "Contenu": "Absolutely terrible customer support.Three weeks to list two domains on there auction site. Reply without any solutions to the problem, which takes them a week for every reply. You can't reply to any tickets, you have to submit a new ticket each time that then gets forwarded on. By far the worst customer support I have ever experienced."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Klara",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T14:38:45.000Z",
          "Titre": "Sav.com stole domains from my account!",
          "Contenu": "Sav.com stole domains from my account. No phone, no chat for contact. Very rude answers via email. Strongly NOT RECOMMENDED!Update: these crooks responded here less than hour after negative review while they never answered questions about the domains they stole from my account and then listed on their platform for hundreds and thousands of dollars. Everybody should boycott this criminal company!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T17:41:41.000Z",
          "Titre": "Horrible service",
          "Contenu": "I bought a domain and it was parked on sav.com. It was initially blocked for a few weeks and I could not transfer it. Then all of a sudden it expired and I could not transfer again. I renewed it accordingly and that was not taken over by the system. After several requests to the customer service, which could not give an appropriate answer, the domain was transferred by some other domain provider.The customer service is terrible and not able to. Never again."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Nicolaj",
          "Nb_Reviews": 4,
          "Date": "2021-05-03T08:41:11.000Z",
          "Titre": "Never got an email in regards to Whois…",
          "Contenu": "Never got an email in regards to Whois verification. Suddenly my domain was offline without any notice or email at all. It was only because of my alert service that i saw this issue. Customer support is not avaiable so i have to wait up to 2 business days before my website will be online. Thanks for nothing.Ps. your SPF record is invalid which might be the reason why your emails are getting dropped. Too many dns lookups..Pps. Ofc i ended up transfer out! you were not helping at all. you held the domain hostage.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T16:57:30.000Z",
          "Titre": "Poor service at its best!!!!!",
          "Contenu": "Poor service at its best!!!!!! Run away from this company. If I could give negative stars I would. I'm very disatisfied!!!!!!!!!!!!!!!!  They claim to provide service but SAV is telling you to SAVE YOUR MONEY AND RUN. This site is a FRAUD!!! Their phone support is fake. Their support response takes days to get back. There isn't anyone there to help."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-01T13:34:56.000Z",
          "Titre": "If you faced any issue with SAV there is no customer support",
          "Contenu": "If you faced any issue with SAV , There is no customer support on chat, and forgot about email helpdesk, I sent a mail 3 days ago, still no response,  If you are someone , who needs quick troubleshooting your concerns , SAV is not for you"
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "HuFeng",
          "Nb_Reviews": 2,
          "Date": "2021-04-15T02:26:32.000Z",
          "Titre": "STAY AWAY FROM THEM!!!",
          "Contenu": "Sav.com expired my domain after my renewal!!!I renewed my domain on 2021-04-10 but sav.com expired my domain causing my project shut down. My costumer can NOT visit my site anymore!!!What an amateur team. Stay away from them. Never use their service!!! Stay away from them!!"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Bahaa Sholy",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T19:49:30.000Z",
          "Titre": "I have bought a premium domain and I…",
          "Contenu": "I have bought a premium domain and I can't see the domain under my name, I have emailed the support more than 5 times without any response.There is no live chat, Phone to call only stupid email and no one is responding.I don't recommend dealing with them at all."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Faisal Khan",
          "Nb_Reviews": 4,
          "Date": "2021-05-11T19:09:41.000Z",
          "Titre": "Beware before you use save.com",
          "Contenu": "Beware before you use save.comIt will change your life permanently. It has zero customer service and technical abilities. If there is any issue arise, you have to rely on GOD. Only he can help you, because sav will not respond your request. Most importantly they have no communication channel. If you are lucky enough they will reply you after few days and will advise you completely wrong.A domain registrar has no capability to change custom nameservers or DNS propagation, is unbelievable. So dear customers beware you might buying headache if you choose to use sav."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "awais.qadir",
          "Nb_Reviews": 3,
          "Date": "2021-05-24T21:23:17.000Z",
          "Titre": "I won 2 bids in an acution from SAV.com…",
          "Contenu": "I won 2 bids in an acution from SAV.com that was already owned by SAV.comSAV charged the payment from me but Domain never came into my account for soo many days. Upon asking there contact support centre, I got a one line reply\" our team is working on it and other customers are facing the same issue\" They didn't even bother giving a timeline or to say we apologize for the inconvenience. Pathetic customer services.Domains showed in my account after so many days and that too after sending them 32 emails for reminder. SAV is pure anxiety and pain in the A**."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2020-07-28T08:56:58.000Z",
          "Titre": "Horrible, they lock your domain for 4 months!",
          "Contenu": "Horrible. Imagine spending a lot of money on a premium domain, only to find out that THEY LOCK YOUR DOMAIN FOR 4 MONTHS! First they lock your domain for a month if you buy it with a creditcard. To unlock it they want to have ALL YOUR CREDITCARD info, without properly explaining why (which is pretty shady). Second, after the first month, they lock it for another 3 months because you bought a premium domain haha...This has to be the worst domain reseller from a customer and business point of view that I ever encountered...please don't fall for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A New Customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T23:02:00.000Z",
          "Titre": "signed up",
          "Contenu": "signed up - and does superficially look very good.  However, the site is almost impossible to forecast and so when I wanted to set to my own name servers I can not find where/how to do that.  Called their published support number.  It is a joke, says you must leave a message and that they ONLY respond to law enforcement.  Sent eMail, no response.  Obviously this is all personal experience and opinion.  The technology is probably pretty good.  Signing up was a breeze.  It is just documentation and support that seem to stink!I did just get a response, amazingly coincidental to my bad review.  Anyway, the info in the response is WRONG!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-29T19:24:40.000Z",
          "Titre": "If you want crappy customer service you've come to the right place!",
          "Contenu": "Can't reach anybody period and so far the customer service has been as bad as bad gets. Really have to try to get worse period Then when you call it says they only take or return calls from law enforcement officials."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-20T07:13:41.000Z",
          "Titre": "Renewed a domain a month in advance",
          "Contenu": "Renewed a domain a month in advance.  A domain I was not planning to renew.  Would not refund.  GoDaddy, Dynadot, Epik, Namecheap and Namesilo do not renew 30 days in advance.  BUYER BEWARE"
        },
        {
          "Note": 1,
          "Lieu": "CI",
          "Pseudo": "Francky",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T14:29:23.000Z",
          "Titre": "They are domain thieves",
          "Contenu": "They are domain thieves. I bought a domain from their site and tried to add a fixed price to it. But that day, the connection to the site was very bad. To my surprise, three days later, I found that my domain name was up for auction on the marketplace for $ 1, a .com domain name. Biggest joke I have ever seen from a domain registrar. Immediately I contacted their customer service to notify them of my refusal to take part in this auction masquerade. And, there I got the most rude answer I have ever had on the net. Frankly their customer service is very rude. I advise you if you value the integrity and the preservation of your domain, never to subscribe to the service of this company. I had 10 domain names with them, I have all transferred. They are just dishonest people"
        },
        {
          "Note": 1,
          "Lieu": "AZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T14:07:34.000Z",
          "Titre": "Child name server (glue records or…",
          "Contenu": "Child name server (glue records or private nameserver) must be change only via email (not online). At the customer panel this is unavailable and email answer waiting  time : min. 48-96 hour (mon-fri)"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Rajveer Thakur",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T02:51:54.000Z",
          "Titre": "Poor Support Service",
          "Contenu": "I transferred the domain to sav on 26th March and as of now my domain transfer is pending. I have also mailed support, but I have not received any reply yet and my website has been down due to this."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "lucidhost",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T15:02:50.000Z",
          "Titre": "very bad customber support team  service",
          "Contenu": "very bad service1. customber support team is not active: support team is very lazy type staff just time spending working. they will unwilling to response my complain.due to negligence of support team mr. mathew my 23 domain is mistakenly iniciated auction and support team is unable to cancel this error in timely manner.2 he has no enough knowlege to support custermer.3. he is not eager to help customber.4. its look like company has only one staff who has heavy work duty and not provide support in time and staff just working as a formality.5. my 23 domains is now transfered from my account to another account.then i lodged a complain with icann.org regarding registrar mishadling of customer services by sav.comall happening of this is responsible for sav.com"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Kelvin W",
          "Nb_Reviews": 4,
          "Date": "2021-01-07T11:47:59.000Z",
          "Titre": "Preventing transfer of my domain",
          "Contenu": "Premium Domain Purchase of ****.com for $280.00 on 24-09-2020. I tried to move my domain on 05-01-2021 because I want to launch my website. Sav.com is forcing me to wait untill 10-01-2021 for no apparent reason. Emailed support to request the release of my domain but they replied that I bought the domain 60 days ago. 24-09 is more then 60 days. This company will force, restrict and apply cheap tricks to continue there hold on your domain.Never register your DNS at a company that limits you in anyway because it will costs you valuable time and money if you need your domain for your business.Sav.com is a business that I cannot recommend because they costs me hundreds of euros because I was not able to shift gears in a professional matter!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Mavashev",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T15:49:07.000Z",
          "Titre": "DO NOT BUY. SCAM ALERT.",
          "Contenu": "I came to Sav to purchase a domain I was looking for. It was listed for $266. My business partner purchased it to reserve it for us, and it showed \"In transfer\" on his Sav dashboard. I had him cancel it so I could purchase it on the proper business debit card, and it said \"In transfer\" for a week on my dashboard. Then, the landing page price went up to $3200. I then received an email saying they no longer owned the domain, but saw that the price of the domain went up to $9999. This is a classic example of Domain running. Sav saw that there was interest in the domain and hiked up the price to maximize profits. They are offering me a refund but this is just clearly dirty business tactics. An embarrassing excuse of a \"domain registrar\". Worse than a car dealership."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Tronson",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T20:01:53.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service. Ignore all these fake five star reviews. Read the forum threads at NamePros instead for a true picture of how awful this company is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "npactmarketing",
          "Nb_Reviews": 4,
          "Date": "2021-07-29T14:06:02.000Z",
          "Titre": "Stole my domains for 96 Cents",
          "Contenu": "Stole my domains for 96 Cents! I listed 2 domains for sale through Sav auctions, I thought maybe if I started the auction with 0.00 min. bid I could draw more bids, the auctions ended unsold, 2 Days After the auction ends I get email from Sav claiming my 1st domain sold for 96 Cents, then I get another email the following day claiming I had another sale for 96 Cents, these domains were worth Far more, and I was fine with the auctions ending unsold, but how do you all the sudden tell me my domains sold Days Later, after auction ends but for only 96 Cents. I know what you are doing, I read how you guys buy the domains and Resell them for far more based on value, of course I can not prove this, but I promise you if I find out you Resold my domains at any time, I will contact the authorities. If the domains Really did sale to a Real Buyer, then why can't I see Any contact information for the so called buyer?"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T14:14:22.000Z",
          "Titre": "I can't pay because of the ridiculous…",
          "Contenu": "I can't pay because of the ridiculous and unthinkable security systems. They respond very late to support request.Google Translate Sorry"
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "Huang Shao",
          "Nb_Reviews": 5,
          "Date": "2021-03-08T02:12:07.000Z",
          "Titre": "Bad marketplace and helpless support",
          "Contenu": "STAY AWAY FROM SAV.COM. STAY AWAY FROM THEM!Really bad marketplace to sell domains! I regretted to sell one domain on Sav's domain marketplace because you can't cash out your balance! They are helpless when filling the payout form. So disappointed.Added after the reply: you have time to reply to the review here but don't have any time to respond to my emails? I have sent several emails to Sav support but the support disappeared again without any clues leaving my problem unsolved. What a poor support!!!> updated on 2021-03-08: sav.com push a V2 domain manager panel which force every one customer to use it  and there is so many bugs that are never tested! They change your domain name DNS server to ns1.sav.com and NOT allowing you to set YOUR OWN DNS name servers! Resulting in my DNS records fails. Emailed them, they don't response to you!!!STAY AWAY FROM THESE SCAMMERS."
        },
        {
          "Note": 1,
          "Lieu": "TV",
          "Pseudo": "Unknown name",
          "Nb_Reviews": 2,
          "Date": "2020-07-04T19:21:16.000Z",
          "Titre": "Capture is weak and the added rear…",
          "Contenu": "Capture is weak and the added rear layout is not deleted immediately.  backorder is not deleted when wanted to give up, but dropping has not been done yet."
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "HuangShao",
          "Nb_Reviews": 3,
          "Date": "2021-02-12T06:14:03.000Z",
          "Titre": "Poor development team and money cheater",
          "Contenu": "There are always bugs out there when you want to manage your domain on Sav.com. You can't change your domain DNS or request a auth code to transfer out your domain to other registrar. The dev team seems so amateur!Money cheater facts: I placed a domain backorder on 2019 and Sav got the domain for me but I decided to let the domain expire a year later. They automatic backorder the same domain and charge me! Event I let  the exact same domain name expire! I then fired a support email for this but got no response ever since(7 days already). What a money cheater and helpless support!STAY AWAY form this!EDIT AFTER REPLY:Sav.com will never response to your email and get things resolved. They just reply here and say some good words but never solved things. For my case, they still not responsed to my refund request email and say some good words here just for public relationship. They are thieves. Stay away from them."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T16:26:18.000Z",
          "Titre": "the site lags very strongly",
          "Contenu": "the site lags very stronglyit is not possible to buy anything error conditionorders from the basket are constantly disappearing"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tony",
          "Nb_Reviews": 4,
          "Date": "2021-04-06T22:38:52.000Z",
          "Titre": "Customer support not available!",
          "Contenu": "Customer support not available! Need to point DNS to GoDaddy server and not been able to do as this system doesn't work properly!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Mourad Al Damarawy",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T22:08:24.000Z",
          "Titre": "No Reply on Support Tickets",
          "Contenu": "I had been in the business for 23 years , I never witness a bad support like this company for many reasons I do NOT recommend SAV :I was about to transfer my 200 + domains from other registrar (Godaddy in my case) but thankfully I started by only one to test their services after many negative reviews, unfortunately there were a typing error on the domain provided , but strangely their system accepted the \"Authorization Code\" to transfer me to their payment gateway !After I noticed the error I sent them a support ticket request to refund my money as according to their disclaimer statement for domains that didn't land to Sav are eligible for refund but I got no reply for 2 days now !my third complain is that they do not have a ticketing system or chat so there is no way to communicate with them except to sit by your main waiting for days with no REPLY !.their website does not support mobile versions under \"my account\" so I have to \"Display as desktop version\" every time I have to visit their website."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Avatar Lodi",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T08:26:24.000Z",
          "Titre": "The portal is not user friendly to…",
          "Contenu": "The portal is not user friendly to update the host name and name server and support system is also very bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T15:31:01.000Z",
          "Titre": "Buggy",
          "Contenu": "System still have some bugs to work out. Support just wants to brush them under the rug instead."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2021-04-01T19:42:07.000Z",
          "Titre": "Review",
          "Contenu": "I am unhappy that Sav.com charged me 7,95$ Because backorder must cost 6,95$ For .com .Thanks"
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "xiao cuitang",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T10:29:30.000Z",
          "Titre": "I can't use Alipay to pay."
        },
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "Dimuthu Sasanka",
          "Nb_Reviews": 11,
          "Date": "2021-01-31T12:03:00.000Z",
          "Titre": "I want delete my domain but no option…",
          "Contenu": "I want delete my domain but no option for it. They charge monthly fee. Bad website."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Олег Бетехтин",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T10:41:09.000Z",
          "Titre": "not very convenient and understandable…",
          "Contenu": "not very convenient and understandable service"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-04-12T15:55:35.000Z",
          "Titre": "After register domain name can't use…",
          "Contenu": "After a register domain name can't use custome nameserver. and free ssl is layer."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T01:02:21.000Z",
          "Titre": "Not follow icann rule.",
          "Contenu": "Not follow icann rule.now available sufficient human resources."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T20:59:20.000Z",
          "Titre": "They have no idea what they're doing!"
        },
        {
          "Note": 1,
          "Lieu": "EC",
          "Pseudo": "Dave",
          "Nb_Reviews": 22,
          "Date": "2021-01-22T20:31:06.000Z",
          "Titre": "SAV Auctions sucks, they fail to charge me now they want to ban me, No solution offered!",
          "Contenu": "I won an auction for a domain at SAV, they claim the payment did not go through, (I will explain this later) But now I am being threatened by SAV with mails they do not answer, saying I will be blocked out of auctions for \"not paying\" for the domain I won. The payment was not processed they claim, which is not true because all my cards on file with SAV and PayPal are active, triple checked and NO CHARGE was made for this auction, and other SAV backorders went fine, how can they can explain this?It is obviously SAV´s fault, but they are taking it on me the customer, failing miserably to process a simple charge or offer a simple link to pay.EVEN WORST.SAV Support is really SLOW and answers after 48 hours with no solutions but with more excuses NOW SAYING they will Auction again the domain I won!!HOW CAN I PAY THEM?SAV DASHBOARD has No link or tab or any other way in their system for clients to Check the Status of an auction, nor to PAY for a won pending payment auction.NOTHING, they run on a pretty weak/lame dashboard to say the less and offer no solution but pass the blame on the client???I have 3 forms of payment added to my SAV’s account I have asked several times to be charged/invoiced or simply Give me a link to pay, the answer?SILENCE, Clearly they would rather stay quiet and offer NO solution and go auction the domain I won, back while blocking me out, in the process.My hands are tied!Note that I've been registering and backordering domains with SAV every week while this happened and ALL charges went just fine, the same day I won the auction they kept charging me normally for other services! How can they explain that?WITH THE AUCTIONS they have clearly lost heir North, affecting my interests with delays, threats and silly excuses, will they block me? At the same time they do not charge me, nor they offered a simple invoice or link to PAY for the auction I am running in circles and no solution so far. Will keep you posted guys.My opinion: \"SAV, auctions\" Not recommended!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Prasanna Kumar Padala",
          "Nb_Reviews": 4,
          "Date": "2023-04-07T08:24:38.000Z",
          "Titre": "SAV is the WORST Domain Registrar",
          "Contenu": "I take back my Words.SAV is the WORST Domain Registrar I have seen till date"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T09:02:22.000Z",
          "Titre": "They banned all of my domains."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Rajesh Kumar",
          "Nb_Reviews": 2,
          "Date": "2021-02-13T15:21:11.000Z",
          "Titre": "bad service",
          "Contenu": "bad service.not good policy"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 52,
          "Date": "2022-09-14T13:57:27.000Z",
          "Titre": "naff website, unable to login to make domain changes.",
          "Contenu": "naff website, waiting for two factor verification code that never arrives.useless.>>> updatei tried login again a few days later, the sms code arrived.however, customer service doesn't exist."
        },
        {
          "Note": 2,
          "Lieu": "CN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T02:59:46.000Z",
          "Titre": "Bad experience, poor function",
          "Contenu": "1. No api interface provided, domain name registration2. No account pre-deposit function is provided, so you have to swipe your card every time you spend3. Credit card swiping, often refunds, resulting in order failure, especially domain name registration, domain name transfer, and other operations"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Austin Zechar",
          "Nb_Reviews": 10,
          "Date": "2022-10-09T01:01:29.000Z",
          "Titre": "has gone downhill in 2 years",
          "Contenu": "It has gotten worse since I left this review. I've been working to transfer all my domains away from Sav due to many reasons, but the main ones being slow support, and them making it so domain transfer's need you to contact them before the transfer accept button even appears (but they don't tell you that). Don't recommend. It is 2 star's because their domain pricing is some of the best."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-22T11:23:02.000Z",
          "Titre": "Slow service"
        },
        {
          "Note": 2,
          "Lieu": "TV",
          "Pseudo": "Unknown name",
          "Nb_Reviews": 2,
          "Date": "2020-02-21T20:48:32.000Z",
          "Titre": "There are some errors in the user…",
          "Contenu": "There are some errors in the user panel, even dynadot gets domains that will fall before sav.com.  it should be faster.  Networksolutions dropcatch must pass them."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T11:36:12.000Z",
          "Titre": "Cheap but update information very slow…",
          "Contenu": "Cheap but update information very slow Thx."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "AR media",
          "Nb_Reviews": 6,
          "Date": "2022-12-12T14:27:08.000Z",
          "Titre": "It looks like SAV stole our domain name! [They fixed the issue]",
          "Contenu": "Update on the review: They fixed the issue and released the domain name back to us, it’s being pointed to our name-servers now, but only after we made the review and exposed them here on TrustPilot. They still haven't replied our messages and tickets.We will keep all domain names with them, for now, but we will be very reluctant to register any more domain names through SAV. If another similar problem comes up again, we'll might have to drop SAV and move our business to another registrar. Let's see..  it's in their hands, they will keep us if they start acting professionally. ———————————Original review (1 star): ———————————We paid the renewal of an expired domain name in time, within the Grace period for .COM TLDs, but SAV although they took our money and the renewal went through with global DNS and Whois records, they parked the domain name to their own name-servers without our authorization obviously, resulting to our client's website to be down. SAV is not even replying to our messages about it. It looks like they stole our domain name. So disappointed, we thought they were a good service. We have hundreds domain names registered with SAV, we will be moving them all to other registrars, if this is not solved ASAP."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Алекс Ч",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T16:05:06.000Z",
          "Titre": "50 dollars stolen",
          "Contenu": "They sent a cheque for $9.88 for the auction, they charged themselves $50, even though the bids didn't even reach that price!I can attach evidence!-------------------------After a week and a half of investigation, the money was returned, but my experience with the company has been negative."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Doug Shortt",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T17:23:54.000Z",
          "Titre": "Trying to Change Name Servers for 2…",
          "Contenu": "Trying to Change Name Servers for 2 domains. I've sent 2 emails to support in the last 4 days and zero response. I've tried updating them 3 times and it's not working. So far I've wasted 4 days on this which should only be a 5 minute job.When I enter the new name servers and hit update nothing happens. This kind of basic function should never be a problem.UPDATE: I guess to get a response you need to leave a bad review. Anyway got it sorted out. Thanks guys."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "JB",
          "Nb_Reviews": 3,
          "Date": "2022-08-14T13:56:16.000Z",
          "Titre": "Dear Sav,",
          "Contenu": "Dear Sav,I am struggling with the lack of external customer support. There needs to be a way of contacting the support without having to access the help support upon login - Problem is I have relocated overseas and changed my mobile hence can not receive the 2FA number. And now can not login in. Please guide a safe and secure option. Many thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lucky Soni",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T10:28:10.000Z",
          "Titre": "Sav takes responsibility to take money but at refund its a big fuss",
          "Contenu": "I am facing the problem repeatedly with the sav auction system; it deducts money even if the proxy bid has outbid you whereas it should be deducting money on bids which are eligible for \"winning category\"my more than $700+ are stuck with bank as they have no idea whether sav.com refunded the money or not, most of the times i get money back into the account within a minute but if it's stuck it takes forever to find."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Shepperd",
          "Nb_Reviews": 3,
          "Date": "2022-08-17T21:12:15.000Z",
          "Titre": "Liked their price and eventually a good resolution…",
          "Contenu": "I am amending my previous rating because the company did finally admit their mistake and correct it. They put the domain in my account as they said they would. I regret for their sakes that it takes threats from individuals to get their attention and response from sales support. Customer service should have been all over any problem that anyone has almost instantly. There are too many chat applications available to not have something. Even a chatbot would give better replies than dead air. I have worked in and run customer service departments for over 30 years so I do know it can be done.Liked their price. Ordered my domain name and then approved using PayPal. Went through fast and then PayPal sent me back to Sav.com for completion. That is when the problem started. Nothing but spinning wheel for 2 minutes and then page says that my account is set up but they will send me an email when everything done. I went to bed and this morning I have an email from them saying they had problem with PayPal (no way used that account for years) and domain name purchase could not be completed. I followed all the links including going to PayPal which did not show a problem. Back to Sav.com and now they say the domain name is no longer available."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Soner YILDIZ",
          "Nb_Reviews": 3,
          "Date": "2022-03-05T17:35:04.000Z",
          "Titre": "domain names are put up for sale when…",
          "Contenu": "domain names are put up for sale when they expire. They are taken from your panel"
        },
        {
          "Note": 3,
          "Lieu": "ET",
          "Pseudo": "Mikiyas Adefris",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T15:53:33.000Z",
          "Titre": "Give online coruse",
          "Contenu": "Create a job that is good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cyber Factor",
          "Nb_Reviews": 3,
          "Date": "2022-10-21T22:02:13.000Z",
          "Titre": "Slow response"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T05:20:05.000Z",
          "Titre": "My first live chat experience",
          "Contenu": "My first time using live chat. Not satisfied that I have to remove my name from the listing and then re-add it if I want to change the price on my name. I asked other questions about turning my parking on and off. Not satisfied with the explanation via chat. 🙁"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Lena",
          "Nb_Reviews": 2,
          "Date": "2021-04-23T11:53:33.000Z",
          "Titre": "The domains are cheap but the platform…",
          "Contenu": "The domains are cheap but the platform is not very good and the automated messages are not correct. An example there is irrelevant information and messages particularly relating to the non-verification of the domain when this had already been done and the message deleted, so how is anyone supposed to verify. Plus the verification link doesn't seem to be connected to a bonafide WHOIS verification link. Just sloppy!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "John X",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T04:06:28.000Z",
          "Titre": "Bad first timer experience",
          "Contenu": "I have to admit it was my mistake not to read the terms and conditions carefully at first. I was testing the domain marketing and auction features, then I lost almost all of my domains as they were put on the action during the testing, and there is no way to take it back. The responses from Sav customer service was in time and helpful in the beginning, but they were not helpful in the auction case."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T17:38:15.000Z",
          "Titre": "Good price, but no basic bulk update option",
          "Contenu": "Everything is good overall. The price is good. But there is no basic bulk update option if I want to change nameservers for multiple domains at once. This is very inconvenient.  I'm not a developer but I feel it's not a highly complex feature to implement since most registrars have it. Sorry if I'm wrong. Keep growing! :)(also would be good if we could add more than 2 default nameservers)"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-03-11T07:58:16.000Z",
          "Titre": "Sav lacks Customer Service",
          "Contenu": "The website lacks a serious customer support feature, I sent an email two days ago regarding a failed purchase for which I was charged, I am still waiting for a reply.I wanted to transfer my domains to sav but then I stopped because of this very slow support."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Salvatore",
          "Nb_Reviews": 4,
          "Date": "2021-12-13T19:54:06.000Z",
          "Titre": "Your site is buggy",
          "Contenu": "Your site is buggy, There were few domains which I had to buy through other Registrar because your site says not available.Overall I think it was a new experience."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T21:54:31.000Z",
          "Titre": "Error 504 Ray ID",
          "Contenu": "Error 504 Ray ID: 57c50b6e8a6f1772 • 2020-03-30 21:50:09 UTCGateway time-outIt's hard to tell whether my order went through or not - though I received a receipt email. dosnt look very trustworthy :/"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neelesh",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T13:19:47.000Z",
          "Titre": "No bulk update tools, no way to sort domain list online, you need to download the list",
          "Contenu": "No bulk update tools. You need to open a page for each domain to make some changes. You can't sort the list of domains by name or date of expiry. All these things will need to be done through customer support, which is not so helpful in many cases. I have 100+ domains, to change domain contact, auto renew status or nameservers, I have to go to each domain and update. Sorting would have been useful if i need to find, which domains are expiring soon and click renew. Now I have to download the list, sort in Excel and then go back to sav.com. API option is for developers, I am just a normal user who has domains.Update: Nick from Sav.com helped me get what I wanted to do with bulk of my names and I am very grateful to him for the support provided in quick time."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T16:19:58.000Z",
          "Titre": "The bidding system is not fair",
          "Contenu": "The bidding system is not fair, the domains I bought on my own are also bidding, it is very unreasonable to take 10 days. the website is not very detailed and needs to be developed."
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "PHAM",
          "Nb_Reviews": 4,
          "Date": "2021-02-13T16:25:03.000Z",
          "Titre": "About domain name only",
          "Contenu": "About domain name only: The price is ok, non free email forwarding, sometime get problem at payment"
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T04:58:22.000Z",
          "Titre": "Unable to purchase domains by PayPal…",
          "Contenu": "Unable to purchase domains by PayPal account. No choice for update name servers more than 2."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Veronica",
          "Nb_Reviews": 2,
          "Date": "2021-12-03T05:47:44.000Z",
          "Titre": "UPDATED: Problem Solved by CEO involvement, many thanks to him.",
          "Contenu": "If I could give no stars I would. This has to be one of the worst transactions I have made on the internet. I hope someone finds this page on time and actually sees the real reviews between all the greenery. I bought a domain name got my private practice and tried to get it set up with my host. The host was having a horrible time trying to troubleshoot. I worked with an independent contractor who buys and sells domain names and he even said that what was happening to my account is wrong. That it shouldn't have taken days to take my domain name off the market (IT STILL WAS UP THERE) especially since my card was charged right away and under \"my\" ownership. I emailed once and when they replied with the same cookie-cutter response I lost it. I read all their agreements. The domain name I know is a loss, but this was ridiculous. ONLY a law enforcement number is provided... how does that even work. I guess let's test it out! No domain name is worth having to go through that nightmare.----------------------------------------------------------------------------------------------------------------------------------UPDATED!!! On Oct 22, The CEO Nick Roskam reached out personally to assist me with my difficult situation via email. He was able to solve the issue by lifting the lock on the domain to transfer out. Without his help, I wouldn't have had peace of mind. Thank you, Nick. VG"
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T14:16:01.000Z",
          "Titre": "Customer service is not good and many…",
          "Contenu": "Customer service is not good and many emails don’t answering"
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T17:45:03.000Z",
          "Titre": "Fantastic pricing",
          "Contenu": "Fantastic pricing, simple to use interface but lack of features."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T04:23:26.000Z",
          "Titre": "improvement of service is needed",
          "Contenu": "no expedite transfer option.no live chat support."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T01:12:47.000Z",
          "Titre": "Still Need Improvement!"
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T08:36:43.000Z",
          "Titre": "Phone is not tip format"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raj Pate",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T20:18:54.000Z",
          "Titre": "Resolved fix the issue paid lot for domain",
          "Contenu": "Resolved thanx"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Khayelihle Khuzwayo",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T14:24:21.000Z",
          "Titre": "It when I started making money online…",
          "Contenu": "It when I started making money online on this site not scams and getting a real savvy"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Mohamed Abd",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T20:54:13.000Z",
          "Titre": "Its solved",
          "Contenu": "Thanks so much for CTO/Nick He helped me to solve my problems with Sav.com, So I decided to edit my review and forgot the past Thanks to his efforts I didn't want to write this review but I have to write this reviewI am old customer with sav .com more than 2 yearsBut i have very bad experience nowadays I have bought some domainsAnd paid 82$suddenly they message me the following (Sav recently discovered a pricing error within our system that mistakenly sold some domains at a 75% discount where no discount should have been applied. The following domain(s) in your account were sold at an incorrect price )"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Hammad Hanif",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T19:39:30.000Z",
          "Titre": "Nice Services But One Repetitive Issue!",
          "Contenu": "Nice Services! Supportive Support!Only One Issue.. Most of the Times Credit Card had been Charged but Domins were unable to arrive at Dashboard.Later on, Refund had been made automatically and We have to purchase those domain again but this repetitive issue is much annoying & disturbing! Plz fix this issue as we never faced such like issue on Other Domains Registrars."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Nguyen Hien",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T16:58:45.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, good auction, but the payment is too old-fashioned, long wait. and should edit the web code very easily to create an account after the domain name auction, so you can buy the domain name again."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Strange",
          "Nb_Reviews": 2,
          "Date": "2022-10-30T07:32:06.000Z",
          "Titre": "You should send a reminder email before…",
          "Contenu": "You should send a reminder email before renewing any service.Edit: The amount was refunded after I contact with the support, Thanks"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "junaid najam",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T15:14:48.000Z",
          "Titre": "No Live Chat Support",
          "Contenu": "Fast payment methodeasy to useeasy to setupbut live chat and email support is not available(i have issue with two factor authorization but there is no live chat support to solve)"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Kelvin",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T04:39:52.000Z",
          "Titre": "Reading that's what made my experience…",
          "Contenu": "Reading that's what made my experience great.Gives people time to work on their reading skills."
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T08:17:43.000Z",
          "Titre": "price is good enough",
          "Contenu": "price is good enough. Need better support feature. And also have to improve payment with account credit"
        },
        {
          "Note": 4,
          "Lieu": "MZ",
          "Pseudo": "Mauro Sadala",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T00:14:08.000Z",
          "Titre": "I need upload my site for my domain…",
          "Contenu": "I need upload my site for my domain name, but i don't know how."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Amit Sood",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T21:45:32.000Z",
          "Titre": "Stock",
          "Contenu": "This website very helpful to make money for study"
        },
        {
          "Note": 4,
          "Lieu": "NP",
          "Pseudo": "Madan",
          "Nb_Reviews": 2,
          "Date": "2021-11-08T09:40:25.000Z",
          "Titre": "Good Pricing, Decent Customer Care",
          "Contenu": "They are good with their pricing. Probably the cheapest option there but that do not justify their horrible customer care. They only seem to respond via email and that too is taking me 2 days+ to address the issue. I hope they fix it and I'll come back here again to update my review, if they do.Edit: They were able to fix my issue just after few hours of writing this review. So, I added one more start."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A. Pringle",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T19:52:59.000Z",
          "Titre": "Perfect for what I wanted",
          "Contenu": "So far, so good. Absolutely no issues. I put down the domains I was interested in and for what cost I'd be willing to buy them and left it at that. They monitored everything after that. A couple days before the domain becomes available for purchase I receive notice, providing opportunities for changing mind or payments, and then when the sale completes I get a receipt for the purchase. It's great, they have provided domains for amazing prices."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "dave",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T21:41:51.000Z",
          "Titre": "Great drop catching service but lacks tools",
          "Contenu": "Great drop catching service.  Very basic user interface and domain management tools.  Would like to see bulk tools added for portfolio management as well as an option to download domain list.  Would also be great if sav was a member of the afternic fast transfer DLS."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sandip Thakur",
          "Nb_Reviews": 3,
          "Date": "2021-06-24T11:40:21.000Z",
          "Titre": "This domain company is very good and…",
          "Contenu": "This domain company is very good and genuine because the price of dot com is not very low according to the market prices. We can register a domain very fast. In many cases, it is seen in many domain companies that it takes much time to be active after registration but here the domain becomes active very fast after registration or putting the name servers.  WHOIS PROTECTION SERVICE also free here. Many companies may charge less in the first year but take much more in the next year at the time of renewal of the registered domain, but in this case renewal price is very affordable. And the only problem is here is that there is no white-label service. I need white-level service really."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "customer",
          "Nb_Reviews": 21,
          "Date": "2022-06-10T23:28:09.000Z",
          "Titre": "Very good",
          "Contenu": "Very good but payout need to be more fast"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T19:07:20.000Z",
          "Titre": "Can't beat the price!",
          "Contenu": "There's no automated support for DNSSEC setup, and I had some issues setting up custom nameservers, but a quick email solved both problems within a couple of days.  And you really can't beat the price."
        },
        {
          "Note": 4,
          "Lieu": "BY",
          "Pseudo": "MAX",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T06:09:35.000Z",
          "Titre": "Almost good",
          "Contenu": "MY PROBLEM SOLVED BY SERVICE! EVERYTHING IS OK! My money returned to my card succesfully! But my advice is to make service answer faster to questions of clients!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2020-04-01T18:11:15.000Z",
          "Titre": "Sav is good but needs lot of improvements.",
          "Contenu": "Sav is awesome, but for auctions, they pre-authorize your card, which means your card will be charged every time you place a bid and if your card is not approved you won't be able to participate."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Abdollah Taha",
          "Nb_Reviews": 3,
          "Date": "2021-12-04T11:38:00.000Z",
          "Titre": "I am just new at Sav just about two…",
          "Contenu": "I am just new at Sav just about two weeks i like the price of Reg fee its the best of all its very cheap and the Website easy to use, Keep up good work ."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Customer :D",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T09:37:30.000Z",
          "Titre": "Quite Good",
          "Contenu": "It would be better if Sav could provide DNSSEC settings for their customers. I am currently having 3 domains with Sav, I would keep support Sav in the near future."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Aiman Kirmani",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T18:46:17.000Z",
          "Titre": "The pricing is good however need to…",
          "Contenu": "The pricing is good however need to understand that sav.com says it provide free ssl certificate however I'm unable to see where to get my ssl certificate from."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T05:24:32.000Z",
          "Titre": "Originally stunk, but now redeemed",
          "Contenu": "UPDATE: I was very impressed that after receiving my review one of the company executives reached out to me and took the time to get to the bottom of the issues that we had been experiencing. He was attentive, thorough, and an excellent communicator, and the end result was that some platform code changes were even implemented to make sure these issues do not surface for other customers in the future. So while my original experience was terrible, the company went the extra mile to turn it around. Kudos. ORIGINAL REVIEW:I had the worst experience with this company. It took them a full week after purchasing my domain to gain access to the DNS. And then the domain expired without any notice whatsoever from the company that the expiration date was near. There's no phone support, and no weekend support. So nothing could be resolved quickly. Worst domain registrar ever."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Tasuku Suzuki",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T09:40:36.000Z",
          "Titre": "Thanks for the great service",
          "Contenu": "Thanks for the great service! I'd like to manage my domains with other colleagues. I'm wondering if/when I can create such team in the service."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T17:59:56.000Z",
          "Titre": "Usage Of either web forwarding or DNS…",
          "Contenu": "Usage Of either web forwarding or DNS panel is not possible. ABD this is useless, in fact not a good customer experience. All can be used together."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mikey",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T03:33:44.000Z",
          "Titre": "BEST PRICES!!",
          "Contenu": "Your prices are the best! I would have given 4.5 stars if that was an option. If you had phone support—I'd give you 5 stars for sure!"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Ahmad K",
          "Nb_Reviews": 6,
          "Date": "2020-12-29T11:10:07.000Z",
          "Titre": "Too bad you can't use custom…",
          "Contenu": "Too bad you can't use custom nameserver. The documentation is also not yet available. Also, it would be great if you have WHMCS modules."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "DomainForSale",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T11:52:39.000Z",
          "Titre": "Prices very competitive.",
          "Contenu": "Prices very competitive.Fast interface.Large number of TLDs supported also in backorderBackorder GUI and payment options can be improved."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "bcool",
          "Nb_Reviews": 4,
          "Date": "2022-06-25T10:23:40.000Z",
          "Titre": "Nothing bad",
          "Contenu": "Nothing bad. Great job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby Mac",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T18:41:31.000Z",
          "Titre": "Lowest price. Good Service. Website design could be better",
          "Contenu": "Thanks for quick service.I have all my domains parked here.Domain control panel user interface could be better."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-14T15:01:00.000Z",
          "Titre": "Almost good",
          "Contenu": "2FA timeout is too fast (60 seconds) and only support via email. If SAV.COM improve these, I will vote 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "Yupeng Tang",
          "Nb_Reviews": 10,
          "Date": "2020-02-20T21:12:30.000Z",
          "Titre": "I don't pre-auth bidders credit card",
          "Contenu": "I don't pre-auth bidders credit card, it is unnecessary and unusual. Except this one, everything is perfect."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T16:27:43.000Z",
          "Titre": "Request to add features",
          "Contenu": "Request to add features1. Bulk domain setting function2. Domain sorting function (registration date, etc.)"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Talles Airan",
          "Nb_Reviews": 2,
          "Date": "2021-02-10T18:40:26.000Z",
          "Titre": "good company good prices",
          "Contenu": "I had only one problem because of the spam confirmation email, but other than that, no problem reporting"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Kamran Shaukat Ali Khan",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T07:37:01.000Z",
          "Titre": "4-star for their price",
          "Contenu": "4-star for their price. They need to work on integration with WHCMS quicky to have strong footing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lena",
          "Nb_Reviews": 2,
          "Date": "2020-04-03T19:37:20.000Z",
          "Titre": "Cheap domain to get started",
          "Contenu": "Great that the domains are cheaper. There was a slight glitch with web forwarding which is now working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DJF",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T14:41:58.000Z",
          "Titre": "Quite easy to use service",
          "Contenu": "Quite easy to use service. However, unfortunately uses/relies on Google and Amazon. :-("
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Jom",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T08:50:27.000Z",
          "Titre": "Sav Review",
          "Contenu": "Thank you, easy and friendly. But I need you to put an option like domain forward with masking"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "New User",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T03:50:02.000Z",
          "Titre": "I am new to this site and needed help",
          "Contenu": "I am new to this site and needed help, but customer service is helping me with info."
        },
        {
          "Note": 4,
          "Lieu": "BZ",
          "Pseudo": "german aguirre",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T05:16:50.000Z",
          "Titre": "I see everything really good",
          "Contenu": "I see everything really good.  .. I sinsierly do not  have nothing to complain about it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chovy",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T11:56:28.000Z",
          "Titre": "Good service",
          "Contenu": "Good service. Mainly for cheap .com but they need some better bulk editing of DNS."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "customer",
          "Nb_Reviews": 21,
          "Date": "2021-04-06T10:17:56.000Z",
          "Titre": "very nice company but customer support…",
          "Contenu": "very nice company but customer support somtimes slow to answer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-29T22:23:53.000Z",
          "Titre": "There is no possibility of deleting…",
          "Contenu": "There is no possibility of deleting payment methods."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T04:18:03.000Z",
          "Titre": "I cannot publish my site on your system"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T15:57:54.000Z",
          "Titre": "Great backorder service",
          "Contenu": "Good prices i hope more drop success rate"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T10:14:21.000Z",
          "Titre": "gd had problem with dns and cf tho"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2020-07-02T16:38:41.000Z",
          "Titre": "Quick process.  Reasonable pricing."
        },
        {
          "Note": 4,
          "Lieu": "NP",
          "Pseudo": "Keshav Raj Ghimire",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T08:51:56.000Z",
          "Titre": "It is good",
          "Contenu": "This seems good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 4,
          "Date": "2020-04-01T22:43:37.000Z",
          "Titre": "Easy to sign up",
          "Contenu": "Easy to sign up. Seems easy to use"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Syed",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T08:56:08.000Z",
          "Titre": "Happy",
          "Contenu": "Happy to be part of sv.com"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T14:07:30.000Z",
          "Titre": "Good",
          "Contenu": "Its a great service"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-08-01T19:48:48.000Z",
          "Titre": "Cool",
          "Contenu": "Cool overall experience."
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T01:14:30.000Z",
          "Titre": "First use give  4 stars."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Rabab EL Nashar",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T01:01:17.000Z",
          "Titre": "good good good goof"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Graham Gunderson",
          "Nb_Reviews": 2,
          "Date": "2021-04-03T03:59:20.000Z",
          "Titre": "As promised",
          "Contenu": "As promised. Legit!"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-12T20:22:47.000Z",
          "Titre": "Good Service."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-04-21T23:19:07.000Z",
          "Titre": "great",
          "Contenu": "great & cheap"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T14:29:03.000Z",
          "Titre": "Cheap domain"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Fast Process",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T09:12:25.000Z",
          "Titre": "Fast Process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AskYourFans AskYourFans.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:03:11.000Z",
          "Titre": "You won’t find better prices anywhere…",
          "Contenu": "You won’t find better prices anywhere else! Simple domain name management and FREE matching domain TLDs w/ EVERY purchase. Note, SAV is built more for domain names & not hosting or other web services. - ViP.Events - AstroGuide.Ai"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Tommy",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:36:23.000Z",
          "Titre": "I had a great experience on sav.com…",
          "Contenu": "I had a great experience on sav.com that I could buy things for just one dollar and sell them for hundreds thousands."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Robert Konecny",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T07:07:48.000Z",
          "Titre": "Simple and flexible!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "vivek gani",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:55:57.000Z",
          "Titre": "Sav is amazing for domain auctions",
          "Contenu": "Sav is amazing for domain auctions, it provides domains at an affordable  price. It has good customer support as well which immediately respond to customer issues."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Ali Raza",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T08:50:10.000Z",
          "Titre": "iTop VPN Crack",
          "Contenu": "iTop VPN 5.0.0 Crack is a large tool toward secrete one’s individuality as steer the Internet. Users spirit find to a lot of websites happening the Internet be infertile or nix single preserve contact them. This software is simple toward utilize by a easy or simple border designed specifically pro each kind of customer. The customer border is simple near utilize like this item have character. It have a bundle of feature. It is easy to utilize."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darryl Fulk",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T05:50:03.000Z",
          "Titre": "Prices are the best in the biz",
          "Contenu": "Prices are the best in the biz. Your auctions are slick and very easy to use. Love the 5 minute reset on your auctions. I despise eBay for never having implemented it. Snipers at auctions suck. It's a PLAGUE at eBay.Please advertise your auctions more if possible. Needs more traffic but that's just my opinion. Transferring domains from another registrar for use in your auctions was EXTREMELY easy.I think your site, prices and auctions are great!"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Keshan Fernando",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T23:47:16.000Z",
          "Titre": "Very Simple and Less Expensive.. Job done in 5 minutes",
          "Contenu": "I wanted to register a .me domain to build my personal brand. So I compared with every single domain provider and this platform had the best registration and renewal price ever. So I didn't think twice and registered it with a new account in 5 minutes. I am very satisfied with the User Experience and the quality of work. Thank you very much ! I appreciate it !"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Hasan G",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T08:39:50.000Z",
          "Titre": "Smooth experience",
          "Contenu": "My experience with .com backorder was awesome. At first, you need to give the payment info either paypal or credit card. Fill the whois info. Get a 2FA sms. They are punctual and delivered a satisfactory service. Hope, I never update this review less than 5 stars they deserved all."
        },
        {
          "Note": 5,
          "Lieu": "MD",
          "Pseudo": "Filip",
          "Nb_Reviews": 6,
          "Date": "2022-08-12T11:53:18.000Z",
          "Titre": "SAVe as Always",
          "Contenu": "I have register and backorder plus transferred allot of domains to SAV, SAV is easy to use, affordable, great UI, of course there are minor issues but SAV is improving as they work.If you would ask me to rate (GMO-z.com) I would give them 0 stars, that is one of the worst compared with SAV and other registrars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Admin",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T22:12:28.000Z",
          "Titre": "Terms of Service",
          "Contenu": "The sav.com leadership reached out to us, researched the past correspondence, and fixed the issue. Being that this was the only negative issue we ever experienced and it is now resolved, we comfortable updating our review, and even recommending them to others. Old review just for reference:The terms of service stated a auto-renew would be perform on the expiration date. Some of our domains were renewed 30 days early and they would not issue a refund."
        },
        {
          "Note": 5,
          "Lieu": "SL",
          "Pseudo": "Bashiru Clanzy Mansaray",
          "Nb_Reviews": 5,
          "Date": "2022-04-03T11:09:19.000Z",
          "Titre": "I've tried so many domain service…",
          "Contenu": "I've tried so many domain service providers in the past decade, and I came across sav just few months ago, and the experience I have with sav is like no other. Prices are awesome and setup process is thoroughly amazing. I recommend Sav 10 out of 10."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Maxime",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T18:29:31.000Z",
          "Titre": "Perfect",
          "Contenu": "I've used sav.com to transfer a domain.All I can say is that I didn't need to contact the support because everything was clear.I put 5 stars because I transfered my domain successfully to my other provider without any difficulties."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Atique ur Rahman",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T08:34:24.000Z",
          "Titre": "Sav.com was searched accidently",
          "Contenu": "Sav.com was searched accidently . I created account and from that day to now, I am very proud that i was blessed with Sav.com Domain price differenceQuick Support Issue Resolving Experienced Technical Staff Are the experties of Sav.comLove & Prayers for you"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ioannis Fthenakis",
          "Nb_Reviews": 5,
          "Date": "2023-10-22T16:33:20.000Z",
          "Titre": "Sav team Ryan is definitely a high…",
          "Contenu": "Sav team Ryan is definitely a high professional and a very good person.Thanks again Ryan 👍👍👍👍👍"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Max S",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T10:58:08.000Z",
          "Titre": "🤩 5 STARS :-) TRULY PHENOMENAL",
          "Contenu": ":-) TRULY PHENOMENAL. IN ENTIRE DOMAIN INDUSTRY/SECTOR, I TRANSFER MY PREMIUM DOMAINS TO SAV BECAUSE THEIR TRANSFER FEE IS LOWEST, SAFEST TECH, AND 100% SERVER UPTIME. NEVER UNDERESTIMATE THE POWER OF GROWING/MEDIUM SIZE ORGANIZATIONS AS DAVID TOOK DOWN GOLIATH WITH STRATEGY/SPEED. SAV IS 'THE DOMAIN MARKETPLACE' OF CHOICE FOR ME. WISHING UTMOST SUCCESS, SECURITY, PEACE TO SAV TEAM. REGARDS, MAX SKY, DOMAINER since 2008"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yian",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T01:29:15.000Z",
          "Titre": "They were there when I needed them to help!",
          "Contenu": "I had a really scary situation but Sav handled it perfectly and saved the day! Although they don't have a phone number to call, they are very responsive and helpful over their chat & ticket system. You will hear back quick and they will do everything they can to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tranquil Blue Tampa Web Design",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T05:26:08.000Z",
          "Titre": "Moved all domains to sav.com - Saved a bunch of money.",
          "Contenu": "We moved all of our domains to sav.com. Their prices are the best I was able to find. Their services are on-par with any other registrar I've been using throughout the decades."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Rana Javed",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T11:50:09.000Z",
          "Titre": "Wonderful experience at SAV",
          "Contenu": "Wonderful experience at SAV, I got my domain by auction as lost that and reacquired it. Thank you for that much simple and easy way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gv-M Chief",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T20:42:02.000Z",
          "Titre": "SAV.com Rocks.",
          "Contenu": "Good service.Like how it works smoothly. SAv.com needs a larger selection PAYMENT methods for everyone to participate in the AUCTIONS."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Jose Manuel Hernandez",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T15:17:08.000Z",
          "Titre": "I hope I knew about them earlier",
          "Contenu": "I learned about Sav because a premium domain I was interested in purchasing was listed with them. After I bought that domain and started the process of transferring it out to the registrar where I have another 385 domains registered, a pop up asked me about the outgoing transfer and when I answered that the reason was consolidating my domains in one place, they asked why I didn't consider consolidating my domains with them. I asked myself, \"why\"? Did my due diligence and decided that I will use Sav as my main domain registrar."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Gerelina Salalila",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T23:20:08.000Z",
          "Titre": "I am happy having this and allowed me…",
          "Contenu": "I am happy having this and allowed me used my Paypal for payment , so grateful to our Lord God and to you also.My son can use this in his teaching and in our business.God bless to the team and more power."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ufacik Erkan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:34:20.000Z",
          "Titre": "Good support"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Jazari Abdul Hamid",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T14:36:44.000Z",
          "Titre": "Easy to manage because not take time to…",
          "Contenu": "Easy to manage because not take time to register website and the most important thing is that the price is the best. I will move hundreds my domains here one day. I can just transfer one by one."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ebrahim Tabarestani",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T18:41:21.000Z",
          "Titre": "I was able to transfer and manage my…",
          "Contenu": "I was able to transfer and manage my domain very quickly and easilyAnd most importantly, sav prices are very reasonable and fair"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Chandan",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T00:28:02.000Z",
          "Titre": "Everything is good save.com is super…",
          "Contenu": "Everything is good save.com is super fast. But accept an Indian currency payment in future.  (local currency payment gateway)"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "paulina martinez",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:52:21.000Z",
          "Titre": "Best website for buy domains"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ancire Co",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T22:40:08.000Z",
          "Titre": "SAV.com Is Excellent",
          "Contenu": "SAV.com for my company, is always quick to respond to questions and concerns.We need Auctions access SAV.com -   I know they will get us set up pretty soon.Certainly 5-star rating."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "AA K",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T18:05:16.000Z",
          "Titre": "Prices I haven't seen anywhere else",
          "Contenu": "Prices I haven't seen anywhere else, they give you your domains instantly without any clutter. Nothing left to say. The best registrar."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T16:56:41.000Z",
          "Titre": "domain auction experience",
          "Contenu": "I used sav.com to purchase a domain in an auction. The process was simple and clear, and the transaction was without incident. No complaints!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Rana ayan",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T22:10:53.000Z",
          "Titre": "My cookies experience so good testy…",
          "Contenu": "My cookies experience so good testy food and healthy food make a beautiful life so cooking with care and hard works."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Aneliya Turlakova",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:09:25.000Z",
          "Titre": "Everything's fine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Co",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T04:29:00.000Z",
          "Titre": "No Compromise Domains",
          "Contenu": "Cheap, quick service, no ridiculous renewal rates. Also lots of good domains in auction. My go to for .xyz domains"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "violet",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T04:46:15.000Z",
          "Titre": "best support ever i think its better…",
          "Contenu": "best support ever i think its better than other registars, it would better if you have a live chat"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "James Barker",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T01:21:52.000Z",
          "Titre": "Really great support and fast",
          "Contenu": "Really great support and fast. Dealt with my issue perfectly which I appreciate as I use the service every day. Love Sav"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul H.",
          "Nb_Reviews": 2,
          "Date": "2022-04-23T20:57:14.045Z",
          "Titre": "SAV is great for buying domain names!",
          "Contenu": "I discovered SAV on google and when I saw the domain prices, I started buying from them and they have fast service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clare Quilty",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T06:55:44.000Z",
          "Titre": "Best prices in the domain-o-sphere",
          "Contenu": "Best prices in the domain-o-sphere, along with best customer satisfaction in catching backorder domains!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kawhi G",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T16:41:53.000Z",
          "Titre": "The back order feature really was a…",
          "Contenu": "The back order feature really was a lifesaver for me and helped me get the domain of my dreams! Thank you sav"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Hassan",
          "Nb_Reviews": 32,
          "Date": "2022-07-23T14:24:31.000Z",
          "Titre": "One of the best Registrar I've ever…",
          "Contenu": "One of the best Registrar I've ever seen in the past 30 years! Affordable price, lots of options/ services, Marketplace/ Auction/ Aftermarket service and the best of all is superior customer service!"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Ha L",
          "Nb_Reviews": 3,
          "Date": "2022-03-21T13:44:12.000Z",
          "Titre": "Sav is good",
          "Contenu": "Hi, I use Sav for more than one year. It's good for me to choose domains what I want. The price is the lowest I've met. I strongly recommend this company if you want buy some domains."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Andrii Fedirko",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T21:51:42.000Z",
          "Titre": "Easy and convenient",
          "Contenu": "It is very easy to use the services of the service. Good prices. Customer orientation is felt."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ramiz Avdovic",
          "Nb_Reviews": 2,
          "Date": "2022-02-01T16:41:42.000Z",
          "Titre": "The best of Domaining",
          "Contenu": "Sav is perfect! Everything a domainer needs is there, simplified, clear and efficient.Great!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Giuseppe Spadoni",
          "Nb_Reviews": 8,
          "Date": "2023-03-10T14:26:33.000Z",
          "Titre": "good experience",
          "Contenu": "good experience need only in marketplace buy-now with make an offer ! regards"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derick Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T18:44:23.000Z",
          "Titre": "Sav.com is always amazing with support"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "FilesPC",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T12:16:21.000Z",
          "Titre": "Best place to get domains very cheaply.",
          "Contenu": "This is a very good website to buy domain names at very reasonable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Perilli",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T12:01:01.000Z",
          "Titre": "very good overall",
          "Contenu": "very good overall, could use a forwarding function with bulk edit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alexander",
          "Nb_Reviews": 3,
          "Date": "2022-07-05T00:41:20.000Z",
          "Titre": "Thanks and Happy Holidays !!!",
          "Contenu": "Thanks , Super Company , try to low prices for co to 1.99$ , domains and com 2,99$, as in 2021 , and you are super great THE BEST ....Happy 4 the Jully !!!  Alex B."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Kousso Ncho",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T11:32:32.000Z",
          "Titre": "I was using other platforms but when i…",
          "Contenu": "I was using other platforms but when i tested sav, it is easy and gets everything ready in minutes. Loving it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Jajack",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T16:22:58.000Z",
          "Titre": "Above and beyond support",
          "Contenu": "The Sav team helped us out with a major outage. They went above and beyond and got us back up and running ASAP. These guys will have your back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dutch B.",
          "Nb_Reviews": 3,
          "Date": "2023-04-28T13:27:39.000Z",
          "Titre": "Ryan went out of his way to resolve a…",
          "Contenu": "Ryan went out of his way to resolve a fairly unconventional problem. Most impressive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Khalid Khan",
          "Nb_Reviews": 4,
          "Date": "2022-06-28T14:43:35.000Z",
          "Titre": "TBC to the premises and surrounding areas",
          "Contenu": "TBC to the public domain addresses and phone number is that the moment but"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T04:20:12.000Z",
          "Titre": "i am very happy. sav.com big Affiliate Marketplace. have a good day."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Omar Moussaoui",
          "Nb_Reviews": 13,
          "Date": "2023-10-22T23:12:31.000Z",
          "Titre": "The best site for buy or sell…",
          "Contenu": "The best site for buy or sell domain-name"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Aarnoud",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T18:52:04.000Z",
          "Titre": "Clear experience",
          "Contenu": "Clear experience, great prices.Help available when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danai Peak",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T17:39:53.000Z",
          "Titre": "Danai",
          "Contenu": "Him you please help for me seesaw thank you for everything and for the help and for the love of all my"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Eddy saul gutierrez muoz",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T07:44:29.000Z",
          "Titre": "driver job in planting…",
          "Contenu": "tractor driver job in planting different types of crops"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Mills",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T12:58:54.000Z",
          "Titre": "A home power wash that was totally…",
          "Contenu": "A home power wash that was totally satisfying.  Professional in the careful attention to detail and thorough application that results in total satisfaction.Highly recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Paddy Digital",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T19:56:10.000Z",
          "Titre": "Smooth Navigation",
          "Contenu": "Smooth and simple website navigation."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Faizan",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T02:48:09.000Z",
          "Titre": "company doing very well",
          "Contenu": "company doing very well and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2022-11-13T20:04:00.000Z",
          "Titre": "One of the best domain name registrar’s…",
          "Contenu": "One of the best domain name registrar’s period!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "DomainEmpire.com",
          "Nb_Reviews": 13,
          "Date": "2022-11-24T22:02:28.000Z",
          "Titre": "The cheapest domain backorder service",
          "Contenu": "Great and cheap domain backorder service.They caught a dozen of names for us so far."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "FilesPC",
          "Nb_Reviews": 4,
          "Date": "2023-01-31T09:38:42.000Z",
          "Titre": "Best Domain Name Provider",
          "Contenu": "Save is the best place to buy any domain at a very flexible rate. Great service !!"
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Robbie",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T05:49:58.000Z",
          "Titre": "It was great experience working with…",
          "Contenu": "It was great experience working with sav.com!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T17:43:31.000Z",
          "Titre": "Solved my problem very quickly",
          "Contenu": "Solved my problem very quickly. Good service, fast response time."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "tommi martikainen",
          "Nb_Reviews": 3,
          "Date": "2022-07-26T09:52:00.000Z",
          "Titre": "Absolutely Flawless",
          "Contenu": "Great! Absolutely Flawless. Or Sawless.) Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Davis",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T18:45:12.000Z",
          "Titre": "Sav is super easy to use and very…",
          "Contenu": "Sav is super easy to use and very reasonably priced!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Khaled Shatia",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T08:19:11.000Z",
          "Titre": "Very Good Company"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T19:25:18.000Z",
          "Titre": "Good price products and good customer…",
          "Contenu": "Good price products and good customer care services...."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Badejo Abdullah",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T02:03:02.000Z",
          "Titre": "This platform is very cool and easy to…",
          "Contenu": "This platform is very cool and easy to operate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David George",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T17:14:36.000Z",
          "Titre": "Good Registrar",
          "Contenu": "Good Registrar.  Nice dashboard.  Great prices."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-25T22:21:20.000Z",
          "Titre": "Thank to the Sav for providing the…",
          "Contenu": "Thank to the Sav for providing the reliable and savvy  domain registration services."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Andy Cloud",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:19:47.000Z",
          "Titre": "Best domain price",
          "Contenu": "The best domain saller"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sandip Thakur",
          "Nb_Reviews": 3,
          "Date": "2022-08-16T11:12:36.000Z",
          "Titre": "Low price and good support.",
          "Contenu": "Low price and good support.Also renewal policy is too good."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Michaels",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T01:53:05.000Z",
          "Titre": "Sav makes it easy order domain names…",
          "Contenu": "Sav makes it easy to order domain names and Sav has great prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Williams",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T23:36:08.000Z",
          "Titre": "good",
          "Contenu": "is good1234 a a a a a a a a a and is amazing I like a lot and my big sister says hi"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Muhammad Nooh",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T19:57:43.000Z",
          "Titre": "Best Service then eurodns.com",
          "Contenu": "Best Service then eurodns.comwill transfer my domains from eurodns.com to WW.SAV.COM🌹🥰😘"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Danish Ali",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T14:02:19.173Z",
          "Titre": "One of the best Domain Provider in the…",
          "Contenu": "One of the best Domain Provider in the world Easy to use."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Volkan Kosar",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T03:51:46.000Z",
          "Titre": "thumbs up...",
          "Contenu": "thumbs up.... ))) let it continue that way..."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Micha Cassola",
          "Nb_Reviews": 4,
          "Date": "2023-04-16T15:14:59.000Z",
          "Titre": "Great pricing and good service"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T13:52:22.000Z",
          "Titre": "Great service",
          "Contenu": "Great service - thank you for timely response"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Valentyn Korzh",
          "Nb_Reviews": 3,
          "Date": "2022-07-03T17:39:22.000Z",
          "Titre": "Cool registrar",
          "Contenu": "Great service, fast execution, easy to navigate. Highly recommend. And competitive pricing as well. :)"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Ibby elaaz",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T22:19:31.000Z",
          "Titre": "it's simply great and easy to manage…",
          "Contenu": "it's simply great and easy to manage domains"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "KAOSAR",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T18:49:01.000Z",
          "Titre": "Best company",
          "Contenu": "Very Good, service and Best offers all time,.."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Pradeep Fernando",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T07:22:33.000Z",
          "Titre": "super easy to use",
          "Contenu": "super easy to use, very fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Names Of Gold",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T04:20:21.000Z",
          "Titre": "SAV gets it right !",
          "Contenu": "SAV gets it right.  Quick and thorough responses. Thank you SAV folk."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "tarun singh",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T05:19:44.000Z",
          "Titre": "Excellent services",
          "Contenu": "Excellent and trustworthy services. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T06:34:48.000Z",
          "Titre": "Nice job.Please add reseller options too"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "CK",
          "Nb_Reviews": 3,
          "Date": "2022-06-05T06:21:11.000Z",
          "Titre": "Good value for money",
          "Contenu": "Good value for money. Fast ticket response."
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Andreas Ioannou",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T02:12:57.000Z",
          "Titre": "Great customer support"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Srbija Oglasi",
          "Nb_Reviews": 5,
          "Date": "2022-03-03T14:03:41.000Z",
          "Titre": "Great",
          "Contenu": "Great, cheap, and fast.Recommend"
        },
        {
          "Note": 5,
          "Lieu": "IQ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T06:36:52.000Z",
          "Titre": "SAV.COM is Perfect Domain Registrar"
        },
        {
          "Note": 5,
          "Lieu": "KG",
          "Pseudo": "Azam",
          "Nb_Reviews": 6,
          "Date": "2022-05-10T16:00:14.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent! The best price!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T04:05:20.000Z",
          "Titre": "Very simple interface that accomplishes…",
          "Contenu": "Very simple interface that accomplishes every standard domain action."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose K",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T02:07:53.000Z",
          "Titre": "The manager Nick was very helpful",
          "Contenu": "The manager Nick was very helpful. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "zeng jia",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T08:16:17.000Z",
          "Titre": "Very convenient to use"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Vincent Odhiambo",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T06:37:31.000Z",
          "Titre": "Why do I pay the money or is not a…",
          "Contenu": "Why do I pay the money or is not a betting site"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "omar",
          "Nb_Reviews": 3,
          "Date": "2022-03-18T19:12:44.000Z",
          "Titre": "Egypt",
          "Contenu": "An excellent company, but the company's shares have started to stabilize or go down a little. I hope the first system is restored so that the company or the registrants do not cause a loss. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Arun Nadarasa",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T18:05:22.000Z",
          "Titre": "Very professional service and very fast…",
          "Contenu": "Very professional service and very fast :)"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "AK",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T01:21:03.000Z",
          "Titre": "Great platform",
          "Contenu": "Great platform, with some ajustement can be No 1"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ClickTranslate",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T23:27:20.000Z",
          "Titre": "Fast & Responsive customer service",
          "Contenu": "Great prices. Fast & Responsive customer service. Overall, great registrar."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andy Goldau",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T13:23:33.000Z",
          "Titre": "Very good and modern registrar",
          "Contenu": "Sav.com is a very good and modern registrar. The ordering process is super easy and quick. The prices are the cheapest for almost all domain extensions. I can 100% recommend Sav.com."
        }
      ]
    }
  ]
}