{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.topazlabs.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy Irwin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:52:10.000Z",
          "Titre": "I was saddened",
          "Contenu": "I was saddened. The only thing this software is decent at is upscaling. The ai face “improvement” is awful and makes it look like a cheap oil painting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T00:28:52.000Z",
          "Titre": "numerous bugs:",
          "Contenu": "numerous bugs:1) no undo2) no partial, save of a batch if you open up 30 or 40 files, you can’t stop in the middle or if the system crashes you lose all your work3) no way to save, or display the settings without going into the individual sliders4) no way to re-process an image with new settings from before"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tomaso",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T17:17:34.000Z",
          "Titre": "The new version could not be used",
          "Contenu": "The new version could not be used. I downloaded the installer twice, yet it said some model files had also to be redownloaded. When trying to do that it said the installer could not be verified. I have no problems with the security of my IMac. The previous Topaz versions had no such issues. The support Centre could not help so far, will try again. Disappointing."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:05:46.000Z",
          "Titre": "Installation Woes…",
          "Contenu": "Having previously purchased several TOPAZ programs which worked beautifully, I jumped at the opportunity to upgrade to your latest version of Sharpen AI, as I use it to improve the presention of photos of crucial historic preserved specimens (type specimens) to colleagues around the world.I am not particularly computer literate, but all attempts to load the current Sharpen AI have failed. As installation of earlier TOPAZ programs did not prove particularly  challenging I am left with the conclusion either that my level of incompetence has increased or installing your products has become more complex"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T22:19:10.000Z",
          "Titre": "Topaz Video AI",
          "Contenu": "With the help of the your support group I was not able to get satisfactory results. We tried!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david mezzardi",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:43:21.000Z",
          "Titre": "I want a refund",
          "Contenu": "I want a refund. you say I can get a refund for 30 days after purchase, but give no avenue to do it. I WANT A REFUND."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Brown",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T11:28:57.000Z",
          "Titre": "In the past I loved all the Topaz…Products, yes I did.",
          "Contenu": "In the past I loved all the Topaz Products I had. Sadly I can't get the Video version to create a new version. I statred to use just a 4 minute mp4 video and it started but only went up to 30 seconds and never continued after. Naturally, I did try a few others but again none of them have worked. I hope your company will sort out the issues so its easy to create a nicer video. Please let me know if you will improve it. Regards John Brown"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Mcadoo",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T23:39:14.000Z",
          "Titre": "I downloaded and paid for the package I cannot use",
          "Contenu": "I downloaded and paid for the package assuming I would be able to use it only to find my particular laptop does not have a CPU compatible with 'AVX', which is required by the software to install or work.I tried sending several messages asking if I can do anything (besides buying yet another laptop) like maybe let me have an earlier version, which I saw online does not require AVX, but they never responded.  I wasted my money for a product I cannot use.  I am very unhappy!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Holland",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:22:25.000Z",
          "Titre": "Tutorial is not like the app.",
          "Contenu": "To begin with - your tutorial does NOT match the Photo AI that opens on my Mac. Simply, the tutorial is worthless. Today Photo AI couldn't find any faces and the image was a close up portrait of a couple (two large faces in the image."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "yongjie tao",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:58:26.000Z",
          "Titre": "never get the items",
          "Contenu": "never get the items. I paid $50 and wait for almost a month but get nothing. I received more than 50 deliveries these two months. All of them are free shipping and with tracking info. I got all of them except this one. I paid shipping fee for this order and no tracking info.This is my worst experience 2023.They told me they will resend. What's the point? wait for another month and still not sure if I can get it since  there is no info shows how and when my delivery lost.It's not what I expected.How I know it wont happen again? I'm tired of this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven G",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:58:12.000Z",
          "Titre": "Unable to load onto PC",
          "Contenu": "I couldn't even get the install wizard to open because of an error message that my desktop CPU does not support AVX as I thought it did. I am now in the process of upgrading the RAM on my laptop to 16GB for Topaz minimum. The CPU on the laptop is supposed to support AVX2 so I guess we'll see. I have been running Photoshop and Luminar Neo on both machines with no problems other than the Luminar AI running very slowly on the laptop because of the 8GB RAM restriction on the laptop, but at least it works."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Bolton",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:15:44.000Z",
          "Titre": "I am unable to authenticate the…",
          "Contenu": "I am unable to authenticate the license.  Your support team seems to have given up.  I paid for it but can't use Photo AI.  My Sharpen and denoise work just fine.  It has been about a week since the last message from your people.  Totally furstrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clint Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:17:50.000Z",
          "Titre": "The topaz photo AI app is mostly bad",
          "Contenu": "The topaz photo AI app is mostly unusable. All of the photos that are uploaded, rather they are high quality raw files or low resolution jpeg the app runs entirely too slow. It crashes constantly. The way it works makes it virtually unusable"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Gibbons",
          "Nb_Reviews": 22,
          "Date": "2023-12-04T14:31:15.000Z",
          "Titre": "Photo AI refuses to open.",
          "Contenu": "I have not been able to open Photo AI since a few updates ago. Up until then everything was fine and I used it all the time with excellent results. I contacted Topaz numerous times but I still cannot open it after following instructions. Cannot give it a proper review if I cannot use it. All other Topaz apps work fine. I would love to use it again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:09:26.000Z",
          "Titre": "Can’t get it to work",
          "Contenu": "I purchased AI Photo and Video programs and not been able to get either to work properly on my Mac or my iPad Pro 12. I have sent two emails asking for instructions or an operators manual but have yet to receive a response. So far, it’s been a disappointing experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra Rotolante",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T19:56:14.000Z",
          "Titre": "I would not recommend AI, I hope it will improve down the road!",
          "Contenu": "I already own DeNoise and love it so I thought why not add AI, it was a huge mistake and waste of money.  I even contacted customer support in hopes that I was doing something wrong, I wasn't.  Every photo I have run through the program is now overexposed so I have to adjust it which means that AI isn't saving me time. I hope with updates, it will improve but at this point I will not be using it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carter",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T21:14:09.000Z",
          "Titre": "I cannot download",
          "Contenu": "I live in a very rural area and the programs will not download to my desktop. How can I get the programs I paid for on disk or other media?"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Staffan Lycke",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T10:36:56.000Z",
          "Titre": "Photo AI oversharpens in my opinion and…",
          "Contenu": "Photo AI oversharpens in my opinion and with my previous products Sharpen AI plus Denoise AI I could adjust this easily. I addressed this issue with an email to support but no reply."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Philip",
          "Nb_Reviews": 30,
          "Date": "2023-11-28T02:39:50.000Z",
          "Titre": "Essentially useless",
          "Contenu": "I have had Topaz Labs DeNoise AI for 6 months now and I have come to the conclusion that this software is basically nothing but a waste of time and money. In most cases it actually adds noise and makes photos worse than they were! Even on the rare occasions that it actually has a \"denoise\" effect DeNoise AI does nothing that Photoshop doesn't already do far better. I will uninstall this app as it is of no use whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Minor",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T19:05:41.000Z",
          "Titre": "Can’t get photo ai to work on m1 /…",
          "Contenu": "Can’t get photo ai to work on m1 / macOS 11 - image immediately breaks up with noise - tech support apparently either hiding or non existent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Bolton",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:40:45.000Z",
          "Titre": "Topaz photo AI won't activate",
          "Contenu": "Topaz photo AI won't activate.  Multiple emails back and forth with customer service have not resolved the issue.After several tries, Topaz was able to resolve the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SK",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:51:18.000Z",
          "Titre": "Poor (nonexistent) customer service",
          "Contenu": "Website mentioned product can be refunded within 30 days of purchase. However their was NO option on the website on how to contact the company for cancelling the order and getting a refund!!! ABSOLUTELY disgusting as I wasted a lot of my precious time trying to find an email or phone number to contact. Finally called my credit card company to cancel my payment as I had no other option. This is unacceptable!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D Stephens",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:29:24.000Z",
          "Titre": "My credit card was charged twice and no…",
          "Contenu": "My credit card was charged twice and no way given to contact company.  The website says all orders can be returned within 30 days.  Good luck finding a way to contact them.  The number given on their website is not in use and no email address either."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "DManis",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:40:46.000Z",
          "Titre": "Nothing more than Photoshop",
          "Contenu": "I am a professional photographer and I bought this app cause I thought that it can do, at least, something more than Photoshop. Unfortunately, I was wrong... Photoshop BETA is better than this..."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Peter Khoo",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:17:39.000Z",
          "Titre": "Was promised that I will get upgraded…",
          "Contenu": "Was promised that I will get upgraded version of Denoise, Sharpen and Gigapixel as my version were very old, 2022 and I have missed many updates in 2023 if I purchase Photo AI upgrade. In the end, I only received the Gigapixel upgrade and was told that my current old 2022 version of Denoise and Sharpen was already latest. How can it be when I missed so many updates in 2022. Subsequently, your guy just changed my record in your system to reflect 2024 version from 2022. I felt so short changed and how can a reputable company just edit my record. It was a terrible customer service experience for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David DiRoma",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:37:57.000Z",
          "Titre": "I bought the “upgrades” for Sharpen and…",
          "Contenu": "I bought the “upgrades” for Sharpen and Gigapixel but they don’t seem much different than the versions I had been using."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "CONG THANH NGUYEN",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:33:19.000Z",
          "Titre": "Crashes all the time.",
          "Contenu": "Crashes all the time.Have only been able to successfully use once.Running in 13900k and 3090 ti. Should be chewing through this.I ran every update and driver update couldn't not make this work consistently. Im a computer engineer and definitely know my way around a computer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerome",
          "Nb_Reviews": 5,
          "Date": "2023-12-01T16:16:18.000Z",
          "Titre": "You do not have a phone number to…",
          "Contenu": "You do not have a phone number to contact to help with installation with my recent upgrade.  I do not know if I even have the recent upgade and cannot speak to anyone about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Holden",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:11:35.000Z",
          "Titre": "Specs for topaz video",
          "Contenu": "Specs for topaz video so I could use Mac iOS 15.1 well I did and it turned out that it didn’t work. I was not able to update my system to another platform due to the age of the computer so I’m stuck I cannot use the software."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "John Roy",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:07:22.000Z",
          "Titre": "I renewed Photo AI",
          "Contenu": "I renewed Photo AI, Denoise, Sharpen & Gigapixel. Now I find out the last three have been bundled into Photo AI and will not be updated, so that is money down the drain. A refund would be appreciated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Ashman",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T20:38:23.000Z",
          "Titre": "Photo AI continues to crash on two…",
          "Contenu": "Photo AI continues to crash on two different machines.  I've done two support tickets over the last couple of months.  It is very frustrating as this didn't happen with v1.5x versions"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DMK",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T19:34:45.000Z",
          "Titre": "Screen grabs from video don't work!!!",
          "Contenu": "I have a number of screen grabs from a video of a World War II film. I could not get it sharpened in any way with your software. I thought it was something I was not doing so I sent you the image and received the bad news it won't work. Nowhere in your marketing does it say it doesn't work for video screen grabs. So I asked for a refund.Regarding the Topaz reply to my review: \"Your file was highly degraded, and there was not enough original detail for the AI models to work with.\" If I had more original detail, I would not need your product!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 21,
          "Date": "2023-11-25T23:29:06.000Z",
          "Titre": "Ripoff",
          "Contenu": "Ripoff. 150 USD/EUR for 1 Year of updates... You folks know that its possible to do this myself using ffmpeg and tensor-flow???For 150 USD/EUR i expect at least 3 years or Life-Time. I will not buy again..."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Kajus Pyrz",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T14:37:11.000Z",
          "Titre": "The program doesn't work and is…",
          "Contenu": "The program doesn't work and is unresponsive. I've tried to launch it 15 times already, but nothing is happening. I can't perform updates, even though the option is displayed in the top right corner. I have urgent work to complete, but it might be challenging. Uploading photos is also impossible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred Harwood",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:09:43.000Z",
          "Titre": "I can’t figure out how to access the…",
          "Contenu": "I can’t figure out how to access the software so I have not been able to use it. I have an iPad. Perhaps I need to use a computer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "anthony",
          "Nb_Reviews": 11,
          "Date": "2023-12-12T09:38:41.000Z",
          "Titre": "I am very disappointed with the results…",
          "Contenu": "I am very disappointed with the results no better than manual photoshop"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Cady",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:46:04.000Z",
          "Titre": "I found a different program that…",
          "Contenu": "I found a different program that upscales and dentists even better than my new Topaz program for just $9.99."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jen Carroll",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:17:41.000Z",
          "Titre": "Results in flat, desaturated images!",
          "Contenu": "Use the twice both times pictures came out dull flat and desaturated.  Called customer service and I keep having to download new programs to upload images or videos of what I'm doing when it's quite simple you put an image into topaz it comes off flattened saturated as simple as that I'm not getting any help I'm very frustrated with this program."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Richard Redmond",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T15:34:07.000Z",
          "Titre": "Sloppy apps",
          "Contenu": "Expensive. Multiple downloads. Multiple apps. It's a money grab to break it up like that. It should all be in one easy to use app for 1 price. It's sloppy for professionals who are busy."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:49:52.000Z",
          "Titre": "Couldn't even run the software",
          "Contenu": "Couldn't even run the software. Crashes while downloading AI models.(Spec: Intel i5 13500, Intel Arc A750)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:44:03.000Z",
          "Titre": "You sold me software I already own",
          "Contenu": "You sold me software I already own.  I thought it was ready for updating, but it wasn't  I have 8 months left."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruth Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T20:45:20.000Z",
          "Titre": "I needed to increase pixels on my…",
          "Contenu": "I needed to increase pixels on my photographs immediately and saw your site and signed up and paid.  I could find NO WAY to access anything and had to resort to something else.  HOW CAN I ACCESS ANYTHING WITHOUT ANY INSTRUCTIONS?  Please help.  I will need to use your site in the future."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 7,
          "Date": "2023-09-22T00:57:08.000Z",
          "Titre": "New User",
          "Contenu": "The lighting/colour beta versions don't seem to work or crashes. There is no progress bar, so no indication when the program has finished its updates? If you then reset the zoom it starts a fresh iteration of updates. So confused to be honest and can't see much improvement in the end results."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leandro Moreira",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:55:22.000Z",
          "Titre": "I want to cancel my subscription",
          "Contenu": "I want to cancel my subscription. The product is not what it promessas to be. Give me a call and I explain better. 4077750145"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Weyand",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:26:06.000Z",
          "Titre": "New version of Topaz Video AI 3.5.4…",
          "Contenu": "New version of Topaz Video AI 3.5.4 won't install on any PC Computer with Window 10 or 11.  When you contact their support... they'll tell you it's your fault.  You must be doing something wrong.  3.5.3 Installs perfectly on the same computers.  But you must be doing something wrong on the new version."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anne Creed",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T18:02:07.000Z",
          "Titre": "Impossible to install due to repeated reports it lost internet connection when no other device had lost internet connection",
          "Contenu": "I spent hours last week trying to download my purchase. It kept crashing and saying that it lost the internet connection and blamed my connection. No other device, including my computer, showed a disconnection. A product I can’t download because of some glitch in your software or server doesn’t deserve any stars."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "GEOFF BENNETT",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T11:00:16.000Z",
          "Titre": "I find the software frustrating to use",
          "Contenu": "I find the software frustrating to use.  Updates occur every second or third day, suggesting it's in beta format almost perpetually. It invariably crashes and when an error occurs, there is no simple way to relay the content of the error to Topaz, unlike Apple which prepares the report and invites the user to send the report.  I started my subscription in August 2022 and thoroughly regret renewing it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2023-08-21T02:09:55.000Z",
          "Titre": "Absolutely terrible",
          "Contenu": "Absolutely terrible, such a con rip off. The quality of 2 x times blow ups are appalling, unusable. There are other programmes and pluggins that blow up things so much better. Don't believe all of the adverts showing amazing pictures this programme gives terrible results and the \"controls\" are so basic its like amateur or budget shareware but its priced at professional level."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kathy Schlattman",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T22:58:51.000Z",
          "Titre": "previous version of DeNoise ran well…",
          "Contenu": "previous version of DeNoise ran well inside Lightroom and new version 3.7.2 would not open properly nor save image back into LR. support was only that \"it was a conflict with the source editor\" How does that help me? VERY disappointed that there isn't even a live chat option"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joseph Reichmann",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:35:51.000Z",
          "Titre": "I've tried using the program but I see no improvement",
          "Contenu": "I've tried using the program but, after spending $400 on it, I'm seeing no discernable difference between the original and the new version of the video I ran through the program."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carrie Brindley",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:48:39.000Z",
          "Titre": "It won't work at all",
          "Contenu": "It won't work at all.  There's a certain spot I can hover the mouse over where everything I tried doing will catch up.  The spot is over the minimize screen spot.  I can't do anything with the software.  It worked great when I downloaded the trail and kept working for about two days.  On the third day I opened it and everything froze.  I have enough ram and memory, so I'm not sure what the issue is.  I just know that it's not working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-08-26T01:13:23.000Z",
          "Titre": "Topaz selling out, but why?",
          "Contenu": "DELIGHTED with Sharpen AI and DeNoise AI. Photo AI is an inferior product. Yet, Topaz will discontinue Sharpen AI and DeNoise AI!If anyone can fathom why Topaz would kill two of the best photo apps on the market to sell an inferior product, do enlighten us.I've been transformed from a Topaz App Enthusiast who's told many, many folks about Topaz, to a Disappointed Customer in search of replacements."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joanne Brohmer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:46:21.000Z",
          "Titre": "Honestly it just makes my pics look…",
          "Contenu": "Honestly it just makes my pics look fake, nothing lien advertised. Very disappointed. Maybe I’m not using it right"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:20:47.000Z",
          "Titre": "This crashes every time I use it. Frustrating!",
          "Contenu": "This product has not worked for me since I got it.  Even the simplest task crashes my computer in very strange ways and I feel it is damaging my computer.  Not one project has worked or finished.  Heck sometimes in preview it crashes.  Terrible for long video clips it won’t even work at all.  It starts to process and then gets stuck.  I keep giving it a try and close to asking for my money back."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nige",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T17:15:54.000Z",
          "Titre": "I'm trying to use the demo Version 4 of…",
          "Contenu": "I'm trying to use the demo Version 4 of Video AI and on preview both the Original and enhanced (very short) clip is extremely choppy and slow.  This is stopping my buying the product..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graeme Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T10:41:19.000Z",
          "Titre": "Very disappointed",
          "Contenu": "I may be using it badly but it doesn't seem to perform as well as some free Ai image improvement apps. I'm a seasoned PS image manipulation user but I can't get results like those you see in the adverts. I'd like to write a positive review but having paid a significant amount of money for something that performs worse than 'free to use' alternatives, I find I can't yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gray Mcquarrie",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T22:12:29.000Z",
          "Titre": "I am beside myself with frustration!!",
          "Contenu": "I am beside myself with frustration!!!  First issue, is if I own a product according to what you say on your site, how do I find the product registration code!!!!!!!!!!!!!!!!!  This is B.S.  Who ever was responsible for this needs to figure out why the user experience I am having is SO MISERABLE!  It makes to never ever purchase a Topaz product ever again!!!!!!!!  I will stick with Adobe offerings thank you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T06:32:50.000Z",
          "Titre": "No Support",
          "Contenu": "After purchasing and downloading the new update I discover that my Mac is not compatible! Asked support team for work around or refund. No body contacted me however they asked for rating review!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A J F",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T11:41:56.000Z",
          "Titre": "This is the worst functioning software…",
          "Contenu": "This is the worst functioning software I’ve ever had. I’ve spent hours in email correspondence with Topaz labs not getting anywhere. I did want my money back, but this has come to naught. I suppose I’ll just have to live with its major limitations. I won’t be buying anything that Topaz produce anytime soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Jaras",
          "Nb_Reviews": 4,
          "Date": "2023-08-28T19:03:55.000Z",
          "Titre": "Not for Pros who need to print",
          "Contenu": "It automatically save at 72 dpi and there's no way to change that.  Not acceptable for printing when you need 300dpi.   Wish I hasn't bought Topaz Photo AI.update:  thanks for the info.  I had tried multiple times to find this documentation without success and had asked for help with no response.  This does work.  But overall I say that Topaz is good for something but for pro upscaling and printing ON1 is far better"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 22,
          "Date": "2023-10-06T17:20:56.000Z",
          "Titre": "absolutely infuriating",
          "Contenu": "From what i can remeber the only thing i have got from Topaz lately was the annual ransome note for my software and then they cask me to rate it whilst i have waited over a week for an answer to a really simple email question about the legacy software,  they dropped, to some one who is actually paying for their software support tarrif Then my enthuisiam levels cant rise much above 1 star. Really sad. Just cut this quote from their ransom note   \"Your feedback is incredibly valuable, so we look forward to hearing from you!\"  so to be fair to them it doesnt actually mention doing anything or replying as long as they hear. I only gave the 1 stars as apparently i am getting a special flag on my account Whoop de Dooh, who do they think we are kids, what the **** is a flag worth. I left the armed forces years ago and that was the last time a flag ever got me out of bed.   Sorry if this seems sarcastic, but you sent the wrong survey at the wrong time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Miller",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T15:00:39.000Z",
          "Titre": "Nonexistent customer service",
          "Contenu": "I bought software 9 days ago.  When I launch it, it's still trial version, no matter how many times I \"load\" the purchased software.  The customer service on getting this fixed is nonexistent.  Nothing!  Relying on email and FAQs for customer service says this company doesn't care.  I've missed one deadline already because of this software and am afraid it's $170 down the drain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D. S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T02:42:41.000Z",
          "Titre": "Can't achieve same results with Paid AI…",
          "Contenu": "Can't achieve same results with Paid AI that we achieved during the Demo.  Please see detailed email response to Tim He, Product Specialist, Topaz Labs dated 07-01-23. Tim is trying to help.  We provided additional information and pictures this afternoon.  Still no resolution to the issue."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "VIDEOCREACION B",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T11:21:45.000Z",
          "Titre": "The photography application is…",
          "Contenu": "The photography application is wonderful but the video application is not successful at all, for example the slow motions that I have made are very bad and they produce \"ghosts\" in the images. It is not worth the price it is worth"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "asijfhiequhsijfndsigjoijg",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T17:07:06.000Z",
          "Titre": "Sorry but I can't read your reponse to my questions",
          "Contenu": "I prefer working directly with the DeNoise, Sharpen and Gigapixel apps than Topaz Photo AI. I find that the results can be controlled much more precisely and the results are also much better.And another very important thing: please, it would be great if your applications could also be used with scanned image files. Currently there are some problems.I know you warn that your applications are designed specifically for digital camera files but I think it would be a very good opportunity for you and for the users that it could also be used perfectly with our scanned images from photographic film negatives and positives. The sooner they get it, the better. Thank you very much for your attention."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "carwow Kunde",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T08:54:26.000Z",
          "Titre": "DNG Files that were created in Topaz…",
          "Contenu": "DNG Files that were created in Topaz Denoise cannot be used in Topaz Sharpen. For example, when I use a 61 megapixel RAW format photo in Denoise, it saves as DNG file. Topaz Sharpen can read this DNG file in a much lower resolution, i.e. it only imports a kind of preview file but not the real photo. This is an obvious bug that makes it hard to use the Topaz software at all.Also, using Topaz AI is not really helpful since the results are inferior to those from Denoise and Sharpen, which is a pitty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John McCarthy",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T10:46:56.000Z",
          "Titre": "Topaz AI v2.0 stalls and Crashes",
          "Contenu": "I purchased Topaz AI v2.0 and downloaded the app. I can send the file from Lightroom to Photoshop. When I open AI, the processing stalls and crashes - every time. I have uninstalled AI and reinstalled it without success. I am running Win 10 on a Dell Inspiron 17 5000 series.If this cannot be resolved, I will have no choice but to request a refund."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Knut",
          "Nb_Reviews": 14,
          "Date": "2023-11-30T21:48:59.000Z",
          "Titre": "Worst page for shopping.",
          "Contenu": "Worst page for shopping.. I should only order Photo AI but had to order Movie AI by a mistake…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lesley Richards",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T23:10:01.000Z",
          "Titre": "The sharping tool is not very realistic…",
          "Contenu": "The sharping tool is not very realistic for faces"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T16:35:05.000Z",
          "Titre": "Pixel AI a bad match with Midjourney",
          "Contenu": "I purchased Pixel AI last night and tried to upscale some of my Midjourney art. I was disappointed to find, it seems to actually make it worse.My conclusion is Pixel AI is it is not intended to upscale Digital graphics or line-art even though is has a “Graphics” setting - too bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy Burgon",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:53:19.000Z",
          "Titre": "The software does not work",
          "Contenu": "There was insufficient detail in the instructions and FAQs to address difficulty in downloading and installing the program.  The process took several hours. After getting the product installed, it does not work at all.  I have tried several old photos that are blurred, out of focus or too pixleated.  the software does nothing at all to change or improve the photos.  I cannot detect any posative change at all.  After all of this I was sent some detailed instructions that shed more light on the process, but I have not had the time to try anything.  bottom line - i have spent over 5 hours messing with your software with nothing to show.  I am not sure if this is just a scam, or if I am doing somehting wrong.  I have never spurchases software that was this problematic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T20:32:26.000Z",
          "Titre": "Continually force closes",
          "Contenu": "Continually force closes, crashes the app, and then all of your edits and efforts are lost so you have to start over entirely. Cool app, but entirely unusable given the lack of stability. Took 13+ attempts to work through editing 486 pictures in 100 image batches. Hope they fix it and make it stable, but until then I don’t believe this product is usable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:36:18.000Z",
          "Titre": "I have the standalone denoise and such…",
          "Contenu": "I have the standalone denoise and such and those work better. The beta features are unusable and the ai for photo ai seems lacking. I regret my purchase.  I was hoping for a one click fix on some minor issues but it seems more aligned to lower quality images than what I’m starting with. Simply not compelling. The other stand alone versions though, def. This thought was a waste of money though imho."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tarick Mahmoud",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:26:22.000Z",
          "Titre": "I like the customer service but the app…",
          "Contenu": "I like the customer service but the app it self does not help (in my expeience) unless the video you are \"enhancing\" is already at least SD. Which is stupid. SD videos are already viewable to a practical degree."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Knut",
          "Nb_Reviews": 14,
          "Date": "2023-12-03T16:45:58.000Z",
          "Titre": "Too expensive just for 1 years licence",
          "Contenu": "Too expensive just for 1 years licence. And pushing programs in their advertisments"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Clive Sutton",
          "Nb_Reviews": 14,
          "Date": "2023-07-15T11:32:15.000Z",
          "Titre": "Regretfully, programme will not work on…",
          "Contenu": "Regretfully programme will not work on my PC!!On the other hand, your agents were very helpful  regarding my difficulties, with my grateful thanks, offered me a refund almost immeadtly by return.Will certainly purchase again, when and if I purchase a new PC?Many thanks.CBS."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tony Bowden",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T01:42:53.000Z",
          "Titre": "Not Impressed",
          "Contenu": "I’ve been using Topaz for years. I recently purchased the ‘new’ version. Disappointed as at this early stage it seems inferior to the original version. Waste of money updating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gigi Adaya",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:55:13.000Z",
          "Titre": "Why is it when i upscale the photo",
          "Contenu": "Why is it when i upscale the photo, the only parts that are upscaling is the face area? The rest is still blurry and distorted? Also, my question if it’s better to use 2x or 4x for Ai image in size 1024x1024 and never get a clear answer"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Kiely",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T16:46:34.000Z",
          "Titre": "Hi I have only given a low score…",
          "Contenu": "Hi I have only given a low score because I have only just purchased the software … and I have not had a chance to use it. I do wonder however whether I should have purchased Topaz Photo AI rather than the individual elements of the software. Your views would be welcomed … I amAn amateur photographer andDo not like to spend hours undertaking post processing !!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "AJB",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:11:54.000Z",
          "Titre": "Topaz video AI 4 is buggier than ever",
          "Contenu": "Topaz video AI 4 is some how even more buggy than its predecessor. Don’t waste your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michele Cipriani",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T23:25:47.000Z",
          "Titre": "I used to rely on Giga Pixel.....not any longer",
          "Contenu": "Until one week ago I would rely on Giga Pixel, I don't know what happened....I have used the software professionally for about 2 years. On my last job everything went wrong. I had the strangest artifacts when using the software and upscaling pictures only 2x. I updated the software and even spent $ 50 on the update to solve the problem....nothing! To this day I don't seem to find a solution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T22:48:35.000Z",
          "Titre": "The upscaling really isnt that great",
          "Contenu": "The upscaling really isnt that great.  Its either not noticeable or it distorts everyones faces.EDIT:  After receiving this response from the creator of the software, I'm even more disappointed.  Instead of acknowledging the issues with their software (which are reported hundreds of times in various forums), they choose to explain away feedback they receive.  I will not be renewing my license with Topaz."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Michael Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T05:01:22.000Z",
          "Titre": "Installation issued",
          "Contenu": "Cannot get it to complete installation. Error messages and then it stops and rolls back. Tried with virus protection turned off with no effect."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "TobyGoodman",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T10:38:04.000Z",
          "Titre": "Deceitful",
          "Contenu": "Originally when I purchased Topaz AI there was no notification that this was a subscription for the product. I am absolutely pissed off this is how they choose to trap people into a subscription plan."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Michel",
          "Nb_Reviews": 7,
          "Date": "2023-09-18T20:22:09.000Z",
          "Titre": "VIDEO AI is just not working",
          "Contenu": "I purchased VIDEO AI and it  just does not work at least to enhance videos (enlarging might be a different issue). If I could I would ask for my money back. My only hope is that you work hard to make it a usable software"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Luche",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:39:09.000Z",
          "Titre": "Totally crap..",
          "Contenu": "Totally crap... I'm trying to make a pic better with the AI... 1,5GB downloaded, many models downloaded for the AI... And the image is the same, the only thing that this crap can do, is to x4 the size, very incredible the AI, nobody can x4 a pic before you !!!!What a crap"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Von S",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T21:22:16.000Z",
          "Titre": "I purchased topaz sharpen AI",
          "Contenu": "I purchased topaz sharpen AI, it stoped working, now you made me buy $49/year subscription to continue to use the same software for which I purchased perpetual license. How do you think i feel about the product? It sucks"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Punkbirdr",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T17:19:04.000Z",
          "Titre": "You guys spam my FB page with your…",
          "Contenu": "You guys spam my FB page with your bullsh*t ads far too much for my liking."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas E Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T17:26:21.000Z",
          "Titre": "Does Topas remove grain in video?",
          "Contenu": "Bought it for the slo-mo and sharpening of footage, but I discovered that Premiere already does this very well. I thought it would help remove grain from low light footage, but it does not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Drexler",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T22:55:58.000Z",
          "Titre": "I am disappointed in the performance of…",
          "Contenu": "I am disappointed in the performance of topaz products. When I initially bought them, things were very crisp and clear. But, after a few tries with different photos, they are just smoothing everything out and it’s distorted. I would not recommend buying the product. It needs a lot of work to get things crisp."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Little",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T19:02:08.000Z",
          "Titre": "The program still does not function…",
          "Contenu": "The program still does not function properly. As a stand-alone product, the workflow is interrupted and takes longer to process images. I ahve to run the program in Administrative Mode to work, and doing so breaks the Installed Filter in Adobe Photoshop, causing the Photoshop product to close with an error box."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T16:59:00.000Z",
          "Titre": "I keep getting blurry results",
          "Contenu": "I keep getting blurry results (in some parts of the design), it doesn't matter if I reset or restart, the images are not crisp and clear. I've had to use a different free upscaler instead. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A guy in Tecas",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T16:44:08.000Z",
          "Titre": "Photo AI is NOT AI",
          "Contenu": "Photo AI is NOT AI! It sucks! Photoshop is far superior! My gut told me to stay with Gigapixal. And use Photoshop. Live and learn! I would have given you 0 stars for Photo AI, but it wasn't an option!Dear Mr. Operations Manager! I have been banned from this forum for speaking my opinion about Photo AI."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ion Ciobanu",
          "Nb_Reviews": 3,
          "Date": "2023-05-02T21:57:33.000Z",
          "Titre": "More like scammers than a better quality",
          "Contenu": "Well, I have tried some videos with a low resolution and there was really  no difference, it just sharpens a bit the image witch I can do with out paying 300$. Maybe for photos it works but I really didn't see the difference for videos."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Grimes",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T23:30:34.000Z",
          "Titre": "Program will not download on my computer as stated above.",
          "Contenu": "Program will not download on my computer saying I must upgrade Wizard. I have no idea what that means so I still have no program that I purchased."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Peter",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T23:29:26.000Z",
          "Titre": "Your software unfortunately was not…",
          "Contenu": "Your software unfortunately was not compatible with either my laptop or desktop and you refunded my payment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lanny",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:48:09.000Z",
          "Titre": "Terrible customer service.",
          "Contenu": "Program continually freezes up and the only customer service I can get is generic email responses that do not help. Topaz refused to call and help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James V. Jordan",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T17:47:46.000Z",
          "Titre": "The software doesn't work, Topaz Labs won't help",
          "Contenu": "The software doesn't work.  It does appear in Lightroom as a plugin, but when I attempt to open it, it takes me to web page that says, \"this site cannot be reached.\"  I have sent Topaz Labs messages about this via its website.  No response."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "paul",
          "Nb_Reviews": 23,
          "Date": "2023-09-28T17:34:55.000Z",
          "Titre": "Waste of Time...",
          "Contenu": "A Support Specialist within Topaz Labs Support was a waste of time. Completely ignored the question I asked and just replied with a generic script"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ThreeG",
          "Nb_Reviews": 4,
          "Date": "2023-05-02T18:10:35.000Z",
          "Titre": "I should have tested the product prior…",
          "Contenu": "I should have tested the product prior to purchasing it. I already have DXO PhotoLab 6 which I believe if far superior to Topaz. I wish I could get my money back. The results are subpar and the processing time is ridiculous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith Klodzen",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:26:25.000Z",
          "Titre": "How do you use Topaz AI as a plugin in Affinity Photo V2?",
          "Contenu": "How do I use Topaz AI as a plugin in Affinity Photo V2?  I can't figure it out.  The info provided is for for V1.  I'm not sure this is a Topaz issue or an Affinity Photo 2 issue. Having to do everything then exporting to a jpg and then using Topaz seems to defeat the purpose.  For the time being Topaz AI is a nuisance that doesn't seem to be much of an improvement over what can be done solely with Affinity Photo V2"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "GD",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:49:32.000Z",
          "Titre": "Upgrade really isnt any better..",
          "Contenu": "Upgrade really isnt any better than previous versions. The interface now is overly complicated and hard to navigate. Does do a good job of up-res medium quality footage, but not much of a difference from AE or Resolve exporting in larger formats. Pictures still goto either watercolour and generally flicker in upressing low quality footage. Overall extremely expensive for a product that doesnt deliver. I wont upgrade again."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Doug Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:35:05.000Z",
          "Titre": "Great product but no service.",
          "Contenu": "I just wanted an upgrade and was asked to pay full price. Challenge this and accepted an appropriate small discount. Challenge came when I went to use it. Required to activate. That went successfully until I tried to use it. Required to activate again and again and... Would love to use this fantastic product but nobody is responding to my call for help..."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Niels Groenendijk",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:46:52.000Z",
          "Titre": "Im really disappointed with the..",
          "Contenu": "Im really disappointed with the results, the shots i tried didn't have so much improvement or no improvement at all.For the slowmotion shots i tried, i seen many artifacts and mistakes in the Ai which made the shots unusable. (It was the main reason i bought it)Maybe i didn't use the right footage/settings but i wouldn’t recommend based on my experiences."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 8,
          "Date": "2023-12-08T17:26:31.000Z",
          "Titre": "Yet another money grab or real upgrades?",
          "Contenu": "The purchase itself was easy enough. The low rating is due to Topaz eliminating apps and/pr not updating older apps that are extremely useful and were reasons myself and others purchased Topaz produces in the first place.  If Topaz wants to combine products like with Studio, Okay, but not just charge them in what looks to be a money trap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony DeSanto",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T01:37:58.000Z",
          "Titre": "No RAW Format Support; Horrible Workflow. Don't Bother with Upgrade.",
          "Contenu": "All the marketing material indicated that RAW support was now available in the new version AND that I'd be able to do everything from Lightroom.  I paid for the upgrade based on that, and soon after found out that NO, Denoise AI still has to create a TIFF file...so, guidance is that denoise should be done early in the workflow, but it has to be a TIFF instead of the RAW file. Seriously weird and clunky workflow.Oh, BTW, I cannot open Z8 or Z9 RAW files directly in this version of Denoise AI--I get error messages.  Seriously?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T17:03:16.000Z",
          "Titre": "Flaws in Photo AI",
          "Contenu": "OK... so when I use Photo AI, LRc does not recognize the file as DNG. LRc will open the file, but you can't process the file using Subject Mask, Background Mask or Sky Mask. It's actually pretty annoying. So, I usually end up using DeNoise."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter Crowell",
          "Nb_Reviews": 5,
          "Date": "2023-12-03T01:48:11.000Z",
          "Titre": "To stay or to go?",
          "Contenu": "I have been a strong supporter and user for many years encouraged by your appearances at KelbyOne events. Today, I am confused about your strategic direction. As a small volume user, who has been sidelined by sickness for quite some time, my return leaves me not able to decipher how your products will now fit into my workflow. I will work on it for a bit, but may abandoned my considerable investment in your products."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Osgood",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T22:02:37.000Z",
          "Titre": "Disappointing results.",
          "Contenu": "Disappointing results.The results I got from the Ai software was disappointing. After reading the promos, I expected that the output was going to amaze me, but it didn't! The results I get from the other Topaz software and Adobe software are as good if not better!A waste of money!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ai",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:03:11.000Z",
          "Titre": "The eyes tend to look unnatural.",
          "Contenu": "The eyes tend to look unnatural.No levels that I see to reduce the effects.The effects are not significantly better than Adobe's Denoise and Neural filters."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T12:32:56.000Z",
          "Titre": "Topaz Video AI technical support very weak",
          "Contenu": "I had hoped that Topaz would be able to help me with my technical issues with Video AI. To be told by a fellow user that I have to go to Reddit for help is not what I'd expect, with nothing coming from Topaz itself is very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ME",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T15:42:12.000Z",
          "Titre": "Disappointed, but holding out hope",
          "Contenu": "I finally bought Topaz video ai during the holiday sale after being tempted for a long time.I am disappointed to say the least.  After seeing promotional material video ai enhance looked too good to be true, and after using it, it was too good to be true.The install did not come with any presets, so I have been burning lots of time trying to figure out the filters.  I cannot seem to achieve the amazing results that promotional material demonstrates.  Usually when I try to upscale and enrich the detail I end up with muddy high def videos.I will keep experimenting, but it would be great to have some actual presets so I don't have to waste tons of time with trial-and-error."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 10,
          "Date": "2023-11-28T02:20:55.000Z",
          "Titre": "Fine, but limited.",
          "Contenu": "The video AI tool is fine for creating slowed down clips and higher res footage, but beyond that, it’s a tough sell. For what it costs, there are certainly more economic options out there that offer results on par with Topaz AI - if not better. I sought a refund due to the middling results."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jade Simms",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:27:36.000Z",
          "Titre": "Instant buyers regret",
          "Contenu": "Instant buyers regret. I thought it would be something extraordinary but I can do better upscaling and denoising in localized stable diffusion and the light and colour correct is something I can do quickly in light room. Yeah, its fast, and good for a quick fix, but does not match up with the level of professional output I need."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trey Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:42:31.000Z",
          "Titre": "Different experiences on different…",
          "Contenu": "Different experiences on different products.Photo AI is pretty good — I may keep itVideo AI is a disappointment.  I am have a hard time just getting to work.   Has taken a lot of time.   No idea I needed how much real time internet traffic would need to be handled.   I do not have high speed where i am."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Photo video pro",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:07:03.000Z",
          "Titre": "There is no way to get an output",
          "Contenu": "There is no way to get an output: it always gets stuck with errors. Setting memory usage to 50% or less as their customer service suggested helped but only up to a point. Let's say it's a great idea but it's not polished yet..."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Wagner",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T20:16:27.000Z",
          "Titre": "Too slow - Even on an Mac M1 Pro 16 GB - How to Insert Topaz in My Workflow?",
          "Contenu": "Could not perform any useful action with the product for Video Related things. I work with 1080p 60p footage for weddings, and I'd like to convert everything to 4K 60p using Topaz, that is the main goal. Another thing would be stabilize the footage:1) For stabilizing - I send to the tech team a video, where stabilization was very bad, full of blurring artifacts; and worse: it's 2 hours processing for each 30 seconds of footage.2) For 1080p60 to 4K60 conversion, it takes also a lot of time to process as well. If using Nyx, it's 48 seconds pear each second of footage. Using Proteus, it's 25 seconds per each second. 3) The most frustrating: There are still several features to be tested. But: how? Every time I want to test something, I need to plan to lose 1 hour of my work, just to see the results, even on a 15-second video.So there you have it. Maybe Topaz is not meant for M1 MacBooks, but for Windows machines with big graphic cards. At this point, I plan to return the product, simply because it seems impossible to insert it into my workflow. Please help me out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lejon",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:23:53.000Z",
          "Titre": "My computer keeps crashing",
          "Contenu": "My computer keeps crashing. I have no idea where to start to understand the models. Tutorials are hard to find for Mac, etc. Maybe Topaz is built for P.C? I hope no one is laughing at me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Gervich",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:54:19.000Z",
          "Titre": "VERY Average",
          "Contenu": "VERY Average, for the amount of money that it costs.  It is way overpriced.  I thought it would fix noise and sharpen images and use AI to \"fill in the gaps\" to make your images look sharp and clean.  It does NOT do this.  It makes your images look like they have a filter on them.  In my experience, it makes the skin look like someone ramped up the Luminosity, giving it that dreadful \"Plastic\" look.  When you use the tools, it will mask out the face however it will not adjust any of the other exposed skin so it doesn't match.  If this thing cost like $50, it would be fine, but it costs a lot of money, and you only get one upgrade so long as it falls within the year of your purchase, otherwise you have to buy it again if you want later updates.  I feel like you could probably get similar results using older sharpening methods and the denoising isn't very good, especially if you have other exposed skin that you'll have to adjust manually anyway."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Nick Hilligoss",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T05:03:14.000Z",
          "Titre": "I bought Topaz Video AI for speed change",
          "Contenu": "I bought Topaz Video AI for a very specific purpose - to slow down shots that I animated in stop motion.  In particular, walking shots, where Da Vinci Resolve Studio and After Effects CS5 both struggle with frames where one leg crosses in front of the other, or moves too far from one frame to the next.  Video AI is similar to Da Vinci in that it does not seem to drag parts of the background along like AE does, but it is worse with parts of the leg disappearing in the new frames.  It also had problems with a repeating pattern of roof shingles (a Baba Yaga hut with shingles, and chicken legs walking, in case you wonder how those things go together).  DaV also had weird ripples in the shingles, but AE did not.  Like other software, there are online videos showing how well Video AI does slowing down simple objects like a moving car, but it has the same limitations with more complex objects changing in shape as they move.  I can see it has many good points, but failed at the one task I needed it for.  I should have downloaded a free demo and tested it first."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Alastair",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:14:22.000Z",
          "Titre": "Results are not what we're sold",
          "Contenu": "Results are never quite as impressive as marketing would have you believe. Processing is excruciatingly slow, which honestly would be fine if not for the underwhelming results. Incredibly unintuitive settings might make sense to app developers or ML engineers but are downright topsy-turvy to a film or video professional. For deinterlacing and upscaling I get comparable results much faster using DaVinci's Neural Engine and for denoising Neat Video does a far, far superior job in a fraction of the time. One day, ML video restoration might be the magic fix that Topaz Video AI is sold to us as, but right now it's not even close."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald Norris",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:56:49.000Z",
          "Titre": "I’m just not sure I’m getting the best…",
          "Contenu": "I’m just not sure I’m getting the best possible results for my video from 1991.  It would probably serve me better if I had a coach that know the basics."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Kevin Crosado",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:41:32.000Z",
          "Titre": "Topaz system forgot my password yet…",
          "Contenu": "Topaz system forgot my password yet again – I used to have to renew it each time I installed a Gigapixel update, at least PhotoAI hasn't been quite that bad yet."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Shawn Vz",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:52:50.000Z",
          "Titre": "DeNoise great, Photo AI not",
          "Contenu": "I am an avid user of the DeNoise product. It works for me and I trust. I have since upgraded my Lightroom and thought I would also upgrade my Topaz account. But I regret it, as the Topaz Photo AI product does not work as advertised, I commonly get weird patches when using the sharper and denoise toggles and the photo is unusable. The best workflow right now is the DeNoise and or the new Lightroom DeNoise toggle. But work well in their own way. But the Photo AI is not worth investing in"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Pneus Online client",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T00:14:41.000Z",
          "Titre": "Not as good as the old one.",
          "Contenu": "I had a copy of the old version of Topaz denoiser but unfortunately lost it so had to purchase the AI release.This is extremely slow in comparison & does not seem as flexible as the older denoiser. Is it possible to still download the old version & use the licence just purchase."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Luca Intini",
          "Nb_Reviews": 8,
          "Date": "2023-11-21T11:29:13.000Z",
          "Titre": "Still young",
          "Contenu": "The software is good to give a fresh layer to old pics, but the fundamental AI part is weak.For instance, it usually gives people two different eyes in colour, depth, and, very often, the person is \"looking in two different directions at the same time\", one eye is looking down, the other one to the East."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Russ Kehler",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:44:25.000Z",
          "Titre": "Lightroom is Much Better!",
          "Contenu": "I have been using adobe's Lightroom for years and honestly I find that to be a much more useful product. I was not impressed with the processing that topaz did on my photos at all. There's an awful lot of hype out there but I'm just not sure for someone who knows how to use processing software if it's really worthwhile."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T20:00:45.000Z",
          "Titre": "Every time I open the program it has be to…",
          "Contenu": "Every time I open the program it has to load more profiles which wastes a lot of time. I wish I hadn’t done the last 3 upgrades. Is there a fix for this issue. I already uninstalled and reinstalled Topaz Photo AI…problem still persists. Please fix this!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T03:59:22.000Z",
          "Titre": "I’m not super impressed tbh.",
          "Contenu": "I’m not super impressed tbh.It cost a lot of money and isn’t a plug-in to the editing programs. Neat video and red giants denoiser are better and you can do things like match grain in real time. Not export something in one program, export that file and then see if it matches up in another program. I wouldn’t recommend this product"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Thorben Technow",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T10:50:07.000Z",
          "Titre": "I would prefer a abo payment option",
          "Contenu": "I would prefer a abo payment option, support for just 1 Year is too less for a software with that price. I would love to pay 11 € a month and have everytime the newest software"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Alnoor Manji",
          "Nb_Reviews": 9,
          "Date": "2023-11-16T17:42:40.000Z",
          "Titre": "Initially thrilled, now disappointed due to repacking as \"new upgrades\"",
          "Contenu": "I have owned all the photo/video products from Topaz AI and was originally thrilled by the functionality, capability and ease of use. In the last two years, Topaz came up with a totally new upgrade version of Video AI and Photo AI with monthly updates. The newer products, especially, Video AI dropped the side-by-side functionality offered in the older versions. I wrote to them about my disappointment of starting from ground zero to await such basic functionality. There is literally an update every month to fix issues or bring back lost functionality and repacked as improvements. The upgrades are quite expensive and it becomes an endless cycle of continuing to pay for products which are being recycled as \"new and improved\" only to reinject lost functionality. Loyal customers don't seem to get reasonable discounts. I just stopped upgrading to save unnecessary spend"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Gucciardo",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T16:39:31.000Z",
          "Titre": "Very slow and confusing to use",
          "Contenu": "Very slow and confusing to use. Can't see different up-scaling results in preview before exporting. Better support and training is needed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DA",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:42:43.000Z",
          "Titre": "AI Photo not compatible with computer",
          "Contenu": "Photo not compatible with computer. Latest version raised min requirements to different OS posted on websites"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T20:23:00.000Z",
          "Titre": "Topaz Denoise inferior to alternatives",
          "Contenu": "Topaz Denoise doesn't offer anything beyond what can be done in the latest versions of LR or ACR. I'd even say that the retention of detail is better in LR. Also DXO PureRaw does it better than Topaz, especially with retention of details (even if you increase the detail retention in Topaz via settings). It's just not worth it for $80."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Dennis Fletcher",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T23:51:21.000Z",
          "Titre": "Photoshop cc6 and topaz sharpening tool",
          "Contenu": "Hi, I have Photoshop cc6 (10 years old) I love it and use it everyday.  I am scanning my thousands of negatives, I purchased Topaz noise reduction last year and very happy with (especially for old negatives)….I purchased topaz AI sharpening two weeks ago and found when using photoshop it some times slows down or freezes, then I must turn off everything and start again….did I do something wrong?   I turned off photoshop when I installed the my new topaz product…."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Bartosz",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:17:43.000Z",
          "Titre": "no memory",
          "Contenu": "I cannot set the temporary file to MACthe program often crashes due to lack of memoryworking on large files is troublesome"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:47:58.000Z",
          "Titre": "The noise reduction is well done but…",
          "Contenu": "The noise reduction is well done but the way people's faces become distorted makes it so that the photos are entirely unusable. I tried with and without the face detection on. As of right now. It was a waste of money for a portrait photographer. Hopefully the issue can be resolved soon."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Philip",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:01:41.000Z",
          "Titre": "Closer to 2 than to 4",
          "Contenu": "I bought Topaz Denoise AI a couple of months ago. It works ok and its easy to use, but on balance, it is not at all as powerful and useful as advertised. It might help you a little, with some photos, occasionally. But sometimes it actually ads noise to photos instead of taking it away."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mike hicks",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T10:41:12.000Z",
          "Titre": "I guess it's just the learning curve",
          "Contenu": "I guess it's just the learning curve. It seems complicated. I keep referring to the beginner tutorials, and they have helped some. But I really feel like I don't know quite what I'm doing. I've done a couple of videos and I can see some improvement in one of them. But one came out even worse than the original. I know it's gotta be the settings are wrong, but I just don't quite understand them."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Catherine Tolton",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:32:54.000Z",
          "Titre": "Extremely disappointed with Photo AI",
          "Contenu": "Extremely disappointed with Photo AI.  Pictures often turn out distorted and unusable. Frankly I find Lightroom's Denoise tool far more realistic and satisfactory"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark Dobie",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T17:25:56.000Z",
          "Titre": "My software program keeps shutting down…",
          "Contenu": "My software program keeps shutting down whilst in the process of editing within Ps Lightroom Classic or when using solely. Software is at the latest edition Version 2.0.1 with latest updates installed. Really frustrating that I can't use it after paying so much for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff P",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T18:16:06.000Z",
          "Titre": "Does work in some cases but there are a lot of limitations.",
          "Contenu": "I'm a bit disappointed in its ability to enhance faces. I'm not finding that the software is able to upscale a video of a person talking on camera. It's also extremely slow to process clips, so enhancing longer videos is likely not an option."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ashley Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T04:16:37.000Z",
          "Titre": "poor video ai documentation when it comes…",
          "Contenu": "very poor documentation when it comes to using the video ai software, it's very unclear about the cause and effects of using different sliders it is not a simple top use software, require multiple hours of learning and testing to create the desired results. no help from support"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Jithesh K Narayanan",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T18:51:40.000Z",
          "Titre": "The product is still not giving quality expected",
          "Contenu": "The product is still not giving the quality that I expected. When upscaling there are lots of patches coming and missing lots of details on the visuals.I strongly think still your team has to go a loooong way to fix these issues."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kevin Houldcroft",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T18:02:07.000Z",
          "Titre": "To be honest I need a new computer to run this program",
          "Contenu": "To be honest, I got your softwand I thought it would run on the same computer that I ran my other topaz software but but it said I needed an upgrade to an m one or m two chip. So I am unable to use this software until I get a new computer which kind of stinks"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "TAI",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T12:58:51.000Z",
          "Titre": "\"Error in Model\" not Solved by Topaz.",
          "Contenu": "The software would generate a preview, stop, and then say \"Error in Model\" and produce a support log file.I emailed Topaz Labs and they responded by saying it was to to with a VPN issue. But I do not use a VPN and they had the Support Log.In the end, a full deletion and reinstall worked.Not good enough for such an expensive product."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Petrica Bratila",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T19:08:22.000Z",
          "Titre": "I've been using Sharpen and Denois",
          "Contenu": "I've been using Sharpen and Denoise AI for a few years now and I've been very happy with them. Unfortunately I can't say the same thing about Photo AI, I couldn't get any good results for any of the pictures I've tried until now, they all look unnatural, either overshapenned or too soft. Hopefully it will get better with future updates but until then I'm still relying with the separate softwares. If I knew I wouldn't have spent my money on it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam Turner",
          "Nb_Reviews": 5,
          "Date": "2023-09-17T03:41:05.000Z",
          "Titre": "The new Topaz Photo AI does a poor job…",
          "Contenu": "The new Topaz Photo AI does a poor job at auto masking the subject for wildlife so I just still rollback and and Denoise AI which I think is their best product. If they can fix subject detection, I love the upscaling but as is, I don't use it much."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Boaz",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T16:38:23.000Z",
          "Titre": "Total waste of time",
          "Contenu": "If you bother to read my emails to your customer support you would have known why:1. When I select all functions, and then I adjust one of the function, let's say Denoise, then ALL other functions start recalculating the preview, which results in a total waste of time.2. Color and lighting adjustments are horrible.Thank you for responding. It would have been better if you had responded to the direct messages that I have sent twice.I will try to explain the processing issue again - If I change the setting of the Denoise then I don't need the AI to re-process sharpening since the sharpening settings are the same.IF you are saying that this is how AI works then I would remove the \"I\" from the AI. There is nothing intelligent in this program."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Sparks",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:37:06.000Z",
          "Titre": "No one to talk to for technical…",
          "Contenu": "No one to talk to for technical service; moving to new Mac Mini computer was an unpleasant experience; and losing most Topaz products I paid for. Many problems with no personal assistance; poor online guidance."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Florent Baugnet",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:01:44.000Z",
          "Titre": "The application crach when i want to…",
          "Contenu": "The application crach when i want to upscale over 4x"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen Battino",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T21:40:05.000Z",
          "Titre": "I thought I was purchasing an upgrade…",
          "Contenu": "I thought I was purchasing an upgrade to the Topaz products I had whose subscription had expired but it ended up being products for masking and a redundant photo product, both that I have no use for. I feel like it was a tricky attempt to sell products that have become obsolete with the newest versions of Photoshop."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T23:04:43.000Z",
          "Titre": "Topaz doesn't live up to the hype…",
          "Contenu": "Topaz’s performance and outcomes don't remotely live up to the advertising and hype. Photoshop’s AI is much better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T00:38:15.000Z",
          "Titre": "One out of three turned out well. Disappointed : (",
          "Contenu": "I used it on a few clips.  The first clip that had lots of things in the background as well as a lot of detailed tattoos turned our horrible : (  The second video was a closeup of two people talking outside around noon with strong light from and shadows.  Using topaz made the the skin look fake : ( The third video worked amazingly well.  The guy in the video had a closeup and he was wearing a white jacket with a white background and his skin turned out great!!"
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Markus K.",
          "Nb_Reviews": 3,
          "Date": "2023-10-10T17:41:20.000Z",
          "Titre": "Overall a bit to less for what you pay",
          "Contenu": "The tools they offer are ok in my opinion, bit a bit overpriced. I hope future updates make some improves as some other tools i used worked better an were cheaper!"
        },
        {
          "Note": 2,
          "Lieu": "MT",
          "Pseudo": "Peter bartolo parnis C/o Maureen inch",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T12:06:06.000Z",
          "Titre": "Apart from the fact that it resulted…",
          "Contenu": "Apart from the fact that it resulted that both my 2015 MacBook Pro and my 2012 iMac are not strong enough to handle Topaz Photo AI efficiently To be quite honest, I did not notice all that much improvement on my images. Frankly I purchased your photo AI on the strength of the various posts on fb.I have to admit that your customer care representative Mr Lingyu Kong, deserves four stars for the way he took care of me.Apologies if I have been negative, it is not my intention.Sahha,Peter."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maxximillian Crypto",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T03:12:51.000Z",
          "Titre": "Finally got it working after 9 months",
          "Contenu": "My customer service experience was faaaaaaaaaar from acceptable. Faaaaaaaaar. It’s like WTH did it take so long for my issue to be understood and addressed properly?There’s just no excuse for the extremely thoughtless responses I received the first several times I reached out. It’s as if nobody was actually reading my message until today when - for the first time - I received a suggestion to help resolve the tech issue. The advice I received worked like a charm. HOWEVER, waiting since September 2022 for tech support is a big nope from me. Five stars for the product. But the long wait for help is completely unacceptable.Be prepared to be mythically persistent if anything goes wrong."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "PM",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T12:43:31.000Z",
          "Titre": "Topaz owners has a hi update cost, also bugs needs to be free patched in previous versions!",
          "Contenu": "I forced to upgrade to last version due errors in processing in my Topaz Video soft under Mac M1Pro. I understand your politic of upgrade pay after a year, but only for new features, bug fixes must to be solved in any version, covered or not by free updates. The second thing that, sorry, can't understand is the High price of the upgrade renewal, is insane to Topaz owners... At least the good news, my new Video version is amazing, the interface of the user also the direct export options are a BIG change from my previous version"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T16:59:04.000Z",
          "Titre": "Overcorrecting",
          "Contenu": "I find that the modules over correct to a point that my photos look fake. Overly sharp or overly soft, losing detail. Blur gets added in the denoise, for example. It’s not an easy program to navigate, and I don’t care for autopilot on AI. I am no stranger to Photoshop and I find that my ability to  correct in PS remains better than what Topaz offers. I wish there were more options for individual sliders, as the ones offered seem to overcorrect still. I am still not happy with Topaz, but so many people use it, I will keep seeing if it is valuable for me in the long run."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim Hallam",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T21:32:54.000Z",
          "Titre": "Many artifacts were introduced to the…",
          "Contenu": "Many artifacts were introduced to the images I processed from each program I tried. Denoise, Sharpen, and Gigapixel. These artifacts took considerable time to clean up in Photoshop and some could not be fixed at all. For the good Topaz products did, they did an equal amount of bad. I ended up returning the software and went with DXO PureRAW3 for noise reduction as I experienced far better results for my type of photography. Wildlife, landscape, wide-field astrophotography."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark_Cale",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T10:02:19.000Z",
          "Titre": "Better options out there that are…",
          "Contenu": "Better options out there that are cheaper and as good like UniConverter which will also upscale to 4K and 8K. Unlike the Topaz video app UniConverter will also read all file formats and is much cheaper. Topaz does not read and convert old MP4 files on Apple that you may have captured in the past. At its price, Topaz is not fit for purpose."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rainer W.",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T07:15:12.000Z",
          "Titre": "Disappointing",
          "Contenu": "I have been testing their photo enhancement tool a while ago and I must say that I'm quite disappointed. A friend has been recommending me this software. You either see little to no difference, or the results look absolutely artificial, unreal or simply out of a horror movie. I have been using applications out of the Play Store before that cost as little as 1,99$ week/months and I honestly can't say that their results were any worse. I have been testing all kind of photos, ranging from studio shots to retro photos from one of the very first Nokia phone cameras. The output is hardly ever something I would actually use, as the result often looks just sketchy. Considering this software costs 199$, I can honestly not recommend it."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "David Fitzhugh",
          "Nb_Reviews": 4,
          "Date": "2023-06-11T17:43:12.000Z",
          "Titre": "An overated and over priced product.",
          "Contenu": "The expectations from all the advertising are quite high for this product but it fails on several levels. First, it is very slow to proccess each photo. Second, the results are not much better if any, than what I do on my own. Third, the price is very high for the results I have gotten. The program is limited as to its usefullnes, mainly only sharpening and adjusting some blurring not really usefull for full editing, removng objects, adding or adjusting backgrounds and things that typical programs for editing do give you. I will still use it on occasion but it will not be my \"go to\" program for editing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T16:21:01.000Z",
          "Titre": "Can’t use your product 90% of the time",
          "Contenu": "Denoise for daylight photos it’s fantastic, for lowlight images not so much, which is what I do for the most part. To many many details are lost. Giga pixel is useless, all the photos I render had a translucent square grid on them that is totally visible. Sharpen I haven’t use yet, so I can’t give you feedback on that one. Not a cheap product for what I got, that I can’t use it for my workflow 90% of the time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AAA",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:47:35.000Z",
          "Titre": "Not as good as the competition"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Lambert",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T17:46:00.000Z",
          "Titre": "I think Photoshop enlarged an image 400…",
          "Contenu": "I think Photoshop enlarged an image 400 percent than Topaz did. Thats just my opinion as a fine art printer."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "ASTLE",
          "Nb_Reviews": 34,
          "Date": "2023-08-20T20:41:32.000Z",
          "Titre": "Disappointing direction",
          "Contenu": "Disappointed that you have de supported your creative tools which were superior to anything else on offer. Intead focussing on image quality which many others do. I’m just bringing my software up to date and then sadly this will be my last purchase from Topaz."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Rob Blakers",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:40:46.000Z",
          "Titre": "Processing even short (60 second) clips…",
          "Contenu": "Processing even short (60 second) clips takes hours, and if i do anything else on the computer while that is in progress my 3.8 GHz 8-Core Intel Core i7 iMac, with 64GB memory freezes and crashes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Edwards",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T22:12:07.000Z",
          "Titre": "You are asking me to give you a review…",
          "Contenu": "You are asking me to give you a review only days after I purchased and installed it.  I need more time to use it before I can give it an objective review.  So far my experience has been mixed.  It appears to do a decent job but with custom settings.  The autopilot doesn’t really satisfy my needs.  The software takes a long time to process a file.  This would be alright if the results justified it.  But…I need more time to use it.  Maybe in a month or so I can give it a fair review."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Paul Vancraybex",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T21:03:51.000Z",
          "Titre": "topaz film is too slow",
          "Contenu": "topaz film is too slow. a one-hour movie takes more than 3 hours to convert to HD format"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GERALD BUCHANAN",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T20:41:16.000Z",
          "Titre": "Troubling Policies …",
          "Contenu": "I find it troubling that you have essentially made every user subscribe to annual updates. I’ve been using Topaz products for a long time and feel that I have been betrayed by your business practices. As long time users we should be given a lower upgrade price plus occasional discounts. One more issue. I am a member of the Photographic Society of America, PSA. PSA is a worldwide organization of approximately 7,000 photographers. Up until recently our members were given a 10-15% discount on all your products. That too was recently eliminated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T13:04:35.000Z",
          "Titre": "Gigapixel AI did not improve any of the…",
          "Contenu": "Gigapixel AI did not improve any of the images I tried. It made them look worse. I suspect it's because I do a lot of landscape photography and distant subjects, and the images I was trying to use were scans of old film photography. The results were less smooth and added too many artifacts to the images to be usable. Also it doesn't really work with known subjects. I tried a photo of the airforce thunderbirds and the numbers and symbols on the aircraft were distorted. I previously used FX photolab and enjoyed that product highly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KBM",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T20:04:08.000Z",
          "Titre": "Software is slow",
          "Contenu": "Software is slow.  Sometimes freezes up my computer.  If I walk away for 40 mins it usually clears up.   Not impressed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JnJ",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T19:21:43.000Z",
          "Titre": "I bought the Photo AI",
          "Contenu": "I bought the Photo AI, having used Sharpen and Gigpixel in the past. Honestly I am not impressed - AI, as it functions right now, is a dumb down Beta combo version of the older suite. Why get rid of the 4 up which is very helpful in the workflow to determine what setting works best?Also, roundtripping from C1 is not working properly, yes I am utilizing \"process in\" instead of \"edit with\" like for other apps. I had artifacts on several test images processed in Photo AI compared to other apps.not Topaz's CS was unhelpful, just sending some basic generic tips that I already tried so I had to trouble shoot on my own to get the app to work. Much too expensive for what it is!"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Lars",
          "Nb_Reviews": 6,
          "Date": "2023-04-25T14:30:36.000Z",
          "Titre": "Overrated",
          "Contenu": "I've been using Topaz labs for several years. I'm a hobby photographer, and have been using Fujifilm x-t3, x-t4 and now x-t5.I find that the sharpening and denoise tool to be somewhat usable at very low sharpening/denoise settings combined with masking work in photoshop. The auto settings are usually very aggressive, and overly sharpen and remove noise from images, often to the point where artifacts are introduced and details removed. I struggle to see any meaningful difference in results during the last couple of years worth of updates. I later purchased DXO Pureraw 2 and 3, and it simply wipes the floor with Topaz Sharpening and Denoise \"AI\"."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 10,
          "Date": "2023-06-09T22:14:49.000Z",
          "Titre": "Overpriced",
          "Contenu": "The software is alright, but extremely overpriced for something you can get with Lightroom if you already have it. Had a few issues where it would make the picture look awful instead of fixing it, had no issues with Lightroom's denoise option on same photo."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Nihal",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:23:36.000Z",
          "Titre": "v 2.0.3",
          "Contenu": "v 2.0.31. When \"plug in extras\" is used on a raw file and \"remove noise\" is used there is a pronounced greenish colour cast.2. When faces are detected with low ISO images many other areas of the image have un-smoothed streaks."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Stephen Roberts",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T22:30:27.000Z",
          "Titre": "Lacks PDF MANUAL and VERY SLOW",
          "Contenu": "I want to download a PDF of instructions not rely on online help.  I have found the Video AI extremely slow.I do love Gigapixel AI.Please consider us older users when designing the interface."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "CLEMENT",
          "Nb_Reviews": 8,
          "Date": "2023-08-18T14:50:08.000Z",
          "Titre": "Always errors",
          "Contenu": "Like everyone on reddit, we can't render vidéos without the problem : \"error\"Even with memory usage of 10%, and different model foldar location, always error, error, error.I quit. Useless software. Just lost 300€"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Herman Koeslag",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:20:25.000Z",
          "Titre": "I should have investigated your product…",
          "Contenu": "I should have investigated your product more before spending the money.I shoot in raw format but your platform doesn’t work well with RAW files"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "elias papadopoulos",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T22:35:33.000Z",
          "Titre": "The noise reduction doesn’t seem to…",
          "Contenu": "The noise reduction doesn’t seem to have any effect at different levels, i tried 1% and 100% but the outcome looks the same, the out of subject area seems to have the same softness regardless of how adjust the sliders. I would prefer to still retain some texture/context in noise area but it just over softens and looks like its been over photoshopped and tacky! Disappointed, The only way around it is that I keep the original file with new softened one combine both files in photoshop and then adjust the opacity in the softened one to get the balance i need, I can’t understand why your software can’t add an opacity dial for the noise mask and that would solve the problem. Im sure it can be an easy fix for your engineers, kind regards Elias"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A 1 & done customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-27T16:20:52.000Z",
          "Titre": "Your days seem numbered...",
          "Contenu": "Your pricing model is too rich for my blood. I can't really recommend you to students and other working artist who aren't working at professional scale with the budgets to afford such things. Your upgrade process is weirdly convoluted and I feel like it takes too much hand holding on my part to make sure I'm running the latest updates. You abandon software for long periods of time and they languish with broken functionality. Your packages install themselves all over the OS instead of neatly into a consistent location and file structure. Though they are problematic in numerous ways, Adobe does a much better job in a lot of these areas I'm mentioned. Your help files and tutorials are not rugged or detailed. The ONLY thing you have going for you is the occasional quality of results, BUT if Adobe adds this sort of processing to PS and PR (like they have in beta) and its even close to the results I'm getting with you, I, and I imagine a ton of others will jump ship."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eop",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T03:06:53.000Z",
          "Titre": "The facial recognition only found my…",
          "Contenu": "The facial recognition only found my wife's face in an old wedding photo once in over 100 tries over 3.5 hours. The one time it found her face it blew me away how well the AI worked to put details back in place like her freckles, but since I couldn't get it to happen again, it was highly frustrating and left me not trusting the product."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Mark Langston",
          "Nb_Reviews": 5,
          "Date": "2023-03-19T17:56:08.000Z",
          "Titre": "On my Mac with Apple silicon",
          "Contenu": "On my Mac with Apple silicon: \"Adjust\" crashes on open. \"JPEG top RAW\"won't open -- icon unresponsive. There is a lack of consistency between the modules in terms of installation, interface, and capability. They've had years to get this all right."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JTM",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T00:17:56.000Z",
          "Titre": "Having your cake and eating it too...",
          "Contenu": "In the past I have appreciated the advanced capabilities and expert level control offered by GigaPixel AI, Noise Reduction AI, and Sharpen AI.Now the movement to a simpler interface with all components bundled in the Topaz Photo AI 2 package, while in principle making use simpler, in practice the motion is happening with loss of control and loss of expert performance.  I gave the above mentioned stand alone apps a 5 star rating before and now the 'one size fits all' Topaz Photo AI 2 gets only 2 stars. Topaz should not dumb down performance in the spirit of simplification. I would suggest (I am a well paid consultant in other industries and you get this advice for free) that you keep a simple exterior and appeal to the masses, BUT have access to the expert capabilities through pull down menus that allow for the same level of control. The current level of control is disappointing in the combined suite. The stand alone apps likely will not be supported well in the future. With the old control afforded by the standalone accessible via pull down menus it would be possible to create an integrated product and not loose for your expert users. The masses could use the auto pilot, while experts can tune... you can have your cake and eat it too... right now I am hungry having lost the calories associated with those lost 3 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Hampton",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T06:16:55.000Z",
          "Titre": "I have been using topaz video Ai since…",
          "Contenu": "I have been using topaz video Ai since V2. In many ways the software gets worse with each version. I have been an expert in encoding, digitizing, capture, conversions, up res, down convert, compression, and file conversions for the last 20 years, for companies in the entertainment system including Disney Studios. I find myself scratching my head at the lack of logic to many of your changes. Additionally the it wasn't until the iris model that your software actually did much that was impressive. But the amount of time it takes to set up a proper up res using the iris model makes the software impractical. I cant imagine ever purchasing an update again because I feel like I am paying to beta test."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Martin von Elm",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T16:40:46.000Z",
          "Titre": "Video AI enhance is not able to render…",
          "Contenu": "Video AI enhance is not able to render Faces properly in upscaling.. it seems the AI is totally off, especially with eyes in childrens faces and low quality input material.. its actually really extremely bad which comes out of it.. eyes look droopy,smeared, extremely artificial, darkened, like drawn with heavy eyeliner, malpositioned. Unfortunately i cant find a possibility to make the program not touch eyes or faces..  all the included Topaz AI Models do that really badly, to varying degrees...The documentation of the software or help is also rudimentary to non exist. Most things are rather selfexplanatory though, but not all. Apart of that the rest of the image looks good, smoothing and stabilizing works well.. upscaling works well, except the eyes of course.Refund policy is honored and done quickly. Contact with TL was friendly and they tried to help, but couldnt. Though, nice company, all in all a software which in some respects is well done and shows whats possible, but unfortunately totally stumbles over a really important aspect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trevor Rapp",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T16:28:10.000Z",
          "Titre": "I was really excited with the purge for…",
          "Contenu": "I was really excited with the surge of artificial intention intelligence to see what you guys could do with a blurry picture. I took a picture that was only slightly blurry, but very easily recognizable as to what it was doing and your product did virtually nothing to improve it. It was a photo of a face and it blurred the nose and sharpened the eyelashes but that was all the difference that I could see."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Connie Doherty",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T16:53:24.000Z",
          "Titre": "The gigapixel does not work and times…",
          "Contenu": "The gigapixel does not work and times out the others I am not overly impressed with the new versions"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "John from Tokyo",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T05:35:14.000Z",
          "Titre": "I bought the software just before …",
          "Contenu": "I bought the software a few days before they gave another sale. If they need to give sales so often, the product must not be priced well so I'm not very happy that I overpaid by $50 for 2-3 days of use of an older version. The product works fine, sometimes not perfect but it does add value to the production and I'm glad I have it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cameron Martin",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T23:02:38.000Z",
          "Titre": "way too proud of your product",
          "Contenu": "you're ridiculously overpriced and offer little to nothing in the way of education discounts. i'm actually sorry i bought the software after having purchased it. it does an average job at the actual work, but seriously you are waaaaaaaay overpriced, for what the software actually does in the way of photo upscaling and there are literally no edit features or ai selection models.  shame on you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T22:48:58.000Z",
          "Titre": "I found it did not do as good a job as…",
          "Contenu": "I found it did not do as good a job as photoshop would normally do. I am not a professional photoshop user, I'm a photographer. I could be using your product in the wrong way, but it really didn't seem to recognize the edges of my rather simple sand dunes against a sky."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "MARIE-ELISE daniel",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T22:39:04.000Z",
          "Titre": "can do better",
          "Contenu": "The conversion or image processing time is too long even with a very powerful graphics card. In the foreground, the image is beautiful, but in the background, the image is not natural, especially at the level of the noses of the people present in the sequence. Their noses are deformed and larger. I think the price of tapaz video  is too high for the final result."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alicia Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T20:42:49.000Z",
          "Titre": "Sharpen AI",
          "Contenu": "Sharpen AI, at first seemed to be a great addition to my professions options but since the last update it is slow and continually crashes. It has slowed my work flow down exponentially.Edit to add:I would like very much to reply to Topaz’s response, but I do not see that option. I have sent a report through the program with every crash."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CG",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:56:44.000Z",
          "Titre": "Overpriced for what you get. Except denoise.",
          "Contenu": "Would expect longer updates to be available for the price. Quality could improve either, especially for that price compared to other free or cheaper products available."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Allen-Scott Redgrave",
          "Nb_Reviews": 8,
          "Date": "2023-07-20T11:59:30.000Z",
          "Titre": "TOPAZ Sharpen and FUJI FILES",
          "Contenu": "Unfortunately the Topaz Sharpen AI is not really comparable with Fuji raw files as they cannot be correctly outputted as a DNG file for further editing in Capture One or DXO. However the great team at Topaz suggested I use the Topaz Photo AI version which has partially solved the problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "No name photographer",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T09:13:35.000Z",
          "Titre": "If you enjoy using CTRL+ALT+Delete you’ll love Gigapixel",
          "Contenu": "Software crashes all the time when processing images. Running on a brand new Microsoft Surface Pro. I have used DeNoise, Sharpen & Photo AI with no issues. Gigapixal needs some work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Cardellino",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T17:58:28.000Z",
          "Titre": "So far",
          "Contenu": "So far, the product processing is EXTREMELY slow. Both stand alone and using Lighteoom plug in.  Can't take over 1 hour to process 2 photos, when on shoots I can have 100+.  My hardware meets or exceeds requirements.  So pretty disappointing."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "David Callam",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T15:27:57.000Z",
          "Titre": "No Insta360 support?!",
          "Contenu": "Hello, Purchased last week to improve the images of my insta360 X3 camera, only to find out a day later it depends on the camera not the jpeg image to have improvements added. I just wasted my money. I do take shots with my D7000 but I really needed it for my Insta360 X3. Quite disappointed. I even applied it to some images I took this year on my Nikon and did not get anywhere near the results I see on your website or on line. I feel I just wasted $200 unless you have a return policy. I would consider buying back in when you have support for the Insta360 X3. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tim everitt",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:58:00.000Z",
          "Titre": "Error diagnosis sidetrack",
          "Contenu": "The program kept error-outing when I pressed Export. The Support guy asked me to send the error log. I did. He said it was a permissions issue with the hard-drive. It wasn't. I kept troubleshooting it until I updated the drivers and that fixed it. I let him know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Norm, former Topaz fan, new Z",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:37:10.000Z",
          "Titre": "Why you think this is a good idea?",
          "Contenu": "I am dismayed that Topaz has chosen to completely abandon the three mainstay products, DeNoise, sharpen, and Gigapixel in favor of putting ALL of their resources on a single product, Photo AI. I really enjoyed using those individual apps and had a productive and successful workflow. I do not in any way feel that Photo AI fully replaces those three individual elements. Add to that the insult of telling me that images from my new Z8 will not be supported on these individual apps and I am understandably feeling deserted. I have never been an Adobe fan but you are now forcing me to turn away from Topaz, grit my teeth, and become an adobe-ite. Very very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carl Muehlemeyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:42:58.000Z",
          "Titre": "My favorite Topaz product is DeNoise",
          "Contenu": "My favorite Topaz product is DeNoise.  On a scale of 1 to 10 I rate it a 20.  It is that good.  It is my go to post processing app after starting with Lightroom.  I recently purchased the latest version of Photo AI.   It doesn't do any better than DeNoise and I don't seem to have the controls over the results as I do with DeNoise.  This may in part be me not seeing the full potential of PhotoAI."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:16:29.000Z",
          "Titre": "Gigapixel AI did a fine job on some of…",
          "Contenu": "Gigapixel AI did a fine job on some of my images. However, even with careful and extensive tweaking of the settings and exploration of all available models, I was not able to produce results comparable to what I saw in the ads. Faces ended up with scars and distortions that were clearly not present in the original. AI up sampling should not be worse than regular up sampling and sharpening. It shouldn’t introduce macro-level features - only micro features “between” the original pixels. I have a feeling the images in the ads may have been carefully selected, just like with most ad campaigns. Because it did allow me to rescue a few images, I would give it 4 stars if it weren’t for the fact that the ads gave me false expectations."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Murry Setzer",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T00:43:27.000Z",
          "Titre": "It was good software however dated.",
          "Contenu": "It was good software however a bit dated. It was ahead of it's time and has remained as standalone software, while other software packages have incorporated many new Ai features together at a single price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:20:18.000Z",
          "Titre": "Seems to work great for low quality…",
          "Contenu": "Seems to work great for low quality stuff. Doesn’t do much to scale up stuff that’s already large and high quality. I thought I could take ~20 megapixels and enlarge it, but it doesn’t seem to do much or allow me to go past 3x."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TERRY K",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T20:20:30.000Z",
          "Titre": "Not as capable as hoped",
          "Contenu": "I found Topaz to work...  \"some\", but so far, it is not as capable as I had hoped. I plan to keep it though, because, as a 54 year photojournalist, I want my images to be the best they can be. The demos in the advertisements may be produced to somewhat overstate the software's ability."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Butcher",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T06:58:18.000Z",
          "Titre": "Works well on some images -- but seemed…",
          "Contenu": "Works well on some images -- but seemed to kind of distort or make faces look fake. The program was also veryyy slow on my computer."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LMP",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:20:38.000Z",
          "Titre": "Super helpful but crazy slow and crashes",
          "Contenu": "Super helpful program but it often crashes and is insanely slow to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fran Lyons",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:42:24.000Z",
          "Titre": "Combine end dates / end the need to log in online",
          "Contenu": "I wish that I could have all of my end dates the same. Since you introduced products at random (photo AI and video AI, specifically), I now have 3 different expiration dates to manage.  I also wish I didn't have to keep logging in to confirm that I'm a valid customer. I'd rather add a license key and be able to use your products even when the internet isn't available."
        },
        {
          "Note": 3,
          "Lieu": "BD",
          "Pseudo": "Karan Chawla",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:52:57.000Z",
          "Titre": "I truly hope for an iPad and iPhone app…",
          "Contenu": "I truly hope for an iPad and iPhone app bundled under the same subscription. Laptops aren't convenient, causing a slowdown in my photography. Overall, the product is good. I eagerly anticipate an iPad and iPhone version from you that can be utilised with the same subscription."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T20:09:11.000Z",
          "Titre": "I'm disappointed that Topaz doesn't fix…",
          "Contenu": "I'm disappointed that Topaz doesn't fix major problems with the older products like Sharpen AI (flickering on MacOS version).  Yet Photo AI isn't ready for prime time to replace the functionality of other products.  Photo AI not being able to keep Lightroom crop and other develop changes is a big miss.  This adds many more steps into the workflow by having to copy develop settings."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Faye",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T13:16:52.000Z",
          "Titre": "Wildlife photography",
          "Contenu": "I use the product mostly for wildlife photography.  I find that the results are acceptable approx 50% of the time I try to apply it.  The rest of the time I revert back to photoshop’s high pass filter for sharpening.  Considering the cost, as compared to photoshop, its value for money is questionable at this point.  Denoise is more reliable than sharpening."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "P. Gunnell",
          "Nb_Reviews": 9,
          "Date": "2023-12-20T16:42:22.000Z",
          "Titre": "The limit to 2 seats per licence should…",
          "Contenu": "The limit to 2 seats per licence should be increased to 3 as per many other companies. I really dislike and still feel considerable disappointment in the failure of Topoaz to continue to support (let alone further develop) some of the software that used to be at the forefront. It’s a gross failure to support existing customers of long-standing, with all that says about future support.Topaz have replied (thank you!) t5o say that my licence enables me to download on as many devices as I wish… maybe I’m doing something wrong, but My experience is that it allows me to download to 2 devices and no more?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Colin Peskett",
          "Nb_Reviews": 10,
          "Date": "2023-12-16T21:15:30.000Z",
          "Titre": "Just purchased new laptop awaiting…",
          "Contenu": "Just purchased new laptop awaiting instruction on how to down load .   When I was able to use software  was most impressed. Will be 5 stars when up and running."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bo Bennike",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T00:26:05.000Z",
          "Titre": "Slow and prone to crashing",
          "Contenu": "Mainly used video AI and photo AI. For upscaling TV format to UHD footage count on 2-3 days of rendering even on systems with large video cards 16gb and up and lots of ram. Makes the MacOS system Sonoma highly unstable and has hard machine crashes when using other software that utilize ram and video card. Photo AI is a mixed bag. Some images it does well, others it makes significant worse regardless of setting and AI models used. In some instances the sharpening artifacts are much worse than using existing built in software filters.My overall impression is a lot of marketing hype but short on actual real life results and performance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Ong",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:27:36.000Z",
          "Titre": "Annoying popups that can't be disabled...",
          "Contenu": "It works pretty well but when it misses it's the stuff of nightmares.  Constantly asks to you use your images to improve the software with an annoying pop-up with what feels like every 5 to 10 pictures you work and I don't think you can permanently disable it. If you are going to do that then charge $25 instead of $200 for the software seeing as you need us to constantly improve it. I am not giving you my data for free."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Barrie Collins",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:15:10.000Z",
          "Titre": "What I dislike is the fact that when…",
          "Contenu": "What I dislike is the fact that when you have finished processing your image and you want to download the file, the system automatically sends it to Topaz (To help) without my consent unless I select do not send. This should be an option when you first use the application and not set automatically. It is an invasion of my privacy and my copyright that is on all of my images. If I wanted you to have them, I'd send them to you. I am not happy with this new function"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:23:06.000Z",
          "Titre": "I bought Sharpen, not sure I'm glad",
          "Contenu": "I bought Sharpen, DeNoise and Gigapixel for nearly full price.  Then you decided to bundle them all in Photo and gave us Photo, essentially in beta, at no charge.  Then when you released Photo V2 - you we had pay for it.That being said, I think Photo V2 (and even V1) over-sharpens a lot, sometimes none of the denoise algorithms remove the noise and there are many more artifacts than with the individual versions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "stephen",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T18:09:16.000Z",
          "Titre": "Upgraded Photo AI and still see issues…",
          "Contenu": "Upgraded Photo AI and still see issues with AI distorting human features, like fingers. Also, would like more user control to define area types within an image. Perhaps there could be different brush types to apply different AI settings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Pieski",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T02:50:59.000Z",
          "Titre": "Cyber Monday Mess",
          "Contenu": "The recent ownership-upgrade-renewal pricing process was confusing at best.  In fact, I would say it was a mess.  There are several members in my photography club that previously purchased GigaP, DeN and Sharpen.  Not one of us could figure out what we should do.  Whoever wrote your Cyber Monday Ad should never be allowed to do it again. And there was no phone number to call for quick resolution.  Conclusion: Great products. Horrible customer support.  I think you got me for $79. I’m not sure what that purchase entitles me to. Not happy about that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeanne",
          "Nb_Reviews": 5,
          "Date": "2023-12-03T04:43:45.000Z",
          "Titre": "Photo AI vs. Stand Alone Program Upgrades?",
          "Contenu": "Don't understand why if I am paying to update Photo AI it doesn't also upddate the stand alone Denoise, Sharpen, Gigapixel which I purchased.  Sometimes I prefer to use the stand alone products and sometimes  use Photo AI.  So which do I pay to update?  Also wish Topaz would not abandon their legacy programs through Studio."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T23:25:12.000Z",
          "Titre": "Please consider art-focused program",
          "Contenu": "The software has high quality with consistent updates, however the decision to drop the 2D art focus has affected my workflow. For example, GigaPixel AI has more natural upscaling compared to Photo AI. Please also consider Studio 3 AI with shareable art FX presets, as that fostered a creative community."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Manfred Kardel",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T12:44:03.000Z",
          "Titre": "I missed offers WITHOUT video software!",
          "Contenu": "I miss BlackFriday offers for loyal photo plug-in users for annual renewal. Like so many people, I'm not interested in video. And I don't have as much money as I'd like at my disposal, where nowadays everything runs on subscriptions and similar models. This world is only for the high earners.What's more, the offers were not easy to understand for someone who is not a native speaker."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T00:17:09.000Z",
          "Titre": "No gamma correction or decent denoising",
          "Contenu": "Surprised there's no gamma correction options (or any basic color correction options). Incorrect gamma on the input file will negatively affects the AI models' ability to do anything well. I was also surprised at Topaz Video AI's inability to denoise really noisy footage. I thought that was something you offered, but I guess not."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Demetrios Giannitsios",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:56:51.000Z",
          "Titre": "It crashes quite often or freezes up…",
          "Contenu": "It crashes quite often or freezes up and needs to be closed and restarted. I’m running a brand new MacBook Pro M3max 32gb ram 1T SSD drive. There should be not an issue. Just a little bit unprofessional but the quality of what comes out is nice. Still going to experiment to see if I can use more of the functionality"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:53:53.000Z",
          "Titre": "The upscaling in Topaz was excellent…",
          "Contenu": "The upscaling in Topaz was excellent however, Topaz completely crashed my computer (a recent Dell laptop running Windows 11) 3 times in a matter of 2 hours.  All my other photography software runs fine on my laptop.  I wish this didn't happen because I really liked the program."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arieh Gorban",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T21:25:45.000Z",
          "Titre": "I like the updates to Photo AI, but I use the others more",
          "Contenu": "I like the updates to Photo AI, but I don't seemuch done with DeNoise AI and Sharpen AI. I use these frequently and prefer to pick teh right one for each picture rather than go to Photo AI that takes much longer and requires my interaction. With DeNoise AI I can apply the same process to many pictures that have the same level of noise."
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Ignacio R Russo",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T04:16:15.000Z",
          "Titre": "I loved it...but it needs the ability…",
          "Contenu": "I loved it...but it needs the ability to detect telecine from VHS and get rid of the scanlines. It was somehow useless for the original purpose."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Daniel",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T08:58:31.000Z",
          "Titre": "Denoise AI works well, but not in Windows 7",
          "Contenu": "Denoise AI works well, but only the Windows 10+ version.There's no good technical reason why the *same* AI algorithms couldn't be incorporated into a Windows 7 version, giving the same denoising performance but in a user-friendly OS.It might run slower than in Win10, but the time saved in not having to boot into Win10, do the denoising, then boot back into a decent OS would cancel that disadvantage."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Lester",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T20:54:28.000Z",
          "Titre": "It does improve quality of a old videos a little…",
          "Contenu": "It does improve quality of old videos but the AI models are difficult to follow and rather hit and miss. Could do with more presets related to type of input."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:33:10.000Z",
          "Titre": "Not so perfect.",
          "Contenu": "I was very amazed, when I bought Topaz photo AI. Sometime denoise and sharping works well, but sometime not. After export some pictures has different crop and that makes me crazy. Some pictures has “ghosts” next to object. Some objects on a picture has “double face”."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PGerrish",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:18:05.000Z",
          "Titre": "Needs improvement on Video AI",
          "Contenu": "Video AI is very slow and didn't upscale enough to be worth the wait. The other photo adjustments work well for some photos, but less improvement on others, Max should be based on the most sharp without losing the image detail."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Saul Rapkin",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:23:23.000Z",
          "Titre": "Tutorials?",
          "Contenu": "I need a comprehensive but easy to follow training class so that I can set up a useful workflow and know what to expect from each piece of software. So far I am not finding it to be as intuitively obvious as I would have hoped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:39:48.000Z",
          "Titre": "Good features bad UX",
          "Contenu": "I like the software of Video AI and the constant improvements in AI. models.I don't like the preview queue or implementation. It is not intuitive and is confusing to make multipe files. The UX design is not well thought out from a user perspective."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TW",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T23:58:29.000Z",
          "Titre": "I don’t get the hype",
          "Contenu": "To be honest, I’m not understanding the hype. I much prefer LR as my images in Topaz appear cartoonish and my subjects faces are unrecognizable. Going to give it some time to learn my way around the software before I land on a final verdict"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T17:00:16.000Z",
          "Titre": "I like when the software works",
          "Contenu": "I like when the software works. At this product I don’t like the slowly check in four steps at starting the software – it could be optional, or any check, I know the quality of the image already. I also don’t like the hidden subscription of Topaz Labs, and that there is no option for users which purchased every product, which allow also to pay a unified price for new sub plan."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee Smith",
          "Nb_Reviews": 8,
          "Date": "2023-12-03T20:31:37.000Z",
          "Titre": "What happened to the renewal bundles",
          "Contenu": "What happened to the renewal bundles? You have great products, but this renewal process is troublesome. I have been using your product for years, but I noticed I was not getting any renewal reminders until recently when I noticed the little update notice on the Photo AI. I saw that that product expired in September 2023. I only use the product on my main computer, but got charged for 2 seats. I did not renew my other products like DeNoise AI and Sharpen AI, because it seems like duplicate software. I would have thought you might offer a bundle price for Gigapixel, DeNoise and Sharpen inlcuding the Photo AI."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VD",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T01:00:18.000Z",
          "Titre": "Underwhelmed",
          "Contenu": "So far I've been underwhelmed by Topaz AI2 and the other Topaz photo apps. I've been testing out Topaz AI2 with my D7500/Sigma 150-600 photos to compare results against using only Nikon NX Studio. Unless the exposure and white balance is ideal, starting out with Topaz to process/de-noise raw images is a lost cause.  I've had to go first to NX Studio to correct exposure and sharpen, export as .tif and then to Topaz to de-noise and sharpen get acceptable results. It somewhat defeats the purpose of being able to efficiently process photos within the Topaz suite. Or at minimum to use Topaz as a first de-noise step. Happy to hear any suggestions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hahli",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T21:06:55.000Z",
          "Titre": "It's okay",
          "Contenu": "It's okay,  but not magical. Not worth the price for the common consumer.  Results are often disappointing and can uglify faces pretty bad.  Slightly better than  remini in preserving details in larger photos and can get more nitty gritty in options to steer away from plasticification of the environment and monstrous faces of crowds. But, there's not much option to filter faces in a way that they don't age up a smiling 20yr old, to look like they're 80 having ptsd. I miss the beautification option that Remini achieves for closer faces. You'll still need to do some heavy lifting in pre/post production in photoshop to fix its many mistakes and wrinkly artifacting. You'll learn there's no point in installing updates as they typically ruin the program further. However,  this is preferred as a one time purchase in a world where subscription services are often the only choice. So I appreciate not being tied to a subscription, which is what ultimately won me over to this program over other options."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Chris Langley",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T15:40:17.000Z",
          "Titre": "I am still finding that some improved…",
          "Contenu": "I am still finding that some improved details and surfaces show a plastic - like look which will be rather obvious on large commercial prints. Straight or smoothed lines on surfaces also can seem course at times. At this point that is my biggest pointer for you. I also need to find a video explaining the controllable functions when auto seems to let me down. You deserve better than a 3/5, but that is my honest grade right now"
        },
        {
          "Note": 3,
          "Lieu": "GT",
          "Pseudo": "Mario Flores",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:05:55.000Z",
          "Titre": "I'v had trouble with unexpected black…",
          "Contenu": "I'v had trouble with unexpected black splotches on the image when I upscaled from 1080 to 4K.   The worst thing is to find out after a very long render time.  Had to try different presets and settings, but the whole process of between ruined exports and fine tuning took me almos 2 days.Besides that, the successful render greatly improved the image quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T20:32:04.000Z",
          "Titre": "Bad border by AI",
          "Contenu": "Shortly after I began editing with the new version a message appeared asking if I would agree to allow Topaz to look at my work. I agreed.  Shortly afterwards I edited a photo of a helicopter and Topaz put a heavy white border along several edges. If you can identify my work you should take a look at what I did 12/2/23.  You do not want that kind of thing to happen.  It ruined the photo.  I was able to reverse the action but had I not been able to reverse it I would have been very disappointed.  If I remember correctly I opened the raw photo with AI."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "GAI CHEW KAI",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T05:02:06.000Z",
          "Titre": "The Photo AI must be able to render human face at smaller portion.",
          "Contenu": "The Photo AI 2 seems not rendering human face at smaller image properly, I have to use Paint.NET to scale to 4k, but yet the blocky human face still not properly being simulated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fambrough Enterprises, Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:02:32.000Z",
          "Titre": "Unable to get a good Mask.",
          "Contenu": "H ave tried everything in Mask to get a successful cutout with out success.  I have gone through all the tutorials I can find and still, the hair cut out is a disaster. I have been working on this one cut out for the past month and still have nothing to show for all the work done."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Reed",
          "Nb_Reviews": 15,
          "Date": "2023-12-04T11:57:03.000Z",
          "Titre": "Not easy to use",
          "Contenu": "It's probably me but I found the interface confused and not logical unlike the photo ai which is super easy.I gave up on my first couple of attempts to use and will delay until I can spend time understanding the operation."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jaswant Singh",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:04:27.000Z",
          "Titre": "It is very slow run the models that I…",
          "Contenu": "It is very slow run the models that I select on my MacBook Pro (i9 with 6Gb video card and 32Gb RAM). It takes several minutes before the view is updated. Is there something that can be done to make it rteasonable fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adrienne Duran",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:14:20.000Z",
          "Titre": "Good product, can get better",
          "Contenu": "Sometimes results are awesome. Sometimes gives weird textures (like on fur or hair) and deep wrinkles on people. Overall, I like it though"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Helander, Claes",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T11:04:57.000Z",
          "Titre": "When you import a larger number of…",
          "Contenu": "When you import a larger number of photos and want to do a batch render in Topaz Photos, for some reason, it randomly drops out files. In my last project it dropped out about 300 files out of 700 in random intervals."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "petrovski miroslav",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T11:32:39.000Z",
          "Titre": "Very satisfactory and no miracles",
          "Contenu": "Hi! I used Photo AI only the last ten days with a bunch of pics and, well, let's say if the pics are bad, no miracles ;-)) Then it can produce ugly results or too artificial. But, for about a half of my trials, it's very very satisfactory. So I go on working and practicing to use it better... All my best"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Conwell",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:05:56.000Z",
          "Titre": "I like the software but the company’s…",
          "Contenu": "I like the software but the company’s service and support is poor. I am now down to just one pieces of their software because I could not get support for all the rest (Sharpen, DeNoise, Gigpixel)."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Minhyoung Kim",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:00:57.000Z",
          "Titre": "Enlarging an Image",
          "Contenu": "In the image being created, sharpness is over or very unnatural, especially for human faces.It also doesn't make use of the texture of clothes."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Kerry",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T09:21:45.000Z",
          "Titre": "Can’t tell the difference between plug ins",
          "Contenu": "I already had gigapixel, which is good- so in a moment of madness bought the ai, sharpen and denoise. In the Black Friday sale. Was shocked when $150 became $250 from au to American dollars, but support was quick to help when I had trouble downloading them. I’m not a professional photographer and not great with technology, but playing around with the photo ai, sharpen and denoise I have to say they all seem to do the same thing as gigapixel,but that’s just me"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Albert Fok",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T20:35:49.000Z",
          "Titre": "Not as good as expected.",
          "Contenu": "The crop tool do not come with level control.The work process of Photo AI is faster than Denoise AI and Sharpen AI combined, however the results are not as good as my two years old version of Denoise and Sharpen.The result sometimes for people have a plastics look on the face."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Karen Riches",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T15:55:08.000Z",
          "Titre": "The program is dreadfully slow",
          "Contenu": "The program is dreadfully slow.  However my computer is old and slow.  My sons are hoping to rectify that at Christmas.  Then hhopefully I can figure how what I am doing, in a more timely fashion.  I am dyslexic and figuring out the steps is difficult."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T16:59:15.000Z",
          "Titre": "Re registration Topaz Photo AI",
          "Contenu": "I have re registered my subscription taking Topaz Photo AI. The product is good but so far is slower than using individual Sharpen or Denoise. Also it has an occasional habit of suddenly stop working and you have to start again. This is a bit concerning as I have recently had a significant upgrade of my computer which is more than sufficient to handle Topaz. I was charged $99 in November deal, however friends of mine got a further discount which was denied to me, which was very disappointing. So has it been worth the money to upgrade?  I am not sure, I have not noticed any significant improvement in quality and speed of output to justify the outlay of cash on my new subscription!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CMC",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T16:28:04.000Z",
          "Titre": "Just Ok.....",
          "Contenu": "The video AI software is not what I expected.  Somewhat cleans videos up but it's not earth shattering and definitely not worth the price paid.  Photo AI works a bit better but again, not for the price paid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Chordas",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T00:38:49.000Z",
          "Titre": "I think I need to ask for my money back on Video AI",
          "Contenu": "I think I need to ask for my money back on the video AI.  I can't use it on any of my computers.  I've got some seriously capable hardware, but it doesn't work on any of them.  Even with SD video, on some machines, a short clip takes over two weeks (I couldn't wait that long) and an 8 core I7 with 32 GB RAM, NVIDIA with 16 GB, the first pass is okay, but the 2nd pass, the computer overheats and shuts down.  I'm have to hold off using this product until I can come up with the funds to buy heavier metal, it's completely unusable.  Your Photo AI, on the other hand is terrific.Update....  Topaz seems committed to customer satisfaction.  I contacted them about the Video AI overheating and shutting down every one of my computers.  They PROMPTLY refunded my money.  Once I get heavier equipment, I'm very likely to buy the product again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beachcomber25",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T20:55:06.000Z",
          "Titre": "Additional Features?",
          "Contenu": "I like what Topaz is doing to the images I am using. But I have two questions:1. Does the Topaz Photo A2 already include the features offered for sale in the \"Black Friday\" photo plus bundle? I'd be a little disappointed if the program I purchased for $150.00 required me to buy additional features I thought would be in the original program.2. I also used the services at MyHeritage.com. Are they using your software or something similar on their website? I think my results using Topaz are better, but I'm just curious if you have any information in that regard.Thanks for your help!Robert"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andy S",
          "Nb_Reviews": 13,
          "Date": "2023-11-28T16:44:26.000Z",
          "Titre": "TopazVideo AI vs Photo AI",
          "Contenu": "TopazVideo AI. Not so impressed. I rarely get a successful output that i can play (no sound or format not recognised). And so many options but not clear what things actually do or when to use. Had it for a year and not renewing......Photo AI is a different story and that I like, use, understand and renewed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Hampton",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T18:51:40.000Z",
          "Titre": "Video AI is useless on my 2019 MacBook…",
          "Contenu": "Video AI is useless on my 2019 MacBook Pro. I should have downloaded the demo 1st. I average .8 frames per second in just the Enhance mode, upscaling 720/480 to 1080. A 1 hour video states it will take me 3 days to render. My MBP doesn't even break a sweat editing 5K video. According to the community chat, my 8G Radeon pro video card lacks the muscle to upscale video. It would seem that I need to upgrade a $2200 (2019) computer with an i9 processor just to use your product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Margulis",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:03:01.000Z",
          "Titre": "PhotoAi is still not as good as the…",
          "Contenu": "PhotoAi is still not as good as the individual Sharpen and DeNoise products, although it is more convenient. Size enlargement is better than GigaPixel though."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Michael Maixner",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T14:23:13.000Z",
          "Titre": "Mostly happy",
          "Contenu": "Mostly I am happy with the products of Topaz but my last buy was disappointing for me. I wanted to upgrade Video AI to version 4 but during the installation I got an error message because of AVX2. I need help!"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "jambodisc",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:09:15.000Z",
          "Titre": "Need performances optimization on Mac…",
          "Contenu": "Need performances optimization on Mac OS. Topaz Video AI is very very slow. However, video improvement seems great if we test on 1 or 2s of video. Topaz Photo AI have also good tips, however, if we apply several different improvements, it should be nice to have possibility to compare with or without the latest applied effect, by keeping the previous ones. Actually, it is only possible to compare between before process and after full process, but not individually for each treatment."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Nicole Shaw",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T18:53:40.000Z",
          "Titre": "I am really impressed for the most…",
          "Contenu": "I am really impressed for the most part, but I have found that it can sometimes be hit or miss, in particular with noise reduction and sharpening. I find that details on feathers are perceived as noise and are usually distorted or look unnatural once the software is done with it. That has been a little frustrating for me as my primary subjects are birds, but on the whole, I am very pleased. I just hope that the AI continues to improve. I also wonder (and maybe there is a way and I just don't know it yet) if theres a way to dial down the enhancement from the AI autopilot. Sometimes I really like what it did but want to turn it down a notch."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Andrew Forward",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T01:54:05.000Z",
          "Titre": "Much too expensive for an update…",
          "Contenu": "Much too expensive for an update ($A132) to pay for any new improvements for 12 months - will certainly not updating next year"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Schramm",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:16:30.000Z",
          "Titre": "Overall the product does a good job…",
          "Contenu": "Overall the product does a good job upscaling old dv footage. I wish it had live preview, faster rendering and did not crash as frequently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T19:32:57.000Z",
          "Titre": "What kind of computer do we need to use this?",
          "Contenu": "I've got a pretty fast MacBook Pro with 64 GB of RAM and the M2 Max chip. My first experiment with a 10 minute video was one I gave up on because it just got spinning beach balls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martin Boerema",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T14:55:14.000Z",
          "Titre": "My wife looked at the tv ad and…",
          "Contenu": "My wife looked at the tv ad and expected more from the software. I have more experience with image editing software and what I see from the software is what I expected."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Jack C",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:05:48.000Z",
          "Titre": "Amazing Software but be Prepared",
          "Contenu": "I have a M2 Max Mac and was under the impression and from reading the System Requirements, I felt that would be almost overkill. To my surprise, this software is slowly killing my mac running around 300% of my CPU. Software is outstanding, just wish I would have known the real requirements before Purchasing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:50:08.000Z",
          "Titre": "I need his issue addressed",
          "Contenu": "I need his issue addressed: I’ve been using Denoise AI from LR for a while without any problems. I just upgraded to Photo AI 2.1.2. I select the photo in LR and select the Photo AI plugin. It prompts me for the options and then duplicates my selected image on the strip. I then expect Photo AI to open, but it doesn’t. I don’t even get an error message from LR, like I see others report."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelli Ann Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:09:38.000Z",
          "Titre": "Great concept, still bugs, but hopeful...",
          "Contenu": "I love the idea of TopazLabs and appreciate the enhancements on pictures that already have a fairly good resolution. I find that the plugin for PhotoShop has a lot of bugs and many times I have to shut it down--along with all the projects I am working on in the moment--and restart PS for the plug-in to function properly. Many times when using the program to upscale an image, the result looks overly AI generated. As I've only been using it for a fairly short time, I still want to play with the settings more and several different types of images to really get to know the product better. However, I have used it several times a day since my purchase--and I have an issue at launch (whether it be an ICC error code, a failure to recognize code, or something else) around 60% of the time. I did reach out to TopazLabs for assistance and they got back to be in a reasonable timeframe and basically told me that if I can't get it to work to send them more information, which they specified for me. I don't know if the same issues occur when using the application directly because I purchased it mainly to help with things I need in PhotoShop and find it more convenient. I am excited about the possibilities, but still find it to have several issues that need to be worked out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Pilkington",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T17:06:08.000Z",
          "Titre": "Photo AI is great, Video AI is not.",
          "Contenu": "Photo AI is great.  Unlike Photo AI, Video AI will not allow dragging of videos from Apple Photos.  This is very disappointing adding steps to the process of having to export videos out of Apple Photos.  Moreover, getting lots of errors in Video AI when trying to run it.  I don't believe Video AI is ready for prime time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "All In Marketing",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:21:00.000Z",
          "Titre": "Useful but hard on your system",
          "Contenu": "Takes a lot out of my system to continuously update the programs. Video AI is not user friendly and I can’t decide if it makes that much of a difference not to mention processing and render time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R Cohn",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T01:44:47.000Z",
          "Titre": "I purchased mostly for Sharpen and…",
          "Contenu": "I purchased mostly for Sharpen and somewhat for Gigapixel. I have found Noise almost always worse than DxO PureRaw which I also own., When Sharpen works it is almost miraculous. Unfortunately, it only works well enough for me to keep the results maybe 40% of the time. It may be the kinds of pictures I work on so don't get upset if your experience is different."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ramakrishna Yelamolu",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T09:59:26.000Z",
          "Titre": "It's very slow when compared to other…",
          "Contenu": "It's very slow when compared to other photo editing softwares I have. Purchased the entire package in the deal.though my computer has 16 GB Ram with Intel iris graphics and 1tb NVM drive.  Maybe I need to try more pics editing to know the true essence of the software. Don't know i feel I have overspent."
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Konta Gábor",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T14:25:29.000Z",
          "Titre": "Topaz Photo AI is developing nicely, but I expect improvement in many thingsIn some cases",
          "Contenu": "In some cases, Topaz Sharpen AI and Topaz Denoise AI lead to better results. I use noise filtering in almost all cases, but with Topaz Photo AI, this has to be turned on separately, and there is no option in the settings to filter noise in all cases. This e.g. It would be good. Basically I like the software."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dieter Kepper",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:38:46.000Z",
          "Titre": "It doesn’t sharpen as well as the…",
          "Contenu": "It doesn’t sharpen as well as the advertisement shows. Although it’s ok. I’m not an expert so maybe I’m doing something wrong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Camp",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T18:18:08.000Z",
          "Titre": "Photo AI is great most of the time",
          "Contenu": "Photo AI is great most of the time. I do batch edits and a few shots do not look good. All the others look great.I just bought Video AI and I cannot figure out how to navigate the interface. So far it has not worked for me. Is there a recent tutorial showing how to navigate Video AI for tutorial challenged people like me?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DVZphotos",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T19:05:37.000Z",
          "Titre": "Grid patterns and sharpening quality",
          "Contenu": "I *really* dislike the grid patterns that appear in some of my raw images after applying sharpening and noise removal. I would prefer to see an improvement in sharpening. Even when choosing “None” sharpening appears unevenly applied. I would love to see the TAi filters applied to a processed image either in the name or in the metadata while in Lightroom."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Beckmann",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:42:56.000Z",
          "Titre": "I have just started working with the program.",
          "Contenu": "I have just started working with the program but can't see that much improvement in sharpening and noise. One exception is an extremely high ISO picture in which the program seemed to help substantially. Give me more time to play and I will be able to give you a better answer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PK",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T13:13:26.000Z",
          "Titre": "Not enough helpful materials for new…",
          "Contenu": "Not enough helpful materials for new users of the software. I have had to reach out to other sources to help me use your product."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Vocsel",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:36:06.000Z",
          "Titre": "Some results are amazing but most of…",
          "Contenu": "Some results are amazing but most of what I've tested ends up having that AI feel. If the % of amazing increases then my rating will as well."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lesley",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:19:29.000Z",
          "Titre": "Good addition to my workflow",
          "Contenu": "I like the overall concept of Photo AI  and it is a good addition to my workflow for some of my images.  It does however crash quite often even on my top of the range laptop.  Sometimes it will not open as a PS plug in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alli Fenwick Photography",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:57:26.000Z",
          "Titre": "Not worth the price",
          "Contenu": "Bought to try to fix some out of focus shots. Looks like you have to purchase the whole package of programs to get any worth out of it. I don’t notice any difference in the focus area. It definitely helped with grain but that’s something I can already fix in Lightroom. Disappointed it didn’t work for me. Definitely not worth it to try to fix 8 photos. Maybe if I had a constant supply of photos that are a teeny bit out of focus it would have been worth the purchase."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Eric Begbie",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T18:02:02.000Z",
          "Titre": "Far too expensive",
          "Contenu": "Far too expensive. I was disgusted to discover that I had to pay another $70+ to continue receiving upgrades to Photo AI for another year."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Anthony Allen",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T09:43:17.000Z",
          "Titre": "It does a reasonable job of cleaning up…",
          "Contenu": "It does a reasonable job of cleaning up and up scaling digital video however, restoring digitised analogue video has very little use. At the current price it is only only commands a 3 star.  If it was $50 it would get 5 stars from me."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Darryl Steeves",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T04:10:52.000Z",
          "Titre": "So far I am not happy with Photo AI",
          "Contenu": "So far I am not happy with Photo AI. I often go back to Denoise to get a better result.But I bought a year of updates as I know you will improve the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Knoll",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T06:22:16.000Z",
          "Titre": "Topaz Products Work Well When They’re Working",
          "Contenu": "The Topaz product has saved many of my pictures from being discarded.  For the most part, it works very well.  There are certain quirks which require some effort to get around.  There are instances where the software will cause pixelation in the photo and it is necessary to change models.  Also, every time there is an update to the software, it will not work properly as a Plug-in to Photoshop Elements 2023.  Contacting Topaz labs support has not yielded a fix and I’ve had to contact Adobe who has been successful in getting the plug-in to work.  Now, I am hesitant about updating to the latest version of the Topaz products since I cannot rely on the product interface properly updating.  This is an ongoing problem.  Topaz products work well but the inability to update the plug-in reliably can be a bit daunting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Shirley",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T18:40:16.000Z",
          "Titre": "Constant updates that are mostly bug…",
          "Contenu": "Constant updates that are mostly bug fixes. Then after one year they want to again charge you for the latest update. They give it a new major number, like it's a major update, but it's mostly bug fixes. Stop with the constant updates and test the software!"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Marti Willemsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:07:35.000Z",
          "Titre": "Incomplete editor",
          "Contenu": "It's a pity need to use other software for simple editing like colour and lighting adjustments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Thomson",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:36:36.000Z",
          "Titre": "Falls Short of Want I Need.",
          "Contenu": "At this point I have not made not been able to see any of my Video files, My primary interest was correcting some video I did of last years local veterans event. The unedited video is 110 minutes long. Everything a Videographer would not want to deal with was present. Last minute move from an outside venue to a community center against the backstop of windows on a light day. Camera's were have issue with colors and movement and even makeup composition. My believe is only the AI tool sets can handle the adjustments. But so far this application looks like I wasted my money.There follow through and attempt to mitigate my frustration was solid. I did recommend they place a skull and cross bones on trying to use their software on an MacBook Air with only 8GH memory on a file on an OS formated external drive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nessa Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:55:11.000Z",
          "Titre": "Why I wanted a refund from these…",
          "Contenu": "Why I wanted a refund from these products.crash too muchdoesn't do any additional editing a lot of the timesExtremely slowEven when buying a new computer that met the requirements...nothing. Customer Service did their absolute best and were very responsive. We tried everything that we could to make the program work.It's not a bad product at all. It didn't work out for me but could for future buyers.I really wanted this to work"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Mauro Borsato",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T10:15:33.000Z",
          "Titre": "The product has significant potential",
          "Contenu": "The product has significant potential, and it’s a matter of refining how it currently operates to achieve excellent results. I’ve extended the support period because I’m confident that your developers will bring it up to the level of other products that have already been marketed in relatively short timeframes."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Brian Pater",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:51:46.000Z",
          "Titre": "Really like denoize and photo ai",
          "Contenu": "Really like denoize and photo ai. However, sharpen ai and gigapixel do not work properly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gregory McCoy",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T06:29:49.000Z",
          "Titre": "When I lighten a dark video",
          "Contenu": "When I lighten a dark video, the video became pixelated.  I would be nice if enlarging a video it would end up looking as good as enlarging your defunct Gigapixel."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "claude lussier",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T18:27:47.000Z",
          "Titre": "While interface is pretty…",
          "Contenu": "While interface is pretty straitghforward, it la liste some prompts and thé user needs to delve info it before beeing able to get wanted résulta. I also had to pirchase a new license over thé one i had before which statues lifetime usage. Subscriptions construit should ne clearer. It is still à Nice software, just need to extensively use it to appreciate it, so far i have to hold m’y assesment to a 3 over 5."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:17:00.000Z",
          "Titre": "I'm not happy that support for DeNoise…",
          "Contenu": "I'm not happy that support for DeNoise and Sharpen will be eliminated. Photo Ai feels like a one size fits all attempt...except it doesn't..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert M Sunderland",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T14:13:07.000Z",
          "Titre": "Yawn!",
          "Contenu": "Program doesn't live up to hype.  Lot of missing features that cost you more for the add-ons."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T08:42:35.000Z",
          "Titre": "The software works well for the casual…",
          "Contenu": "The software works well for the casual user, but as a professional, I feel it's missing a lot of features.  These features have all been requested by the community on the forums, however it seems that most of these feature requests receive little attention."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Bob Fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T03:52:29.000Z",
          "Titre": "The results were no different to the…",
          "Contenu": "The results were no different to the earlier version that I purchased 3 years ago. I should have saved my money and not upgraded"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Malcolm",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T22:19:12.000Z",
          "Titre": "Video AI v4.0.7 is a lot better than V2 and V3.",
          "Contenu": "Video AI v4.0.7 is a lot better than version 2, I found version 3 to be a disaster filled with bugs and usability issues, so I held off upgrading until version 4. The improved speed on GPU is more than 50% faster for me and the ability to preview one frame has been fixed. The new preview system to compare multiple setting is great, I do miss the live update as the frames render though so you can see how much longer you have until it finishes. Generally I'm really happy after the upgrade, my feedback would be to keep working on speed as it still takes hours to render small clips recorded at 60fps."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Murray Adamson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:38:02.000Z",
          "Titre": "Found that the software works really…",
          "Contenu": "Found that the software works really well on colour photos and the focus/ sharpness improvements are very good. Noise reduction also good. Tried same for b/w photos but was disappointed with the result. Overall these products do exactly as advertised and very happy with purchase."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Songyi Choi",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:07:18.000Z",
          "Titre": "I bought the product on the date ahead…",
          "Contenu": "I bought the product on the date ahead of the holiday sale. I was an existing Topaz Lab product owner, so I think it would have been better if you could have applied the promotion discount a little bit earlier."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Jan Macek",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:33:47.000Z",
          "Titre": "Overall superb results",
          "Contenu": "Overall superb results. However Gigapixel didn't evolve for long time and PhotoAI doesn't provide as good results of upsizing."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Diego",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T21:22:56.000Z",
          "Titre": "I love all the products of TOPAZ, but.",
          "Contenu": "I love all the products of TOPAZ, and I like the idea of the evolution to photo AI, and although it has improved a lot, but I think the results are still better in the separate apps.The only thing I consider is not so good, is that the maintenance costs are a little high for the level of evolution that the software has, sometimes it is the same to buy the new application as maintenance, in my opinion, should be much cheaper."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:16:49.000Z",
          "Titre": "Impressive but could use a slight improvement",
          "Contenu": "I've been quite happy using this program. I think it does a good job of enhancing and cleaning up video. I am particularly impressed by its ability to upscale SD into HD video. While it does take a long time to process long videos, the results are generally worth the wait. What I would like to see improved is in the export area of the screen. I would like to see the settings of my previous render displayed clearly in an \"info\" region so that I can come back later and change one or two factors, knowing exactly which settings were already performed in previous renders. Currently it's hard to know exactly what was done as the export bar is too small to be intuitive unless one writes down all the settings before clicking the render button."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "stacey marmolejo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:33:30.000Z",
          "Titre": "Topaz makes my bad photo skills look better",
          "Contenu": "I am a terrible photographer and it doesn't help that I have an old iphone with a basic camera. Topaz Labs helps clear up my fuzzy, dark photos."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alexander  Samson",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T18:18:57.000Z",
          "Titre": "For certain images Topaz will work wonders",
          "Contenu": "For certain images Topaz will work wonders and produce a sharp clear picture  even using the standard setting. But, despite the adverts,  it will not turn a bad image into a good one and in certain  cases it can make the image look completely overdone. You really need to think very hard whether your workflow and needs merit spending £200 on this software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T22:55:10.000Z",
          "Titre": "It gets results.",
          "Contenu": "Noise and sharpness are two fine points that often need improvement when making images. This product delivers the results that professionals want in both areas. Upscaling is well done also.  The app isn't limited to RAW files, unlike some others."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Yavuz Eryavuz",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:32:46.000Z",
          "Titre": "Too much sharpening on jpeg files",
          "Contenu": "Generally Im happy with Topaz photo AI 2. I edited tons of bad old files sucsessfully.Two things I want to mention are..1_ Updates takes too much time.2_ İts easier to get better results by using raw files directly on standalon program but with jpeg files in PS  end results are too much sharp and crisp .Control of these files with sliders diffucult.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Cam Turner",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T00:37:47.000Z",
          "Titre": "Fantastic product",
          "Contenu": "The product itself works great, no complaints there. I purchased the complete photo package, so Gigapixel, Sharpen, Denoise, Photo AI. The only reason I didn't go 5 stars is because these products don't co-exist in one program, so you need to use Photo AI, then save the image/s, then open Sharpen AI (for example) and run the image through there again. I wish all these programs could be combined in one."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Stirling",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:37:51.000Z",
          "Titre": "The Sharpening AI does work as Described",
          "Contenu": "The Sharpening AI does work as described but it does require a PC/Laptop with good quality graphics card and memory.  I am going to update my laptop after testing on another machine which gave the results I was hoping for."
        },
        {
          "Note": 4,
          "Lieu": "IS",
          "Pseudo": "Ragnar Th Sigurdsson",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:35:16.000Z",
          "Titre": "I am a professional photographer and I…",
          "Contenu": "I am a professional photographer and I do a lot of Drone photography as well as conventional photography.   I specialize in Volcanic eruptions and glaciers here in Iceland.   Those topics require a low lite photography with some times higher ISO than I would have wanted, that is where Topaz comes in.  I am not always happy but it is by far the best program I have got.  Thank youRagnar Th Sigurdsson Arctic-Images.com"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Koch",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:05:05.000Z",
          "Titre": "Purchased the AI up-scaling program",
          "Contenu": "Purchased the AI up-scaling program, easy to use and still quite powerful. Am using to upscale SD footage from SVHS and older films as well. This is the best upscaler I have used to date other than my Teranex HD Transcoder, and this program edges out the Teranex by a noticeable difference!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Tony Eastwood",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T03:59:50.000Z",
          "Titre": "Very satisfied user.",
          "Contenu": "Results are better than previous version. Achieved results better than just sharpening.  Often takes quite long to producess but understand there are many calculations."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:19:54.000Z",
          "Titre": "Amazing tool",
          "Contenu": "I'm learning how use it still. More tutorials would be very helpful.  A photo I considered rubbish, after topaz - unbelievable.  The face recovery - amazing.  Nothing is perfect, but it's pretty close.  I now know how people get such amazing bird photos."
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "sunni",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T07:38:01.000Z",
          "Titre": "so loving it",
          "Contenu": "so loving it, i am still learning the app. a few glitches here and there ie crashes but the results are awesome by comparison to others"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alan Bell",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T21:37:10.000Z",
          "Titre": "Photo AI and Topaz Sharpen",
          "Contenu": "I'm not impressed with the Photo AI software but that might be because I'm not used to it. The Photo AI and the Sharpen tool quite often leave artifacts when a shiny or reflective surface is involved. I mostly use standard on both and when artifacts are not found , it's pretty impressive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Kline",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:19:32.000Z",
          "Titre": "Good but not great",
          "Contenu": "Love ai denoise works great! Its the first thing I do on every picture.Sharpen ai works well most of the time but it does tend to produce some very annoying artifacts including odd colour shifts and oversharpened areas where the is lots of details like fur and feathers.Gigapixel is also great most of the time but also tends to produce artifacts you have to always be careful and keep checking the results. But it is indispensible when making giant canvasses 70\"x36\".Photo ai is useful for quick fixes of family  photos but for my best photos it just doesn't seem to cut it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Cherkasov",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:59:30.000Z",
          "Titre": "Wow! Not bad!!!",
          "Contenu": "Not bad - great balance of ease of use and stability. Like the UI, like the image/video quality.  I only with there were pre-filter functions such as adjusting brightness/contrast/color/white balance and an HDR filter. Otherwise I like it -works great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Malcolm Gregg",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:47:22.000Z",
          "Titre": "Love Photo AI",
          "Contenu": "I love Topaz Photo AI.  I purchased a year ago, just renewed and consider this a necessary tool in my armory, everyone should have it.The team is super serious about updates and strive hard to resolve issues.I would like to see an improvement with the masking ability especially around the skyline, hence 41/2 of 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Graham Lindsay",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T00:49:37.000Z",
          "Titre": "AI software is ever evolving",
          "Contenu": "AI imaging software is ever evolving and Topaz Labs has produced a remarkable product. I can't use it for all my imaging work but it sure takes the hard work out of repairing damaged images, preparing images for web or print, and experimenting with new approaches. Even though I use the latest version of Photoshop I still need to apply Topaz Photo AI to most jobs."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Hopkins",
          "Nb_Reviews": 20,
          "Date": "2023-12-05T10:32:34.000Z",
          "Titre": "A useful additional tool particularly for film negative scans in post production",
          "Contenu": "It is the only AI based sharpening/denoise tool that you can use on film negative scans other than maybe PhotoshopLightroom only uses DNG not  TIFF and is therefore limited to manual not AI options or you use scanning software such as Silverfast It seems memory hungry on my MAC so can be a bit slowLike all tools you need to experiment to get the best resultsImages need to be very close to ok to recover acceptably so will not recover motion or lens blur unless minor in natureWhen it works you get a brilliant result I use an older camera with limited ISO performance and   AI denoise can be very usefulI regard it as a useful additional tool that does offer a useful alternative to Adobe but not a replacement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Sparks",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T12:15:35.000Z",
          "Titre": "My experience so far",
          "Contenu": "I love what the software is suppose to do. Just getting the basics spelled out is hard. Maybe they are my basics and not everyone's basics. I may be oversimplifying a complicated answer. I don't know. So far it's working great. I'm just not sure what my enhanced picture will look like, how big will it be. Why can't I add certain things into the menu without the program terminating halfway through?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Barrett",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T23:19:44.000Z",
          "Titre": "Great photo-processing app",
          "Contenu": "Overall it's a great photo-processing program that can save images which may have been destined for removal. I have the latest version, which is a definite improvement on the previous one but still a bit slow for my liking. I was disappointed the facial recognition didn't also recognise the dog's face in a family photo, which meant the dog was slightly out of focus. The faces can come out slightly plastic-looking at first and may have to be toned back, so don't just accept the auto-setting image."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaMont",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T23:19:06.000Z",
          "Titre": "It's good but...",
          "Contenu": "It's good but...Magnific AI does a better job. I tested a few images in Topaz vs Magnific and there's nothing on the market better than Magnific at the moment. I still like Topaz Labs there's no one on the market that has a better video enhancer but when it comes to photos, they are no longer the leader."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie Summers",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T22:10:39.000Z",
          "Titre": "Rating Topaz Sharpening AI and DeNoise AI against Photo AI",
          "Contenu": "Your separate programs, Sharpen AI and DeNoise AI are great with lots of control however your sharpening algorithms in AI mode oversharpen or leave artifacts.  Yet, these two programs separately allow me to recover images I could not do in the past.I have not gotten the same response from Photo AI.  I just feel this program does not give me the control the other two do. I also wonder why the separate program, Sharpening AI, almost always choses the motion algorithm even when the subject is stationary?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith Forster",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T01:14:46.000Z",
          "Titre": "Nice results",
          "Contenu": "Nice results, but takes such a long time. Also would be nice to have a step by step new user guide, including save as downloads. Found it a bit confusing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T17:58:50.000Z",
          "Titre": "Topaz Sharpen AI",
          "Contenu": "Simple to use, easy to override the auto settings, and usually better results that using the Sharpen settings in other editing software.4/5, not 5/5 because when sharpening my *.CR3 photos, the saved image always looses some brightness/contrast, so ends up being duller and needing more editing to bright the brightness back."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "龍生 尤",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T05:20:50.000Z",
          "Titre": "We need an instruction for overall installation",
          "Contenu": "It would be nice if you can. Show us how to install four application at one time.Myself after the install photo AI didn’t know how to do the other three application installation Together"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Marzio Fusaroli",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T10:24:17.000Z",
          "Titre": "Video AI v4.0.4 very long processing…",
          "Contenu": "Video AI v4.0.4 very long processing time on my HP Workstation Z Book and no video improvement observedFor the test I used an 11 seconds .mp4 clip 1920 x 1080, 22 MB sizesetting:H265 encoderStabilization 50%Themis3840x2160 upgradeIt took 6 minutes to complete the process and the output file was:.mov81 MB size 61790 Kbps total data speed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Funk",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T05:31:32.000Z",
          "Titre": "Amazing Photo Improvements to Family Photos",
          "Contenu": "I've got a lot of family memory photos that are \"OK\" at best which have been dramatically improved using Topaz products - mostly Photo  AI.  I love the results!  The only downside that I've found is that when I use the latest version of Photo AI as a Lightroom Classic plugin, the entire Photo AI display nearly always shrinks down to about 1/4 of the screen size and I can't figure out how to get it to full screen.  This wasn't a problem with earlier versions."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "zebrazoma",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T17:56:39.000Z",
          "Titre": "Not easy to compare from one setup to another",
          "Contenu": "Good product, but when you want to compare one setup to another one, the view of the previous set up is reinitialised ans it take time to view the new one. A snapshot of the previous setup could help a comparaison with the new one (this is the case for exemple into Topaz clarity)"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Andrew Blomfield",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:59:23.000Z",
          "Titre": "I had a problem downloading the program…",
          "Contenu": "I had a problem downloading the program over a satellite link The message kept coming up that the internet was not connected even though it was downloading at 15mb per sec.Good experience with the program so far"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kay Pearce",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T05:21:42.000Z",
          "Titre": "Does a great job",
          "Contenu": "Does a great job.  Found it a bit dauting at first but getting used to it.  THe on;y this I find is tit takes a bit longer that I though to process the changes.  As a regular Photoshop user, it seems to be longer.  And of course, PSdoes so much more.  But its great for basic fix ups."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Walter Wieland",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T14:52:27.000Z",
          "Titre": "I would give Topaz 4.5 stars because…",
          "Contenu": "I would give Topaz 4.5 stars because when running face recognition it does focus on the face itself and keeps the hair closeby out of focus unsharp especially compared to the recovered face.  Maybe, there is a way to expand the to be recovered space around the face - I have not figured it out yet."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T16:29:00.000Z",
          "Titre": "Tasks****",
          "Contenu": "I am using Topaz for long, and think that package helps with some of the most demanding technical tasks. Recently, however, I don't see real improvement, at least on level I would expect: format is changed, but some features like masking and wide range of AI styles are lost, image outcome did not improve, though it was very good already to be honest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colleen Bittner",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T20:35:11.000Z",
          "Titre": "Your products save so many photos",
          "Contenu": "Your products save so many photosI like the AI module, however I thought the sharpening in sharpening only module often worked better for movement issue photos.Would appreciate having better mini tutorials when you changed/update the modules--Glad you update often but hard to keep up with best practices for use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francois",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:48:17.000Z",
          "Titre": "Gigapixel First Run",
          "Contenu": "There have been a few software innovations like the old Genuine Fractals that changed outputto keep the printing from loosing sharpness.  Aihas shown to the way to help the photographerrescue detail that would have other wise been lost.My observation as I attempt to use the programis wonder why the algorithm can help identify theface but the rest of the image remains soft.Sharpening that detail in Photoshop is not on a par with Gigapixel. It is amazing what the program can already accomplish. I would have to shown you the first attempt of a historic glass plate photograph that I restored but sending it to you is not an option here."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "tejay",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:48:05.000Z",
          "Titre": "*if has more file organization features…",
          "Contenu": "*if has more file organization features would be perfect (Gallery, folders etc.).please add an option to overwrite to original file.*more inpaint features? not just remove :)"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Jostein Sageie",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:13:35.000Z",
          "Titre": "I am a new user of Topaz and so far…",
          "Contenu": "I am a new user of Topaz and so far have somewhat limited experience.I use the software on two machines that are both relatively powerful and have graphics cards so that the GPU is enabled. Do not experience that the program is slow as mentioned of others.I find that recalculations start immediately after changing a parameter. Could it be an idea to have the option to pause the recalculation until all the parameters have been changed?Would also like the ability to rotate images, now I have to do this in other software,I have both TOPAZ for photo and video. Haven't tested the last one, but use images to a large extent for video production as well.So far I am very satisfied, and then there is probably a bit of a lack of user expertise.The result of improving the face and sharpness is absolutely fantastic.Jostein Sageie"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JERRY Cannon",
          "Nb_Reviews": 7,
          "Date": "2023-12-06T01:46:18.000Z",
          "Titre": "Topaz AI works awesome for me.",
          "Contenu": "Topaz AI works awesome for me. It reduces noise and sharpens the picture. My only regret is I purchased Topaz Denoise not that long ago and I find they both are very similar when it comes to getting rid of noise. There was a reduction in price for the AI if you already had Denoise, but I could have saved another $150 if I would have just bought AI and not Denoise. I'm very happy with the results I'm getting so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T15:17:59.000Z",
          "Titre": "I have to shoot at higher ISO often",
          "Contenu": "I have to shoot at higher ISO often. So those images are noisy.  Your product has been a lifesaver.   I wish it could sharpen more…???"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jake Dodson",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T12:22:46.000Z",
          "Titre": "The product is excellent and I love…",
          "Contenu": "The product is excellent and I love using it.I think the ongoing fees are expensive after the initial outlay. If the annual maintenance fees was 50% less I would be very happy and 4 stars would become 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Mauro",
          "Nb_Reviews": 7,
          "Date": "2023-11-27T20:18:23.000Z",
          "Titre": "A good software but not perfect for the price",
          "Contenu": "A good software, but IMHO, need to improve a lot more, specially considering the very high price. The noise reduction works well, both in high and medium resolution. The problems I experienced on low resolution pics are when using the sharpening which creates, sometime, gosts effects. Also the light and the color improvement, can be improuved a lot. Another thning could be managed, is to save the work already done and change only the one wich is added, nor to restart from zero any time you mouve a cursor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steph Zelly",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:34:32.000Z",
          "Titre": "WHY TOPAZ",
          "Contenu": "Great product with constant updates and refinements.  There is no more cost effective upgrade to your current camera and lens package than Topaz labs.  I have used for 2 years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:37:51.000Z",
          "Titre": "The software is stunning",
          "Contenu": "The software is amazing. Upscaled my 2000 era ripped DVD file and looks stunning. Only complaint would be how it works on small faces in the background. Distorts them and looks bad. The AI should be better at not doing much to those faces. And the customer service I've received has been absolutely incredible. So thankful for their help!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T03:20:11.000Z",
          "Titre": "I am researching my family tree and…",
          "Contenu": "I am researching my family tree and have thousands of old images that I am restoring.  Photo AI seems to have issues with moustaches / hair but some images are incredible and I am encouraged and excited to see what AI will do in the future.  Dust and Scratches continue to be an issue and take time to clean up...wish there was a good solution.  Thank you for your software."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Sargent",
          "Nb_Reviews": 9,
          "Date": "2023-11-30T18:13:11.000Z",
          "Titre": "The Photo AI software works very well…",
          "Contenu": "The Photo AI software works very well to clean up noise and sharpen images. I would recommend making sure the face recovery amount is considerably lower than the default which I find makes faces look over processed. Biggest gripe is the price."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Steve Fahnestalk",
          "Nb_Reviews": 8,
          "Date": "2023-12-05T23:11:35.000Z",
          "Titre": "Can not run Topaz Video AI's newest version!",
          "Contenu": "If my computer was still able to run Topaz Video AI's new version, this would be a 5-star review. But they upgraded it to something my computer can't run. Video AI has never lived up to its promise, and I was hoping the new version would. But I guess I'll never know.Other Topaz products are very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blaquestalyon",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T04:50:30.000Z",
          "Titre": "As far as the AI enhancement goes",
          "Contenu": "As far as the AI enhancement goes, there is simply no better product/solution on the market that I have experienced.The only downside is that each time you make a modification to a parameter the AI engine starts to run again to enhance your image.  It does it automatically and is pretty intrusive as well as taking up a lot of processing bandwidth.It would be better if you could adjust the parameters and then manually initiate enhancement as opposed to the engine running each time anything is change."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Harrington",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:03:19.000Z",
          "Titre": "I am extremely impressed with Topaz… except...",
          "Contenu": "I am extremely impressed with Topaz Gigapixel and Topaz Sharpen. Topaz DeNoise is not needed (by me) as Sharpen does a great job of removing noise. I am unimpressed with Topaz Photo as it doesn't do a great job on my photos."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jack Thompson",
          "Nb_Reviews": 6,
          "Date": "2023-12-04T22:33:09.000Z",
          "Titre": "Help for beginners",
          "Contenu": "Had problems installing but friendly and very helpful assistant patiently persisted and got the problem solved. I would like a step-by-step guide for beginners starting to use Topas Video AI"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2023-11-27T12:38:26.000Z",
          "Titre": "Generally like and use Topaz's…",
          "Contenu": "Generally like and use Topaz's software. Photo AI is a great help to me particularly for photos that I need to upscale for a particular project.However, it - and all things Topaz - are increasingly so very expensive, I have to choose which software gets and update, etc.Being on a fixed income where literally everything costs more but income doesn't match, my wish is that Topaz's software was truly affordable for me...and so many others."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Steve",
          "Nb_Reviews": 8,
          "Date": "2023-11-30T02:18:42.000Z",
          "Titre": "Photo recovery genius",
          "Contenu": "The ability to recover slightly blurred faces in group shots.  The ability to recover old photographs.  Generally how easy the whole process is, especially for an amateur that sometimes gets it wrong.   How Topaz is always working to improve the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Kearney",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T09:22:20.000Z",
          "Titre": "Amazing blowups",
          "Contenu": "Amazing blowupsNoise reduction is incredibleSharpening  first rateStill has a problem with faces especially eyes. Much better then it used to be but still has a ways to go"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "victor toy",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:50:30.000Z",
          "Titre": "There were no glitches in ordering",
          "Contenu": "There were no glitches in ordering, downloading and instalation of the products. Everything went smoothly but program ran slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARK BLACKMAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:10:27.000Z",
          "Titre": "I recently bought Photo A.I",
          "Contenu": "I recently bought Photo A.I.  The enhancement macro is similar to the one available in Adobe Raw.   It has been very useful in extracting detail from TIFF scans of black and white negatives and color slides.   The noise filter does a nice job with the grain on the black and white negatives. When using the noise, sharpening and face macros, it makes sense to create another layer in Adobe Photoshop, so you can tone down the softening by dropping the opacity.  In addition, a mask allows you to confine the macro to a particular part of the image.   The face macro works best with large faces.  As the faces get smaller in the overall image, the output can look like a Francis Bacon painting.  There is a softening effect similar to the Dynamic Skin Softener in Color Efex Pro, although in that case, I usually use a white mask and black paint brush to limit the impact on the eyes, nose and lips.  All in all, I got what I needed and feel that I got my money's worth.  I look forward to future improvements."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Hendley",
          "Nb_Reviews": 28,
          "Date": "2023-12-01T19:54:28.000Z",
          "Titre": "Topaz products work well for me but marketing clarity is lacking",
          "Contenu": "The topaz web site is a little out of date regarding the availability of the bulk upgrade one-year catch-all offer that I had previously purchased in 2022 Black friday.  The FAQ web site stil shows the availability of these upgrades but it appears that the only option now is a single upgrade for photo AI.  I am stil confused as to how Topaz markets photo AI vs. the individua pacakges we all purchased before.  It appears that Photo AI has taken over everything but that is never made clear.Despite this confusion in marketing, the photo AI package is now th eonly software from Topaz that I use and denoise/sharpen Ai sit idle.  Not sure yet how gigapixel compares to Photo AI as I use that a lot less.Not quite sure if Phot IA denoising is as agood as pureRaw 3 or adobe enhance but th ehuge beneift is tha you can use topaz late in the editing process on seleted parts of an image.Software very high marks - clearity of marketing and web site - less so!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Nietupski",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:25:07.000Z",
          "Titre": "I asked a technical question via email",
          "Contenu": "I asked a technical question via email. I was hoping for a technical reply. Instead I got a marketing reply that was very ambiguous. Eventually I was able to do decipher the reply."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Hale",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:20:19.000Z",
          "Titre": "Technically improves",
          "Contenu": "The software does improve photos, so I can't give it a low star rating, but definitely not 5-stars because though they're \"better,\" it's certainly not like I had hoped. I honestly get better results faster from Remini and wish I had gotten that instead since it's much cheaper.  I'm very disappointed that it isn't easier to use or a better improvement of noisy/blurry pictures than it is, especially for animals (like the ads show)."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lenn Bayliss",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T02:48:14.000Z",
          "Titre": "Can't get it to run",
          "Contenu": "Can't get it to run. All earlier versions worked without any issues.Post script.   After communication with Topaz I have changed the changed from the GPU to the CPU for processing and the software is now functioning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert benson",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T18:48:25.000Z",
          "Titre": "The Topaz Face cleanup product works, the overall cleanup not so much.",
          "Contenu": "The product works, especially for Face cleanup. The Face results are very good.  However, it sometimes distorts the parts of the photo that are not Faces.  I have seen hands that look gnarly after using Topaz.  I was advised to just use the upscaling and that is somewhat better for preventing distortion but it does not give the level of crispness that you receive for faces.  My guess is that the AI can be better tuned for faces, but the algorithm or learning process for the software is more difficult to perfect when the choices are much greater."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Francisco Javier diaz Benito",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T13:10:15.000Z",
          "Titre": "I really liked the image rescaling",
          "Contenu": "I really liked the image rescaling, as well as noise removal and sharpening, also combined on the same platform. I have also noticed progress in the arrangement of faces in images generated by Artificial Intelligence. But there should be another option to fix hands because it is a pain to fix them since they still don't come out correctly. I hope for this improvement in future editions."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jeff Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:21:33.000Z",
          "Titre": "Happy",
          "Contenu": "Happy with how it is now, how far can you go pushing the AI further?Always want more higher resolution, if I can get it, I will take it.Otherwise an extremly good product.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Terry Burne",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:31:24.000Z",
          "Titre": "Topaz Apps allow meto not worry about ISO",
          "Contenu": "Topaz Apps take a picture that is nearly good enough, to great, by cleaning up noise and taking the sharpness an extra level.  It allows me to let me use Auto-ISO and know that I will be able to clean up the picture in post-processing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arnold",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T22:53:07.000Z",
          "Titre": "The good is that the IA modules do help…",
          "Contenu": "The good is that the IA modules do help a lot with sharpness and noise. The photo AI may be redundant with the other 2. I haven't used it enough to give it more stars. I also like the fact that there are regular updates that keep the software relevant."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graham Kirsch",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T18:16:38.000Z",
          "Titre": "Photo AI is remarkable software",
          "Contenu": "Photo AI is remarkable software: what it does is not really possible with any other software I use. I would not be without it now. But as a photo processing suite, it can't do the whole job and the user interface gives less control than I need. Other applications correct lens distortion, have really powerful control over colour and contrast, excellent noise reduction, geometric correction and so on. I use Photo AI's capabilities when I want even lower noise, extra sharpness, or to fix less than perfect shots. It would be better for this purpose as a plug-in to the software I use for the rest of my flow (DxO PL), where its unique capabilities would fit very well.Nevertheless, it is amazing."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "MENG",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:49:17.000Z",
          "Titre": "This software pack make my old picture…",
          "Contenu": "This software pack make my old picture and vdo look more good but it takes time a little for processing by Denoise and Sharpen in my old Mac late 2018 with i7+ram 32GBFor VDO ai and Photo Ai I use in Mac M2+ ram 64 GB.I separate software using in 2 Devices"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Jason Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:46:40.000Z",
          "Titre": "Very good AI but needs more editabilty for the user.",
          "Contenu": "The AI is very good at what its designed to do, however I think there are still features that need to be implemented to really round it out. For one, it’s very good at being able to recognize faces and improving them but not very good at improving the rest of the Human body. I feel there needs to be more options available to the user to edit the Fotos, for example being able to apply the same improvements made to faces to other areas of our choosing with something like brush type tool."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "René",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T19:39:56.000Z",
          "Titre": "Topaz is great",
          "Contenu": "Topaz is great. Only remark sometimes rather slow"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:31:51.000Z",
          "Titre": "Quality results",
          "Contenu": "I questioned this product but bought it on Black Friday anyway to try it out. It’s definitely worth the price. I don’t particularly care for the gui so 4 stars. Quality results."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "GORDON STUBBS",
          "Nb_Reviews": 5,
          "Date": "2023-12-01T23:25:21.000Z",
          "Titre": "Highly recommended",
          "Contenu": "He most important thing for some of my age is the support one receives from the developer of the application.Topaz is the best of all the photographic editing apps I have used.The backup support is second to none, and a credit to its developers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Cress",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T05:37:53.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, will be happy when you perfect the removal tool!  Love your products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason K",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T20:20:40.000Z",
          "Titre": "Does the job, could be a little faster",
          "Contenu": "Writing this comment in case the developers read it. The software works as expected, but I was hoping for a bit more from the interface. The long render time is what it is, but I wish it could scrub video faster when seeking to find your previews, maybe they could make it seek at lower quality and then improve when you stop the play head? The other item that is nearly perfect is the ability to use the software while it's rendering. The only issue is that your previews will get held up by current renders. It would be nice if previews would automatically slow down render jobs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Towle",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T21:43:23.000Z",
          "Titre": "It really works to sharpen photos!",
          "Contenu": "I was wondering how other photographers were posting images sharper and less noise than mine while using the same equipment and now I know.Topaz has features that really help for example adding pixels to low quality images, changing the subject face if there are multiple faces to edit and other features, I did not realize it had.I am not an expert yet on its operation, but there are some issues for me.First, the software crashes for no apparent reason. however, when you restart, the last photo is still there to click on again.I have not been able to incorporate it with my Lightroom 5 in any attempts, so I have to use Topaz as a standalone.The spot remover is hopeless and doesn't need to be there. The light adjustment is mediocre at best and the color adjust slightly better. (These addons are not a deal breaker for me).I was unable to find the answers I needed in the help section.I am exceptionally happy with Topaz's system of sharpening and reducing noise.  It is amazing and well worth the investment! It brings back most of my old, discarded pics to life!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Allan",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T20:43:49.000Z",
          "Titre": "Five Stars Except for …",
          "Contenu": "I would have given you 5 stars except your Video Enhance product is overpriced, even for someone that purchased a license two years ago.Photo AI is very nice but I still like the full functionality of Sharpen, DeNoise and Gigapixel AI."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T21:10:21.000Z",
          "Titre": "I was amazed at how well it removed…",
          "Contenu": "I was amazed at how well it removed grain and sharpened the images. The AI is a real game changer. But, I would suggest that you might find a way to reduce the specular highlights that the sharpening sometimes produces. With larger files, it takes longer to save. Minor stuff but could still use a little work."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Gavin",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T13:24:48.000Z",
          "Titre": "Upsizing pictures generally works well",
          "Contenu": "Upsizing pictures generally works well, but sometimes strange angularities appear - e.g fingers can come out oddly shaped sometimes. But overall, results can be very satisfying, and while I have a number of picture processing apps, the apps in the Topaz suite are some of the ones I use the most."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Michel Frossard",
          "Nb_Reviews": 9,
          "Date": "2023-12-21T10:15:30.000Z",
          "Titre": "Impossible to save",
          "Contenu": "Impossible to save, only \"Apply\" !!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clifford Jacobs",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T03:34:55.000Z",
          "Titre": "The Topaz labs products do a very good…",
          "Contenu": "The Topaz labs products do a very good job at improving older pictures and videos.  At times, the facial recovery creates a face that is not quite right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Eager",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:43:58.000Z",
          "Titre": "I appreciate using Topaz products",
          "Contenu": "I appreciate using Topaz products. They do an excellent job assisting with photo edits, clearing up distortion, and ensuring I have the best photo quality. I look forward to learning more about how this software works and exploring where it takes my craft."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mario Page",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:22:28.000Z",
          "Titre": "It's obviously the best photo…",
          "Contenu": "It's obviously the best photo enlargement available. Therefore it very often turn off during saving process and take's too long to do so.Also for the price I would have like to be able to use it on my second computer."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "René Grosheintz-Laval",
          "Nb_Reviews": 5,
          "Date": "2023-11-27T21:38:53.000Z",
          "Titre": "Some spectacular results",
          "Contenu": "What is really good about Topaz software,  is that improvements to the product are fast and frequent. This company works really hard to improve their software. Unfortunately they have also increased their prices substantially and doing work on your photos is beginning to be a luxury, as there aren't many companies that sell photo editing software at affordable prices for amateurs."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Lubos Vojtech",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T08:54:55.000Z",
          "Titre": "Great satisfaction!",
          "Contenu": "The speed, removing noise and upscale are great. I am waiting for the definitive update of \"adjust lighting\" and \"balance color\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Goodfellow",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T19:51:56.000Z",
          "Titre": "I really like Photo AI",
          "Contenu": "I really like Photo AI. I like that it is getting updates on a consistent basis. It just keeps getting better and better, so I updated/renewed my subscription for updates. I am choosing not to renew/update the individual programs as I have not seen an update during the previous year. Photo AI seems to be getting all the love."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philippe",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T20:02:38.000Z",
          "Titre": "Vert impressive on a general but…",
          "Contenu": "Vert impressive on a general but sometimes creates artifacts that are difficult to correct and I must use other software to correct if it is possible. Example are teeth that become crooked if the lightning reflets on one tooth , sometimes the eyes become creepy and water droplets eyes creates unatural rings of light"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Michel",
          "Nb_Reviews": 9,
          "Date": "2023-12-06T01:17:45.000Z",
          "Titre": "Looks pretty good",
          "Contenu": "Looks pretty good, just the way to erase in studio is not so satisfaying, could be better with AI like re- building the image with the environnement."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Obed Jese García Martínez",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T20:49:34.000Z",
          "Titre": "Great between greats!",
          "Contenu": "Thanks to the TopazLabs suite of programs, I have been able to recover photos that I thought were lost. It has also improved my workflow.I believe that they still have room for improvement in mask work and the option to be more precise in zone-based improvement."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "L  Bleiler",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T08:17:02.000Z",
          "Titre": "Photos came alive",
          "Contenu": "The faces in my old photo were quite fuzzy Topaz AI really brought them to life.  However areas around the neck still looked fuzzy in some cases.  Sometimes the clothes “smoothed” out and sometimes they didn’t leaving artifacts behind.  All in all I am pleased with the faces."
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Enrique Ruiz",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:20:04.000Z",
          "Titre": "Topaz Docs in spanish",
          "Contenu": "Everything is working correctly, only I would be confortable with doc´s in spanish, the User Guide at least."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Engle",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T02:38:39.000Z",
          "Titre": "Noise reduction",
          "Contenu": "I have been able to go back to old images that were made with a high ISO and salvage those images. I've been shooting with 6400 ISO recently and get fantastic images using Topaz AI."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "frank lee",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T00:34:25.000Z",
          "Titre": "You have good products, but ...",
          "Contenu": "You have good products. However your rapid EOL and lack of support for deprecated products which are still some of the best in class means you lose customer loyalty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adirondack nature photographer",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T19:53:29.000Z",
          "Titre": "Works well for most photos",
          "Contenu": "Works well for most photos. I've had trouble getting some Topaz aps to work with my Mac. The interfaces could use improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christian van den Brink",
          "Nb_Reviews": 5,
          "Date": "2023-11-29T21:31:01.000Z",
          "Titre": "Great product line on all and…",
          "Contenu": "Great product line on all and especially Photo AI. We need however make it successful for all users by increasing more one on one product support team."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "George Foster",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T21:21:16.000Z",
          "Titre": "AI photo is great",
          "Contenu": "AI photo is great. However, the Subject Sharpen tool curser would be easier for me to use if it was a circle (as the original AI Sharpen) instead of a Cross 😆"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:08:22.000Z",
          "Titre": "Great App, some issues crashing",
          "Contenu": "I love the capabilities of this app, but this has some issues crashing. Have to limit some of its capabilities to keep that from happening"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Hoffman",
          "Nb_Reviews": 32,
          "Date": "2023-12-02T17:18:45.000Z",
          "Titre": "When it's good it's miraculous but…",
          "Contenu": "When it's good it's miraculous but quite often it's dreadful. Worth it for the good times though.It would be better to have the output as a separate layer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Fink",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T19:33:18.000Z",
          "Titre": "No .PSD files from within Lightroom Classic",
          "Contenu": "I use Photo AI from Lightroom, Photoshop, and sometimes as a stand-alone program. I think it's every bit worth the money. It doesn't do anything I can't do myself in Photoshop, but it does it 100 times faster.The one criticism I have is that, for some reason, I can't work on a Photoshop file from within Lightroom.  Topaz refuses. I have to go to Photoshop to work on a .PSD file."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Valued Visit A City User",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T18:15:10.000Z",
          "Titre": "Works as advertised",
          "Contenu": "It is an excellent tool to make your workflow simpler which involves noise reduction and image sharpening.Very convenient as it is available from LrC and as an independent app with multiple tools within the same interface.By purchasing the individual apps it was a better option for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Smith",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T19:41:27.000Z",
          "Titre": "The latest version of Topaz Photo AI blew me away!",
          "Contenu": "I've monitored the advancement of photo enhancing apps for quite a while but it wasn't until I recently read a new article regarding the latest changes to Topaz Photo AI that I considered giving it a trial. WOW!! The upscaling and sharpening of a low res test image blew me away ... so mush so I immediately purchased the full license. I've used it now on a large number of jobs and am continually astounded by the end results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T21:10:43.000Z",
          "Titre": "The REMOVE tool is amazing",
          "Contenu": "The REMOVE tool is amazing.  I've painstakingly tried to remove things from photos before, with very mixed results.  This tool, powered with AI, has made the process effortless.  Also, the upscaling works fairly well to help with sharpening a photo.  The REMOVE tool is worth the price of admission.  It is saving me tons of time!   Now if you guys could add a \"SKY REPLACEMENT\" tool it would solve pretty much everything for me!  lol"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:15:26.000Z",
          "Titre": "Highly recommend!",
          "Contenu": "The Photo AI software works great.  Noise reduction and image sharpening is amazing.   It has become an indispensable part of my workflow.   The cost is reasonable and on the few occasions I've had to contact customer support I've found them to be extremely responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "michel",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:38:51.000Z",
          "Titre": "I had problems starting the TOPAZ PHOTO…",
          "Contenu": "I had problems starting the TOPAZ PHOTO AI package, due to a misunderstanding when I purchased the soft.With the help of support team we finally understood why it did not work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Kornmeyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:56:22.000Z",
          "Titre": "Great software",
          "Contenu": "The software is created for the photographer and is very easy to understand and use.  I have thirteen of the plugins to Photshop and I also have the standalone program.  They all make my photos even better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Photocon",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T08:22:20.000Z",
          "Titre": "Topaz AI is Amazing!",
          "Contenu": "Topaz AI is an amazing program, as is Gigapixel. I've enjoyed using them on a regular basis. They are intuitive, easy to use, and the results are amazing."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Risto Ranta",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T19:04:04.000Z",
          "Titre": "I never thought this was possible!",
          "Contenu": "I never thought this was possible!In images taken with the new SLR cameras, the improvement comes mainly in improving sharpness. But the most astonishing increase in quality is obtained in images taken with old small-sensor cameras. And even in old scanned images taken with film cameras."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas Shea",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T04:24:44.000Z",
          "Titre": "Love Topaz products.",
          "Contenu": "I still prefer your products to any of the others I've used/sampled as I find them much easier to use and highly superior to all others.Keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-12-22T00:25:28.000Z",
          "Titre": "Five Stars",
          "Contenu": "Topaz AI and Sharpen AI very good products. Topaz Video AI didn't meet my needs but I'll keep checking as  it evolves.  The Support Team is excellent."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Felipe Souza",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:59:53.000Z",
          "Titre": "The best tools in my workflow",
          "Contenu": "Since I've started to use Topaz Labs products - Gigapixel and TopazVideo - I've expanded my work possibilities to a long wished level."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ringo Santiago",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:39:57.000Z",
          "Titre": "Easy to purchase, download, and install.",
          "Contenu": "Downloading and updating the Topaz Labs software has been an easy process. Most of the purchase and upgrade instructions and process have been intuitive and hassle free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 10,
          "Date": "2023-12-19T04:47:36.000Z",
          "Titre": "I use topaz for a number of reasons",
          "Contenu": "I use topaz for a number of reasons. It depends what issue I would be correcting in my image...Topaz gives many choices to choose from."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Whiskers",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T17:09:48.000Z",
          "Titre": "I use primarily for my bird and nature…",
          "Contenu": "I use primarily for my bird and nature photos, however I'm also very pleased with how old scanned in photos are improved as well. Great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Almeida",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:26:36.000Z",
          "Titre": "Essential software for the any level photographer and videographer",
          "Contenu": "I’ve been using Topaz plugins for years. They save me hours of time and you get your desired results."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Josep Monreal",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:11:02.000Z",
          "Titre": "I am positively astonished.",
          "Contenu": "Hi,I recently scanned around 600 pics of my family. The most recent were 70 years old.In many cases, the faces were just completely blurr.After Topaz medicine I cacn recognize the faces of my family. Same time the very annoying noise completely  desappeared."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H.Harper",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:50:31.000Z",
          "Titre": "This software is out of this world",
          "Contenu": "This software is out of this world! It is so resourceful, so fast and so easy to use, it paid for itself in less than one hour! There is nothing in the market that can compare to this. And have i mentioned the absolutely incredible, super friendly and highly talented tech support? I couldn’t be happier with this software ! Thank you Topaz, signed your number 1 fan!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 22,
          "Date": "2023-12-20T19:23:41.000Z",
          "Titre": "Topaz AI has set a new standard",
          "Contenu": "Topaz AI has set a new standard for noise reduction and sharpening.  Amazing tool"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Dardar",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:24:24.000Z",
          "Titre": "A crucial part of my editing",
          "Contenu": "I post copies of content I archived of VHS recordings of many years ago to YouTube. While others have similar channels I find that thanks to mine being enhanced from Topaz Video I have an edge of better quality videos. If I have one complaint, the year renewal price is a bit high, although worth the extra cost, the price may turn away some customers.I have one suggestion of a feature I’d like to see added. While Topaz works with only videos it would be a great feature to at least listen to the original audio with simply a checkbox."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T11:21:07.000Z",
          "Titre": "I've been using the Topaz photo suite…",
          "Contenu": "I've been using the Topaz photo suite (Gigapixel, DeNoise, Sharpen, and Photo AI) for a while now and it has saved me on numerous occassions. This is particularly true in situations where I needed zoom and crop a picture to focus on a smaller portion of my photo or graphic. I've been extremely pleased with the results I've gotten. Also, I just recently purchased Topaz Video AI and I hope to begin experimenting with it as soon as time allows."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laverne Keizer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:29:13.000Z",
          "Titre": "Game Changer!",
          "Contenu": "My older photos, even in jpeg format, were given new life, as a result of the sharpening and de-noising."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN NAUGHTON",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:53:52.000Z",
          "Titre": "Powerful Tool!",
          "Contenu": "Being a user of the Topaz suite D S & G I was hopeful the Photo AI would be an improvement over an already good photo processing tool, I was blown away!Obviously a good tool for all photography, but a must have for nightscape astro photography!!Well done Topaz Labs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jack bishop",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T09:46:45.000Z",
          "Titre": "Topaz AI  helped me clarify and restore…",
          "Contenu": "Topaz AI  helped me clarify and restore an old but valuable photo into a quality that allowed the old blurry to become an amazingly clear photo that scaled beautifully. This is well worth the investment. This is truly impressive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "matthewpeteroneill",
          "Nb_Reviews": 16,
          "Date": "2023-12-07T12:54:01.000Z",
          "Titre": "Stunningly effective.",
          "Contenu": "Both Topaz Video and Photo A.I have been invaluable in my workflow since taking the plunge 12 months ago.To be able to slow down footage by up to x16, as well as upscale, sharpen and denoise along with a host of other features, has incresed my creative options in a way no other software has.It's an incredible achievement and continues to improve with regular and effective updates.I can't wait to see what the future holds."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Fredos",
          "Nb_Reviews": 7,
          "Date": "2023-12-08T16:47:51.000Z",
          "Titre": "An excellent logic",
          "Contenu": "An excellent logic, completely updated and very effective. The negative touch is the choice of language. When you meet these programs in Europe, you pour effort into offering more important languages, including the German, French, Italian, and Spanish.  ''America First'', we are both, and within a short time of the limits.(translated from French language by Google)"
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "Juan M.",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T05:23:23.000Z",
          "Titre": "I am completly satisfy with the TOPAZTopaz…",
          "Contenu": "I am completly satisfy with the Topaz Software results. I have Giga. Denoise, Sharp andTopaz Photo AI."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Neville Wostear",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T10:06:11.000Z",
          "Titre": "As good as it gets.",
          "Contenu": "The product does what you claim it will do and it certainly improves my pictures to the point that I recover shots I would other wise discard.As I become more familiar with the programs I believe my work will improve even further."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARY LEE BUCK",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T18:08:10.000Z",
          "Titre": "Using topaz software has been a game changer in my post processing",
          "Contenu": "I’ve been using Topaz software for many years. I love all their products. Since I started photographing birds, I find myself using very high ISO’s. The noise reduction feature has helped a lot in improving the quality of my photographs. It has literally been a game changer. I highly recommend this product if you photograph wildlife or find yourself using high ISO’s."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 8,
          "Date": "2023-12-21T21:29:06.000Z",
          "Titre": "Best all round error correction software I have tried",
          "Contenu": "All of the modules can make a recognisable difference to my photographs.Noise AI is particularly good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian Thacker",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T22:53:55.000Z",
          "Titre": "It's easy to use and see immediate…",
          "Contenu": "It's easy to use and see immediate improvement in your photography.  Works really well with low light images"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Green",
          "Nb_Reviews": 24,
          "Date": "2023-12-06T16:57:01.000Z",
          "Titre": "Upgrade to AI Photo…",
          "Contenu": "I have owned DeNoise, Sharpen and Gigapixel for some time now and purchased AI Photo on 17th December. BRILLIANT! However, I wish I’d known about the discount offer to existing Topaz owners, that allows the upgrade to AI from DeNoise, Sharpen, Gigapixel, etc! Topaz - SUPERB product. Terrific Customer Support. Thanks 🙏"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Barry Skeen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:42:13.000Z",
          "Titre": "Worth the money",
          "Contenu": "For me , Topaz makes my pictures come to life , Ive had so many of my pictures wasted and disappointed in my time , iam no exspert in photography , but I do enjoy taking all types of pictures , birds , landscape, people , insects you name it I'll take a picture of it , iam happy with the latest update , so thanks Topaz"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gary T",
          "Nb_Reviews": 13,
          "Date": "2023-12-10T12:10:56.000Z",
          "Titre": "Always Helpful and Great Products",
          "Contenu": "The team in support are always extremely responsive and helpful whether it is a daft query or a genuine issue.  The products do exactly what they should and are now a core part of my photo editing workflow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T17:15:38.000Z",
          "Titre": "I love it",
          "Contenu": "I love it. very simple to use, just select difference choice and see which one is fit best for you. Love the masking fusions because you can select only area you like. You can also fine tune every function that best for your image. I own a few Topaz Labs plugin, it work well with photoshop. I only hope Topaz have a package deal for me. That all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Adduci",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T23:42:55.000Z",
          "Titre": "They almost 'think' for me. Thanks.",
          "Contenu": "I've had Topaz add-ons for Photoshop ever since Topaz brought them to market. Topaz has improved virtually every photo I take in one way or another with one of their plug-ins or another. The newer AI versions are now even better. I'm a great fan of your excellent software. They almost 'think' for me. Thanks. Recently returned from Greenland and the Canadian Arctic and have used Topaz Sharpen AI, Topaz DeNoise AI, Topaz Photo AI, and Topaz Gigapixel AI on most of the 52 gig of photos that I came back with."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Michel",
          "Nb_Reviews": 7,
          "Date": "2023-12-21T21:29:36.000Z",
          "Titre": "A must have for post treatment…",
          "Contenu": "Some of your softwares  have become a must have for post tratment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher McNeill",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T02:52:25.000Z",
          "Titre": "Best Software out there for editing…",
          "Contenu": "Best Software out there for editing photos or videos"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hilary K",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T00:25:17.000Z",
          "Titre": "Easy download from Topaz website",
          "Contenu": "Easy download from Topaz website, easy payment process. Good that customer is allowed to try out the software for free first before purchase. Works on my Fuji X-T5 raw and jpeg files."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Kai Helge Andersen",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T11:29:23.000Z",
          "Titre": "For many years I have used various…",
          "Contenu": "For many years I have used various products from Topaz, mostly I have used Topaz DeNoiseAI to remove unwanted noise from my photos, a fantastic product that \"saves\" many photos. Most recently, I bought Topaz Gigapixel AI, a product that upscales images with minimal reduction in quality."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Peter",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T23:29:43.000Z",
          "Titre": "Initially I had a problem with computer…",
          "Contenu": "Initially I had a problem with computer compatibility and Topaz refunded my payment when I found my HP computer was compatible Topaz gave me all the assistance I needed to get the Software installed.I’m very impressed with this package and it was well worth the money it turns my astrophotography photos in beautiful pieces of ArtThank you all and my best wishes for Christmas and 2024"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ian Batchelor",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T07:34:57.000Z",
          "Titre": "the product is better than all the hype…",
          "Contenu": "the product is better than all the hype about it. It allows me to salvage images that would normally end up in the bin with an unhappy result. This is the second time I have purchased Photo Ai and it continues to improve with every upgrade. I recommend it  to all my photographer friends but many are already using it. I recommend this  software it does do what it says it does .."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A Gawronski",
          "Nb_Reviews": 10,
          "Date": "2023-12-09T15:43:53.000Z",
          "Titre": "Topaz is like another lens",
          "Contenu": "Topaz makes a big improvement to my photos.It cleans them up and sharpens them.It would be good if there were a few other functions such as cropping, stretching, colour management, ..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nan Carder",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:16:17.000Z",
          "Titre": "This software is part of my daily editing on many of my images.",
          "Contenu": "I use their software daily to improve my photographs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T19:33:29.000Z",
          "Titre": "The Sharpen is amazing",
          "Contenu": "The Sharpen is amazing. I can’t use Photo AI yet because of my system, but I look forward to it when I get a new Mac! Also the customer support is outstanding compared to other tech companies!!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "AB",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:23:45.000Z",
          "Titre": "Gigapixel AI recovering old photos",
          "Contenu": "Topaz Gigapixel AI did a great job of recovering old low resolution photos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Baker",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:18:57.000Z",
          "Titre": "It works exactly as promised",
          "Contenu": "It works exactly as promised. I've sharpened pictures that I never thought would be salvageable, with just a few clicks. I especially like the masking option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael De Martino",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T00:05:36.000Z",
          "Titre": "My images are more sharp than ever. I how ever did not receive my discount because i do have other Topaz  that I ordered in the past.",
          "Contenu": "My images are more sharp than ever. i did not get my discount when I ordered even though i have other Topaz"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Pip Grant-Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T08:19:59.000Z",
          "Titre": "Back into the wild with the ultimate Gem.",
          "Contenu": "The software has restored my faith in my photography. It's been a pleasure to use and the learning curve not painful. Even minor adjustments greatly improve my pictures"
        },
        {
          "Note": 5,
          "Lieu": "GU",
          "Pseudo": "Mark",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T01:29:34.000Z",
          "Titre": "Indispensable part of my workflow.",
          "Contenu": "I have used Topaz products for many years, The latest version of Photo AI has been an indispensable tool for me. It does what it says and I am seldom disappointed in the results."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Lim Teck Thong",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T03:27:36.000Z",
          "Titre": "Photo AI is a useful tool which I use…",
          "Contenu": "Photo AI is a useful tool which I use in combination with Photoshop. I bought Photo AI mainly for upscale purpose for bird photography."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "@pablo_fsss",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T21:56:50.000Z",
          "Titre": "Stunning results !",
          "Contenu": "My editing process has become not only more efficient but also faster, making it significantly easier for me. The results are truly stunning. This program stands out as one of the most rewarding tools I have ever used, and I wholeheartedly recommend it to all fellow photographers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dorothy Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:44:48.000Z",
          "Titre": "Topaz Labs take great care with improving their products to help their customer get better photos…",
          "Contenu": "The programs are being updated and the results are getting better everytime. I used the support system and the response to the problems are prompt and very helpful.I am very pleased with the service I receive from topaz Labs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Asiala",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T12:52:30.000Z",
          "Titre": "I’ve been using Topaz software for…",
          "Contenu": "I’ve been using Topaz software for years and now I will never go without it. I just completed my collection by adding the Topaz video editor to it and I can’t wait to see what I can do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean-Pierre",
          "Nb_Reviews": 8,
          "Date": "2023-12-08T05:05:39.000Z",
          "Titre": "I love the way it removes noise",
          "Contenu": "I love the way it removes noise. Something bugs me is that with every picture it has to re-download new AI models. That increases the processing time significantly."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "dutchgal",
          "Nb_Reviews": 8,
          "Date": "2023-12-07T23:05:16.000Z",
          "Titre": "Always great offers",
          "Contenu": "What I love is that if I take advantage of a discount that the new period is just added to the period I already own. Anyway Topaz has always been a trendsetter. I used it a lot. Also Topaz is nice for those that are already a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Larsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:37:44.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! Looking forward to great updates! Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swami Shraddhananda",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:36:22.000Z",
          "Titre": "Easy to use, removes noise, improves clarity, is very good for faces, expands the dimensions (pixel size) of the image, if needed.",
          "Contenu": "I have been using all Topaz products for a number of years. The new \"Topaz Photo AI\" is excellent and replaces the various apps Topaz had earlier. The ease of use is extraordinary!I highly recommend Topaz Photo AI."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curt Lyon",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:35:08.000Z",
          "Titre": "Old TV Commercials Look New",
          "Contenu": "I have a collection of older TV commercials that I needed to share with clients but had been saved in small files. I used Topaz to uprez the commercials and have been very impressed with the quality of the reproduction."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dieter Eberle",
          "Nb_Reviews": 12,
          "Date": "2023-12-20T18:42:54.000Z",
          "Titre": "I never had problems with the service…",
          "Contenu": "I never had problems with the service of Topaz."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "GUILLERMO MARCONI",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T19:01:58.000Z",
          "Titre": "Company is doing this great program",
          "Contenu": "Company is doing this great program! I am an amateur photographer and Topaz AI, even Sharp and De noise help me a lot to enhance my pictures, sharpening, erasing noise, and so on"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Buehler Shaffer",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T22:01:58.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, without the an annoying subscription. One price that pays for itself!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:40:40.000Z",
          "Titre": "I have Topaz photo AI and the standalone apps",
          "Contenu": "I have Topaz photo AI, gigapixel, denoise, and sharpen. The photo AI updates quickly but that depends on your device cpu and vpu. It generally works pretty well in auto but you have the options to tweak the settings yourself. It can be a great time saver to quickly fix a photo or a good starting point if you know the photo needs something but aren't sure how or what it needs. They have basically taken the standalone apps and put them in photo AI so you can change the parameters in one program, scaling, denoise, and sharpening. It also adds recover faces. I don't know if the standalone apps will continue, the updates are few and far between. I hope they do. The advantages of the standalone apps is you can set them to compare mode and have 4 different modes side by side so you can easily see which is the best mode to use. You can select different modes in photo AI but you change it, wait for the refresh and have to remember what the previous one looked like. Not the same at all. The side by side comparison is a great feature. You can see how they compare in detail. It would be great if it could somehow be incorporated into photo AI. So all in all great for someone who wants their photo to look better with the click of a button or a 1st step in a processing workflow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Bentz",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T18:12:05.000Z",
          "Titre": "Topaz products have proven to be a revelation",
          "Contenu": "Topaz products have proven to be a collection fantastic tools that I use regularly in my photo editing. Not only for digital images but they have been transformational for editing film images. Every update is a worth while and effective improvement."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 29,
          "Date": "2023-12-16T13:08:31.000Z",
          "Titre": "Straight forward understandable…",
          "Contenu": "Straight forward understandable process. Fantastic results. I have managed to 'rescue ' some old favourites. Worth the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:01:21.000Z",
          "Titre": "Perfect tool for noise removal as well…",
          "Contenu": "Perfect tool for noise removal as well as improving sharpness."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Murray Robertson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:14:01.000Z",
          "Titre": "It works",
          "Contenu": "It works. With little learning time, it works. I'm confident that it'll work better for me once I learn the controls. I do like to do things my way.:-)"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Klaus Mohr",
          "Nb_Reviews": 7,
          "Date": "2023-12-15T01:45:20.000Z",
          "Titre": "Photo AI is the best software to remove…",
          "Contenu": "Photo AI is the best software to remove noise, sharpen and upscale on the market! In my opinion... ;-)"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Wigberto Cuenca Saez",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T17:58:32.000Z",
          "Titre": "Good product and good service.",
          "Contenu": "The noise reduction and sharpness are impressive, although sometimes it is a little slow in processing, maybe it's my computer.Good customer service, I had a problem with an update and the service was excellent until the problem was resolved, which was not easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Asiala",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T12:47:46.000Z",
          "Titre": "I am so loving Topaz editing software!",
          "Contenu": "I am so loving Topaz editing software!It has made my productivity skyrocket. Thank you so much for your support and help with everything I do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mackolb",
          "Nb_Reviews": 11,
          "Date": "2023-12-09T06:25:20.000Z",
          "Titre": "My photos and video footage have…",
          "Contenu": "My photos and video footage have enjoyed new lives thanks to Topaz. I’m astounded at the recovery and modification possibilities have been made possible. Pure magic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:56:37.000Z",
          "Titre": "Gigapixel is an amazing software",
          "Contenu": "Gigapixel is an amazing software! We love it.Thanks, God bless you!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Gunther Hanne",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T03:13:42.000Z",
          "Titre": "Such a great and easy software to use",
          "Contenu": "Such a great and easy software to use, together with Lightroom"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Beasley",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:24:39.000Z",
          "Titre": "I’ve only had time to work a bit with…",
          "Contenu": "I’ve only had time to work a bit with two of the apps. Both work well and I’m sure (with the user learning more) will get the results I need. I’m very pleased with the responses I have received to my questions and the help I received with an issue I had. I recommend these apps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lionel Freeman",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:57:31.000Z",
          "Titre": "You can trust this capability to rescue your difficult shots.",
          "Contenu": "The ability to upsize small prints and achieve high resolution prints with minimal or no discernable artifacts is a tremendous addition to my capability."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley K.",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T17:42:48.000Z",
          "Titre": "WORTH IT!!!!!!",
          "Contenu": "I would give a hundred stars if I could. It has absolutely changed my photos, the quality is unbelievable. It is definitely worth it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T00:25:58.000Z",
          "Titre": "Old photos faces come back to life.",
          "Contenu": "Old photos faces come back to life.Even recent photos adds sharpness. Brilliant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:59:26.000Z",
          "Titre": "Great product.",
          "Contenu": "Has helped my photography maintain quality on social media in a major way!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyle",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T01:40:25.000Z",
          "Titre": "Perfecting a photo",
          "Contenu": "It is so nice to be able to take a picture with good composition and make sure it is tack sharp and remove noise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Emerson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:12:21.000Z",
          "Titre": "Your products do what you say they'll do.",
          "Contenu": "Your products do what you say they will do.  Can't ask for anything  more than that."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian",
          "Nb_Reviews": 9,
          "Date": "2023-12-14T20:36:04.000Z",
          "Titre": "The product does what it says",
          "Contenu": "The product does what it says. A useful addition to the editing process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary L. Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:34:53.000Z",
          "Titre": "Highly recommended!",
          "Contenu": "The site is straightforward to use, and the software is excellent.  The options available in Gigapixel AI, allow you get the absolute best enlargement or reduction, based on each individual image."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel S.",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:50:31.000Z",
          "Titre": "Good to work with",
          "Contenu": "Renewing my subscriptions was easy and straight forward.  Topaz Labs was good about informing me that my subscription was expired."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack the Alchemist",
          "Nb_Reviews": 10,
          "Date": "2023-12-07T00:49:13.000Z",
          "Titre": "It is amaat Topaz Labs software…",
          "Contenu": "It is amazing what Topaz Labs software allows me to improve in my photos. You must see for your self."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ian rowley",
          "Nb_Reviews": 29,
          "Date": "2023-12-07T02:22:47.000Z",
          "Titre": "Great product",
          "Contenu": "Brilliant software a real game changer really impressed in thd way it improved my photography"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alberto Franco",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T20:36:51.000Z",
          "Titre": "All the Topaz products are excelent",
          "Contenu": "I have all the Topaz products except the video, and they are all excellent. They are easy to use, and the final results are amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Stein",
          "Nb_Reviews": 5,
          "Date": "2023-12-07T19:47:26.000Z",
          "Titre": "Great product for photographers",
          "Contenu": "Topaz Photo AI for still photography has really made a difference in some of my pictures! Easy to use and it will not break the bank."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Gigeous",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:23:02.000Z",
          "Titre": "Amazing tool",
          "Contenu": "It takes some experimenting, but when used right it's a must use on any video project."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Silviu Gheorghe Ionut",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T20:48:34.000Z",
          "Titre": "The experience is really good",
          "Contenu": "The experience is really good. Software is so easy to use and you don’t need no workshops to learn it all. I am very impressed by the gigapixel and denoise. These are the highlights for my:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:51:42.000Z",
          "Titre": "Works great….saved my photos from a…",
          "Contenu": "Works great….saved my photos from a photo shoot in a gym with very dim lighting…!!!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Frank Busjahn",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:16:08.000Z",
          "Titre": "Perfect tool for perfect pictures."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Fišer",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T07:52:06.000Z",
          "Titre": "Great tool",
          "Contenu": "Great tool, still surprising.  Even photos that look unusable at first glance turn out great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "winston",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T06:17:18.000Z",
          "Titre": "Video AI and Photo AI are both essential tools",
          "Contenu": "I use both Video AI and Photo AI on a near-daily basis. I wish they were not so expensive. But they are necessary tools."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Britton",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:34:43.000Z",
          "Titre": "Great product",
          "Contenu": "Essential piece of my editing flow"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David A",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:23:37.000Z",
          "Titre": "Love the Topaz products",
          "Contenu": "Love the Topaz products. They work very well and make a big difference in my finished photos."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jac Daigle",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:05:23.000Z",
          "Titre": "After an initial learning curve",
          "Contenu": "After an initial learning curve, Denoise AI augmented my joy of photography by perfecting the finishing touches to my photos."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Robin Burtt",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T22:47:03.000Z",
          "Titre": "Topaz software",
          "Contenu": "Very happy with topaz software, particularly Denoise. It works well and integrates well with other software that I use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melbourne",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T16:46:31.000Z",
          "Titre": "Topaz Photo AI is my go to plugin to…",
          "Contenu": "Topaz Photo AI is my go to plugin to manage noise, resolution and sharpening, especially in restoring family heirloom photos, but even photos taken with my state of the art mirrorless cameras. I especially appreciate the ability to control the degree of sharpness, noise reduction and resolution. And upgrades keep getting better."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hugh Chisholm",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:36:28.000Z",
          "Titre": "Great software",
          "Contenu": "Great software, great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john hilton",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:38:03.000Z",
          "Titre": "Password problem",
          "Contenu": "Unable to activate 2 of the 5 program. Problem solved, working fine"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Chant",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T18:13:11.000Z",
          "Titre": "All the products are easy to use and…",
          "Contenu": "All the products are easy to use and understand and give an alternative look to your picture."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Jacce",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T11:06:25.000Z",
          "Titre": "Very simple to use",
          "Contenu": "Very simple to use and the results are amazing. Really helps to improve lores images in my case"
        }
      ]
    }
  ]
}