{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.maxprog.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Julian Berkshire",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T11:05:20.000Z",
          "Titre": "Don't send proper header in plain text…",
          "Contenu": "Don't send proper header in plain text password sending mode with no ssl which lead you to be warned by anti spam system. This when other software succed.Work properly only in case of authentication with ssl and login pass."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gailon Morisette",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T22:27:56.000Z",
          "Titre": "I have not been able to get it working…",
          "Contenu": "I have not been able to get it working yet, and your instructions leave a log to be desired."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "PITCHAI BALASUBRAMANIAN",
          "Nb_Reviews": 2,
          "Date": "2020-08-16T01:41:26.000Z",
          "Titre": "You are a international fraud",
          "Contenu": "You are a international fraud. You have cheated 10 years customer of yours by selling fraudulent software-Email verifier which is not working at all. You do not have any shame and asking every time for a review. You will get destroyed by God soon."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Ralph Holt",
          "Nb_Reviews": 3,
          "Date": "2021-05-29T17:14:01.000Z",
          "Titre": "Suggestion",
          "Contenu": "Personally, MaxBulk & MLM should be definitely transformed & transferred it to a CLOUD of some sort. We loose too much time in learnings, trainings, watching multiple videos, in the designing, testings, and highly complicated setups (FTP/HTML/Server issues, etc) of MaxProg software for just retriving infos (list of unscribers/ok subscribers / Newsletter interests, etc) - Take example at Flashissue or similar.Kind rgdsRalph"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Unsatisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T03:06:16.000Z",
          "Titre": "Unworkable Software Apps",
          "Contenu": "Most of the software are not really work (MaxBulk Mailer Pro, eMail Bounce Handler, and eMail Verifier). So sorry to say that I already purchase other apps to replace Maxprog. Please no offense, and take this opportunity to do improvement for ensuring your sustainable business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer David-Lang",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T22:05:21.000Z",
          "Titre": "I have been using MaxBulk Mailer for…",
          "Contenu": "I have been using MaxBulk Mailer for over 13 years and it just stopped working on both my desktop and my laptop. When I reached out, they weren't able to help me.So I dropped it and replaced it with a different mail merge program (GMASS).I won't use MaxBulk ever again unless someone reaches out and helps me to fix it."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "PITCHAI BALASUBRAMANIAN",
          "Nb_Reviews": 2,
          "Date": "2020-08-15T15:29:23.000Z",
          "Titre": "Email verifier software was  bought by…",
          "Contenu": "Email verifier software was  bought by me before a week. It was not working after installation. No body is responding. They received money of Rs.2800. Still they do not want to attend. These are all no.1 cheaters in the world. I am their customer for the pst 10 years. Their email sender and extractor were working (bought before  10 years)good.will you attend to it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "thomas j morrell",
          "Nb_Reviews": 2,
          "Date": "2020-07-10T00:10:19.000Z",
          "Titre": "could not help me at all",
          "Contenu": "extrator for emailsno help whatsoever only message that said nothing none of the advise given worked can only rate this extractor as a scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T23:43:41.000Z",
          "Titre": "stops working after verifying just a…",
          "Contenu": "stops working after verifying just a few emails. Freezes up. I have restarted my machine and I have updated the software to it's newest version. This is very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "BIJKERK",
          "Nb_Reviews": 1,
          "Date": "2020-01-10T19:37:10.000Z",
          "Titre": "TOOLKIT Not working",
          "Contenu": "Bought the total email TOOLKIT But thé activation code does not work!  Latest versions and for Now no help since december 2019 :("
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Nike",
          "Nb_Reviews": 8,
          "Date": "2020-01-09T21:56:19.000Z",
          "Titre": "Sending lots of email asking me to to…",
          "Contenu": "Sending lots of email asking me to to review my purchase. All your email got you was a bad review"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Stefano Stefani",
          "Nb_Reviews": 5,
          "Date": "2020-10-12T10:03:42.000Z",
          "Titre": "The program Email verifier did not work…",
          "Contenu": "The program Email verifier did not work in the notebook. No refound"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Walker",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T18:45:23.000Z",
          "Titre": "Spam increased 1000%"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Mikas AK",
          "Nb_Reviews": 4,
          "Date": "2020-10-15T04:15:37.000Z",
          "Titre": "Software barely usable",
          "Contenu": "Software barely usable, extract more junk and real emails."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Pierre",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T17:28:32.000Z",
          "Titre": "I'm still not reimbursed for email…",
          "Contenu": "I'm still not reimbursed for email extractor"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-10T10:49:05.000Z",
          "Titre": "I paid",
          "Contenu": "I paid, but I was not given a license code"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Yannis Haralambous",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T11:53:14.000Z",
          "Titre": "Unable to use"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "edgar",
          "Nb_Reviews": 1,
          "Date": "2020-02-03T15:52:12.000Z",
          "Titre": "The software don't work."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2020-10-18T08:40:39.000Z",
          "Titre": "expensive and useless... SITESUCKER IS BETTER"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M. Hakim",
          "Nb_Reviews": 2,
          "Date": "2019-12-02T01:23:20.000Z",
          "Titre": "does not work on my mac"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "petter",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T17:23:50.000Z",
          "Titre": "bad application ever"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T19:26:38.000Z",
          "Titre": "COMPLICATED EMAIL VERIFIER"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Johan",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T11:17:10.000Z",
          "Titre": "No answer from you",
          "Contenu": "No answer from you. Please respond when a new customer reaches out to you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FRED LICHT",
          "Nb_Reviews": 2,
          "Date": "2020-01-02T00:36:53.000Z",
          "Titre": "The same inability to upload the new…",
          "Contenu": "The same inability to upload the new software release for MBM occurred for a second time in a row when the update was announced. The first time this occurred, it was suggested that I complete the update via the product web page, mentioning that the issue would be resolved at a future time.  The following update the same problem occurred.  The response to my second inquiry about this was paltry."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Juan Luis Martin",
          "Nb_Reviews": 1,
          "Date": "2020-11-21T11:57:06.000Z",
          "Titre": "Mail Verifier stops frequently",
          "Contenu": "Mail Verifier stops frequently, you have to restart from time to time. Older versions did not have this issue."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Marco",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T12:46:25.000Z",
          "Titre": "MBM ok, mlm and support: the opposite",
          "Contenu": "If you want to use MBM with mlm, a PHP script to manage subsriptions on your Website and synchronize them with MBM, at least find and download the standalone version and fix all errors by yourself, as the script bundled with the mac download has not been updated to the fixed version and contains a flaw which does prevent it from using SMTP. Version 3.2.0 contains a typo. Although I had to find the error by myself and reported it 2 weeks ago, the mac download as of today has not been updated and support didn't even react verbally on that report. The standalone version 3.2.1 states it to be fixed since 2019-11-29, which as of today is more than six months ago.Test mlm thoroughly before buying MBM, as support comes in the form of  not reading messages, \"mlm is a free script\", \"I don't know\" and \"why should I answer, if I don't know?\" and that's about the end of it. No questions more than asking for screenshots, no info about system requirements. Have a look at the style of support in the forums for it and you'll see what I mean.But as if this weren't enough, add a hint on the website to set register_globals to \"on\" in order to circumvent problems with the script, which in terms of security has been known as irresponsible for years. The script contains undeclared variables.Knowing all of the above beforehand would have prevented 2 people spending several hours trying to find and fix errors and getting useful or even just interested, friendly and timely answers from support.2 points, because of the easy refund and because MBM in itself seems to work good as a standalone solution. Its interface could be a bit less 2002, though.I hope I could prevent my emotions from influencing this report and it is of help for others in search of a toolset for mailing list management.---------------UPDATE 2 weeks after my initial review:Concerning the reply: qed (= not addressing any problems mentioned in the review).The Mac software package still has not been updated with mlm 3.2.1. I just cannot understand why a developer does not care about delivering software with known and already fixed bugs frustrating his potential customers. I can come up with many good and bad explanations for such behaviour. MBM is a useful software, just be warned that if you need to integrate subscriber management on your website and/or need to use SMTP for sending mails, you're on your own. My advice is: get the fixed standalone download of mlm and check it thoroughly. Do not set REGISTER_GLOBALS to ON, as is suggested in the FAQ.UPDATE 3The point is that I have neither been bombarded with questions (but with unrelated tutorial videos) nor have I received a reply on the mail with the screenshots until I asked for it some days later. Then the answer was the question, why you should answer at all, if you didn't have any idea.Sorry, but there's been more than one strange moments in our communication. Not a single one of your messages addressed the questions asked or provided any helpful hints, e.g. about system requirements or that there already is a fixed version of the script or whatever.Enough with that. Have a nice day and happy clients from now on."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-02-02T22:22:39.000Z",
          "Titre": "I do not think Maxprog understood my…",
          "Contenu": "I do not think Maxprog understood my question"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon Mitchell",
          "Nb_Reviews": 2,
          "Date": "2020-10-28T22:55:18.000Z",
          "Titre": "Product does not work with my email…",
          "Contenu": "Product does not work with my email system. Could not get a straight answer."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Gérald Tenenbaum",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T23:26:05.000Z",
          "Titre": "replies but does not answer..",
          "Contenu": "replies but does not answer... too bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philippe",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T22:05:43.000Z",
          "Titre": "Stable and robust cash management tool",
          "Contenu": "Stable and robust cash management tool. I am using iCash for several years without any problem.BUT no innovation since I use it and no new functionality. Limited export capability (ie to supplement missing functionalities in Excel or PowerBi)."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Foad Shodjai",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T03:55:32.000Z",
          "Titre": "Its a good tool; I have had some difficulties",
          "Contenu": "The tool is great and we have been using it for a few years now. I found a few shortcoming that I have not been able to solve:1. When saving the presets in importing list from a remote database, the names given to each preset gets duplicated and mixed. This has been a source of great difficulties for the operators2. the stying of the text of the message is limited. We use styled text. I cannot indent paragraphs.3. I recently paid for the annual support. Since then, my importing from remote database stopped working! Its strange; but it is true! my desktop works fine; my laptop doesn't work."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Korey",
          "Nb_Reviews": 2,
          "Date": "2019-10-05T14:43:09.000Z",
          "Titre": "The program works-mostly",
          "Contenu": "The program works, and is quite affordable.  I have used it for several years, and have never had the experience that everything worked correctly the first time.  But with a little finesse and patience, it always seems to get the job done.  Recently, I've had to change security settings temporarily in Google in order for the program to access my mail account as google considers the app \"less secure.\""
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Giuseppe Pisani",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T12:46:09.000Z",
          "Titre": "iCash: UI is the the most weak side of the app…",
          "Contenu": "UI is the the most weak side of the app and should be heavily improved, especially the transactions area (view, edit and insert, merging and spliting) as it is the budget area. Since the ui is a very important side, I would give 2 stars, but I like its way to organise the balance and the profits and loss so I give 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Laurent Glaenzer",
          "Nb_Reviews": 3,
          "Date": "2020-05-02T07:43:56.000Z",
          "Titre": "Good but would deserve a serious redesign...",
          "Contenu": "Max bulk mailer is a good product that does the job. But the interface would need a stronger redesign and it is not very easy to use."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-02-04T18:20:42.000Z",
          "Titre": "iCash version 7.8.1 with problems that…",
          "Contenu": "iCash version 7.8.1 with problems that version 7.6.5 did not have."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T22:22:03.000Z",
          "Titre": "Support",
          "Contenu": "If you have any potential to improve the software, they try to include that asap as update. Also the support is very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Field",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T13:25:22.000Z",
          "Titre": "Top-class Tool",
          "Contenu": "Top-class Tool: Excellent program with one small place for attention (if possible). It would be a real game-changer if non-programmers could just drag and drop or copy/paste brochures etc. without having to go the HTML route for those of us who are not well versed in that discipline.Otherwise, a top-class tool for getting the job done"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Kevin Jiang",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T08:01:43.000Z",
          "Titre": "There is a tiny bug in the code editor",
          "Contenu": "I want to say MaxBulk Mailer is awesome! Unfortunately, there is a tiny bug in the code editor. Sometimes the behavior of pressing the backspace key is weird, and I have to use the delete key to remove code."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith Scott",
          "Nb_Reviews": 2,
          "Date": "2019-11-08T15:26:37.000Z",
          "Titre": "Much better than iMacMailer",
          "Contenu": "Much better than iMacMailer, which I was using until it wouldn't work on latest Mac OS - hence the need to look for something new and finding MBM).Haven't got the click through working yet but that's an extra yet to be enjoyed.The main thing is that it does exactly what it says on the tin.I'm still getting used to it - but I like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck Preston",
          "Nb_Reviews": 4,
          "Date": "2020-08-18T13:13:34.000Z",
          "Titre": "Very good but could be better.",
          "Contenu": "I really like this program and its ease of use. I also like the features added in the most recent update. However I do notice some glitches. I could never get through a list of 4700+ names after letting the program run for hours (overnight). It only ever got to 99%. The older version always completed these lists.  Another more glaring glitch was seeing a long list (over 300) of email addresses that were marked as Bad and \"impossible to test this email address\". But when I ran those same names individually most of them came back as vaild. But on those names I ran them twice as individuals. Some reported bad initially then either automatically changed to valid or were marked valid upon a second testing.  Please work on those items and you will have a perfect program! Customer service was quick and responsive on these issues."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Semih Ertuğrul",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T12:14:53.000Z",
          "Titre": "4 out of 5",
          "Contenu": "In general i'm happy to use Maxprog. There are two main problems;1- Format of the message that i want to mail in review panel is different than the sent mail. Sometimes its really hard to share a link. (It gives link (link)) instead)2- Can not use the program in macbook. Don't know why."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Dhr. Ronny De Peuter",
          "Nb_Reviews": 12,
          "Date": "2022-10-22T18:17:15.000Z",
          "Titre": "Great software and perfect support"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "NickJ",
          "Nb_Reviews": 5,
          "Date": "2021-05-10T16:38:01.000Z",
          "Titre": "The app works well overall",
          "Contenu": "The app works well overall. The \"budget\" side of iCash needs to be beefed up to allow for month by month different amounts budgeting to reflect reality."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "N. Noordegraaf",
          "Nb_Reviews": 4,
          "Date": "2022-10-19T18:43:25.000Z",
          "Titre": "Very good eMail software",
          "Contenu": "If you want to send bulk emails: choose MaxBulk Mailer..."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Paolo Boscolo",
          "Nb_Reviews": 2,
          "Date": "2022-06-04T23:49:32.000Z",
          "Titre": "Some minir bugs still remain  in the…",
          "Contenu": "Some minir bugs still remain  in the produce. Lack of freedom in the definition of the strutture of the accounts"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sandro",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T17:02:17.023Z",
          "Titre": "good",
          "Contenu": "The problem of the image loaded on the stylish text, good was well explained and addressed."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Andrea Saraceni",
          "Nb_Reviews": 3,
          "Date": "2020-10-22T16:05:31.000Z",
          "Titre": "Maxprog it is great",
          "Contenu": "Maxprog it is great! Excellent work! But the software seem to be little bit old fashioned."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Gorka",
          "Nb_Reviews": 1,
          "Date": "2019-11-17T10:29:55.000Z",
          "Titre": "If I had the option to control your…",
          "Contenu": "If I had the option to control your stock portfolio it would be perfect."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Cristina Tassinari",
          "Nb_Reviews": 2,
          "Date": "2020-08-12T05:53:12.000Z",
          "Titre": "Four stars and not five",
          "Contenu": "Four stars and not five, because the interface is not very intuitive"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Daniele",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T09:28:45.000Z",
          "Titre": "great !",
          "Contenu": "Very practical to manage lists and send mails"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Larsen",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T16:03:33.000Z",
          "Titre": "Definitely a good product"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T13:47:37.000Z",
          "Titre": "Maxbulk mailer works for me the way I…",
          "Contenu": "Maxbulk mailer works for me the way I wants it"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Markus",
          "Nb_Reviews": 13,
          "Date": "2019-11-02T23:25:54.000Z",
          "Titre": "Very good program"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Power System Control",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T07:19:30.000Z",
          "Titre": "I am a new user"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T16:48:31.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, continous improvements"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rena Pearl",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T19:09:52.000Z",
          "Titre": "Excellent professional service",
          "Contenu": "Recently I contacted Maxprog on two occasions, each time I received a reply within a day, and each time the issue was solved. Excellent service!"
        },
        {
          "Note": 5,
          "Lieu": "TN",
          "Pseudo": "Maher Souhabi",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T22:25:11.000Z",
          "Titre": "The application does exactly what it's…",
          "Contenu": "The application does exactly what it's programmed for, and it does it well.Maher,"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kurt Regenscheidt",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:50:48.000Z",
          "Titre": "Excellent service…",
          "Contenu": "Very good program with some possibilities for improvement (tab) and excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F. Sciacca",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T18:44:11.000Z",
          "Titre": "Stan Busk and Maxprog get 5 stars from the U.S.",
          "Contenu": "Stan Busk is running one of the best small businesses in the world. His attention to his products and his customers is unparalleled. I've been using MaxBulk Mailer for years, and it's been a money-saving and pleasant alternative to MailChimp and other services. Plus, his customer support is always fast, and very personal. I give Maxprog my highest recommendation for small nonprofits (like myself) or 1-2 person businesses who don't have a huge IT budget. iCash is my latest purchase, and I'm totally pleased with it. A bit of a learning curve from Quicken, but meets all my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 7,
          "Date": "2023-05-15T21:55:49.000Z",
          "Titre": "So many MaxProg utilities",
          "Contenu": "So many MaxProg utilities; so little time. Using eMail Verfier with superb success. Checking email validity may seem paltry to some. For our needs, it's critical. MaxProg is or choice for our Macs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Goldman",
          "Nb_Reviews": 5,
          "Date": "2021-03-31T17:15:09.000Z",
          "Titre": "Absolutely love Email Extractor",
          "Contenu": "I absolutely love Email Extractor. I’ve been using it for several years to turn all kinds of documents into useable prospect lists. I’ve done directories, meeting lists, agendas, from Word, Excel, PDFs (turned into text), whatever you have that has emails in it. It couldn't be easier to use, and it just works with no complaints. Reliable, incredibly useful and valuable tool. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Nick",
          "Nb_Reviews": 10,
          "Date": "2023-10-02T11:24:04.000Z",
          "Titre": "Been using Maxbulk Mailer in…",
          "Contenu": "Been using Maxbulk Mailer in conjunction with FileMaker Pro for mailing my classes for many years. Great product and fantastic support."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Massimo Scalia",
          "Nb_Reviews": 2,
          "Date": "2020-08-26T00:35:11.000Z",
          "Titre": "Maxprog impressive.",
          "Contenu": "I have Maxprog for a couple of years.  It just keeps on improving.  Has all the IT tech for bulk mailing including individual attachments. In the investment fund business the ability to do it in-house to maintain privacy and security is a big advantage compared to cloud services.Finally it can also be used by non or semi IT people like myself.RegardsMax"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Ranger",
          "Nb_Reviews": 9,
          "Date": "2023-04-04T13:06:43.000Z",
          "Titre": "It just works every time",
          "Contenu": "We have used Maxprog's Max Bulk Mailer for many years and as a functional, no frills broadcast email facility, it has delivered time after time for us. The personal support through Stan too is excellent"
        },
        {
          "Note": 5,
          "Lieu": "LU",
          "Pseudo": "Paul",
          "Nb_Reviews": 4,
          "Date": "2023-03-05T03:01:41.000Z",
          "Titre": "A super simple to handle programm",
          "Contenu": "A super simple programm and very efficient how's quick and easy to understand and work with it. I can recommand it to every one who want's to make a simple and complete book keeping for private persons as well as for nonprofit associations or small buisinesses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Schuster",
          "Nb_Reviews": 2,
          "Date": "2021-01-27T20:02:20.000Z",
          "Titre": "I believe Max Bulk Mailer deserves to be in your toolbox.",
          "Contenu": "I believe Max Bulk Mailer deserves 5 stars. If I think of all the businesses that I deal with, they should probably get 10 stars. Their customer service department gets back to you quickly, which is important to me.Having used MBM for over 20 years, I can confidently recommend it."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Jotto",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T14:17:39.000Z",
          "Titre": "I use to use iMac Mailer until they bit…",
          "Contenu": "I use to use iMac Mailer until they bit the dust, MaxBulk Mailer is superior in all aspects. Stan is a bit slow at times with customer service however keep in mind he is a one-man band. Suggestion; send in one issue at a time, he will help through any issues and eventually he will get you through it... Thanks Stan!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Torsten B",
          "Nb_Reviews": 10,
          "Date": "2020-08-13T13:01:42.000Z",
          "Titre": "Great Product, swift and helpful support response on a weird error",
          "Contenu": "I had a weird error message, possibly based on my local set up. The support team responded within a few hours, tested with my own delivered file and gave helpful tips. Although the error is not completely gone, I have a workaround and, again, this might have nothing to do with the product, but with some interference in my individual system set-up."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ped",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T15:14:21.000Z",
          "Titre": "iCash by Maxprog",
          "Contenu": "I have been using iCash for many years now it is a good little program . Over the years there have been a few little problems but an e mail to Maxprog has usually received a prompt reply followed by a swift solution This time might take a little longer but then I am waiting for the next update to sort a minor bug.Update installed all working as it used to.Thank you all at Maxprog"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T20:20:45.000Z",
          "Titre": "MaxBulk mailer continues to deliver",
          "Contenu": "I cannot remember how long I have been using this program, but each time there is an update, you see improvement. Hence why I have continued to pay for my subscription for many years. A great product with great service from a great company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2020-01-10T16:56:07.000Z",
          "Titre": "The latest iCash update wouldn’t…",
          "Contenu": "The latest iCash update wouldn’t download correctly when accessed through the program’s update option.  Maxprog support directed me to the download section of their website - the update worked fine when downloaded from this page. Support’s response was timely and solved the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Palmer",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T16:18:15.000Z",
          "Titre": "Excellent accounting program - iCash",
          "Contenu": "Excellent personal and business accounting program for macOS.  Recently had a problem upgrading the program to the most current release level.  Maxprog handled the problem in much less than one day and correctly the very first time.  Very happy long-term customer here (greater than 10 years)."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TRA",
          "Nb_Reviews": 2,
          "Date": "2020-09-04T01:11:37.000Z",
          "Titre": "Great tool for the price",
          "Contenu": "Great tool for the price - They put a lot of work into it. You really should know php/html and server infos and be very familiar with SMTP. Although they do provide good documentation, it is still a little \"buggy\" and is certainly not plug & play."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T12:39:24.000Z",
          "Titre": "I had hard drive issues and didn't have…",
          "Contenu": "I had hard drive issues and didn't have the s/n for MaxBulk and my email address is now different than when I bought the program.Stan was very prompt in assisting and got me working again in short order - Thanks Stan."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Brian Pringle",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T04:18:45.000Z",
          "Titre": "iCash is by far the best",
          "Contenu": "iCash is by far the best of all the accounting apps out there, and I've tried most of them. It is particularly good at producing detailed reports and aiding information retrieval ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Palmer",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T22:46:51.000Z",
          "Titre": "I've used this emailing software over…",
          "Contenu": "I've used this emailing software over 10 years now. It works great and what really impresses me -- is that the company works to keep the software current. Thanks MaxProg for great email bulk software. I use it to manage over 400 Vocational H.S. Alumni and send out regular emails. I've also used it with a gmail address at times."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Serge Yurkevich",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T14:28:23.000Z",
          "Titre": "The application is the most complete…",
          "Contenu": "The application is the most complete and developed of analogues on the market. As a user of similar applications for MAC, I was especially pleased to see a lot of really useful options. It is very important that quality support is provided, Stan himself responds immediately by mail. I definitely recommend the app!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "John Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T11:17:49.000Z",
          "Titre": "Co-workers and visitor hugely appeciate",
          "Contenu": "I recently updated MaxBulk which I have been using for many years in my former job. Co-workers and visitors from the non-profit exhibition place I work for these days hugely appreciate the personalized mails I send."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Takan",
          "Nb_Reviews": 1,
          "Date": "2019-11-02T11:27:53.000Z",
          "Titre": "I am an email marketer and have been…",
          "Contenu": "I am an email marketer and have been using maxprog software for the 2nd year running and hand on heart it has brought me sales through the the cleared email list I use CLEANED *****"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "JAIME FIOL",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T23:14:04.000Z",
          "Titre": "I am very satisfied with the icash…",
          "Contenu": "I am very satisfied with the icash program, which I have been using for years, which helps me to know better and at all times the destination of my funds and to keep an exhaustive control of my expenses. It has been and is a good experience for me."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Marco Navalesi",
          "Nb_Reviews": 2,
          "Date": "2020-10-11T17:57:10.000Z",
          "Titre": "Very good software",
          "Contenu": "I've been using Maxbulk for at least 10 years, sending about 30,000 emails a month, with excellent results. Why move to the cloud? Perfect together with a good smtp server"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Victor M.d S",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T09:07:29.000Z",
          "Titre": "Great product and support,",
          "Contenu": "I have been using Icash for some years already and it has helped me to have a grip on my finances. Many thanks for offering an affordable and powerful solution to manage my finances."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "receiver customer",
          "Nb_Reviews": 4,
          "Date": "2020-05-01T14:27:50.000Z",
          "Titre": "Seamless purchase & key delivery.",
          "Contenu": "Upon purchase the key was emailed swiftly within 10 minutes or so, and unlocked the software restrictions perfectly.  Purchase was made seamlessly through PayPal."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Raymond  & Suzanne  Scholer",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T07:42:24.000Z",
          "Titre": "Stan never let me down during the…",
          "Contenu": "Stan never let me down during the couple of days where the new update wouldnt work.  He sent me graphics, pieces of advice, how to do everything in the right order : and we succeeded ! Thank you, Stan !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charles B.",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T14:07:55.000Z",
          "Titre": "Great Product!",
          "Contenu": "This product is simply the best for our needs in the market. It is simple to manage, with a personal email all the recipients do not notice the message is coming from a computer or automated traditional bulk software. It is versatile, we recommend it for all kind of industries interested to have a personal positive impact with their clients."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Anne Scott",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T00:59:55.000Z",
          "Titre": "I have been a Maxprog user for…",
          "Contenu": "I have been a Maxprog user for something like 10 years and it fulfills my requirements. I do not have the codewriting skills to make my emails look pretty but the system suits me."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Yudisleidy Landrian Furniel",
          "Nb_Reviews": 1,
          "Date": "2020-07-26T15:19:20.000Z",
          "Titre": "Thank you very much for helping me…",
          "Contenu": "Thank you very much for helping me getting started with MaxBulk Mailer and for the video you made about installing the mailing list manager. Very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark M",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T18:23:02.000Z",
          "Titre": "I am planning on buying this software…",
          "Contenu": "I am planning on buying this software works due to great support they didn’t give up on my problem w the demo grest software and support worth every penny"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Leandro",
          "Nb_Reviews": 9,
          "Date": "2020-01-09T09:09:52.000Z",
          "Titre": "Great MaxBulk Mailer",
          "Contenu": "I had a great time, MaxBulk Mailer does his duty perfectly. Initially not very simple to set when accessing the SMTP server, but once understood, the operation becomes simple and intuitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dino C.",
          "Nb_Reviews": 4,
          "Date": "2023-03-16T08:07:13.000Z",
          "Titre": "Outstanding",
          "Contenu": "Outstanding!  And super helpful resources and support.  Wish I’d known about these solutions years ago.DC"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T18:53:38.000Z",
          "Titre": "I generally use EndNote Show All style",
          "Contenu": "I generally use EndNote Show All style, create a Word file, then easily contact colleagues about a subject."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "paul",
          "Nb_Reviews": 4,
          "Date": "2020-12-24T16:42:20.000Z",
          "Titre": "Icash",
          "Contenu": "I use Icash as my personal finance recording after having used it in my business. Great program with good customer service when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wicknet",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T17:40:08.000Z",
          "Titre": "Their support ROCKS",
          "Contenu": "Their support ROCKS! An email reequest for help was answered with precise instructions within a couple of hours.Don't change ANYTHING!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Ralph Holt",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T09:40:05.000Z",
          "Titre": "Max is a good communicator with…",
          "Contenu": "Max is a good communicator with professional knowledge about it's product. We like looking at all the short and precise videos that are targeted right to the respective points that needs clarifications &/or attentions, despite his \"charming\" accent."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "H NHA",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T23:29:53.000Z",
          "Titre": "MaxBulkMailer : a perfect mailing software for Mac",
          "Contenu": "Very nice mailing software for Mac. MaxBulkMailer is fast, has numerous features and is easy to use. You can have it with a nice price ! And the support is great !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Woelfel",
          "Nb_Reviews": 3,
          "Date": "2020-08-27T22:12:26.000Z",
          "Titre": "Solid, well maintained, excellent features",
          "Contenu": "I have used this program for years, on and off, and it has been very helpful. It is well maintained and offers great features. The developer is very responsive as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T03:12:54.000Z",
          "Titre": "Great Customer Service.",
          "Contenu": "Great Customer Service.Good products. I messed up and signed up twice for upgrades. I asked to just add one to the other in order to extend the term and he was more than willing to fix it for me.Nice guy. Has added a lot of great features over the years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Stevenson",
          "Nb_Reviews": 6,
          "Date": "2020-06-12T19:47:17.000Z",
          "Titre": "Return to iCash…",
          "Contenu": "Come back to iCash after leaving it for a competitor.  Pleasantly surprised to see the differences since 2018."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2020-09-15T15:54:53.000Z",
          "Titre": "Everything perfect",
          "Contenu": "For me this is ecaxtly what the doctor would have prescribed. I am very happy with the functionality and the performance."
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "Алиен",
          "Nb_Reviews": 4,
          "Date": "2020-11-13T10:29:26.000Z",
          "Titre": "4 years already using this great…",
          "Contenu": "4 years already using this great software and loving it. It helped to get my finances under control."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 21,
          "Date": "2021-03-19T06:56:22.000Z",
          "Titre": "Really great support from helpdesk",
          "Contenu": "Really great support from helpdesk. They did everything necessary to help and addressed all my issues. Great team!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Null Boob",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T18:04:47.000Z",
          "Titre": "Best software ever made for sending bulk emails",
          "Contenu": "Best software for sending bulk emails. No any software can beat this program"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jakob Ward",
          "Nb_Reviews": 3,
          "Date": "2022-09-27T23:15:44.000Z",
          "Titre": "Great software",
          "Contenu": "Great software. I have been using it for more than 10 years. Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terence Watts",
          "Nb_Reviews": 2,
          "Date": "2020-10-10T13:26:16.000Z",
          "Titre": "Always totally professional!",
          "Contenu": "Always totally professional and knowledgeable, as befits what is probably the VERY BEST desktop bulk email app!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Daniele Silvioli",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T08:29:28.000Z",
          "Titre": "eMail Extractor",
          "Contenu": "excellent software, stable operation, continuously updated, no problems. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "alpesh vaghela",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T03:58:48.235Z",
          "Titre": "Great service and Support are awesome…",
          "Contenu": "Great service and Support are awesome no other companies transpernt like ths. Thanks MaxProg team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T02:24:03.000Z",
          "Titre": "Love MaxBulk Mailer",
          "Contenu": "I've used this for over a decade and I love it. It gives me so much control over how I communicate with my people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 4,
          "Date": "2020-05-04T03:47:18.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response, and they allowed me to add to my program at a reduced package price. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Kamen",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T15:13:13.000Z",
          "Titre": "great",
          "Contenu": "Max Bulk mailer has been the staple of my mass mailing for over a decade."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "ygurbuz",
          "Nb_Reviews": 1,
          "Date": "2020-02-02T16:35:35.000Z",
          "Titre": "Maxbulk mailer is very useful and easy…",
          "Contenu": "Maxbulk mailer is very useful and easy to use, efficient sw."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Daniel A. Neves",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T12:28:30.000Z",
          "Titre": "Five stars and I recommend it!",
          "Contenu": "I use Maxbulk Mailer for more than 5 years and it is the best in the market. Five stars and I recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KB33149",
          "Nb_Reviews": 3,
          "Date": "2022-08-05T17:23:51.000Z",
          "Titre": "Awesome app",
          "Contenu": "I've been using email extractor for years. Simple. Does exactly what I need it to do. Love it."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "Rene Torres",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T04:53:33.000Z",
          "Titre": "great customer service and fast…",
          "Contenu": "great customer service and fast response from tech support."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Dhr. Ronny De Peuter",
          "Nb_Reviews": 12,
          "Date": "2019-11-01T14:01:10.000Z",
          "Titre": "I love iCash for Mac !",
          "Contenu": "I love iCash for Mac and the ease of renewing my license for the next 3 years!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Szabo",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T13:09:56.000Z",
          "Titre": "MaxBulk Mailer is a great product with…",
          "Contenu": "MaxBulk Mailer is a great product with good online support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John W Dudley",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T03:12:39.000Z",
          "Titre": "I have used maxprog for over 20 years…",
          "Contenu": "I have used maxprog for over 20 years or more.  Love them.  Keep up the good work.  John W Dudley, ASL Bible Teacher"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "MartVie",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T18:09:45.000Z",
          "Titre": "Perfect and easy to use for newsletters…",
          "Contenu": "Perfect and easy to use for newsletters and emails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T19:36:59.000Z",
          "Titre": "Max Bulker is a good software",
          "Contenu": "Max Bulker is a good software, easy to use.  I have been using it for more than 5 years."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Iain",
          "Nb_Reviews": 6,
          "Date": "2019-10-10T10:11:09.000Z",
          "Titre": "Bought on the Mac App Store- very…",
          "Contenu": "Bought on the Mac App Store- very pleased with this app and the customer support.  Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "DAVID RIX",
          "Nb_Reviews": 1,
          "Date": "2020-12-13T02:07:51.000Z",
          "Titre": "All good once you get your head around…",
          "Contenu": "All good once you get your head around it,like any program.Been using for a few years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Randall",
          "Nb_Reviews": 18,
          "Date": "2023-03-26T18:22:27.000Z",
          "Titre": "Loan Calc Repeat User",
          "Contenu": "I've been using this for many, many years. That is why I keep coming back for more."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "nitin verma",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T09:28:33.000Z",
          "Titre": "I am using iCash for last 11 years",
          "Contenu": "I am using iCash for last 11 years. Excellent product."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "E. Bietsch",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T10:25:46.000Z",
          "Titre": "I like the product icash from Maxprog",
          "Contenu": "I like the product icash from Maxprog. It's very easy to use and help to manage your finance data. I love it."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Klaus Wendel",
          "Nb_Reviews": 2,
          "Date": "2020-01-03T16:01:24.000Z",
          "Titre": "The update worked fine after your…",
          "Contenu": "The update worked fine after your recommendation.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick R. Pfadt",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T17:09:32.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use and I was able to send my first email within 5 minutes."
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "Алиен",
          "Nb_Reviews": 4,
          "Date": "2020-11-09T10:44:45.000Z",
          "Titre": "great software",
          "Contenu": "great software, easiest and feature full."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Happy Customer - Tony",
          "Nb_Reviews": 1,
          "Date": "2020-08-28T12:42:56.000Z",
          "Titre": "Great product that “just works”",
          "Contenu": "Great product that “just works” and their support is awesome."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2020-01-10T20:48:02.000Z",
          "Titre": "I had some issues and everything was…",
          "Contenu": "I had some issues and everything was promptly resolved, thank you very much Stan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Schuster",
          "Nb_Reviews": 2,
          "Date": "2021-02-09T19:57:46.000Z",
          "Titre": "I can ALWAYS count on a quick response…",
          "Contenu": "I can ALWAYS count on a quick response from Stan."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "NickJ",
          "Nb_Reviews": 5,
          "Date": "2020-10-24T22:55:54.000Z",
          "Titre": "The iCash Update Plan process was…",
          "Contenu": "The iCash Update Plan process was smooth and fast. All went very well."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Quincy Rumbiak",
          "Nb_Reviews": 2,
          "Date": "2020-07-28T08:43:56.000Z",
          "Titre": "Wonderful and awesome experience",
          "Contenu": "Wonderful and awesome experience, keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Barbara Hagström",
          "Nb_Reviews": 8,
          "Date": "2020-01-09T15:50:26.000Z",
          "Titre": "help with iCash update",
          "Contenu": "Fast answer to my question"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kenneth Gee",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T18:03:53.000Z",
          "Titre": "Quick response to questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John W Dudley",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T12:58:19.000Z",
          "Titre": "When I was in business  you kept me in…",
          "Contenu": "When I was in business  you kept me in business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John C",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T22:42:03.000Z",
          "Titre": "Great product",
          "Contenu": "Great Product which continually improves and innovates."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "潤 本郷",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T02:00:46.068Z",
          "Titre": "Good",
          "Contenu": "Very good ! and very convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philippe",
          "Nb_Reviews": 5,
          "Date": "2020-10-18T15:56:31.000Z",
          "Titre": "It does the job quite well",
          "Contenu": "It does the job quite well. Simple and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Morrow",
          "Nb_Reviews": 2,
          "Date": "2019-10-01T04:16:11.000Z",
          "Titre": "Great product that saves​ countless…",
          "Contenu": "Great product that saves countless hours - it just WORKS!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "F.M. Barbosa",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T21:05:31.000Z",
          "Titre": "Support",
          "Contenu": "Rapid support that is solution-oriented and dedicated to customer needs."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Pasupulety Mattapally",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T10:21:03.000Z",
          "Titre": "Nice software"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank, Webdeveloper",
          "Nb_Reviews": 2,
          "Date": "2019-10-02T19:46:05.000Z",
          "Titre": "Great program!",
          "Contenu": "Great program!Could not get along without it."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "abdel sadik",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T09:21:23.000Z",
          "Titre": "Thanks a lot for this amazing app"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Cm Adlerstierna",
          "Nb_Reviews": 6,
          "Date": "2020-04-03T16:34:15.000Z",
          "Titre": "Perfect",
          "Contenu": "Perfect  and great"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Franz",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T05:01:31.000Z",
          "Titre": "Quick and effective support",
          "Contenu": "Got things going very quickly"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Mils",
          "Nb_Reviews": 4,
          "Date": "2020-05-08T20:59:13.000Z",
          "Titre": "A good company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-03T18:08:28.000Z",
          "Titre": "Fast and excellent response"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Mills",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T19:16:55.000Z",
          "Titre": "Love this product",
          "Contenu": "Love this product. It is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Jan Gunnar Holmertz",
          "Nb_Reviews": 5,
          "Date": "2020-08-28T07:58:38.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, excellent excellent excellent excellent excellent excellent excellent excellent excellent"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Michele Solito",
          "Nb_Reviews": 5,
          "Date": "2023-01-07T15:18:54.000Z",
          "Titre": "Very fast",
          "Contenu": "Very fast.  —-"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T01:17:51.000Z",
          "Titre": "good product"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "N. Noordegraaf",
          "Nb_Reviews": 4,
          "Date": "2020-10-29T18:16:39.000Z",
          "Titre": "Excellent application."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "rp",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T10:08:12.000Z",
          "Titre": "Title",
          "Contenu": "abcabcabcabc"
        }
      ]
    }
  ]
}