{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.macs4u.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben Browning",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T04:32:52.000Z",
          "Titre": "MY 2017 MACBOOK PRO KEYBOARD IS STILL…",
          "Contenu": "MY 2017 MACBOOK PRO KEYBOARD IS STILL STICKING AFTER TRYING MULTIPLE EFFORTS TO FREE KEYS. DUDE WHAT DOES IT TAKE TO CHECK ALL KEYS ARE FREE??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mad customer never again!",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T03:35:24.000Z",
          "Titre": "Worst purchase ever horrible customer service!",
          "Contenu": "sent a Imac pro with no key board or mouse when listing said it came with it , sent an older model than listed, refused to accept a return and told me i should know what I'm doing with a computer if I was going to buy a 6k computer. Im a cinematographer with over 20 years experience on nothing but a mac. The video card went out shortly there after and they claimed it was not their fault and it wasn't under warranty I had only ahathe computer for about 45 days."
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Sergio Lazcano",
          "Nb_Reviews": 5,
          "Date": "2021-05-04T19:01:57.000Z",
          "Titre": "Cancelled order",
          "Contenu": "I placed this order 164383, it was charged to my bank account and after 1 day it was cancelled saying only because the payent processor say that may be a fraud. I want to know the reason for this desition, the billing address and shipping address are the same, and 100% same as appear on my bank statement, also same email and telephone number on my bank profile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wanda Kennedy",
          "Nb_Reviews": 2,
          "Date": "2019-09-19T16:31:59.000Z",
          "Titre": "Ordered my product",
          "Contenu": "Ordered my product. It was supposed to be delivered on Wednesday the 18th received no tracking info until the 19th. Tracking info indicated my package would be delivered today. Then it said my package was being returned to sender. Have tried to contact sender to no success. Not happy. This store and online merchant will no longer get any of my business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PC",
          "Nb_Reviews": 1,
          "Date": "2019-01-15T20:14:48.000Z",
          "Titre": "Paid for expedited 2 day shipping, never came.",
          "Contenu": "Paid for expedited 2 day shipping.  When asked for an update a week later they responded \" we ran into both a weather delay and some internal logistic issues with our supplier for this particular model. This resulted in a “Perfect Storm” scenario that delayed your order well beyond what we anticipated\"...  I have a feeling they run into a lot of \"perfect storms\".   Unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zachariah Lloyd",
          "Nb_Reviews": 18,
          "Date": "2020-04-18T04:20:21.000Z",
          "Titre": "I am not able to check if I qualify....",
          "Contenu": "I am not able to check if I qualify for a financing program for a computer because their ridiculous website keeps demanding that I verify my Email address, even though I am already logged into my account....On top of this, the site keeps telling me to disable my pop up[ blocker, but it is not enabled at all.This  is ignorant, and I am sick to death of websites that are created by morons, who do not kn ow anything about administrating a functional internet presence. These types of companies should be fined for being imbecilic, and never be allowed to crowd up the internet with their sloppily coded webpages.TOTALLY WORTHLESS WEBSITE!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2018-02-26T18:01:16.000Z",
          "Titre": "Staff is cool but had a frustrating experience.",
          "Contenu": "The staff was really kind and understanding... But i had a very frustrating/unfair experience, first... Fedex took 4 days more to deliver my package, then when the computer arrived i was so happy but immediately when i started working on the computer the thing died to never come back... i tried everything but at the end i had to send it back... They need to check the computer to give me my money back... But i wasn't offer (a least not yet) the possibility of a courtesy of help to make it better on my end. I'm buying from someone else now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raul",
          "Nb_Reviews": 1,
          "Date": "2014-06-06T15:04:03.000Z",
          "Titre": "Don't use a credit card.",
          "Contenu": "I used a credit card three times only to be told i could not send the computer to where i wanted it to go to, without contacting the card company to allow it to go to a different address. I had all the proof it was me. After three times and three different cards. Ridiculous service ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leigh Becker",
          "Nb_Reviews": 1,
          "Date": "2020-03-07T13:08:42.000Z",
          "Titre": "Receiving a MacBook Air",
          "Contenu": "Receiving a MacBook Air, that would not never power up. Call twice and was told that a return shipping info would be sent. That never happened. $650 down the drain. Should have just got a new system from Apple"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 1,
          "Date": "2017-07-14T03:13:18.000Z",
          "Titre": "Got my MacBook Pro June 12,2017 …",
          "Contenu": "Got my MacBook Pro June 12,2017 everything has been working great until today July 13,2017 the computer started running slow then shut down on me!  Now a folder with a question mark keeps coming up and have no idea how to make it go away :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Jolicoeur",
          "Nb_Reviews": 3,
          "Date": "2020-03-17T19:18:43.000Z",
          "Titre": "No service from macs4u YET!! A non charging rip off Mac!!",
          "Contenu": "We purchased a refurbished Mac from macs4u and it has never charged properly! Despite numerous calls and emails, this company has still not sent out a WORKING computer! They sent out a second charger after forgetting about us, until we called them on it!! Still not charging!! They want this one back first and we are not taking the chance of further incompetence by losing our data again, without transferring the data first!! Has anyone else suffered this lack of responsibility from this company? We are issuing legal proceedings for this rip off company and now the lost time it has cost us as well!! Let macs4u know what you think of this lame business practice!! The BBB will be notified today as well. I have ZERO tolerance for rip offs and those who support that as a job.... Do what is right for a change."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diana Pierre",
          "Nb_Reviews": 2,
          "Date": "2018-04-30T14:24:25.000Z",
          "Titre": "Bad customer service over time",
          "Contenu": "Good customer service is achieved over time, when the customer starts experiencing issues with the product they purchased....good customer service doesn't end with the customer payment for the product, that's when it should start! I experienced an issue with my Apple MacBook Air 13.3-Inch Laptop 1 year after I purchased it...a battery issue. I called macs4u customer service and they said they will have to charge me cuz I didn't have an extended warranty, then they said they'll send me a quote within 24 hours and we'll take it from there....the quote never came. I took my mac to a local shop for them to realize it was a bad connectivity issue with the battery. I got it fixed for 50$ where macs4u were going to charge me an arm and a leg...I wouldn't know, they never got back to me. Terrible customer service. Think twice before using them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Storey",
          "Nb_Reviews": 1,
          "Date": "2019-02-14T20:00:30.000Z",
          "Titre": "Your company is a joke",
          "Contenu": "Your company is a joke.  I would give a 0 star rating if I could.  A sad joke.  I will NEVER recommend your company to anyone except my worst enemy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Jolicoeur",
          "Nb_Reviews": 3,
          "Date": "2020-03-13T17:25:46.000Z",
          "Titre": "Paid for a Mac and got a piece of junk that does not even charge!!",
          "Contenu": "We purchased a mac from this company back in September and the computer has never charged properly. After trying a new charger that was sent out late, because macs4u dropped the ball on this repair and did not send out the charger immediately as promised, the computer still does charge!! I am currently at 7% and may not even get to finish this email!! We have paid dearly for this computer in lost time alone and it would be the decent thing to do to send out another WORKING computer for us to transfer this data too, BEFORE shipping the faulty computer back. We have PAID for a computer that we can't use and this lame company expects us to return before sending out another!! We will NOT take the chance of losing this data to more incompetence!!. We have PAID for a computer, now send us one that WORKS and Charges!! Several phone calls later and still no computer that we paid for!! Heading to the court house and BBB today, if we do not get CONFIRMATION that the computer we PAID for has been shipped in overnight mail..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2018-09-14T18:11:41.000Z",
          "Titre": "I like the product however not really …",
          "Contenu": "I like the product however not really happy when it is described as a 2011-2016 model. I order all the high upgrades and you send me a 2011. I would think spending a little extra on a everythig would upgrade me to a slightly newer model that doesnt take so long to load on opening the screen. Called after review and Basically wanted me to change my review to a positive one. I left another review in which they decided to try and get it deleted. So I will repost here on the original review.I bought this paid $1000 for the upgrades and package and it was slow from the beginning, had only less than an hour on full charge. I’ve needed to plug it in from that point forward to work. I had an existing charger that was the correct one so I used it saving this one since they always bend and break easily. I pulled it out to use and it does not work because I was sent the wrong wattage charger. My MacBook Pro takes about 10 minutes to boot up and takes forever to sign in to get to work on adobe cloud graphics. I feel I wasted my money and they wanted me to just hange their rating to benefit themselves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2017-05-13T04:33:00.000Z",
          "Titre": "They canceled my order without an …",
          "Contenu": "They canceled my order without an explanation. Seems like a shady company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2019-09-24T13:25:50.000Z",
          "Titre": "My order is always declined and money…",
          "Contenu": "My order is always declined and money refunded"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ecaterina",
          "Nb_Reviews": 1,
          "Date": "2016-07-23T13:43:56.000Z",
          "Titre": "Horrible customer service. Computer came with viruses.",
          "Contenu": "Do not buy from this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T17:16:39.000Z",
          "Titre": "I bought a MacBook Pro from macs4u in…",
          "Contenu": "I bought a MacBook Pro from macs4u in 2021 that lasted a couple months. I sent it back, paying postage. (Rev: I didn’t pay postage but had to print tag and drive to PO as they wouldn’t do UPS call tag. They replaced it with one that lasted less than a month. Same issue: would stop accepting a charge regardless of cord and adapter. The third one lasted just long enough to get past warranty then the same issue happened. I took it to a local Mac repair place who diagnosed it needed a new battery. If you want a Frankenstein (and not the funny Mel Brooks version) computer, with questionable parts from other dead computers, buy from here. Gave two stars as they tried. (Rev: Why not replace cord first time if that was issue? And 12 mo warranty expires from purchase of first computer; third replacement computer was well within 12 months of receipt but outside original computer purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachel Tieger",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T17:18:34.000Z",
          "Titre": "Crashes all the time",
          "Contenu": "The Refurbished MacBook Pro I purchased through Macs4u crashes all of the time...sometimes, every hour. The tech support was kind and patient but wanted me to wipe all of my data which I wasn't willing to do, so I have suffered with constant crashing since I purchased it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DeeDee",
          "Nb_Reviews": 10,
          "Date": "2019-02-03T18:06:07.000Z",
          "Titre": "you all were great in the past but seem to be \"slipping\" what's up ?",
          "Contenu": "#1. they forgot to schedule my appointment even though I called to remind them the day before #2. I ask for 2 things, an email address to be removed. it was not. ask for a F.B.acc. be TOTALY ERASED not just deleted. I do not know if it really was or not.  this is the second time I have gotten unacceptable service.  I was a huge fan of Mac-4 U and recommended them to many people. not so sure I will continue to do so now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rashika",
          "Nb_Reviews": 1,
          "Date": "2019-01-12T23:54:24.000Z",
          "Titre": "Doesn't feel worth it",
          "Contenu": "Purchased two MacBooks. Both arrived in the same box with the carriers I ordered promptly, however one of the laptops malfunctioned and I couldn't get past the first screen. It kept searching for a wireless keyboard and froze the computer. Had to send it right back. Then found out I paid over $1k for each computer with absolutely no software on it. No Microsoft Office anything!!! Can't work on nada. Really disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2018-08-30T00:14:42.000Z",
          "Titre": "Computer is fine, but shipping is slothlike",
          "Contenu": "The laptop was just fine, but their shipping is super slow. It took them two days just to make a shipping label (were they refurbishing the machine *after* I ordered?) and then the package arrival date was four days after they'd said it would arrive -- too late for me to have my laptop on my first day at my new job. >.>"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel Freeman",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T16:30:36.000Z",
          "Titre": "Sent to wrong address...",
          "Contenu": "Somehow, the address entered into your system was changed to a different street address.  Fortunately, the person at that residence called my phone number not he package to alert me to the receipt of the package and I was able to retrieve it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marijke",
          "Nb_Reviews": 1,
          "Date": "2014-06-12T01:03:00.000Z",
          "Titre": "I don't know about the computer because I still have not received it.",
          "Contenu": "Ups Ground delivery is a complete disaster. The package has arrived one week ago at their office 40 miles from my home and only today I was told I have no other choice than driving 40 miles to get the package 8 days after the package arrived. The company should be more informed about what they are getting their clients into or at least be upfront with it so a client can make informed choices. I don't know about the computer yet since I haven't seen it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenny",
          "Nb_Reviews": 2,
          "Date": "2015-12-15T03:12:16.000Z",
          "Titre": "Disappointed",
          "Contenu": "The computer seems to be okay, but it is missing some programs that are usually on all Apple computers. The main reason we got this computer was because my son needs Garage Band to do what he needs to do for school and what he is doing for music. And that program is not even on this computer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2014-11-22T16:12:48.000Z",
          "Titre": "Be careful",
          "Contenu": "I purchased my computer and the salesman assured me that I was buying the macbook most recently sold at the store. I took it to the genius bar after I noticed it was running slower than my old macbook air. They told me it hadn't been sold since 2012--definitely not 2014. I feel cheated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Parveen",
          "Nb_Reviews": 1,
          "Date": "2018-09-06T13:47:35.000Z",
          "Titre": "Customer Service average",
          "Contenu": "I got the Mac book the Mac book is really good one but the customer service is ok 👎I got the dent on side almost no body helped about this Customer service is poor no recommending to others sorry but I am still unhappy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 2,
          "Date": "2018-08-02T01:49:04.000Z",
          "Titre": "over a month to get a computer from them",
          "Contenu": "the first order I made it did not go through which I was not aware of so buy the time I ordered it again it was gone so I called and over a second one to find out the person that took the order with all my cc info he does not order it again, so that ones gone so now it's a third time I ask for a manager, he said there was no more like the one I had ordered so he was looking for one he did find one and I got it its a good computer so far I happy I got it. no there was a second order placed between the first and third  so your information is wrong,  it was supposed to be ordered one time from me, two time from your company, and the third time, yes I got it, be honest thats what keeps your customers not lies to make it out like its my fault the order did not go through."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2018-03-31T04:20:58.000Z",
          "Titre": "No consumer-centric shipping options",
          "Contenu": "The product was delivered on time and in good working order, but I was extremely disappointed in the delivery options. Specifically, I was not given the choice at pay-out for delivery to a nearby FedEx retail store. That delivery option was only available via FedEx Delivery Mgr for an extra $5.25. The signature-only mandate is great for security, but not for those working days away from home. … UPDATE: macs4U's reply to this review stated that I could have KEYED IN the FedEx location during ordering, but let's be very clear about this — there was no dropdown menu with a FedEx location as an option nor was there a prompt about keying in a FedEx location as an alt shipping address (i.e. I would have to have known IN ADVANCE the retail store would accept my package and allow me to pick it up). Consequently, my review has dropped to two stars b/c of your obtuse response. … 2nd UPDATE: I didn't misunderstand your explanation. Apparently you misunderstood my parenthetical reference above. … Your instructions need revision. I know this because I have 20+ yrs in PR/Mkt and have written copy for the various pages of a payment gateway. I suggest you conduct a trial purchase and ask yourself: \"How would a consumer know that shipping to a FedEx store is acceptable if we don't tell them or they don't know this in advance?\" \"And why would a consumer choose a FedEx retail store without prior authorization?\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2018-09-11T04:05:03.000Z",
          "Titre": "Irresponsible & Ridiculous",
          "Contenu": "I ordered a computer a few weeks ago and immediately it came back declined. I called customer service to see what the issue was & he said some of our info in the 3rd party purchasing software must have not lined up. The money would be back in our account in a few days and I should try to buy it through PayPal. WELL, an ENTIRE week goes by, no money. I check every day and call a few times, same answer. My bank account even says that it's no longer a pending charge, its complete. My husband makes 4 or 5 calls, NO ONE has answers. He keeps getting the same \"Just wait\" even after telling them, they HAVE to have our money because its out of our account. They even told us to have our bank fax some sheet to prove we didn't have it at one point. So we had all these phone calls. FINALLY, we had to ask to speak to a supervisor (Brandon), he tried to help us, gave us the info for the finance people. It was clear he felt bad and empathized with us, but that still didn't excuse the fact that the company had no idea what happened to our money. It took ANOTHER week, and finally they refunded my money. Thankfully we didn't have to dispute the charge through bank but I find it super irresponsible that they had NO clue where our money was at (or had ZERO answers) for TWO WEEKS. This was a business purchase too so I was losing time on my deadlines! They at least should have offered a discount on the computer I wanted to purchase or some sort of help for the grievance and loss of business they costed me.  All this to say, I'm glad they honored their word & refunded me but they were such a pain to deal with and very incompetent in knowing what was actually going on, that I will not use them or recommend them to anyone I know."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Happy I did it.",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T14:38:11.000Z",
          "Titre": "Very good experience & will shop again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Revena Angerstein",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T18:56:53.000Z",
          "Titre": "My experience with one of your computers.",
          "Contenu": "My experience with your company and staff was fine and effortless and I received my computer very fast and in good order.  After a few days of having my data transferred to the new computer, being walked through reinstalling my Adobe apps via phone, which took some time and frustration, I felt like things were getting back to normal as I got used to my new computer.  Then some glitches came with the keyboard.  The left shift key, when depressed, took me directly to the Desktop.  I called you at Macs4u, and was directed to call Apple Care, which came with my purchase, and of which I was very thankful to have.  I also discovered that the whole row of top keys did not function at all.  I spent many hours, stretched over three days, talking to at least four service agents at Apple.  They had me perform countless tasks over and over to no avail.  I have owned and used a computer for many, many years, but am not a \"techie\" so this was very stressful for me.  Just the thought of sending the new computer back for a replacement, because no one could figure out the problem, sent me into a tailspin just thinking about all the time, energy, and money I had put into transferring over all my data from the previous computer to the new.  Finally, one of the Apple senior supervisors came across the problem.  There was something in the keyboard settings that was not set properly.  I don't know why others were not able to discover this, but thankful he was able to.  So, because someone in your employ did not program the settings correctly, I was put through a lot of frustration and dismay.  I know things like this can happen.  Purchasing a renovated computer, to me, already had a risk factor to it, and I guess one of my fears came true that something might go wrong, and it did.  I'm very thankful the problem was corrected without having to get a replacement and begin the whole process of transferring data over again.  For this reason, I have to give a rating of two stars: \"a lot of friction.\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T16:20:23.000Z",
          "Titre": "Lemon",
          "Contenu": "First the good, the technical support from IT was responsive. They went through troubleshooting with me and spent hours trying to help me with all the difficulties getting the iMac up and running (multiple times, many hours, over several days). However, in the end, the actual refurbished computer (iMac with fusion drive) was a lemon.After I lost a full week of productivity trying to make the computer work, Macs4u authorized a return. But, they then charged me an exorbitant restocking fee for a defective computer.The iMac was unable to wake up after sleeping. After going into sleep mode, instead of waking, I would find the computer completely unresponsive. The only option was a forced restart in recovery mode, which would reveal that the computer had rejected the operating system or the hard drive (flashing “no” symbol or flashing folder with a “?” ). These errors require wiping the computer & rebuilding the whole computer. I even resorted to physically driving the machine to their local HQ for an expert rebuild & reinstall, but with the same result: a full system failure after sleep.The returns department tried to blame the instability issue on my migrated data & an older program, however this is completely unjustified. My programs and data worked just fine on my MacPro and since returning the defective iMac from macs4u, I have purchased a Mac Mini that is running my migrated profile just fine with zero issues. The problem was not which version of macOS, or my migrated data, or certain software, it was a lemon of a computer.These types of hardware problems can and do occur,— as my grandma used to say it’s not whether problems happen, it’s how you handle them, that matters.What can’t be justified and is the source of my grievance was their refusal to stand behind their warranty. The website states (1) that hardware is covered under warranty and (2) that warranty returns are not charged a restocking fee. I have since learned that the fusion drives are particularly unstable and prone to failure. If Macs4u had followed their own policies and refunded the full purchase price, I would be giving a different review here, despite losing so much work time trying to make the defective iMac work. After making up for the lost productivity, I probably would even have purchased a replacement from them, but a computer without the fusion drive. Instead, after working double time to make up for my lost week, I went to a different retailer and purchased a computer with a solid state hard drive and I have had zero problems. An expensive lesson indeed.From the website:“Our warranty is a hardware warranty and covers every component of the computer including the AC charger to work as designed and are covered against mechanical and electrical failures. Simple as that!” (1)“If the refund is based on a warranty issue, the restocking fee is waived. “ (2)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Pfeifer",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T06:27:43.000Z",
          "Titre": "Customer loyalty has no value",
          "Contenu": "My latest purchase was my 5th Mac from this company.  I also steared my daughter to the company for her Mac.  I missed a click or some option to purchase a $40 dollar item for $10......I asked if they could come through for the $10 price....apparently customer loyalty means little to Macs4U.  Now it's not the money but the principle of it.  Be cause of a $30 shot that would definitely break Mac4U's bank, I will be sure to shop else where for my company's next set of Macs.  $30 bucks?? Really?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Easy Peasy",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T01:13:23.000Z",
          "Titre": "My computer came on time and well…",
          "Contenu": "My computer came on time and well packaged, as advertised. However, am having a heck of a time getting my information transferred over.  I have run migration assistant 4 times now, and spent hours on the phone with apple tech, but still cannot even get my pictures."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAMIEN O",
          "Nb_Reviews": 2,
          "Date": "2022-05-17T18:38:57.000Z",
          "Titre": "I got my computer quickly",
          "Contenu": "I got my computer quickly. It came in great packaging. It didn't mention what problems the computer might have, with it being labeled \"good\", I figured there would be cosmetic issues, which there are and they are minor. What I didn't expect was some dead pixels/screen discoloration. I tried to reach out to see if this was how the computer was received initially or if this happened in transit. Regardless, the computer works and that's what I needed it to do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T23:57:24.000Z",
          "Titre": "It took a week  for the mouse I…",
          "Contenu": "It took almost 2 weeks for the mouse I had ordered to arrive. In the meantime I got repeated inaccurate FedEx messages about where it was and where it was being sent. Your customer service department was very polite and attempted to be helpful but about all they could tell me was it had been scanned incorrectly and hopefully would arrive eventually."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candyce Petersen",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T16:25:02.000Z",
          "Titre": "Sensitive cursor -revised",
          "Contenu": "The computer was received promptly, given to my guru who downloaded my previous files, informed me I had to purchase a part to do so and a new Word program since the computer came with none. (With labor, another $300.)  Not your fault.The problem is with the cursor.  It is sensitive and bounces around frequently.   Sometimes even opens a new file."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 2,
          "Date": "2020-12-16T14:23:54.000Z",
          "Titre": "Not fixed…",
          "Contenu": "In the past, I've even very pleased with Macs4U service. Not this time. I signed up for one session of virtual help to address two issues with my computer. One was the computer is incredibly slow, and the other issue is all my iphotos disappeared. Although the tech assistant was very nice, neither of these issues were solved. The fix for the slow computer was to buy an external drive, but since the connecting cord is USB2 that will not speed up the computer at all. So I still have the same problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jordan Pickett",
          "Nb_Reviews": 1,
          "Date": "2019-09-13T16:00:37.000Z",
          "Titre": "Really disappointed in my purchase",
          "Contenu": "Really disappointed in my purchase. I bought this with the purpose of using it for DJing, it is useless seeing that the part of the world I’d be using it in is south east Asia. Not only is it banned on all flights in Vietnam, and Thailand, but the battery doesn’t even hold a charge for a for little more than an hour. It’s not necessarily the fault of, Macs4u, in regards to the travel ban, but the limited battery life is extremely disappointing on top of it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2018-08-27T20:24:54.000Z",
          "Titre": "Great price and a great MacBook pro",
          "Contenu": "Great price and a great MacBook pro! I originally paid for 2-day shipping, but \"something happened\" and I didn't get it for a week! Because of that, I had to drive 3 hours one way to deliver it to my son who could have taken it with him for college.Regardless, I would recommend them and use them again. (I'd just be sure on the shipping.)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 1,
          "Date": "2019-01-24T16:35:44.000Z",
          "Titre": "Faulty computer",
          "Contenu": "Purchased a MacBook Air, and when the computer arrived to me it wouldn’t work. I had to send it off to be repaired as soon as I got it. Apple replaced the logic board, the batterie, and some connections. Not a great first impression, and I would strongly recommend getting insurance, if the product doesn’t already have apple care."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2017-03-14T22:15:20.000Z",
          "Titre": "macbook pro 13.3 refurbished laptop",
          "Contenu": "The computer was in good shape and arrived promptly. I honestly was disappointed in the fact that the battery that was supplied with this laptop had already been cycled 500 times. It would not have been that expensive for them to replace the battery. Now probably within a year I am going to have to buy and replace it. I thought that this was the difference between refurbished and used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2015-12-29T17:31:21.000Z",
          "Titre": "Great initial service but not great follow-up",
          "Contenu": "I was very happy with my experience purchasing a MacAir. Good customer service and on-time delivery. 5 stars so far.\r So why 3 stars? Unfortunately, one screw was missing and two other screws holding the case together soon fell out. I contacted macs4u about getting replacement screws. Now, 6 weeks--and many promises--later there's still been no action on their part.  Disappointing, and unlikely I would recommend them again, given how many other sellers there are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2019-02-15T23:58:56.000Z",
          "Titre": "Decent Company...",
          "Contenu": "Decent Company...Had a minor issue. Product arrived unusable because it was password protected and the included documentation had the incorrect password. This is not a mistake that should occur on a refurbished product. Issue was resolved but made me weary on their attention to detail."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Littwin",
          "Nb_Reviews": 2,
          "Date": "2014-11-08T13:35:05.000Z",
          "Titre": "Disappointed with plug and battery",
          "Contenu": "I am disappointed that I only received half of the plug. Apple plugs come in two parts for close up use and farther away use. I did not receive the second cord and therefore cannot use the computer on my desk at work because it does not reach the outlet! Also, the battery does not last throughout the day. I only have to charge my Mac Pro at home every other day and I use it all the time! However this one cannot last an 8 hour work day before it has to be charged! Very Disappointed!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Malcolm",
          "Nb_Reviews": 2,
          "Date": "2017-10-30T20:35:50.000Z",
          "Titre": "The shipping procedures are absolutely …",
          "Contenu": "The shipping procedures are absolutely RIDICULOUS. I have never encountered a more impossible and obtuse protocol attempted to get my package delivered.  Your company needs to serious alter the demands you put on Fedex and your customers.  IT IS TERRIBLE FOR BUSINESS"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Morris Esmiol",
          "Nb_Reviews": 4,
          "Date": "2019-03-14T03:06:13.000Z",
          "Titre": "The online buying was fine",
          "Contenu": "The online buying was fine, went smoothly.  The shipping took longer than anticipated. As a new Mac user, the support on set up was basically non existent, not too much of a problem with YouTube but it would be nice to have more info out of the box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jw",
          "Nb_Reviews": 1,
          "Date": "2018-09-27T09:02:38.000Z",
          "Titre": "it was fine",
          "Contenu": "it was fine - but I wish I knew what year the Mac was that I bought. I wish they let me know that it didn't come with a mouse and gave me an offer for one - like other e-commerce sites. The follow-up service was fine. Easy experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bryce",
          "Nb_Reviews": 1,
          "Date": "2015-06-19T03:58:05.000Z",
          "Titre": "Your shipping departments sucks",
          "Contenu": "The product that I bought is ok , but the shipping department promised to deliver to one place it ended up in an other . It was enconveint and created a very timely expenses to me . I may buy other products from you but I will look else where first ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2019-01-27T15:38:27.000Z",
          "Titre": "Battery issues, but other than that an acceptable product.",
          "Contenu": "The MacBook Pro I purchased looks good and runs good, however, the battery doesn't seem to hold a charge as long as it should. I would have that for the price I paid, Macs4U would have provided a new battery, but apparently not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fernando",
          "Nb_Reviews": 1,
          "Date": "2018-07-25T15:16:34.000Z",
          "Titre": "They did not keep me up to date.",
          "Contenu": "I was under the impression that my computer would ship in two days. After a week, I had to email Macs4u only to find out my computer was not in stock. I never received an email from them letting me know. This was a bit disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcia Sweet",
          "Nb_Reviews": 4,
          "Date": "2020-01-22T15:49:56.000Z",
          "Titre": "I was given the old bait and switch. Buyer beware.",
          "Contenu": "I was given the old bait and switch by these guys. Placed an order, had to call for shipping info, was told my ordermhad been \"sent out to Apple for new replacement parts and would be shipped out to me later today. Next comes a call from a guy who says the item was never in inventory but I can maybe get \"something close\" on Friday. No, I want a refund. Too bad Herbert can't even get a refund processed. 24-48 hours...maybe. Time will tell. I have a full refund pending in my bank account. I'm very happy that the company did the right thing. I still would remain wary due to the fact that I was misled from the gate. Again, buyer beware.I would NEVER trust this company. Lied to me from the gate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2018-01-22T19:02:48.000Z",
          "Titre": "I Received the Wrong PC",
          "Contenu": "I found the company receptive to my questions and they refunded the money for a service I bought but didn't need.  However I think I got a different computer than what I ordered, it is older and not as good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FRANK",
          "Nb_Reviews": 1,
          "Date": "2017-11-03T11:48:06.000Z",
          "Titre": "ASKED FOR",
          "Contenu": "good job          but had to sign for pakage took 2 days plus i have to log into it SO THERE ALWAYS GOING TO BR A LOG IN SOMETHING I'LL HAVE TO REMEMBER  HAVEN'T  DONE IT YET     THANK U"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roya Montana",
          "Nb_Reviews": 1,
          "Date": "2019-07-28T01:09:05.000Z",
          "Titre": "My Mac only stays on for 5 mins before…",
          "Contenu": "My Mac only stays on for 5 mins before shutting off, so I received it with battery issues.  Everything else about it is great though, I just have this extra expense now unfortunately"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "denise",
          "Nb_Reviews": 1,
          "Date": "2015-08-24T16:50:11.000Z",
          "Titre": "macbook pro",
          "Contenu": "the laptop was in excellent condition. and we received quickly. Great customer service BUT I found out that none of the apps came loaded on the computer after we got it.So it was not ready for use as it would have been had I bought through best buy etc. Also... COMPARE prices! I bought this refurbished for one of my kid going into his freshman year at college, another of my kids going into senior year at college purchased BRAND NEW mac book pro for same money I spent and everything was loaded, updated and ready to use immediately. I was not told that we would have to do anything to this so I was expecting to be able to turn on and use ...that was disappointing. As he still hasn't gotten everything downloaded im hoping all the apps are the latest and most up to date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2017-10-11T02:19:52.000Z",
          "Titre": "Bought a refurbished MacBook Pro",
          "Contenu": "Bought a refurbished MacBook ProIn late August, my 2011 MacBook Pro bit the dust (fourth logic board failure) and I needed a replacement. macs4u.com had a refurbished computer available that matched or bettered my previous system, so I bought it. The price was OK, but the machine was a bit older than I wanted (2012) and I can tell there's been some wear-and-tear on it (such as worn spots on keys, hidden by the silicone keyboard cover) even though I paid for a machine in \"Excellent-Grade A Condition.\" So far I haven't had any issues, other than I lost some of my alias folder connections when I reloaded my data from my back-up hard drive. Also, the two-day FedEx took nearly a week to get to me in Southeast Alaska. I did buy the two-year warranty, but hope I never need to use it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 9,
          "Date": "2017-06-01T01:09:49.000Z",
          "Titre": "Purchased 3 Macbook Pros, problems with 2 of them.",
          "Contenu": "I have a very good experience with the staff at Mac4u.com however I have purchased quantity (3) Macbook Pro's.  All were model year 2012.(2) of the Macbooks had defects:- one with the key 'O' that was dead. Brandon arranged shipping on the replacement.- one with a dead superdrive.  I replaced the superdrive myself since I had already installed software and didn't want to waste my time setting up all over again.(1) macbook pro has been working fine for over a year and is my daily driver.The Good:  Very honest and pleasant staff to work with when there are problems.The Bad:   Quality control on refurb equipment needs to be better.  Also, I asked serveral times to be notified when a 17\" Macbook Pro was avaiable.   The only notice that I have received was to give this reveiw on Trustpilot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2014-08-28T01:01:49.000Z",
          "Titre": "Saved me money",
          "Contenu": "this saved me money instead of buy a mac right from apple or even a refurbished one from apple. however, i think i should have just spent the extra money to get one through apple."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2019-01-20T23:51:55.000Z",
          "Titre": "The computer was great I was extremely…",
          "Contenu": "The computer was great I was extremely disappointed with the charger that came with it didn’t work so I had to go out and buy another $79 charger for my MacBook Pro"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nnnn",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T20:26:25.000Z",
          "Titre": "The Mac that was delivered has a deficient battery, makes it a lot less useful",
          "Contenu": "The Mac I bought has a deficient battery, and that really makes it a lot less useful to me. Sales staff I spoke to was great, which I really appreciate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel  Hetzel",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T02:33:48.000Z",
          "Titre": "Descriptions need to be accurate!!",
          "Contenu": "Bought expensive Macbook and it turns out battery is not that great. I feel like this should have been noted somewhere in description."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JULIO MUJICA",
          "Nb_Reviews": 2,
          "Date": "2021-07-24T01:11:17.000Z",
          "Titre": "Unfortunately when we received the Mac…",
          "Contenu": "Unfortunately when we received the Mac we realized that the memory was really low and I can’t use it for what I really needed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "explode1966",
          "Nb_Reviews": 3,
          "Date": "2020-02-12T01:58:52.000Z",
          "Titre": "I bought two used mac computers and…",
          "Contenu": "I bought two used mac computers and both worked fine for about a year and then both had problems causing $400 plus repairs on each computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2016-06-22T02:38:25.000Z",
          "Titre": "unit",
          "Contenu": "After the recent iMac unit arrived I found that it was only 1 year newer than my current 8 year old iMac and would not accept the newest mac OS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2019-02-10T10:13:30.000Z",
          "Titre": "Mac is OK-- not great. Service is not",
          "Contenu": "The refurbished 15\" MacBook Pro arrived in good time and well packaged. I had paid for 30 minutes of help in startup, but it took more than an hour and a half. I was not charged extra, as I should not have been, because it was obvious the \"expert\" did not know what he was doing, since he had to put me on hold over and over, to check with his supervisor.The Mac is adequate but is by no means as good as the one it replaced. It takes forever to load pages. This is quite frustrating, since I do many searches. Also, the power cord continually falls out of its plug, even when the Mac is moved ever so slightly. This should have been noticed and remedied before it was sent out. It is also frustrating that support service is available only during standard daytime business hours and not on weekends at all. They also prefer that you make appointments for service. There is no real consideration for customer convenience. Since I am up at night, this is especially frustrating.  Apple Care was far superior.I would only recommend company this to someone who absolutely could not afford a new Apple product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T01:09:59.000Z",
          "Titre": "Alright experience",
          "Contenu": "Alright experience. Would be better if you could narrow down the year MacBook you will be buying. On the shipping..... it would’ve GREAT if you gave the option to not have to sign. Or AT LEAST don’t block what the recipient needs to see on fedex. Customer support? They act like no one works! Started out great and fell down to a zero when having questions as to the delivery being signed for. Replying to my email a day later. Not good on that. So you say that it is a late 2016 model. And on the MacBook itself it is a early 2015. So I change my review to full of crap. Do not buy from them. And as far as the shipping. Called fedex and they also said the same as their site, the shipper, macs4u wouldn’t let me see the delivery time. So??? Good luck to whomever buys from them. You can see they lie to try and make them look better.>>>> Looked up my MacBook Air and yes, my MacBook I bought from macs4u says on the display EARLY 2015 and yes, that is what apple says it should be. So are you saying you shipped me the wrong MacBook? Thanks for your quick responses, to bad you weren't this quick when I actually had questions on my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel Tieger",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T01:28:10.000Z",
          "Titre": "Styrofoam packaging",
          "Contenu": "My computer arrived on time with good communication but there was styrofoam in the box/packaging"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2016-03-19T15:13:48.785Z",
          "Titre": "Expected more features..",
          "Contenu": "Oh okay. I see. I would actually like to exchange the AIR for the PRO. How do I go about that from here?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeanette",
          "Nb_Reviews": 2,
          "Date": "2019-02-25T20:57:58.000Z",
          "Titre": "Loved getting my Mac min iPad but there…",
          "Contenu": "Loved getting my Mac min iPad but there was quite a large scratch in it.Regards,Jeanette"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Drew Runnebohm",
          "Nb_Reviews": 2,
          "Date": "2019-07-30T15:48:41.000Z",
          "Titre": "I paid extra for 2 day express shipping…",
          "Contenu": "I paid extra for 2 day express shipping and I got it in 4 or 5 days"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Weiss",
          "Nb_Reviews": 7,
          "Date": "2020-09-21T15:01:39.000Z",
          "Titre": "Refurbished mac",
          "Contenu": "Poor communication about delivery. Keyboard poorly refurbished"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daphne",
          "Nb_Reviews": 1,
          "Date": "2019-02-15T18:55:21.000Z",
          "Titre": "Your tech-support team needs to show…",
          "Contenu": "Your tech-support team needs to show more empathy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 1,
          "Date": "2017-04-07T05:05:34.000Z",
          "Titre": "I asked for 500 SSD but only got 250 GB"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Troy Franklin Armstrong",
          "Nb_Reviews": 2,
          "Date": "2018-07-14T15:57:41.000Z",
          "Titre": "Could have easily been a 5* review...",
          "Contenu": "My purchase, delivery, and initial setup experience with mac4u.com was great. Positives:First, their purchase options included payment via AFFIRM which enabled me to get the exact iMac that I wanted and not have to settle. Next they reached out to me after the computer was shipped via email, text, and phone. The phone call was a very professional touch which I really appreciated. My shipment arrived in just under four business days from MN to NC which was sooner than I expected for such a large package.The equipment was nicely packed and the smaller peripherals like magic keyboard and magic mouse where secured to the inside of the shipping container and undamaged.After plugging in the new computer powered up with no issues and immediately recognized the peripherals. I was expecting a system setup screen but instead got a standard Mac OS desktop with an open document from macs4u again thanking me for my purchase and letting me know the default system login/password.AT THIS POINT I AM A 5* CUSTOMER BUT THEN...Negatives: Reasons why I cannot give Five Stars - all of which are easily remedable.First, as an IT professional, turning on a \"new-to-me\" computer and not having to go through an on-screen system setup process is a HUGE security concern and means that someone else set up the administrator account and may or may not have access to your system once it is connected to the internet.THIS IS NOT ACCEPTABLE!! People who are not as computer savvy as I am may just leave the setup as-is and with the default login and passwords that macs4u provide. Someone with bad intent could easily find out via the computer owner that they got a great computer and great deal from mac4u and end up getting into the admin account by guessing.Second, I connected my Apple Thunderbolt Monitor to my new iMac and did a few minutes of web surfing. I left the computer for a few minutes upon which it went to sleep. When I giggled the mouse to wake the system back up, the iMac came up but the display did not. Within 30 seconds the system threw a serious error and shutdown.It would not reboot.So now I am less than a hour into owning a very expensive computer that will not boot fully.I ended up having to access the restore menu manually, erasing the hard drive, and reinstalling Mac OS on my system which took another three hours.Now everything is working fine.The issue seems to have been that the OS that macs4u installed on the iMac was actually from a MacBook Pro(MBP). The iMac and the MBP OS's are not exactly the same so restoring the system from Apple servers resolved the issue.Seeing as macs4u has paid support options based on time spent as well as warranty options, this could have been a big headache for others at best or a return for macs4u at worst."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "June Price",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T02:26:29.000Z",
          "Titre": "The service was great but…",
          "Contenu": "The service was great but unfortunately, the FedX situation colored the situation in a negative light."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Caio F.",
          "Nb_Reviews": 3,
          "Date": "2022-05-28T16:36:39.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "They are very fast and delivered what I ordered. The only reason I didn't give 5 stars is because my MacBook Pro didn't come very clean, it had some fingerprints on the screen and etc. That's all, I totally recommend them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Friedman",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T00:45:36.000Z",
          "Titre": "Excellent Service with one qualifier",
          "Contenu": "Excellent Service with one qualifierI got exactly what I wanted with one exception. I was hoping to get a computer with USBa ports. Instead I got USBc ports which are a pain and require special adapters. The choice of USB ports should be an option on the ordering page. Otherwise excellent service at a reasonable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Broom",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T15:09:31.000Z",
          "Titre": "The purchasing was easy",
          "Contenu": "The purchasing was easy, the device itself is great, im very happy with my mac"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Beatham",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T20:55:37.000Z",
          "Titre": "I think the new computer is wonderful…",
          "Contenu": "I think the new computer is wonderful love it but have a lot to learn. Do wish i had a manual to look at with instruction on how to use different  part of this.  I am an 80 yr old man and  need something to look at with instructions.  I am nota business so have to learn on my own.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Tomas",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T16:37:22.000Z",
          "Titre": "How to create a better customer-friendly service.",
          "Contenu": "A purchased a refurbed MacBook Pro… the service was fine, but I should have done more research regarding differences between my previous MacBook (2011-12) and the new be I purchased… my bad, but perhaps Macs4U can weave in some questions for prospective customers regarding technical difference. Great website and service… just some sugg actions for you to keep getting better! Thanks…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Peiffer",
          "Nb_Reviews": 2,
          "Date": "2021-05-04T01:08:17.000Z",
          "Titre": "Mostly pleased",
          "Contenu": "Product was exactly as advertised, priced appropriately.  Even received a call after my order shipped advising when to expect delivery.  Delivery expected on a Thursday.  I know macs4u has no control over shippers but when it didn’t arrive by close of business on Friday I called macs4u and was told they would follow up with FedEx and get back to me.  I never heard from them again.  Luckily my product showed up on Tuesday. In spite of this I would use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Redenti",
          "Nb_Reviews": 2,
          "Date": "2020-05-23T21:22:47.000Z",
          "Titre": "the computer works well",
          "Contenu": "the computer works well, macs4u were quite professional and helpful in my purchaseThe only problem was fedex left the computer box on the deck in the rainThere appears to be no damage to the computer and this may be beyond macs4u control. However, if this has happen to others macs 4u should work with the carrier they use to have signature only deliveries"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan T.",
          "Nb_Reviews": 2,
          "Date": "2020-01-10T17:12:53.000Z",
          "Titre": "Ordered a refurbished MacBook Pro and…",
          "Contenu": "Ordered a refurbished MacBook Pro and when I set it up the keyboard was not working properly. Macs4u identified the issue and said the Apple would fix for free. Although I would have preferred a working computer at first, I understand that the keyboard may have failed recently. Mac4u reached out to Apple and had them send me a return box to fix the issue. Apple turned the repair around quickly and the computer is working well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAY WASSERMAN",
          "Nb_Reviews": 2,
          "Date": "2019-08-30T00:22:42.000Z",
          "Titre": "Good prices computer was well packed…",
          "Contenu": "Good prices computer was well packed and the price and configuration was competitive. FedEx was a bit of a hassle. The iMac sent was not the exact model but it worked out in my favor. The service rep was friendly and responsive to my needs by emailed and phone, but should have coverage when he is on vacation. Overall, pretty happy with my computer and my experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mel Tearle",
          "Nb_Reviews": 1,
          "Date": "2019-07-04T04:54:56.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good,  I've used this enough to know that it's working well.I had some problems with setting it up but that's probably because I was moving from a mac that had a different video card and my time machine backup introduced a conflict. Doing a clean install and using migration assistant seems to have solved the problem.I know better before the 90 day warranty runs out.  I'm pretty happy with it in general.   I'd recommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Boyle",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T23:58:37.000Z",
          "Titre": "Oops! ... all better",
          "Contenu": "Ordered a 27” iMac, unit wouldn’t connect to Magic Mouse.  I live in the Twin Cities area, so I took it back to them and they repaired the unit on the spot.  Very happy with my purchase, and to tell people that they stand behind their products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2019-02-15T01:01:10.000Z",
          "Titre": "A timely arrival, an immediate issue and they promptly fixed it",
          "Contenu": "The computer arrived in a timely manner, well packaged and in the shape reported. There was promptly a glitch between the wireless keyboard and computer. I called the tech, and he walked me through several options to try and fix it before walking me through a full factory reset of the computer. It now appears to be working normal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "As Far As You Know",
          "Nb_Reviews": 5,
          "Date": "2018-01-10T00:00:48.000Z",
          "Titre": "Customer Service is Awesome",
          "Contenu": "Customer Service is Awesome.  They also display a lot of integrity.  The product came on time and was in excellent shape.The one area they could approve on is full disclosure of when the computer was made like Apple does.  i.e. Mid 2015.  This would help the consumer make a better decision.  Also they charge a restocking fee unlike Ebay, Apple or Amazon.But I highly recommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Brill",
          "Nb_Reviews": 2,
          "Date": "2019-02-28T00:50:21.000Z",
          "Titre": "Great machine.",
          "Contenu": "The iMac is fine. One bad pixel but otherwise in pristine shape. The only complaint is the packaging. Styro peanuts are horrible. I purchased from another company that had inferior customer service but an incredibly cool packing system of only cardboard and a stretch wrap envelope. That would have made this purchase perfect."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Steven",
          "Nb_Reviews": 3,
          "Date": "2017-04-16T23:09:32.000Z",
          "Titre": "Great opportunity for someone to get a …",
          "Contenu": "Great opportunity for someone to get a great Mac for a lot less.   I've only had mine for 2 weeks now but I love it.   Had a small issue with FedEx delivering it since you have to physically be around to sign for it and between work and life it was hard to make that happen, but that only a minor issue.   Nothing that would keep me from buying another one from Macs4u.    Buy from Macs4u"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2018-08-27T19:20:39.000Z",
          "Titre": "Payment processing was not easy",
          "Contenu": "There system has an issue with credit cards and after multiple attempts I had to use PayPal.  The multiple attempts caused a delay in getting the laptop to my daughter as she was moving into college.  It finally all got resolved but was stressful.  They were very sympathetic and helpful and my daughter seems happy with the laptop"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kbrad",
          "Nb_Reviews": 3,
          "Date": "2017-06-19T23:07:09.000Z",
          "Titre": "This is my third refurbished computer …",
          "Contenu": "This is my third refurbished computer purchase from Macs4u (13.3\" Mac Book Pro i5 2.5GHz, 256GB HDD, 8GB, Early 2015). Delivery has always been as promised. The computers have operated exactly to spec and no problems even after expiration of the 90 day warranty.  My second computer had a faulty power cord which I simply replaced; otherwise, 5 stars for Macs4u."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2017-04-04T04:47:20.000Z",
          "Titre": "Glad I found these guys",
          "Contenu": "Would have been a 5 star, but the battery charger was cracked and cable had a short in it. However, the MacBook Pro is remarkable for the price. This unit is exactly as advertised, the case has some cosmetic damage but it is negligible. This is my first Apple product and macs4u knocked it out of the park with affordability of these preowned units.Good work boys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 4,
          "Date": "2018-07-24T18:13:52.000Z",
          "Titre": "Pricing & Loan Availability Can't Be Beat!",
          "Contenu": "I got a MacBook Pro from Macs4U about a month ago and I love it! I saved over $900 and for the price, it couldn't be beat!There were a few obvious problems (such as a dent by the charging port) but since they aren't affecting how the machine runs, I don't see it as a problem. I just wish some of the issues like this would be mentioned, especially when it affects how the charging cord plugs in.For the price and the ability to get an fast loan, I'm extremely happy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2017-02-02T18:44:45.000Z",
          "Titre": "Going Well So Far",
          "Contenu": "It was shipping in a timely manner and pretty good condition. I have had no issues using it thus far with the exception of the charger that was provided. It is very temperamental when it comes to charging. The charger isn't covered by the warranty, so I will eventually have to spring for a new one instead of playing the will you charge today game. (It is not the laptop from what I can tell, I am almost certain it is the charger.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gesine Krogh",
          "Nb_Reviews": 1,
          "Date": "2020-09-05T16:45:41.000Z",
          "Titre": "My association with your company is…",
          "Contenu": "My association with your company is very positive.  Everything from beginning to end was right on, except...I do not understand why the operating system had to be totally removed from my original IMAC. I did ask to have all my personal information removed from it, but not the operating system! Though old, it worked perfectly well. I haven't been successful in finding a way to reinstall it. I would appreciate some help with this, if at all possible.   I do thank Mike for all his help and patience.  He is very professional and understanding, and I recommend him highly. thank you, Gesine Krogh"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Apostle 2.0",
          "Nb_Reviews": 1,
          "Date": "2016-05-20T18:14:52.000Z",
          "Titre": "Awesome!!!  Would Be 5 Stars!!!",
          "Contenu": "Awesome Service; And Very Knowledgeable Staff!!!When I Received My iMac \"Everything Was Perfect\"; I Noticed A Little \"Dot Or Indention\" In The HD Screen, Small But Noticeable In The Background When Lit Of Course...  But Still Works Perfectly And Service Is Awesome!!!I Will Still Be Dealing With Macs4U In The Future!!!  Awesome Guys!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erin Claxton",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T14:29:53.000Z",
          "Titre": "Macbook Air had everything we needed",
          "Contenu": "Macbook Air had everything we neededMy husband needed a simple machine for email and office, but likes the simplicity of a mac, and I like the compatibility. A friend showed me this website, and I was excited to get such a good deal on a laptop for him! It even came with a protective case and keyboard cover. The only issue we had with it is that the screen hinge is a little loose, causing the screen to fall back instead of staying in place. Its not a big issue, but it will eventually get worse and need to be fixed. Overall, I'm very happy with my purchase!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2019-02-18T04:13:52.000Z",
          "Titre": "Great price. Great condition.",
          "Contenu": "Computer arrived in excellent condition. Free hard case is a nice touch. Best price out there for a reliable used apple product. My only complaint is shipping is exclusively via FedEx. I consistently have negative experiences with fedex and it would have been nice to have another option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 2,
          "Date": "2019-01-06T01:16:04.000Z",
          "Titre": "I was looking to replace a six-year-old…",
          "Contenu": "I was looking to replace a six-year-old MacBook Pro with OS Snow Leopard with something more up-to-date and compatible with current online requirements. While I guess I didn't know exactly what I was purchasing from Macs4u, it turned out to be my exact unit refurbished and with an updated OS (High Sierra). Thus proved to be a perfect solution to my situation and the price of the new unit was very reasonable. I'm happy with the purchase and wonder how long my old unit will keep going. I'm using it for this review right now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Baird",
          "Nb_Reviews": 2,
          "Date": "2018-02-01T20:11:41.000Z",
          "Titre": "The only reason for not receiving 5 …",
          "Contenu": "The only reason for not receiving 5 stars is I had USB issues when the computer arrived. I worked with the tech support from a 3rd party and in the end, I needed to reinstall the USB drivers. It's working now, but it was frustrating to lose about 3.5 hours to this issue for a relatively new computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2017-08-08T15:23:45.000Z",
          "Titre": "I would recommend this company to anyone looking to purchase a referbed machine.",
          "Contenu": "Macs4u processed my order as advertised and so far there has been no issue with the Mac Pro I purchased. Appreciate the on-time, no-hassle service. I suspect that if any issues had arisen, they would have resolved them promptly. I would recommend this company to anyone looking to purchase a referbed machine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 5,
          "Date": "2018-09-10T14:49:11.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "The computer seems to be fine.  The only reason I'm rating a 4 instead of a five is that it took several days before it was shipped.  The charger stopped working, but customer service was great and sent me another one the next day.  I have recommended this company to friends and family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anita",
          "Nb_Reviews": 6,
          "Date": "2015-11-23T21:49:13.000Z",
          "Titre": "purchasing an Imac",
          "Contenu": "Service was great and received the iMac in specified time.  Called Ben for some help....and I could use a little  more but my free time was used up....which means I will have to pay for extra help....since I can't call apple.  The keyboards seems to stick and the delete button needs separate clicks for every letter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shizuo",
          "Nb_Reviews": 1,
          "Date": "2017-06-05T13:44:44.000Z",
          "Titre": "I have been very pleased with the …",
          "Contenu": "I have been very pleased with the service that I have received. I did sign up for a little 'help' session, which cost some extra $30, however, I didn't really need it. I had imagined the process of having a refurbished computer would have few more hoops to jump but it has been quite simple."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARJORIE LINDSEY",
          "Nb_Reviews": 1,
          "Date": "2020-03-16T23:38:56.000Z",
          "Titre": "I ordered my computer and got it within…",
          "Contenu": "I ordered my computer and got it within just a couple days it’s exactly what I’ve ordered I haven’t used it enough to know if it’s as wonderful as I expected to be and since I’m not a computer wizard truly my opinion won’t be anything I’d take to the bank"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Sisti",
          "Nb_Reviews": 1,
          "Date": "2015-02-02T22:57:08.000Z",
          "Titre": "Overall a Great company, and outstanding Service !",
          "Contenu": "Great buying experience, and decent price on my re-furbished Mac Pro, had one issue of freeze-up, which was corrected by a very knowledgable  customer service Tech Ben....however in last several days, issue of freeze-up has occurred 4 times, which I myself corrected with the solution originally   which given me by service person Ben...Am hoping this is just a temp. issue, and will not require another phone call to Mac 4 you service...otherwise, great product , great service, great company!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sylvia",
          "Nb_Reviews": 1,
          "Date": "2016-12-03T12:43:47.000Z",
          "Titre": "Computer order",
          "Contenu": "I was very happy with the ordering process. I was more happy with the time of ordering to the time I received my computers.  It came really fast.  I was also happy with the no shipping cost. I love my computers and the added touch of the keyboards. I am very happy and so is my granddaughter with hers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 2,
          "Date": "2018-04-28T20:50:31.000Z",
          "Titre": "iMac value for unMac-like price",
          "Contenu": "Easy to order and customize your system. Good value for price. Great follow up after order shipped. One minor issue is that they ran out of memory and had to wait to ship it a few extra days but there was no notification of this. I had to call to see what was going on. I did not have an account so I could not check order status. So that was my fault.Called after it shipped to make sure I knew it had to be signed for and how to avert issues if I could not be there. Fast shipping. Out of the box, great computer. The packing job was first class."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leonard Solomon",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T22:01:47.000Z",
          "Titre": "I ordered a three year old MacBook Pro…",
          "Contenu": "I ordered a three year old MacBook Pro and it works fine. The only problem I had was that it was delivered a few days later than anticipated. I think this was the fault of the shipping company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Audiot Savant",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T01:28:39.000Z",
          "Titre": "So I would say an overall great…",
          "Contenu": "So I would say an overall great experience with a couple of caveats;1. The sales guy was super friendly and reassuring (came to macs4u after a poor experience with a company named after a very large river in South America...). He said that the unit would ship on a Tuesday and would be here Saturday.2. The unit shipped Thursday (late) via FedEx ground (my choice... I admit it...) but was delayed once they tendered it to a local contractor. I would advise your customers that due to COVID, transit times are a bit of a guess,3. When I was trying to track my shipment down, you folks were again super helpful and I appreciate.macs4u... you guys rock."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Givens",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T20:27:10.000Z",
          "Titre": "It would have been five stars if they…",
          "Contenu": "It would have been five stars if they had installed the OS I ordered and was charged for.  The DAW I use is certified up to OS X 10.13 and that's what I ordered.  Sadly, when I received the excellent iMac I ordered, it was running the latest OS.  macs4u.com, to their credit, walked me through the two separate installs of older operating systems that were necessary to get me back to what I had ordered.  The machine is in excellent condition despite the treatment it received in shipping - the box looked as though someone had hit it with a baseball bat over and over.  The macs4u packing was up to the task."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 1,
          "Date": "2016-04-19T17:57:38.000Z",
          "Titre": "Quick, personal, exactly what I ordered!",
          "Contenu": "Got a great machine at a great price!  Customer service was very personal.  When my MacBook Pro arrived with an issue they took care of me right away on the phone with an easy recalibration keystroke and follow up instructions.  I've had no problems and the machine works great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2018-04-09T18:12:00.000Z",
          "Titre": "Outstanding value",
          "Contenu": "Outstanding value, complete order, and promptly delivered. My ONLY observation and caution is that the Mac power supply and cord were so tightly wound that the cord seems to be permanently kinked. Maybe change the way you package that... Otherwise, I will come back!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2015-12-11T20:52:04.000Z",
          "Titre": "Great Communication",
          "Contenu": "I made a mistake while placing my order for three laptops.  I emailed after hours to please call me before shipping.  To my delight they did.  We corrected my mistake and the computers still arrived on the original expected date of delivery.  I will definitely buy from them again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hector",
          "Nb_Reviews": 3,
          "Date": "2017-07-21T22:27:23.000Z",
          "Titre": "Delivered as Promised",
          "Contenu": "Delivered as Promised:  I was very pleased with the description of product I was looking at and everything stated was just as promised.  The delivery process was just as dependable and very reliable.  Thank you, the unit was in excellent shape and works out of the box."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2020-12-25T20:23:24.000Z",
          "Titre": "Outstanding Service. Very Good Company",
          "Contenu": "Okay, so I was going to write a one star review. I ordered the Black Friday Special Macbook Pro (late 2017) and after a perfect two weeks or so of functioning, it started getting freezy. Two freaking weeks.However, I got on the Help Chat on the Macs4U website and they were awfully nice about the return. They were prompt, clear, and even sent me a shipping label to cover costs. Once I sent it back, they got it processed within five hours and offered a FULL REFUND, no restocking fee. It's rare that a company go so above and beyond in their service. And in the end, maybe I just got unlucky with the unit that I got; statistically, it's bound to happen. It's how a company handles it that matters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2017-05-11T15:21:25.000Z",
          "Titre": "I give them a A in most ways",
          "Contenu": "I give them a A in most ways - transaction ease, quick delivery, well packaged, Mac in excellent condition, everything works well.  My only complaint is the battery life isn't very good .... 3 hours or so ... my guess is that it's the original battery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jlc",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T01:50:29.000Z",
          "Titre": "We have had a refurbished MACPro for our 2 teenagers",
          "Contenu": "We have had a refurbished MACPro for less than a year, but have found that the service and quality of the machine are great!  In fact, we ordered another MacPro a few weeks ago and are looking forward to long ownership tenures with both!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "IH",
          "Nb_Reviews": 3,
          "Date": "2015-11-16T23:00:38.000Z",
          "Titre": "ipad was almost new, shipped within two days",
          "Contenu": "I ordered refurbished ipad. The ipad it came looked almost new with new screen and new power plugs and cord. It worked perfect. Only reason I am giving this 4 star is that case wasn't included. It supposed to come with a case. I am inquiring about this now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2014-11-26T01:13:57.000Z",
          "Titre": "I was impressed with the staff",
          "Contenu": "What impressed me the most was they didn't tr to sell me what I didn't need.  I explained what I needed and what I was looking for and they he eloped out a lot.  I am recommending to my friends and now they will be my go to place for my computer needs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandy M",
          "Nb_Reviews": 2,
          "Date": "2020-01-02T20:15:14.000Z",
          "Titre": "Very good customer response time...",
          "Contenu": "Not 100% happy with the product and the only resource is to send it back and possibly loose money in restocking fees. I should have kept my old one. At least it  downloaded programs faster than this one. The company response has been excellent, however, they blame the download being slow on my network. Nevertheless, after reformatting my old laptop and downloading programs (HighSierra, MSWord and WordPerfect, etc.) I did not have the same internet slowdown issues. Regardless, the laptop is lighter weight, though I miss the DVD drive and being able to access files on the HD rather than in the 'cloud.' Don't now why that's so difficult. Guess I'll have to figure that out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2016-04-21T01:18:46.000Z",
          "Titre": "Issues with Products.  Great Resolution",
          "Contenu": "We have bought two laptops from them.  The first one, they sent us the wrong machine, although they quickly got the other one to us immediately and gave us a $100 credit.  The second one had an issue with the screen and we returned it immediately and a new machine was sent that was fine.  Both times they were very professional and later fixed one of the machines that my daughter was pretty hard on under warranty very quickly.  It seems like bad luck with the two devices, but they were so easy to work with and the laptops were in great condition physically, we would work with them again. Customer Service was prompt and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 2,
          "Date": "2018-07-16T11:21:37.000Z",
          "Titre": "The only reason I didn’t give 5 stars…",
          "Contenu": "The only reason I didn’t give 5 stars was because FedEx signed for my package and just left my Mac by my door. Fortunately it was still there when I got home from work. However, this could have easily been a terrible experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James (JJ)",
          "Nb_Reviews": 1,
          "Date": "2015-06-29T00:53:36.000Z",
          "Titre": "Expectations Met, Mac is fully functional",
          "Contenu": "At this point I have verified all critical operations and utilities that I am using are functioning properly. I have not set up full disk encryption, but expect it will also work. The only issue I found is that the battery charging warning is active and says \"Service required\". However, when I checked on line it appears to be a \"false warning\" that showed up on many MacBook Pro's after converting to Mavericks OSX. \rIn any case, I have the one year extended warranty, but hate having to have service after loading all my data and special apps. The battery appears to be operating normally and holds its charge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2016-10-06T23:59:16.000Z",
          "Titre": "`macbook pro",
          "Contenu": "She has not stopped using her computer.  This was the right purchase at the right price too.  My discussion with your agent reassured me that the money I spent on this computer was well worth it.  I will buy again when the need arises."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ja",
          "Nb_Reviews": 2,
          "Date": "2019-12-24T16:26:32.000Z",
          "Titre": "Shipping dilemma",
          "Contenu": "My order was shipped promptly, however, receiving my order was difficult. It was shipped by FedEx. When It was shipped, I was not given the option to choose a delivery time when I would be home to accept the order. My order required a signature and I was unable to change the delivery time with FedEx. Two delivery attempts were made when I was not home.  My order had to be re-routed to a FedEx store where I could pick it up. Delivery took about 5 days longer than it should have. My suggestion is to inform customers how their order is going to be shipped ahead of time and give them the option of delivery time and place. Customer service at macs4u  was very courteous and did work with me to get this resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harvey Bulice",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T21:58:30.000Z",
          "Titre": "I would like to thank Mike and Conner…",
          "Contenu": "I would like to thank Mike and Conner for being very informative about your product. If not for them I would have probably fond another place to by my new mac. Everything was great and worked out fine for my wife."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2016-11-22T16:06:29.000Z",
          "Titre": "great computer.",
          "Contenu": "I payed for 2 day shipping on sat night, computer showed up Thursday morning. a few more scratches and dents than expected, bought the one one set up... didn't need it....I feel like someone looked at my order and said this guy won't care if Mac 4 you sends the most dented scratched computer they had...and tell me that they are throwing in a nice cover.... if it wasn't for the silicon cover hiding all the scratches and dents.... I would have sent it back.... ok, that was the bad.... the good is the computer runs just fine.. its a Mac and runs great..I  might have missed it but it would be nice to see a option to get word or other programs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kbrad",
          "Nb_Reviews": 3,
          "Date": "2016-05-06T00:40:02.000Z",
          "Titre": "Great product!",
          "Contenu": "In the past 30 days, I have purchased two macbook pros from macs4u.com. The laptops have worked excellent, and look new! I would have provided five stars but the mag safe 2 charger on one malfunctioned shortly after my receipt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E.T.",
          "Nb_Reviews": 1,
          "Date": "2016-11-11T23:47:36.000Z",
          "Titre": "It's as advertised. Hardware is solid.",
          "Contenu": "I wish we had a choice of OS. I am using El Capitan on a laptop and another desktop. I have problems with Sierra. I am having to re-format the new iMac to regain compatibility. Not the end of the world, but a pain in the...!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2016-06-01T21:38:29.000Z",
          "Titre": "Great Service",
          "Contenu": "I had hassle free service when I purchased a computer 2 weeks ago. I was updated in shipping and even got a personal call letting me know it was out the door.I was impressed by ease of website and the full ordering process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abraham",
          "Nb_Reviews": 3,
          "Date": "2019-01-18T15:52:07.000Z",
          "Titre": "I received my MacBook Air in perfect…",
          "Contenu": "I received my MacBook Air in perfect condition. Unfortunately, I thought I had ordered a MacBook Pro. Also there was no manual, or instruction, but the battery was fully charged. Overall , I am quite pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jade",
          "Nb_Reviews": 1,
          "Date": "2015-11-19T20:11:35.000Z",
          "Titre": "Not quite perfect",
          "Contenu": "Ordered used macbook pro. The monitor has issues but I guess that's what you get for used. Should have been replaced before being resold. I'll deal with it since I need this specific model. Otherwise great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2018-01-18T03:14:04.000Z",
          "Titre": "Delivered as ordered",
          "Contenu": "Delivered as ordered, though case had a few dents and hard cover was appreciated. The machine is running fine.  I did add more memory as it was a bit slow for my use and now satisfied that the price/value is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Xuany",
          "Nb_Reviews": 1,
          "Date": "2018-09-03T01:03:39.000Z",
          "Titre": "I ended up buying 2 computers from here…",
          "Contenu": "I ended up buying 2 computers from here and one is in perfect conditions it works amazing mine in the other hand works fine at times sometimes it blacks out which I don’t know why or what’s wrong with it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandeep",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T05:03:49.000Z",
          "Titre": "Great Mac",
          "Contenu": "Great Mac, excellent service, a few minor annoyances..... Over phone & email they were excellent!  Very responsive, super knowledgeable, and friendly.  2 small annoyances I had though:(1) my macbook pro came with a cover installed on it, when I removed it, one part was stuck to my screen & after finally getting it loose, it left a mark on my laptop ;( I would have rather it come separately.  (2) there was something in my headphone jack.  The first time I tried plugging my headphones in I felt something crumble & when I blew into in a bunch of small plastic pieces came out.  I have no idea what that was, but would have hope something like that would have been checked during inspection.  Other than that I'm very happy with my purchase!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2017-09-26T22:45:57.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Only drawback is the current operating system doesn't support Microsoft Office 2016. Other than that was impressed with the service, the packaging, and the product itself. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Concialdi",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T21:59:22.000Z",
          "Titre": "Great service",
          "Contenu": "Great customer service, quick responses, clean Mac. Delivery is super secure which is the only frustration, it’s too secure. Be great if we can choose pickup at FedEx from the start."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JV",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T23:27:10.000Z",
          "Titre": "Charger Mixup Corrected",
          "Contenu": "Quick shipping and arrival of my refurb laptop, but it arrived with the wrong charger. I let them know and the exchange for the correct charger was handled with expedience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Stockland",
          "Nb_Reviews": 2,
          "Date": "2019-07-02T11:22:38.000Z",
          "Titre": "Everything works",
          "Contenu": "Everything works.  System takes 3 minutes to boot.  Possibly Sata hard drive. This leaves me wondering if there is an issue and hoping it breaks during warranty if so.   Nicely packaged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-01-22T04:49:43.000Z",
          "Titre": "I greatly appreciate the personal touch …",
          "Contenu": "I greatly appreciate the personal touch that a customer service agent from macs4u followed up my online purchase of a refurbished 15\" MacBook Pro with a phone call to explain a signature would be required to accept delivery and to insure there were no problems.  The condition of the MacBook Pro was excellent as advertised.  When I started my Mac the first time I was expecting to go through the new computer setup process. Instead macs4u had already setup the computer with predetermined accounts, names and passwords.  Unfortunately, it took me many hours to erase the hard drive and re-install the MacOS, so I could start with a completely clean Mac.  Even though I rated 4 stars because fo the set-up process issue, I highly recommend macs4u to my friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Govatos",
          "Nb_Reviews": 3,
          "Date": "2017-04-11T12:46:23.000Z",
          "Titre": "They Make It Right",
          "Contenu": "My first laptop from them didn't work.  However, they made it right and even gave me a discount on an upgrade to a better unit.  They were easy tor work with and stand behind their products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dieter",
          "Nb_Reviews": 3,
          "Date": "2016-01-15T19:43:52.000Z",
          "Titre": "my used macpro",
          "Contenu": "I like the laptop, it has some issues and wished I purchased a newer one. Not seller issue. It noted a minor scuff, but it is a dent. I purchased the upgraded with no scuffs. I'm a perfectionist. I wont dye. The other note I said to sales person I want to use my existing 1tb digital drive and he said I can replace it, when I received it had a seal that voids the warranty that I also purchased, I sent an email on this and that I broke the seal to replace the hard drive, never got an answer. So I hope that if I have an issue they will honor it.  Overall the service was nice, fast shipment and works great, I paid for waterproof keyboard, but I think water will get in between the keyboards where the lights shines up. Hope for no spills, specially on planes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edwin Rogers",
          "Nb_Reviews": 3,
          "Date": "2019-03-05T17:40:22.000Z",
          "Titre": "High marks for macs4u! !",
          "Contenu": "macs4u.com has provided me with the very system they advertised.  It has worked properly right out of the \"box\".  My only problem is not with macs4u but with the firm (FedEx) they engaged to deliver this iMac system.  The weather cannot be blamed on either firm, but FedEx's failure to keep macs4u AND me informed of the delay suffered.  They had all the information to communicate delivery updates to me and macs4u but they did not.  Instead, it was \"delivery by the end of the day\" right up til midnight on the day promised.  And then no update until macs4u got on their case.  Delivery was five days later.  So I have given a reluctant 4-stars, though the loss of a star really belongs to FedEx.All-in-all, I will certainly go to macs4u the next time I want to buy a Mac systema"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2019-03-21T02:40:54.000Z",
          "Titre": "The customer service was wonderful",
          "Contenu": "The customer service was wonderful. They were knowledgeable about the product. They made sure all my questions were answered. Overall these are great products at wholesale prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosetta Knight",
          "Nb_Reviews": 2,
          "Date": "2020-07-31T17:30:15.000Z",
          "Titre": "product is very good",
          "Contenu": "product is very good.  would have given 5 stars, but a few of the keys on my magic keyboard had popped out.  I am grateful I was able to just pop them back in place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "artmidwife",
          "Nb_Reviews": 1,
          "Date": "2017-07-31T21:35:53.000Z",
          "Titre": "Nice computer, no info on how to use",
          "Contenu": "Computer seems in great condition, but I've never had a Mac.  It would certainly be nice to get a manual of some kind with it.  I am having a very difficult time figuring things out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. L.",
          "Nb_Reviews": 1,
          "Date": "2015-08-05T02:45:37.000Z",
          "Titre": "Very nice iMac",
          "Contenu": "Easy to use website and the IMAC was like new. A great deal and I will get any other MACs from this site. The only minor problem was they use FEDEX and they have a problem finding my house."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 1,
          "Date": "2016-08-15T22:55:22.791Z",
          "Titre": "Good customer service",
          "Contenu": "I would order from macs4u.com again,  great customer service,  my order arrived with the wrong power cord,  I contact macs4u.com, and they rush me the power cord the next business day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2017-08-16T16:53:47.000Z",
          "Titre": "Computer came as described  working …",
          "Contenu": "Computer came as described  working fine no issues. Only complaint I have is having to be home to sign for delivery. Window of delivery was too broad.  Not sure if that is fixable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Dorfman",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T15:52:38.000Z",
          "Titre": "Dent next to track pad was disappointing!",
          "Contenu": "I received the laptop in a timely manner.  I did notice that there was a small dent next to the trackpad.  That was disappointing.  I should have returned the laptop."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LAWANNA DANIEL",
          "Nb_Reviews": 1,
          "Date": "2019-09-07T15:57:26.000Z",
          "Titre": "We love the laptop",
          "Contenu": "We love the laptop.  It runs great.  The lid hinge could be a little tighter so it would stay in positions better.  I understand that it is a refurbished laptop.Thank"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emmanuel Shambley",
          "Nb_Reviews": 1,
          "Date": "2019-09-07T14:03:27.000Z",
          "Titre": "MacBook Appreciation",
          "Contenu": "Just as everyone else says who purchased a refurbished product from this place. I love it! You can't go wrong with a newly used device that still provides value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joey",
          "Nb_Reviews": 1,
          "Date": "2014-08-29T00:25:42.000Z",
          "Titre": "Great prices! What a bargain!",
          "Contenu": "Customer service was great! I had to take my MacBook Pro to the Apple store for servicing though. They had to reset it to factory settings since\rsome of the Apps failed to update."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JPK939",
          "Nb_Reviews": 2,
          "Date": "2016-09-05T21:16:32.000Z",
          "Titre": "Looks good",
          "Contenu": "Minor glitches in the ordering & tracking but the machine arrived on time, was as described and in good condition.  More to follow when we've been able to check it out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T14:45:19.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good! We just gave the MacBook Air to my son for his 25th birthday on Jan. 28. He has only had it for one day, and he is setting it up. Seems to be working good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James  McBroom",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T16:34:17.000Z",
          "Titre": "The new iMac is very new looking for…",
          "Contenu": "The new iMac is very new looking for being 8 years old. The main problem is the screen moves itself to another position. The screen definition is wonderful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 1,
          "Date": "2015-09-13T02:28:57.000Z",
          "Titre": "Reliable",
          "Contenu": "I was treated fairly, the product was excellently re-furbished, and the price was excellently low. Emails and phone calls were answered in a timely and professional manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tekla",
          "Nb_Reviews": 1,
          "Date": "2015-01-13T02:40:54.000Z",
          "Titre": "Good so far!",
          "Contenu": "I have only had my new (old) MacBook Pro for a week and so far everything is good. I do want to note that during my purchase I had a hiccup that was very annoying. My credit card company could not process the transaction online for some reason. I spent a few hours talking to the cc co. going back and forth on what the problem was, resending the purchase on Macs4u while still on the phone with the card co. and so on. Finally I called Macs4u and a very nice gentleman named Wolfgang worked everything out for me quickly and efficiently. I was feeling very frustrated and wanted to take it out on him, but he was so charming and helpful that my anger dissolved. A few days later my computer arrived and so far I am very pleased. So my review at this point is, great customer service and a computer that has lived up to my expectations so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert",
          "Nb_Reviews": 3,
          "Date": "2017-12-31T16:44:10.000Z",
          "Titre": "A little pricy for such older iMac but …",
          "Contenu": "A little pricy for such older iMac but still worth the price.Be sure to pay extra for 1. MacKeeper and 2. Zoom support if you are new to iMac. Excellent machine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom S.",
          "Nb_Reviews": 1,
          "Date": "2018-05-26T17:19:18.000Z",
          "Titre": "Decent Customer Service",
          "Contenu": "Good product, good packing but slight mixup on delivery.  You pay a bit more for the product but have return privilege, warranty, and decent customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "priscilla lee",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T05:21:49.000Z",
          "Titre": "upgrading my system affordably",
          "Contenu": "I bought a 2015 model updated 27\" iMac loaded with OS Catalina.  Very happy with it, one week in.  It comes with a 1 yr warranty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2018-04-01T14:23:05.000Z",
          "Titre": "excellent purchase",
          "Contenu": "my computer arrivedd on time. works great, great value. only drawback, due to my schedule, wish tech support was open on Saturdays to help with set-up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Skylar",
          "Nb_Reviews": 1,
          "Date": "2018-01-22T23:57:27.000Z",
          "Titre": "Happy with my purchase and the customer …",
          "Contenu": "Happy with my purchase and the customer service I received when I had concerns about payment issues, which turned out to be simply myself missing my middle initial in the credit card payment section of check out. My only complaint would be that I was a bit stressed out that it felt like it took forever to get the computer which I paid over a grand for mailed to me with the free shipping from fedex which macs4you uses. Took 6 days which felt like 8 to get from Minnesota to Oregon. Amazon would have under its free shipping had it shipped to me in 2-5 days which I would have been less anxious and worried about it being banged up on its journey to me. When the computer did arrive from Macs4you I was impressed with how they had it boxed and padded with lots of foam! Anyhow I am happy I went with the older MacBook with the USB ports and SSD slot built in.  I am pleased with the perk of getting the hard cover in blue for the MacBook along with the keyboard protector."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2017-08-25T11:35:52.000Z",
          "Titre": "My imac came with a locked itunes that …",
          "Contenu": "My imac came with a locked itunes that I will not be able to access. Other than that, the service was friendly, timely, and affordable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert LUCAS",
          "Nb_Reviews": 1,
          "Date": "2015-11-06T03:16:34.000Z",
          "Titre": "IT WAS GOOD DEALING WITH YOU.",
          "Contenu": "I WOULD GIVE THEM THUMBS UP FOR MAKING SURE THEIR REFURBISHED PRODUCTS ARE GOOD QUALITY AND FIT THE DESCRIPTION IN THEIR ADVERTISEMENTS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2016-01-23T05:36:34.000Z",
          "Titre": "Very pleased!",
          "Contenu": "Got my IMac. I am very pleased. It arrived quickly. I was notified with shipping updates by phone. Very impressed! Mac is perfect!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toby Woodard",
          "Nb_Reviews": 2,
          "Date": "2018-04-14T16:51:25.000Z",
          "Titre": "We have now purchased 2 refurbished…",
          "Contenu": "We have now purchased 2 refurbished Macs from this company, totaling somewhere near $2000.  The first one worked OK for about 6 months, but started to freeze up and shut down often.  All I do is regular research and word processing, so it wasn't user-related.  Strike One.  Additionally, the charge cord didn't work.  We sent it back and they updated some hardware for $100.  I'm pretty sure that the \"new\" cord they sent back was the old cord, or one just as bad.  It never worked correctly.  Strike Two.  Then, the second computer we bought as a high school graduation gift for our daughter.  It worked fine...for 5 months.  We had to put a new $200 hard drive in it.  Strike Three.  UPDATE: Within minutes of posting my original review (1 star), a very sincere, polite, and attentive man called and resolved our issue to my satisfaction. I was impressed by this customer service. So, since we have had issues with equipment, I must take a star away. But at least they made things right. On the customer service end, I would give a 5 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2017-10-07T01:04:37.000Z",
          "Titre": "The box was delivered crushed by FedEx",
          "Contenu": "The box was delivered crushed by FedEx and one of the keys has fallen off.  Other than that the mac seems to be working fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Lowe",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T13:49:35.000Z",
          "Titre": "everything arrived as expected",
          "Contenu": "everything arrived as expected.  The keyboard was dented but other than that, the machine seems to run fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alvin",
          "Nb_Reviews": 1,
          "Date": "2014-06-05T22:40:41.000Z",
          "Titre": "Satisfaction guaranteed",
          "Contenu": "I am completely satisfied with my purchase of my computer from this company and would not hesitate to purchase from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 3,
          "Date": "2016-08-17T01:27:24.000Z",
          "Titre": "Good process, good machine",
          "Contenu": "Got a very powerful MacBook, only reservation was finding out after I got it that it was a 2012 machine, not a 2013."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Starr Page",
          "Nb_Reviews": 3,
          "Date": "2020-09-04T00:20:10.000Z",
          "Titre": "Thank you!",
          "Contenu": "Thank you! (Why do I have to write so many characters. I don’t have lot’s to say... )Just Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Bad yt",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T12:52:33.000Z",
          "Titre": "In 2021 I was searching for a used iMac…",
          "Contenu": "In 2021 I was searching for a used iMac that needed an older operating system so I could run a specific program for work. Somehow I stumbled upon Macs4u and found that they had what I needed and would even install the OS that I required. I'm still using that computer for work today, so when it came time to order a MacBook Air, I immediately turned to them and found out that they had the best prices and service for refurbished Macs anywhere. Both computers look like brand new and function flawlessly and their customer service is always top notch. I've recommenced them to a few friends now. Nice to know there's great small businesses out there making a difference!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Charity okwy",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T19:32:49.000Z",
          "Titre": "This is the second time I've gotten an…",
          "Contenu": "This is the second time I've gotten an equipment from Macs4u.comI have never been disappointed or worried about any of them.Cos Macs4u has always been helpful and their prices are more than reasonableI Love it and with Macs4u equipments nothing can go wrong.....Charity"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Laduke Haggard",
          "Nb_Reviews": 6,
          "Date": "2023-10-31T18:00:31.000Z",
          "Titre": "A very convenient site",
          "Contenu": "A very convenient site, the selection and ordering process turned out to be easier than I thought. Delivery was on time, and the manager who contacted me was friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Saxon",
          "Nb_Reviews": 4,
          "Date": "2023-02-25T02:50:59.000Z",
          "Titre": "GREAT CONSUMER EXPERIENCE WITH MACS4U",
          "Contenu": "I've purchased 4 refurbished computers from Macs4u over the years. They stand by their products and offer super quick and amazingly accurate tech support. My latest buy, a 2019 iMac, arrived in less than a week. Herbert and Brandon helped me bring over my bookmarks from my old iMac and also assisted me in erasing my hard drive and re-installing the OS. They're great guys and extremely helpful. I highly recommend Macs4u."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Sue",
          "Nb_Reviews": 5,
          "Date": "2022-12-31T04:22:52.000Z",
          "Titre": "This is the 4 th piece of equipment I…",
          "Contenu": "This is the 4 th piece of equipment I have bought from Macs4u.com. Maybe it’s their midwestern base but I have never been dissatisfied, disappointed or anxious about any of the 4 transactions.  The boss and his team members are over the top helpful and the products are exactly as advertised. Mary Sue, Maryland"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katy",
          "Nb_Reviews": 4,
          "Date": "2023-09-29T14:43:05.000Z",
          "Titre": "Great Customer Service!!!",
          "Contenu": "Customer service from start to finish was great, especially after UPS messed up order and sent it on a lengthly circuitous route."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2022-06-05T23:25:59.000Z",
          "Titre": "Extraordinary!  Flawless condition at a deep discount!",
          "Contenu": "I was so very pleasantly surprised when I opened the box to find what looked like a brand-spanking-new iMac!  One would never know it was already five years old as it was in \"factory new\" condition.  Macs4U loaded the operating system that I asked for (Big Sur) and it booted right up.I strongly recommend macs4u for anyone needing a greatly-discounted Mac that still has many years of useful life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Saxon",
          "Nb_Reviews": 4,
          "Date": "2022-08-12T02:17:09.000Z",
          "Titre": "ONLINE SCAM - MACS4U FIXED IT",
          "Contenu": "I was the victim of an online scam - fortunately I didn't lose any money. I was told by my bank to have my computer wiped clean by a professional, so I called Macs4U. Nathan helped me remove my OS and install a new one. Easy peasy, no problems. Macs4U has always been extremely professional, helpful, patient, and their prices are more than reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miranda Moreno",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T19:54:51.000Z",
          "Titre": "GREAT PRODUCT & CUSTOMER SERVICE",
          "Contenu": "More than pleased with my Macbook Pro! Like new! Came with a case and charger, and customer service was excellent. I received a call letting me know when it would ship, answered almost immediately when I messaged in a question-  communication was top notch. Highly recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John White",
          "Nb_Reviews": 3,
          "Date": "2022-07-09T02:11:50.000Z",
          "Titre": "M1 MacBook  Pro",
          "Contenu": "Ordered an M1 chip MacBook Pro, 512 Gb SSD. It was an Apple factory refurbished model. Once again macs4u provided an absolutely perfect machine for a very reasonable price. Beautiful look, perfect in every way. You can’t go wrong with macs4u."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Hervey",
          "Nb_Reviews": 2,
          "Date": "2022-01-25T01:16:25.000Z",
          "Titre": "Best Refurbished Macs Are At Macs4u",
          "Contenu": "In 2020 I was searching for a used iMac that needed an older operating system so I could run a specific program for work. Somehow I stumbled upon Macs4u and found that they had what I needed and would even install the OS that I required. I'm still using that computer for work today, so when it came time to order a MacBook Air, I immediately turned to them and found out that they had the best prices and service for refurbished Macs anywhere. Both computers look like brand new and function flawlessly and their customer service is always top notch. I've recommenced them to a few friends now. Nice to know there's great small businesses out there making a difference!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LEROY MINSON",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T01:43:29.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, great like new looking units and the best customer service I’ve experienced in years. Received a unit with a sticking key, not only did they send out a shipping box but unit was worked on the same day it was received and returned the same week, with my data intact, even though I was warned I should back it up. Have to see how the machine holds ip, but at this point can only offer praise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Brown",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T02:46:36.000Z",
          "Titre": "Fan of macs4u",
          "Contenu": "I purchased a Macbook Air 2 1/2 years ago with a payment plan, wasn't quite sure about the company at first, to my surprise customer service was awsome, I mean you talk to an actual huuman being lol I know right...I'm still bangin out songs on this thing.Purchased a M1 Macbook 3 weeks ago (it's nuts) bought it out right because mac4u has quality merch. (I'm not paid to comment) Great company, save some money! 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Koepke",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T01:40:05.000Z",
          "Titre": "Bargain Bargain",
          "Contenu": "Bargain Bargain. When old Mac crashed I did my research on the internet. Macs4U was highly recommend. I’m very pleased with my 2019 refurbished MacBook Pro laptop. If you buy get the protective cover. Mine was in excellent condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Olson-Nelson",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T01:31:30.000Z",
          "Titre": "Very Happy!",
          "Contenu": "I was a bit skeptical about buying a computer sight unseen and online. But boy was I very pleasantly surprised! Financing was super easy, the computer I bought was practically new and at a great price, I am VERY satisfied and I highly recommend macs4u.com. When I need another computer I will definitely buy from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Just Me",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T01:11:04.000Z",
          "Titre": "Great product, great service!",
          "Contenu": "I had to upgrade my current laptop to do video editing. I did a lot of research and decided on the MacBook Pro. Since a new one is rather pricey, I decided to go with a refurbished one. Someone recommended macs4u and I decided to purchase from them because they had great reviews. They gave nothing but great service from start to finish! The laptop arrived quickly, very well packed and they sent several shipping updates as well as follow up emails, calls and text messages. Such amazing customer service!! I would recommend them to anyone and would purchase from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tuyet Huynh-Weiss",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T17:27:30.000Z",
          "Titre": "I love my Macbook Pro and I very much…",
          "Contenu": "I love my Macbook Pro and I very much appreciate the calm, slowed-down approach to customer service that helped me choose which of the laptops was best for my needs. Computer is running perfectly and does everything I need (and probably more if I had enough skill to poke around.) Thanks Macs4u!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian  Tisby",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T01:05:42.000Z",
          "Titre": "Phenomenal value",
          "Contenu": "Phenomenal value. I have a machine that looks and performs like new for much less than I would’ve spent with Apple.  Item arrived in perfect condition, swiftly.  I have bought my last 4 computers from macs4u.com, and I couldn’t be happier.  I will continue to do business with them.  I’m an iOS developer, so I needed a machine with greater than typical specs, and macs4u delivered.  Thank you all so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty Glenn",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T01:47:41.000Z",
          "Titre": "I am very glad that I followed my Mac Guru's recommendation to order from Macs4u.",
          "Contenu": "It was very easy to make my choices and place my order online. Considering the shipping was free, the irregularity of shipping companies and the delivery date was changed twice, my computer was delivered in a reasonable time. The iMac was in good condition in spite of a half-dollar-sized puncture hole in the box.  The attached instructions were very easy to follow. The young man who called to follow up on my order was very kind, polite and professional. Overall, I am quite pleased with the experience I have had with Macs4u and I have already told my grandson about you. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio DiBartolomeo",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T14:03:57.000Z",
          "Titre": "Macs4u Are There For You",
          "Contenu": "If you want personal shopping experience with a knowledgeable person who cares then Macs4u are the ones to shop with. Their customer service is above and beyond what you'll ever get from anyone or any company. And they are in Minnesota. I would do business with them again if need be. Trust them I do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Martin",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T12:46:38.000Z",
          "Titre": "Purchased a late 2018 Macbook Pro 13\"",
          "Contenu": "Purchased a late 2018 Macbook Pro 13\". I got it refurbished to save some money, Macbook arrived in a timely manner, works great, and even came with a hard case and keyboard cover for free. Very satisfied with the service of Macs4U and will definitely be using them again for my next Mac purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earle Greene",
          "Nb_Reviews": 2,
          "Date": "2022-01-31T19:41:27.000Z",
          "Titre": "Excellent buying experience",
          "Contenu": "Excellent buying experience.  I got a refurbished 2020 M1 MacBook Air, 16gb, 1 TB SSD for the same price that Apple was selling this configuration refurbished, but the computer also came with an Apple Care + warranty good until June 2024, which would have cost me $249 extra had I bought the computer from Apple.  The machine looks brand new.  A representative from Macs4U called me the day before my computer was scheduled to be delivered to make sure I was satisfied with my purchase.   Needless to say, I am more than satisfied, and will definitely look to Macs4U the next time I buy a new Mac."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K G",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T22:42:22.000Z",
          "Titre": "I initially ordered a refurbished apple…",
          "Contenu": "I initially ordered a refurbished apple pen through them, and when it arrived it didn't work, probably due to shipping knocking it around. Macs4U helped me troubleshoot the issue, and eventually sent a pencil that did work at no cost to me. Thank you so much for your help! Very helpful and honest company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Bill",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T16:10:54.000Z",
          "Titre": "I am glad to have upgraded.",
          "Contenu": "I am glad to have upgraded.I appreciate your willingness to help out.We are having challenges moving my daughter's info from her old computer into the computer I have just replaced.We will be asking you for help this morning.We live on an island off the coast of Washington state.And there are no techies here to help us!No amount of Googling has helped!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clif G",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T01:34:47.038Z",
          "Titre": "Reliable and fair pricing",
          "Contenu": "Reliable and fast service. I appreciate customer service coming from the business vs a outsourced call center. 2nd mac I’ve gotten from them. First had a great 5yr run until children. Pricing is the best around by far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stache",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T17:19:01.000Z",
          "Titre": "100% Satisfied",
          "Contenu": "I contacted macs4u in regard to a Mac laptop I wanted to purchase at a price point that matched how the computer would be used. I got excellent help in terms of staging my purchase to match incoming inventory. The machine arrived exactly as described and works splendidly. I am 100% satisfied with the service I received and I highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Guffey",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T00:53:56.000Z",
          "Titre": "The Macs4U experience was first class...",
          "Contenu": "Everything about the Macs4U experience was first class. The only frustration was waiting for the iMac configuration that I needed to rotate through the options. That's not a complaint! Macs4U does such good work, I noticed produced sold very quickly. That's a very good sign for the kind of company with whom I want to do business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rapanos",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T14:24:41.000Z",
          "Titre": "My first purchase from Macs4u",
          "Contenu": "My first purchase from Macs4u and extremely satisfied. It was delivered by FedEx within a week after purchase. The MacBook Pro was clean and nice, surprisingly for a renewed one. Definitely will buy my next one from nowhere else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiah Lynn Booker",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T00:01:03.000Z",
          "Titre": "Great Experience… Great Product!",
          "Contenu": "All in all a great experience and great computer. I got a 2017 MacBook Pro in excellent condition. I will say there are small areas on this computer where you can tell it’s refurbished. Theres a small bubble on the very side of my screen where I imagine the screen was replaced. But the performance is on point… lighting fast and responsive, and cosmetically in amazing condition. There was a courtesy call made to make sure my delivery went well and great correspondence along the way through email to make sure I had everything I needed. I would definitely do business with this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Grimmett",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T01:20:26.000Z",
          "Titre": "Totally worth every penny",
          "Contenu": "Product was exactly as described and it works so freaking good. I love my new MacBook Pro and I would 💯 buy from them again and probably will. The delivery was super fast and required a signature which made me feel awesome that it wasn’t gonna get stolen off my porch by some rando."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T15:00:00.000Z",
          "Titre": "macbook laptop purchase",
          "Contenu": "It was an easy purchase. The website told me plenty of information about the company and the product. After I placed the order someone from the company called me to make sure I was getting what I wanted and answered questions about warranty, etc. It's a well functioning refurbished laptop and I would return to macs4u.com again to buy something in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Wille",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T02:29:07.000Z",
          "Titre": "Great purchase- timely delivery",
          "Contenu": "The Mac air I purchased was in perfect condition.  Since it came with a hard case I assumed the metal cover was marred, however it was in perfect condition.  I received it within 36 hours of purchase.  The price was reasonable.  Couldn’t be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Malika Lyon",
          "Nb_Reviews": 2,
          "Date": "2022-06-25T06:50:04.000Z",
          "Titre": "My third purchase of a Mac from macs4u - Terrific as always!",
          "Contenu": "I recently bought a refurbished MacBook Pro - the third Mac I have purchased from macs4u over the years. Everything about the purchase, shipment, communications, condition of the Mac - in a nice case and with keyboard protector, and performance of the Mac has been outstanding! We have always had very good experiences with macs4u. We would definitely recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas V.",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T04:16:53.000Z",
          "Titre": "This team is knowledgeable",
          "Contenu": "This team is knowledgeable, thorough and clear with communication.  Their prices are reasonable too.  For years I've gone to them for all of my lightly used computer needs.I've not ever been disappointed with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SEWCheeky",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T16:27:24.000Z",
          "Titre": "I would absolutely purchase from…",
          "Contenu": "I would absolutely purchase from Macs4u.com again! I ordered my MacPro at 4:45Pm on Friday afternoon and it was shipped the same day. Customer service was AMAZING! They responded to my email immediately and my flawless laptop was delivered with my free case days later and just in time for my birthday. I was so pleased with the experience that I shared it with my cousin and she purchased her own laptop the same day. Thanks for an awesome experience Macs4u.com. You've got a repeat customer in me."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Marcy Benosa",
          "Nb_Reviews": 5,
          "Date": "2023-04-07T16:24:49.000Z",
          "Titre": "Great customer service and products",
          "Contenu": "My mom ordered her first Macbook Pro through macs4u.com and received it on time, bought a few accessories with it and all worked really well. Had a few issues with setting it up since I was not there with her and their customer service was ready to help as much as they could."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PCH",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T01:05:56.000Z",
          "Titre": "Expectations exceeded.",
          "Contenu": "Hesitant at first as I was unfamiliar with Macs4U.  However, they have outstandingly exceeded my expectations.  Their rated quality of \"Good\" for my MacBookPro 13 is silly - it looks/performs like brand new.  Rapid order fulfillment and follow up (whether automated or not), was equally as impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T20:56:29.000Z",
          "Titre": "2 great experiences so far!",
          "Contenu": "I just bought a second Mac laptop from Macs4u and couldn’t be happier! The refurb I bought for myself 2 years ago felt like a gamble as I had always used PC. Since I love my iPhone I decided to try a refurb MacBook Air. The Macs4u support team walked me through transferring my data and I have had no issues with it so far. When my daughters Mac got so old that she could no longer get updates on it (circa 2012) we decided to get her a refurb MacBook from Macs4u since we had such a good experience the first time. Again the tech support was superb for moving her data from her very old Mac to the “new” one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Crowe",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T01:20:56.000Z",
          "Titre": "Great Company to do business with.",
          "Contenu": "Great ordering process.(This is my second computer purchase and 1 service  from Macs4U) Always top notch !!Staff was great at shipping when I requested a delay of shipping due to my travel schedule.I will most likely buy my next computer fro Macs4U !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gaga Fayard",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T21:54:04.000Z",
          "Titre": "I have wanted a Mac computer forever",
          "Contenu": "I have wanted a Mac computer forever! MACS4U helped me realize this dream with a wonderful product at an affordable price. Excellent customer service and great warranty program. Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2022-03-15T01:55:10.000Z",
          "Titre": "Products and service are excellent",
          "Contenu": "I was not able to use the MacBook Pro I ordered last fall, but Mac4U was very helpful in accepting its return. And the older MacBook Pro I ordered in 2018 is still working well. On the occasional times when I have questions, their customer service is helpful. I recommend Macs4u."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brecke Trent",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T15:27:18.000Z",
          "Titre": "Mac Purchase",
          "Contenu": "I gave a five star because my whole experience was great.  Although the first computer that I received came with a cracked screen the communication with the staff at Macs4u was quick.  I enjoyed the communication from the start of when I purchased and after I received it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Misty Fulgencio",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T23:03:06.000Z",
          "Titre": "This is the second refurbished Macbook…",
          "Contenu": "This is the second refurbished Macbook Pro I have purchased from Macs4U and I could not be happier. The item is pristine, works great and I even took advantage of the extended warranty plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2022-01-28T19:01:22.000Z",
          "Titre": "Went to battle for me.",
          "Contenu": "I was extremely frustrated with the delays in delivery from FedEx and I reached out to voice my complaints. The team at Macs4u went to battle for me and the machine made it the next day. The Machine was in exceptional condition and even better than they explained it to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eva Sandor",
          "Nb_Reviews": 3,
          "Date": "2022-05-20T02:53:03.000Z",
          "Titre": "Wonderful experience, great people!",
          "Contenu": "Not only did I get a great computer for an excellent price, but I got to experience the friendliest, kindest and most patient customer service ever. My issues were taken care of in a prompt and hassle-free way.  I’m sorry I don’t need more computer stuff, so I could buy it from Macs 4U! But I have been telling everyone about them. So I hope that spreads the word."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2022-03-20T07:56:12.000Z",
          "Titre": "I am quite happy with my new toy and it…",
          "Contenu": "I am quite happy with my new toy and it is a joy to use so far. I have not had a computer for a while since my previous MacBook was stolen so I'm learning all of the new abilities of this perfectly functioning machine. Great pricing and the person I spoke with was very knowledgeable ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael H",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T08:21:01.000Z",
          "Titre": "Great Deal & EXCELLENT Customer Service!",
          "Contenu": "When my previous iMac failed (after 13 years!) and I didn't have the $$ for a new one I started researching my options and am so glad I found Macs4U! The refurbished iMac desktop I bought looks and performs just like a brand new computer! It was in perfect cosmetic condition and has been operating fast and flawlessly in every way since the moment I fired it up. Not only that, but the customer service they provided has also been fantastic! They helped me transfer my old data over to my new desktop and even made sure I had the most current updates to the applications I use most frequently. I couldn't be happier with my purchase from Macs4U and would be happy to do business with them again. HIGHLY RECOMMENDED to anyone looking for a great deal on Apple products. THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Tiebout",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T23:42:58.000Z",
          "Titre": "My experience with macs4u has been…",
          "Contenu": "My experience with macs4u has been excellent. I've been thrilled with the laptop. And with the service. When I called for support, they were helpful and, importantly, very understanding of my lack of tech skills. I've already recommended them to many people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert and Jackie",
          "Nb_Reviews": 2,
          "Date": "2022-02-08T15:18:01.000Z",
          "Titre": "Great experience and product.",
          "Contenu": "This was a very professional transaction in all respects. The staff was very courteous, knowledgeable, and helpful. The MacBook Pro was just as described and fairly priced with a warranty. Could not have been better. I will keep them on my list for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Phillips",
          "Nb_Reviews": 2,
          "Date": "2022-06-28T17:14:25.000Z",
          "Titre": "I purchased a MacBook Pro several…",
          "Contenu": "I purchased a MacBook Pro several months ago and I love it!! Brandon in Customer Service was a star helping me out with my internet service issue!! I would buy another computer from them in a heartbeat!! Highly recommended!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen White",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T18:27:48.000Z",
          "Titre": "Top Notch Service",
          "Contenu": "Excellent experience! Ordered a MBP for my wife and had to email them about a shipping delay. They were fast to respond and also followed up to make sure everything was good. I'll be using Macs4U again when I buy another MBP for myself soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zelda Skaife",
          "Nb_Reviews": 2,
          "Date": "2022-09-07T22:41:01.000Z",
          "Titre": "Fantastic buying experience for a quality product!!!",
          "Contenu": "Great experience working with the macs4c.com team. I was so very impressed with the pre shipping follow up to confirm my address as I live remotely in the mountains! Thank you!!The unit is perfect in every way and am so very satisfied!!! Should the need arise, I would DEFINITELY do business again and have already made a couple of referrals to friends!!Thank you so much!Z.Skaife MSN/RN"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abraham",
          "Nb_Reviews": 3,
          "Date": "2022-07-27T01:17:40.000Z",
          "Titre": "I received this amazing computer a few…",
          "Contenu": "I received this amazing computer a few days early. The voice activation instructions to prepare the computer for my data and to personalize it was very helpful. What a beautiful case you included and if I could have some help in completing the set up process, I would be very grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Agnes Rachell K.",
          "Nb_Reviews": 2,
          "Date": "2022-08-18T10:13:36.000Z",
          "Titre": "Good communication and great product",
          "Contenu": "Purchasing through macs4u.com was a fantastic experience. This is our third laptop purchased with them. They were able to get this latest laptop quicker than anyone in the marketplace.  I cannot thank them enough for how great they were to me. You’ve got a forever customer. I hope to see you soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 7,
          "Date": "2022-03-15T13:28:56.000Z",
          "Titre": "Consistently reliable!",
          "Contenu": "We've made multiple, four, five, maybe six, purchases from macs4u thru the years and have been very pleased with them! Our kids and grandkids have enjoyed their macs. They've been just as described with no issues! The deliveries have been timely with no issues! I'll continue to make purchases from them when the need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T00:17:29.000Z",
          "Titre": "Great price for a MacBook Pro!",
          "Contenu": "Great price for an excellent used MacBook Pro. This is my second MacBook purchase from Macs4u in 5 years. The other is still going and I use it regularly at my work office and the latest at my home office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pascal Gravelin",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T03:31:19.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "Fantastic customer service. Professional people who really understand their products and delivered with a smile. This was one of kind great experience. I will buy again. Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Crowe",
          "Nb_Reviews": 2,
          "Date": "2022-06-25T20:21:33.000Z",
          "Titre": "Perfect service !!",
          "Contenu": "I could have gone to a few other repair shops to get my Mac Pro battery replaced but I trust these guys. I originally bought my Mac Pro from them and it's been a perfect computer ever since.Great company to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Goncarovs",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T13:36:33.000Z",
          "Titre": "Competely positive in spite of Fedex Tracking mystery",
          "Contenu": "My experience must reflect that MACs4u.com is an excellent company.  I had nothing but helpful, informed technical people guide me through the purchase and shipping processes.  They need to rethink using FEDEX because its tracking system makes things so much harder when it didn't have to be. Even then, MACs4u.com help arrived to investigate FEDEX's mysterious tracking system, making my overall experience completely positive.  Thank you for sending me my first phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T12:08:53.000Z",
          "Titre": "Macs4u came highly recommended",
          "Contenu": "Macs4u came highly recommended by multiple family members and I’m extremely happy with my purchase. It was in excellent condition and works great ! Would definitely purchase from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Treadwell",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T01:14:41.000Z",
          "Titre": "Purchased an m1 macbook air fully…",
          "Contenu": "Purchased an m1 macbook air fully specced out laptop at a great price and got it delivered within 48 hours, day before Christmas. The service is outstanding as well as the computer. Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Mercer",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T19:38:15.000Z",
          "Titre": "We purchased a mac book for my granddaughter",
          "Contenu": "We purchased a mac book for my Granddaughter's graduation to take to college. I was a used unit and it looks flawless and arrived SUPER fast!We can't wait for her to open it next week and try it out, but I'm sure she won't have any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Martin",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T20:28:19.000Z",
          "Titre": "Just purchased mine on 3/27/2022",
          "Contenu": "Just purchased mine on 3/27/2022. I got a late 2019 i7 16 inch mac graded as Excellent condition. My initial purchase was approved, then denied, then switched to manual verification. Not sure what manual means as I never got a phone call or anything. I called to doublecheck and they sorted it out the next day. The laptop shipped on time and arrived the next day (today) with zero issues. They even called me a few times to give me updates on the shipping progress. GREAT attention to customer service. Even though it's only been a day, the laptop is working great and literally looks out of the box brand new. Not a single scratch or visible wear anywhere on the top case, bottom screen, keys or track pad. The battery only has 100 cycles which is very little use. It also comes with a 1 year warranty from MAC4U and has remaining Applecare warranty as well. SUPER impressed with how this went down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 3,
          "Date": "2022-03-15T18:41:51.000Z",
          "Titre": "They never let me down",
          "Contenu": "They never let me down.  I've been buying from Macs4U since 2014 and they always seem to exceed my expectations.  The last computer I bought from them looked absolutely new but cost $800 less than a new one from Apple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dick O'Connell",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T21:20:33.000Z",
          "Titre": "I thought Max for you was a great find…",
          "Contenu": "I thought Macs4u was a great find on my part. You guys have been great since I first started looking for an updated Mac. You may not be first in customer service and value in this particular market niche, but you’re way ahead of the ones in second place!😎👏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mindy Shulman",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T01:05:37.000Z",
          "Titre": "I love my Macbook",
          "Contenu": "I love my Macbook. Customer service was so helpful both times I talked to them. However, I wouldn't use FedEX anymore. That was the only downfall. Otherwise, I would recommend you to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Robert Krüger",
          "Nb_Reviews": 3,
          "Date": "2022-01-16T16:58:59.000Z",
          "Titre": "Polite staff",
          "Contenu": "Well, I'm actually fond of collecting various technics, so I applied to this company mainly because I had a need to acquire a new computer, which I would use in my own objectives. I asked customer support about some issues and asked several questions, they responded me on every question politely and gave me all the instructions I needed. So, I would definetely state that this is the best service I have ever faced, because in many other similar companies the staff seemed to me rude. Here I saw professionals with a real desire to help customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2022-07-05T18:12:09.000Z",
          "Titre": "The machine was in even better than I expected",
          "Contenu": "The machine was in even better condition than listed. I had to reach out to the support team a couple of times in the process and they were exceptional, I have referred them to a number of friends and family."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Janet Rowberry",
          "Nb_Reviews": 26,
          "Date": "2022-01-19T11:31:44.000Z",
          "Titre": "Brilliant company to deal with",
          "Contenu": "Brilliant company to deal with. Ordered MacBook Air and got it within 48 hours. Excellent condition and worth every penny. I wouldn’t hestitate to recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Robertson",
          "Nb_Reviews": 2,
          "Date": "2022-04-28T11:54:23.438Z",
          "Titre": "Trouble Free experience",
          "Contenu": "The whole purchase process was smooth and trouble free. Bought a MacBook Pro 13 inch. It is in excellent condition and we are very pleased with it. Based on this experience I would recommend Macs4U."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T19:09:28.000Z",
          "Titre": "Great store, great service,great price!…",
          "Contenu": "I had been looking for a new MacBook for a while, but wasn’t sure what to get. Customer service was great. They payed attention to my needs and set me up with a perfect MacBook Pro within my budget. They were not pushy or trying to sell me something I didn’t need. I will purchase from Macs4u.com again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Constance Frankland",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T22:28:30.000Z",
          "Titre": "Macs4u Still Deserves Their Sterling Reputation",
          "Contenu": "The refurbished iMac I purchased from Macs4u 5 years ago has worked beautifully. A few times when I was stalled, I called the staff at M4u who, without exception, were supportive & patient. (I pay for whatever warrantees are most extensive.) In the years since, I purchased a new iPad & iPhone from 2 separate local sources because I believe in shopping locally. Sadly, my experience with calls or visits for help locally were less than satisfactory.I'm not a tech expert but do small-time contract work & now need a quicker, newer set-up for book formatting & graphics programs. I researched, narrowed down my search, then called Macs4u. The folks who helped me were pleasant, knowledgable, patient, & guided me toward my best bet.When I typed the wrong payment information, unfortunately, my credit card was refused & all my credit cards were automatically locked. Yet my Macs4u helpers neither judged nor revealed frustration. They offered alternatives & paused my purchase until I could take care of issues the next morning.I recommend Macs4u without reservation! They hire capable, helpful, people-oriented employees, their products arrive quickly, safely, & as advertised, & someone is available to offer help when I stall. As long as they continue to strive for excellence, I'll continue to heartily recommend Macs4u."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaiah Ortiz",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T09:20:20.000Z",
          "Titre": "Pristine condition!",
          "Contenu": "The laptop I ordered came as described in pristine condition. My wife is so glad to have a new computer and we are so thankful for the excellent customer service we received from Macs4u."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerardine Pierre",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T01:23:22.000Z",
          "Titre": "I am so glad I found this company or…",
          "Contenu": "I am so glad I found this company or site. I was in dire need of a mac book and this company definitely saved me it works very well and came in good condition! Very timely and prompt no complaints highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael C",
          "Nb_Reviews": 2,
          "Date": "2022-02-08T12:31:50.000Z",
          "Titre": "Better price, Better specs",
          "Contenu": "Macs4U got me a Mac at a better price with better specs than what I had previously been searching for. Still a Mac, so it wasn't cheap, but the quality is outstanding!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ugwuchukwu Nnaemeka",
          "Nb_Reviews": 6,
          "Date": "2022-06-12T17:12:33.000Z",
          "Titre": "Phenomenal value for money",
          "Contenu": "Phenomenal value for money. Had purchased a computer from them which I sent back home to my brother. His coding journey has been seemless ever since"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BMD",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T14:44:01.000Z",
          "Titre": "This was an exceptional transaction",
          "Contenu": "This was an exceptional transaction.  Second time buyer from Macs4u and I am sold.  They are completely reliable and communication was great.  Thank You - BMD"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shampa Rice",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T05:50:35.000Z",
          "Titre": "EXCELLENT PRODUCT",
          "Contenu": "EXCELLENT PRODUCT ! Very happy with this affordable computer for Indian students who we support, in their education.Thank you shampa mum"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Andrews",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T13:53:46.000Z",
          "Titre": "The transaction was smooth and fast",
          "Contenu": "The transaction was smooth and fast. Macs4U followed up with me when the MacBook was sent out and asked if i had any questions. Macbook Pro purchased is basically brand new and works great."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Julie Christensen",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T08:59:05.000Z",
          "Titre": "When I decided to buy a new computer I…",
          "Contenu": "When I decided to buy a new computer I checked into macs4u. I liked what I read. When I actually spoke to someone they were very helpful. You never have to wait long to talk to someone.My computer came fast and was packed really well. I love my computer. It works perfectly. A very satisfying experience. I recommend macs4u. as a great place to buy a"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felix",
          "Nb_Reviews": 2,
          "Date": "2022-02-10T17:44:05.000Z",
          "Titre": "Second time ordering",
          "Contenu": "Second time we have ordered a mac from you and again was very pleased at the support your team gave me in setting up our MacBook pro 15 inch. The interface device we ordered worked well in migrating from backup drive to newer mac.Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott S",
          "Nb_Reviews": 8,
          "Date": "2022-02-17T21:49:25.000Z",
          "Titre": "Helpful staff, quality product, competitive price",
          "Contenu": "This is the fourth lightly used Mac we have purchased from Macs4U.com. Each time we have received helpful advice, a competitive price, and a pristine, useful laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Palmer",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T16:50:40.000Z",
          "Titre": "2nd Time Used",
          "Contenu": "This the 2nd MacBook Pro that I have bought from macs4u. I have been very pleased with both of them, and will use them again. Quick shipping and secure packaging. Very efficient operation. I would highly recommend them if you are in the market for a new MacBook."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Laughlin",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T01:40:56.000Z",
          "Titre": "Macs4U had the best prices and fastest…",
          "Contenu": "Macs4U had the best prices and fastest shipping! I loved how they emailed along the way as it was being shipped! The computer is in pristine condition and I am so excited to have another Mac at such a great price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John  B",
          "Nb_Reviews": 6,
          "Date": "2022-05-26T05:59:38.000Z",
          "Titre": "Great source for a refurbished Mac",
          "Contenu": "Great source for a refurbished Mac! Saved $1500-2000 over a brand new one! I would definitely recommend purchasing from this company again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 4,
          "Date": "2023-01-21T02:31:46.000Z",
          "Titre": "Always the go to store!",
          "Contenu": "We’ve used them multiple times, especially with 2 growing kids, and will continue to use them, until they close their doors!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Conrad",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T03:01:08.000Z",
          "Titre": "I made a mistake on an order",
          "Contenu": "I made a mistake on an order. The service rep. was excellent in helping me solve my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duke Farms",
          "Nb_Reviews": 5,
          "Date": "2022-09-20T15:32:06.000Z",
          "Titre": "Great price, lots of bells and whistles",
          "Contenu": "I bought a great little MacBook Pro Nice upgrade from my 12 year old Pro that died. So far so good. Great screen, lots of storage, etc. I should have checked to make sure there were available USB ports, but I found an external port to add on to the computer. Otherwise, A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ELEANORA L",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T16:28:59.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience,  very satisfied.  The item came in a timely manner. The condition of the laptop was better than I expected.  I would recommend them highly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Krauel",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T02:05:57.000Z",
          "Titre": "The most amazing customer service ever",
          "Contenu": "The most amazing customer service ever!  Such great value for a high end notebook!They really make you feel like a friend, not just a customer.I just wish I had more experiences like this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T13:25:23.000Z",
          "Titre": "I've been a customer for over 10 years…",
          "Contenu": "I've been a customer for over 10 years and purchased several Macs. As always, top notch products and help if needed. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Froen",
          "Nb_Reviews": 3,
          "Date": "2023-02-16T07:56:20.000Z",
          "Titre": "Got my laptop here in November",
          "Contenu": "Got my laptop here in November. Reliable company with good customer service. I'm happy with my order thus far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Oliver",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T01:26:07.000Z",
          "Titre": "The whole experience was hassle free",
          "Contenu": "The whole experience was hassle free. Easy to order and with the cheapest shipping possible, it still arrived at my door in four business days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GH",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T02:47:20.000Z",
          "Titre": "Great Product, Great Service",
          "Contenu": "Ordered refurbished MacBook Pro and it is wonderful!  Perfect condition, all set up and ready to use. Highly recommend Macs4u!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dottie",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T01:48:10.000Z",
          "Titre": "Just what I was looking for…",
          "Contenu": "I was looking for a refurbished MacBook Air, and Macs4U had just what I needed in the price range I could afford. Beautiful condition too. Thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Smith",
          "Nb_Reviews": 2,
          "Date": "2022-04-23T04:25:28.647Z",
          "Titre": "Very happy repeat customer!",
          "Contenu": "This is the second apple computer that I have bought from macs4u.com. Each time I have call to speak to someone about specifics and to help in deciding exactly which computer to finally get. Each interaction has been really friendly and very helpful! The MacBook Pro I got a couple of years ago was to replace a much older one and it is still working perfectly. This 2017 iMac that I just bought was bought to replace a much older one and I wanted to double up the ssd to 2 tb. Again with this purchase, I had a couple of choices and the guy I spoke to talked to me about the differences to make my decision easier. I got a wireless keyboard and the iMac. Everything arrived in about a week and the computer was in perfect shape. The keyboard had a sticking key and when I call, they immediately got another one out to me. I am completely satisfied with the computers, the service and would recommend this company to anyone looking to upgrade from an older system and not willing or able to pay the price of a new computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Boroski",
          "Nb_Reviews": 3,
          "Date": "2022-04-26T01:23:52.638Z",
          "Titre": "Had an issue with my initial purchase…",
          "Contenu": "Had an issue with my initial purchase but due to my past experiences I stuck with them. They fixed the issue at no charge and my computer works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Tarantelli",
          "Nb_Reviews": 2,
          "Date": "2022-03-21T02:33:11.000Z",
          "Titre": "My 13 year old iMac was running slow…",
          "Contenu": "My 13 year old iMac was running slow and couldn’t be updated any longer. I decided to get a MacBook Pro as both my kids have them and are very happy. I’d looked at the macs4u website prior so decided to give them a try. I found a special and bought it! I’m very happy with my purchase. If I didn’t know, I’d think it was a brand new machine. Looks great, runs great! Would definitely recommend macs4u!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Rice",
          "Nb_Reviews": 2,
          "Date": "2022-05-28T14:41:04.000Z",
          "Titre": "Very happy with my purchase,,AGAIN",
          "Contenu": "Very happy with my purchase,,AGAIN.  This is the 3rd purchase from Macs4u over the years and they have all been great machines, reasonably prices and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Hemen",
          "Nb_Reviews": 3,
          "Date": "2022-09-19T01:49:34.000Z",
          "Titre": "The computer was first rate",
          "Contenu": "The computer was first rate, as was the customer service. I bought it for my daughter so that she could use it in college and she is finding it to be an excellent resource. Thanks for the good work."
        }
      ]
    }
  ]
}