{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.strongvpn.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "sophia",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T06:16:08.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service. Took monthly payments without my authorisation and will not refund as it is not a yearly plan. Do not interact!"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T20:05:54.000Z",
          "Titre": "I can't unsubscribe!",
          "Contenu": "I made a strong VPN subscription in order to use it when traveling abroad. it's just that the app just doesn't work abroad. Yes! That's right, you didn't read wrong! On the way back from the trip, I asked to cancel the subscription to this app and, I got another surprise, the site is under maintenance and asked to access it later! This is absurd! it's abuse! it's cheating! It's disrespectful to the consumer! it's the case of the police!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Gabriela Zym",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T00:35:59.000Z",
          "Titre": "Doing Totally scam",
          "Contenu": "Doing Totally scamI was bought VPN for Stronvpn but the VPN Not working in My both computer and laptop.These people say 30 days money back guarantee of Promise but that applicable only annual follow note monthly plan.they not mention clearer its not for monthly plan. \"The 30 day money back guarantee is only available for the annual plans, this is mentioned in our plan and guarantee's information page: \""
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T07:30:22.000Z",
          "Titre": "absolutely spam website",
          "Contenu": "absolutely spam website! Can’t even load a single character when you are using it in China and they don’t refund you unless you are having a annual plan."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Maier Belensky",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T10:20:06.000Z",
          "Titre": "it's a bad network for users",
          "Contenu": "it's a bad network for users, I don't recommend it to anyone, Facebook blocked our business accounts, people from Europe!!,facebook detect them as coming from Russia and stop advertising, Google finds the ips as a scam and asks us to build anti-spam elephants every time. so I don't recommend it even to my enemy"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joe Lim",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T17:29:24.000Z",
          "Titre": "Fraud Scam VPN Company not Strong",
          "Contenu": "The VPN company made for scams, because wham you purchase this VPN the VPN not working on your computer and when you ask for refund the will tell refund policy applicable only annual subscriber.i don't recommend this VPN.  here totally positive reviews are paid."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jeff jeff",
          "Nb_Reviews": 19,
          "Date": "2022-12-19T02:15:09.000Z",
          "Titre": "Beyond a painful experience with this VPN Strong company",
          "Contenu": "do nto use this company if your trying to have a denmark or swedish IP.!!m  its a joke i have been trying to connect to a danish server for 30 minutes.when i did connect NOT 1, TV company in denmark could i watch outside of denmark.  its beyond a useless vpn ( for me )this is my experience, and how i found this company.hence the 1 star."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Passerby",
          "Nb_Reviews": 40,
          "Date": "2023-10-29T14:59:54.000Z",
          "Titre": "new rules even for paid customers",
          "Contenu": "I've been a lifetime subscriber to StrongVPN, but my smooth ride hit a bump two days ago. I suddenly couldn't connect to any of their servers.I reached out to their support team, hoping for a fix. But when I mentioned where I was located, they dropped a bombshell – they don't serve my region anymore. This was a shocker, considering I have a paid, active subscription.It's frustrating and just plain wrong. If you're a paying customer, you expect them to support you.Update:I decided to give them another shot after they responded to my review. Unfortunately, they stuck to their guns, saying there were no refunds or solutions. They're based in the United States, so you'd think they'd play by the rules.It's a bummer that they decided to cut me off from the service I paid for, with no chance of a refund. This situation makes you wonder how they'd react if government requests your data!"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "CyPy Fry",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T03:26:56.000Z",
          "Titre": "SCAM",
          "Contenu": "SCAM! Stay away! They just cancel your service without notice.Used to be good but as of May 2023, there are MUCH BETTER options out there and StrongVPN cannot match up - so they resort to SCAMMING.STAY AWAY, you have been warned."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Parham Rad",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T13:27:40.000Z",
          "Titre": "Doesn't work in Iran",
          "Contenu": "It doesn't work with Iran network restriction, I've tried every protocol and none of them works. I wish they could provide a tunnel connection as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Coan",
          "Nb_Reviews": 9,
          "Date": "2022-05-04T19:47:03.000Z",
          "Titre": "I was a happy customer of Strong until.......",
          "Contenu": "I was a happy customer of Strong for about 6 years.then, when I had a problem, I contacted Strong and was given the cold shoulder.Not only did they not answer the phone, they took 24 hours each day every day to answer the emails I sent.Each day they'd tell me to try something new. and each day, I'd respond that the provided solution wasn't working.Finally, I gave up. and told them to please cancel my account and refund my money.That started another whole series of emails.Apparently they don't EVER give you back any $ and they want to keep trying to solve your problem (much more attentively) than when you were moderately happy. Strong is like any other big group.They want your $ and they want you to give them glowing reviews.They do not respond to criticism and they want to tell you your case is \"Solved\" even if they haven't done anything to solve it.  I left very unhappy.Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Nagendra Singh",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T21:56:14.000Z",
          "Titre": "Don't buy",
          "Contenu": "I was bought strongVPN and i tray to install in my computer but the VPN not install in My Desktop and Laptop after then i contact to support team thay suggest me select this and more i was do it but the VPN not install in My PC after then i ask again for support teams and i told clear if possible to run this application or refund my money but thy have not able to install the app my computer and they have not mention clearly in the website refund policy applicable only annual purchasing. finally they have not refund my money and not able to install the crap application in my computer just use VPN for Make Money as scam way.Don't buy other wise you also loss your money and wast your time also."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jacob Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T00:35:20.000Z",
          "Titre": "VPN not working and support system is very bade",
          "Contenu": "VPN not working and support system is very bade they send auto reply mail in support and after uninstalling VPN my internet Driver was corrupt and Internet not working."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Som Kele",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T16:00:15.000Z",
          "Titre": "Life is all about going ture hard work…Hard work",
          "Contenu": "Life is all about going ture hard work which make u what u are in time u will enjoy your hard work"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Tee Frank",
          "Nb_Reviews": 3,
          "Date": "2021-05-02T10:55:04.000Z",
          "Titre": "Does NOT Work as Advertised",
          "Contenu": "We rolled to this Service after StrongVPN acquired Unblockus.  Nothing consistently works with StrongVPN.  HBOMax on AppleTV will not work.Peacock on AppleTV will not work.Amazon Prime on AppleTV will not work.Speaking with their IT Department (which get back to you in about 3 hrs (only email, no phone), they are \"WORKING\" on these issues but have no timeframe on the possible solutions."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Eric L",
          "Nb_Reviews": 9,
          "Date": "2021-11-18T08:30:22.000Z",
          "Titre": "Dreadful customer service",
          "Contenu": "Dreadful customer service. Renewed my subscription without my consent despite the fact that I complained about VPN service not working. Russel Hatfield from the StrongVPN Support Team provides appalling service. I will never use StrongVPN again and cannot recommend them."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Linx",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T07:30:20.000Z",
          "Titre": "Spam, spam, spam, spam",
          "Contenu": "The service was bland, and very often slow.But when I cancelled my subscription, the spamming started. It's been over a month of daily mails, sometimes several, with \"reminders\" to update my payment info.Even though I've contacted them (which I really shouldn't have had to), and got confirmation that my subscription is stopped, they keep coming.Do yourself a favour, and stay way."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-07T14:51:38.000Z",
          "Titre": "Charged for a VPN I can’t use …",
          "Contenu": "I’ll never know if it was good once connected because all that happened was I got charged and then wasn’t able to connect to the VPN after changing payment info. When I emailed support they sent a link to articles that had nothing to do with my problem and it was clear no real person had read my email. Two weeks or so later I am still being charged and am unable to use or connect to the VPN at all, was really looking forward to being able to use this so am very disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Mads Sørensen",
          "Nb_Reviews": 7,
          "Date": "2016-12-12T13:16:34.000Z",
          "Titre": "Got an invoice after I clicked around on their website",
          "Contenu": "I am browsing for a good VPN application, so I checked out StrongVPN. I have just recieved an email with an invoice.... I haven't used your app guys, what the ...? I made a free signup - it said free. I didn't choose any product or anything. I was just checking out your website. Now you seem to have made my decision easy for me. You cannot invoice me, when I have not used or asked for your product. It is not a valid invoice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walik Dancy",
          "Nb_Reviews": 2,
          "Date": "2019-12-17T17:16:53.000Z",
          "Titre": "I love having Strong VPN",
          "Contenu": "I love having Strong VPN, because I feel safe and secure with them, I haven’t had any problems at all since I signup for their service. I recommend that anyone who is looking for VPN protection to give StrongVPN a try, I guarantee that you will not be dissatisfied.Thank youLennis Dancy"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Daniele Tramp",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T18:10:02.000Z",
          "Titre": "I preferred IBVPN",
          "Contenu": "I had subscribed to IBVPN only to access a swiss site, but since they sold to STRONGVPN i cannot access the site anymore. I tried to contact them to solve the problem or to get a refund but still nothing.Edit: after writing this review i got a refund, thanks."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rami Tarabein",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T14:29:54.000Z",
          "Titre": "TOO RISKY! NOT SECURE",
          "Contenu": "It was one of the worst experience with VPN ever, there is no any confirmation for account with change email and password, very slow connection, No mail to tell you there is maintenance....I would like to give him Zero if possible."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Monika",
          "Nb_Reviews": 103,
          "Date": "2021-11-21T13:35:40.000Z",
          "Titre": "The worst VPN provider online!",
          "Contenu": "The worst VPN provider online!! StrongVPN are the 'ambulance chasers' of VPN services requesting 'payment' (10 emails and counting) for something that was NEVER used nor activated!Without fail every 1-2 weeks StrongVPN contacts me for 'payment' for a VPN I've never used nor activated!'Invoice overdue' and 'Payment Reminder' but I've NEVER used their 'service'.This is appalling behaviour and indicative of the worst service a company can provide. I'm never using StrongVPN and if you are thinking about using them be aware they will still chase you for 'payment' even if you don't use them!!'One star' is too much and avoid these online 'ambulance chasers'!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mick Monroe",
          "Nb_Reviews": 1,
          "Date": "2018-11-09T12:43:20.000Z",
          "Titre": "If you just want a VPN to surf the net",
          "Contenu": "If you just want a VPN to surf the net, then I guess they're OK. However, if you are streaming sports; well the NFL & NHL identifies you as having a VPN and you will not be able to see that blacked out game.Support is by email, or chat only."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Gordon",
          "Nb_Reviews": 23,
          "Date": "2015-08-18T11:15:31.782Z",
          "Titre": "Very disappointing service!",
          "Contenu": "Poor speeds, continual service dropping out and disconnecting, as well as charges to chat to a customer service agent! I don't know if StrongVPN has changed hands recently but whatever has happened a once good service is now very disappointing, unreliable and frustrating to use! I use IP Vanish now and unlike StrongVPN I get fast speeds, NO connection drop outs and FREE customer service! Maybe the people who once owned or worked at StrongVPN left and created IP Vanish but whatever is the reason I won't EVER be using StrongVPN again! I hope this review helps anyone looking for a reliable VPN!"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Issac Goldstand",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T11:29:31.000Z",
          "Titre": "Service was down.  Instead of fixing, their support rep told me to leave",
          "Contenu": "StrongVPN recently acquired OverPlay, where I'd been a happy customer for over ten years.  After being migrated over to StrongVPN things seemed to work fine for the first few weeks. However, after a few weeks, something broke with their SmartDNS service.  I contacted customer support, hoping for a positive first experience. Imagine my disappointment when the response I got was \"you can back to Overplay. It's still active until 2021-08-02.  I cannot fix this...\".  This makes me feel like worthless user, rather than a long-time paying customer.  Congratulations, you've utterly lost trust the trust of a loyal customer and you can never put things back to the way they were :("
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:56:16.000Z",
          "Titre": "very poor service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PissedCustomer",
          "Nb_Reviews": 11,
          "Date": "2021-09-25T12:07:40.000Z",
          "Titre": "Supporting criminals and take no action…",
          "Contenu": "Supporting criminals and take no action to take them down. Another bunch of wannabe business guys who have nothing else in mind than getting their piece of the cyber criminals' cake."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Kate",
          "Nb_Reviews": 2,
          "Date": "2019-06-28T08:59:53.000Z",
          "Titre": "I have been a subscriber for the past 8…",
          "Contenu": "I have been a subscriber for the past 8 years and i can say i am quite happy  and satisfied with the service. Support is quite fast and efficient too. Im so satisfied i have referred several of my friends to use StrongVPN."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 6,
          "Date": "2019-08-12T17:45:13.000Z",
          "Titre": "My service has been down for nearly 24…",
          "Contenu": "My service has been down for nearly 24 hours and customer service is having difficulty explaining why.  Not happy at all? Especially as I have just renewed my annual subscription.  I would hope for some compensation."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Vlad",
          "Nb_Reviews": 2,
          "Date": "2015-11-26T18:19:19.576Z",
          "Titre": "BE WARNED!",
          "Contenu": "This company will sell your a**, scroll down to see a previous comment on the matter.\r Staff member was able to tell me times i logged on/off and then i seen the comment above.\r If you value your privacy do not go near this mob."
        },
        {
          "Note": 1,
          "Lieu": "EC",
          "Pseudo": "bubba",
          "Nb_Reviews": 2,
          "Date": "2014-05-01T17:19:09.000Z",
          "Titre": "sloooooooooooooow",
          "Contenu": "their vpn services are extremely slow.  I loose 70% of my bandwidth consistently.\rtheir customer service will take more than 40 minutes to field my inquiry they offered a new script last time but that did not resolve\rthink b4 you buy"
        },
        {
          "Note": 1,
          "Lieu": "KY",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T18:08:35.000Z",
          "Titre": "Was awesome in the first few years bit…",
          "Contenu": "Was awesome in the first few years bit lately can not get the sevices i want to watch ie: netflix and prime. Been hoping they could get these but tired of waiting. Will change when subscription is up. Too bad really."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Darren Vaughan",
          "Nb_Reviews": 1,
          "Date": "2018-11-09T08:00:07.000Z",
          "Titre": "Slow and no good for netflix or kodi",
          "Contenu": "Slow and no good for netflix or kodi, paid for full year ok first few weeks then had problems, sickening things was I had gone over the 30 days money back offer by 2 days so lost my money! no refund!Avoid this company!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Darren Vaughan",
          "Nb_Reviews": 8,
          "Date": "2018-07-05T12:35:26.000Z",
          "Titre": "Slow and no good for netflix or kodi",
          "Contenu": "Slow and no good for netflix or kodi, paid for full year ok first few weeks then had problems, sickening things was I had gone over the 30 days money back offer by 2 days so lost my money! no refund!Avoid this company!"
        },
        {
          "Note": 1,
          "Lieu": "EC",
          "Pseudo": "Dena Janene Pate",
          "Nb_Reviews": 2,
          "Date": "2016-06-16T20:32:19.000Z",
          "Titre": "Don't waist your time or money on this service.",
          "Contenu": "I have been using StrongsVPN for 3 years. I am a missionary in Ecuador and need the VPN to access my online banking, watch my favorite shows on ABC and CBS.com and watch Netflix, however over the past month, while my VPN is connected, I have not been able to log into my US bank account or watch my favorite shows as I get an error message saying that the content is not available in my area. I have submitted technical tickets, because there is not customer service to call or a live chat to help with the issue, and the responses from the technical ticket took days for someone to respond with technical jargon that I did not understand and there was no-one to ask further questions. I am cancelling my subscription."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shaun Ellingham",
          "Nb_Reviews": 3,
          "Date": "2020-12-19T22:11:27.000Z",
          "Titre": "Steer clear",
          "Contenu": "Steer clear, was with them for 5 years but decided I no longer needed a VPN.  Cancelled in plenty of time, but they still took the annual subscription from my account.  Credit to them they refunded after I chased them, but now they are bombarding me with emails asking to rejoin them on a 'special offer'.Been sending me an email every day asking to return, now had 2 emails in the last 30 min with a plaintive one line 'I wanted to follow up with you regarding our last message. Let us know if you're interested in proceeding and a member of our team can help you immediately.'Well Nataly Dergai I still dont want to, and given how much grief you give when I have tried to leave I never will in the future - and suggest others follow suit...but they wont let you go....quietly....Avoid..."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Umit Kesgin",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T19:32:04.000Z",
          "Titre": "they didn't pay back my money ,even…",
          "Contenu": "they didn't pay back my money ,even they know when ı start and when ı want my money back ..it was not finish 30 days .so they take my money and they r lierbe careful"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Ms   Maria D Fernandez",
          "Nb_Reviews": 2,
          "Date": "2019-06-28T09:40:19.000Z",
          "Titre": "I contracted with the VPN to watch the…",
          "Contenu": "I contracted with the VPN to watch the award shows (academy awards, Grammys, Tony’s, Golden Globes, etc) and the tennis grand slams from where I live in Spain. It is not working,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2019-06-27T21:50:20.000Z",
          "Titre": "Went to renew and your service rep…",
          "Contenu": "Went to renew and your service rep couldn't put my vpn in Holland...like it always had been???!!!  He placed my vpn in Florida.I went with another company and glad I did."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "for your order, Kelly Coglianese",
          "Nb_Reviews": 3,
          "Date": "2019-06-27T20:20:08.000Z",
          "Titre": "Always issues",
          "Contenu": "Continued, issues with connections. No help at all with customer service they just kept passing it off to each other never solved the issue and we have very limited use."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T10:36:35.000Z",
          "Titre": "One star - UAE not working at all",
          "Contenu": "One star, because I traveled to United Arab Emirates and Strong VPN was not working at all. It seems that for travelers the program is not the best solution."
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "Bernadette",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T06:02:28.000Z",
          "Titre": "0ne star you never waited to get in…",
          "Contenu": "0ne star you never waited to get in touch when we had a new credit card delivered and closed thr VPN I now cannot access any of my sports accounts"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JEHIV",
          "Nb_Reviews": 1,
          "Date": "2016-09-09T14:09:43.000Z",
          "Titre": "One time purchase means one time each month!",
          "Contenu": "I purchased a \"one time\" activation of StrongVPN services, and they took money from my PayPal again the following month.  One their website they offered a \"monthly\" service for about $5 a month, or a \"one time\" for one month for about $10.  I chose the \"one time\".  I was looking for a VPN service to use temporarily, and \"How To Geek\" recommended them.  I won't be trusting them anymore either.  Once purchased, I received an email with user and password info.  Following instructions was not clear.  I had to download an app to connect.  Windows wouldn't allow the download.  I contacted StrongVPN for my money back, and they said use a different browser.  I finally got the app to download, and signed on.  Google was displayed in Arabic fonts with a link to English.  I had to wait several times while the service buffered while using it.  And after all that, they charged me again!  RUN...  Stay away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Terry",
          "Nb_Reviews": 31,
          "Date": "2020-10-05T20:16:29.000Z",
          "Titre": "Supporting all criminals as long as they pay them...",
          "Contenu": "Use by criminal pieces of sh_it and they do nothing to prevent it. They should be put out of business and shipped to Guantanamo."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "M.Hudson",
          "Nb_Reviews": 1,
          "Date": "2015-08-14T15:47:16.027Z",
          "Titre": "Recent server change has changed a great service into a diabolical one!",
          "Contenu": "I have been a Strong VPN customer for several years now and have several VPNs which I use. These are great for working abroad and really help me. Recently Strong VPN changed their servers forcing customers onto a new one and sent out changeover instructions to make the switch to the new server. However, the new server which is based in the Netherlands is terrible and a once great service is now a nightmare. The service constantly drops out, is slow and stops working without warning. Forget watching a film or listening to a radio without interruption as virtually every few minutes there is a problem. I've already complained to Strong VPN customer service but nothing has changed and be very wary signing up to them based upon reliability of service as this is now very unreliable! It's a shame as Strong VPN used to be so good but if it continues I will leave and find another VPN as the service is becoming almost impossible to use without constant interruptions!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "RT",
          "Nb_Reviews": 11,
          "Date": "2016-11-07T18:48:58.000Z",
          "Titre": "Scam. Deliberate nighmare to avoid auto renew",
          "Contenu": "I hate companies like this that put so many steps in your way to stop you just paying when you use the product. Shame, product is ok."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T04:00:32.000Z",
          "Titre": "It does not work in China ( but that’s…",
          "Contenu": "It does not work in China ( but that’s not your fault ) and I now can’t get the bbc IPlayer on my IPad and I could before."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ebby",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T20:55:24.000Z",
          "Titre": "Were not helpful",
          "Contenu": "Were not helpful, wouldn't let me change vpn location, took money out of account when information was deleted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T22:26:48.000Z",
          "Titre": "Stopped Working",
          "Contenu": "Stopped WorkingThe Icon would open the program. called customer service and their remedy didn't work!!!"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Wilhelm Torsten",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T18:48:28.000Z",
          "Titre": "Technical support is bad and not…",
          "Contenu": "Technical support is bad and not working for Turkey, but The vpn Company which is Free are working?!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia L",
          "Nb_Reviews": 2,
          "Date": "2019-06-27T17:35:49.000Z",
          "Titre": "Speed <1 Mbps",
          "Contenu": "For the past month using STRONG VPN has slowed our internet speed to <1 Mbps."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Oliver",
          "Nb_Reviews": 7,
          "Date": "2019-06-27T18:55:43.000Z",
          "Titre": "Not working.",
          "Contenu": "Strong VPN has not worked for me in s long time. I have cancelled my account."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Ian",
          "Nb_Reviews": 11,
          "Date": "2019-06-28T01:27:39.000Z",
          "Titre": "Am in China,no support whatsoever",
          "Contenu": "Am in China,no support whatsoever. Impossible to contact, nuff said"
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Este Ban",
          "Nb_Reviews": 11,
          "Date": "2021-04-22T17:59:19.000Z",
          "Titre": "Used by hackers",
          "Contenu": "Used by hackers ! This VPN will be put down by FBI soon"
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "SENSE",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T07:07:01.000Z",
          "Titre": "How can I sell trade"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Graham Stewart",
          "Nb_Reviews": 2,
          "Date": "2019-06-28T12:52:19.000Z",
          "Titre": "Has not worked for months and no…",
          "Contenu": "Has not worked for months and no assistance when requested"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2019-06-29T11:32:48.000Z",
          "Titre": "Its got very bad now with the BBC uk…",
          "Contenu": "Its got very bad now with the BBC uk blocking your VPN"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "KD",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T07:14:57.000Z",
          "Titre": "I am unable to make use of it on my…",
          "Contenu": "I am unable to make use of it on my SAMSUNG S3 Tablet"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve C",
          "Nb_Reviews": 27,
          "Date": "2021-09-06T04:09:26.000Z",
          "Titre": "Be warned! They will use an expired credit card!",
          "Contenu": "I had this service in China back in 2016 and it frequently wouldn't work, always being blocked, so when it came up for renewal in 2017 as I was leaving China decided to cancel. They sent me a notice saying I needed to enter new payment details for my service to continue, but instead I responded saying no thanks, I would like to cancel. Fast forward to 2021 and I get another renewal notice. So, thinking it was strange, I investigated.Turns out that the email I received and responded to was a no-reply email, there was nothing in the email to tell you that unless you checked for it hidden away in the email address, plus there was no automated response to tell you that you had emailed an unmonitored address! It was all set up to catch out the unwary. There was also no link to cancel, just a \"give us new credit card details here\". Couldn't have gone to their site at the time anyhow as their web address was blocked!Turns out that they continued the service and continued taking money despite it being an expired credit card, despite the service never being used, and kept on taking it even though the service was clearly unused.Yes I know I should have seen it on my credit card but I didn't. But, also, I have up until 2021 never received any renewal notice and have never received a payment invoice, otherwise I would have known earlier.I have never used the service, I switched to ExpressVPN and can prove I had that MUCH SUPERIOR service during that time.Contacting them, they initially didn't want to know, but eventually returned the one payment from 2020, but refused to return the other 3 payments saying it was against their T&C to refund such old payments.I will be contacting the bank, but am sure they also will say it is too old but would be interesting to hear how they can use expired credit card details. They have found a loophole in the system to keep taking money from people, just a scam."
        },
        {
          "Note": 1,
          "Lieu": "KM",
          "Pseudo": "Daniel Davis",
          "Nb_Reviews": 1,
          "Date": "2015-04-11T06:27:31.000Z",
          "Titre": "Sorry to disagree",
          "Contenu": "I got Strong VPN because of the many positive reviews I saw here and other places.  I signed up for a year-long subscription, downloaded everything, and got started.  \r Upon connecting to Strong VPN my computer started popping up the \"Internet Connections\" window and then the \"LAN Settings\" window and then closing them over and over.  It made my system (Microsoft Surface Pro 2) inoperable.\r So I used their customer service.  I was about 2 minutes with the first person who said they would get a tech person, and then waited 15 minutes for the tech person, who had me install support software so that he could operate my computer remotely.  After about 45 more minutes he didn't have it working...  \"It's not working\" he said lamely.  So we gave up.\r I expected that they would open a service ticket and get back to me, but not hearing anything for 2 days, I emailed them with my problem, asking for a fix or my money back.  5 days later, conveniently outside of their 7 day \"money back guarantee\" window, I get an email with my problem listed as medium priority and couple questions like where I am (which you tell them when you sign up for the service) and how I connect.\r So...  I'm getting no love from Strong VPN.  Take your chances.  Looks like a lot of people are getting good service and find it a good product, however, I  might add, that it is a psychological fact that when it appears that a vast majority of people have a particular belief, those who don't agree tend to keep quiet about their views.  This is even true with online reviews.  So take your guess: am I just really unlucky? or did I just get ripped off?  Since StrongVPN hasn't solved my problem, or given me my money back right now I'm thinking option 2."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T16:53:17.000Z",
          "Titre": "It  did not download.........."
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T22:30:20.000Z",
          "Titre": "Not working at all in China"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Shona",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T20:05:10.000Z",
          "Titre": "It isn’t working for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T21:39:03.000Z",
          "Titre": "I cant change to dominican republic"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen L",
          "Nb_Reviews": 10,
          "Date": "2022-02-11T03:16:28.000Z",
          "Titre": "StrongVPN Not Providing What They Did In The Past....",
          "Contenu": "Been a StrongVPN customer for just under 4 years. Worked great until a month ago and now while it will allow me to stream geoblocked content it won't allow me to appear to be in a specific US city which I need and have used succesfully for all these years. So, time to move on and try other VPN's as Strong can't provide the service any more."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-12T21:01:10.000Z",
          "Titre": "Doesn't work nearly as good as they…",
          "Contenu": "Doesn't work nearly as good as they promise. Won't fool Netflix or Acorn TV."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "William",
          "Nb_Reviews": 9,
          "Date": "2019-06-27T19:14:43.000Z",
          "Titre": "Stong VPN was really worth it a couple…",
          "Contenu": "Stong VPN was really worth it a couple of years ago.  I'm not sure what happened, I've been told web sites are beating the VPN technology. I agree. In the last 18 months can no longer fool NetFlix and a couple of other sites.  I have to access them without the VPN being on, and them am denied viewing the movies.  I'm getting ready to look elsewhere to be frank."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Krishna Biltoo",
          "Nb_Reviews": 15,
          "Date": "2019-06-28T11:55:54.000Z",
          "Titre": "I have Strong VPN to access BBC content…",
          "Contenu": "I have Strong VPN to access BBC content when I'm abroad. The VPN service is random and erratic. I have in the past 20 mins repeatedly tried via the London hub. No access. Then I turned the VPN off and get into BBC Sounds straight away. I wonder why I pay for Strong VPN? Sometimes it works for streaming TV, but I can use SKY Go fr that, so will probably cancel."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T18:23:27.000Z",
          "Titre": "Does not work for Amazon movies",
          "Contenu": "I subscribed to StrongVPN as I work in France and wanted to watch movies on my Amazon.com account. Initially Strong VPN let me watch movies, but in past 4 months if I use StrongVPN I get a message from Amazon \"you are using a VPN, discoonect your VPN....\" and I am unable to watch movies"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Buk",
          "Nb_Reviews": 9,
          "Date": "2021-02-06T15:36:16.000Z",
          "Titre": "Not good",
          "Contenu": "I used their services for more than 1 year. I finished my subscription because they do not keep what they promise like would be able to watch Amazon Prime UK. If you want a VPN that works for everthing they advertise, this is not the one."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Elliot",
          "Nb_Reviews": 10,
          "Date": "2014-12-02T12:06:08.000Z",
          "Titre": "Trouble connecting all the time",
          "Contenu": "I have been using their service on and off for two years while I travel in Asia. While they will assist, assist and assist some more, the service is just not reliable. What's more, the techs like to take over your computer and the approach of almost all the technicians is different. In some cases, I'm concerned that they are messing too much with my settings. They are friendly but in some cases need more training and the company needs to have a more uniform approach to these issues."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Alan & Carol",
          "Nb_Reviews": 20,
          "Date": "2019-10-06T12:34:30.000Z",
          "Titre": "Still no fix for VPN on the BBC",
          "Contenu": "Still no fix for VPN on the BBC, has now been months since it last worked we will be changing company when my subscription is due. Sad because they are good in all other ways and we have been with them for several years."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Chris Q",
          "Nb_Reviews": 2,
          "Date": "2020-12-07T22:00:23.000Z",
          "Titre": "I give 5 stars for service but…",
          "Contenu": "I give 5 stars for service but frequently the speed is so slow it's not usable for streaming services like NETFLIX and ESPN - the main reason I use a VPN.  Speed / QOS = 1-2 stars"
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Nick Vines",
          "Nb_Reviews": 1,
          "Date": "2017-08-26T08:56:53.000Z",
          "Titre": "Speed is frequently an issue",
          "Contenu": "Speed is frequently an issue.  I have to spend 20 minutes finding a faster server every time I need to use the VPN.  I started a chat with customer support to fix the problem and they closed the chat on me."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T03:38:23.000Z",
          "Titre": "Recently in China StrongVPN has…",
          "Contenu": "Recently in China StrongVPN has practically stopped working. Express VPN sends out emails with latest solutions, but StrongVPN leaves customers to fend for themselves. Why am I paying money?"
        },
        {
          "Note": 2,
          "Lieu": "BM",
          "Pseudo": "Glen",
          "Nb_Reviews": 2,
          "Date": "2019-07-04T20:44:21.000Z",
          "Titre": "HIT OR MISS",
          "Contenu": "Not sure whose at fault, \"BUT\" the service often prevents me fromgaining access to the content I want to watch in the USA?"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2019-06-30T17:29:32.000Z",
          "Titre": "Many of the channels I ised to receive…",
          "Contenu": "Many of the channels I ised to receive now say they're unavailable in my country even when using Strong VPN."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T22:32:59.000Z",
          "Titre": "Too many times",
          "Contenu": "Too many times, I can't connect to the place I want. I wait & wait, but it just doesn't happen"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "OB",
          "Nb_Reviews": 2,
          "Date": "2016-09-28T05:15:39.910Z",
          "Titre": "No Chat Support",
          "Contenu": "No chat support, no phone number to call anyone for support"
        },
        {
          "Note": 2,
          "Lieu": "SK",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2019-06-29T22:00:00.000Z",
          "Titre": "It no longer works on my Android Galaxy…",
          "Contenu": "It no longer works on my Android Galaxy S 9 phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maurice",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T00:20:42.000Z",
          "Titre": "I was encouraged to buy DNS and yet I…",
          "Contenu": "I was encouraged to buy DNS and yet I can't get easy and good service when I am wintering in Mexico. I am considering another company. I am in Oakland CA right now so can't do anything about the Mexico problem, I guess.Here is the transcript of my conversation (one of many) with technicians: Strong nov 21, 2018 Tema B.Ken M.👍👎Chat startedMauriceEver since I upgraded to the DNS, I cannot connect to the internet with Buffalo.Ken M. joined the chatKen M.hiwhat device are you trying to connect?Mauriceapple tvKen M.are you using a router?Mauricemy other devices like the cell do workyesKen M.I'm getting a tech for you, it may be a few minMauricetkxTema B. joined the chatTema B.HelloChecking your account, one moment please.MauriceokTema B.Are you using service for Netflix?Mauriceyes, but while I am in Mexico for the winter, the Netflix I get is the Mexican version - I was told by your company that the DNS would get me the US versionthe dns does not allow me a network connectionTema B.We have applied fix for Netflix service, now it should work fine with VPN.Netflix with DNS works only with PC/Mac web browsers.MauriceWhy was I encouraged to get DNS then?Tema B.We advice to restore your AppleTV dns settings to defaults. And run VPN on the router.Mauricenot clear how to do that - and I am also paying for DNS with you allTema B.Please revert DNS settings backMauriceis this called \"Reset all settings\"?Tema B.Where did you place DNS settings? What guide have you used to configure DNS?MauriceSome technician fron Strong told me what to do, but that was a year agoSorry I can't be clearerTema B.Please reset your Apple TV to factory defaultsMauricedoing that nowI did and chose Buffalo and the message appears that \"there was a problem connecting to the network\"Tema B.Are you connected to VPn router with your Mac?MauriceYes with BuffaloTema B.So you have internet connection through VPN router with your Mac, but not with AppleTV?Mauriceyes, and my iphone and ipad work toTema B.Try to connect your AppleTV with wireMauriceI don't seem to have the wire hereTema B.Unforchenatly there is no other solutions, since AppleTV has been reset to defaults and other devices works just fine.We can help you with further VPN setup.MauriceI guess that since your DNS does not work for me I will have to switch to another company like Smart. No?F"
        },
        {
          "Note": 2,
          "Lieu": "KW",
          "Pseudo": "Saad",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T14:38:03.000Z",
          "Titre": "Slow speeds",
          "Contenu": "Slow speeds vpn"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:19:17.000Z",
          "Titre": "It connects most of the time",
          "Contenu": "It connects most of the time. Online Help very poor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T10:46:15.000Z",
          "Titre": "The service is great and i love it BUT ...",
          "Contenu": "The service is great and i love it and ive been on it since over 7 years now when it was still IBVPN before the merging.however, it feels like your services run some sort of FUP (Fair usage policies) where if we stress it or use a pre-defined amount of data on it, it becomes slow, very slow.I myself am a penetration tester, i work with cyber security firms, everytime i need to test a client for DOS (Denial Of Service) TCP floods, the VPN turns SUPER slow until i disconnect and reconnect to another server. i dont know why a great company like StrongVPN requires FUP, but if that was the case, please fix it. if FUP was not the problem, but some other random tech causing the issue, also please fix it.Great service overall.thank you and have a great day.PS: i set a date of experience only because it was mandatory in order to send the review. however, the issue has always been there since IBVPN became StrongVPN."
        },
        {
          "Note": 3,
          "Lieu": "QA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T18:01:42.661Z",
          "Titre": "Trying to login with new mobile but…",
          "Contenu": "Trying to login with new mobile but says no network.."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T19:04:10.000Z",
          "Titre": "I have problems with the download speed…",
          "Contenu": "I have problems with the download speed when I change from my local Internet server to your Strong VPN. Depending of the server I choose with your program, the download speed goes down up to 50% of the one I get frrom my local server. Other problem I have is that when I don´t need to use sStrong VPN, I have to restart my computer. Now I found another problem, when I started today my computer I was not connected whith your program, and I had to reset my WiFi, in order to get again the download speed offered from my local supplier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T12:23:07.000Z",
          "Titre": "Dropped Connection when using StrongVPN",
          "Contenu": "I find that using StrongVPN, regardless of using \"Best Available\" or a specific US city, that I have connection fails on a regular basis. This does NOT happens when not using StrongVPN. I did purchase StrongVPN based on reviews (vs. another product) and believe using a VPN is important. Hopefully any upcoming upgrades will correct this issue."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Brian Smith",
          "Nb_Reviews": 6,
          "Date": "2019-06-28T05:49:55.000Z",
          "Titre": "Not too impressed with Strong VPN",
          "Contenu": "I have been impressed with Strong VPN for 10 years, but have been disappointed this year. Primarily we use the VPN to use the BBC I-player in Turkey. The BBC has blocked users of the VPN on numerous occasions but the 'fix' does not allow users of Windows NT to access the BBC. When I am out of the country my wife uses an old computer and cannot access the BBC."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Albert",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T12:43:19.000Z",
          "Titre": "What I like, and what I don't like about StrongVPN",
          "Contenu": "What I like about StrongVPN:* no noticeable increase in latency* no noticeable reduction of speedWhat I don't like in StrongVPN:* it tends to disconnect when I leave my pc/laptop alone for a while* on my Android phone, it only re-directs my browser traffic, not other (such as tethering (this is serious; I don't know if - for example - whatsapp, google maps and skype traffic goes through StrongVPN on my Android phone)"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Hussain",
          "Nb_Reviews": 11,
          "Date": "2022-06-30T21:54:12.000Z",
          "Titre": "It was not as FAST as I expected!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "SC",
          "Nb_Reviews": 2,
          "Date": "2019-06-27T19:13:22.000Z",
          "Titre": "Just OK",
          "Contenu": "So... they're fine. I've used them for a couple years now. HOWEVER, there are some things that just don't work sometimes: 1) A sudden drop that will break my feed, or 2) A server issue that brings a connection fail and a dialogue box, or 3) It won't work with video feed for one of the main UK-based sites I am trying to watch. Overall, when it works, it works fine, but there are a handful of ways listed above that I'd like to see better addressed. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Lawndart",
          "Nb_Reviews": 6,
          "Date": "2019-06-28T11:56:42.000Z",
          "Titre": "When it works, it's great!",
          "Contenu": "When it works, it's great.  The variety of potential cities is quite nice, and the connection is typically quite fast, enough for streaming, etc.However, on some days, the connection drops constantly, it'll be up for 5 minutes, then lose connection, reconnect, and then lose connection again.  This on/off process really brings down the average speed.This complaint aside, we haven't yet found a better service at this price, so we've stuck with them for the past 6 years."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T02:31:17.000Z",
          "Titre": "It works on and off at times in China",
          "Contenu": "It works on and off at times in China.  So not very consistent.  Also very slow and breaks off a lot.  Technical service is good but when you can not get on VPN it is very hard to contact them to help.If this continue I will have no choice but to change to another VPN provider.Also I did not like the auto renew."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T06:06:04.000Z",
          "Titre": "Unhappy after technology changes",
          "Contenu": "Following a number of happy usage years, this last year it has been almost impossible to use for TV usage from a foreign land.  Maybe the country I am in, maybe the technology being used by the TV streaming sites or maybe StrongVPN technology?  Not sure which but when I relocate in a month or so, we will try again."
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Meyrick",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T15:32:06.000Z",
          "Titre": "Can't access BBC iPlayer, ITV Hub etc",
          "Contenu": "It generally works effectively, but a number of UK based applications, e.g. BBC iPlayer, ITV Hub, are no longer accessible using StrongVPN. This is no doubt due to the blockers placed by these apps. However, other VPN providers, e.g. Expat VPN, are guaranteeing that these apps are accessible."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "王丽华",
          "Nb_Reviews": 1,
          "Date": "2015-02-26T23:44:10.000Z",
          "Titre": "Strong but not stable",
          "Contenu": "VPN is really useful and the live help are really handful,but when it comes housing itself,the app itself disconnects     a lot,and sometimes it did not work when I went to china neither on my iPad nor mac.but apart from that,this is really a great thing for me to get access to all the information throughout the whole world!"
        },
        {
          "Note": 3,
          "Lieu": "BS",
          "Pseudo": "Rodney Sands",
          "Nb_Reviews": 5,
          "Date": "2019-06-27T18:58:21.000Z",
          "Titre": "Need to upgrade ability to access…",
          "Contenu": "Need to upgrade ability to access Netflix, BBS, and ITVtired of \"You are behing a proxy server \" messages from those sites which is my primary objective in having the subscription - would be willing to pay more for an \"almost\" guaranteed working service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 2,
          "Date": "2019-06-28T15:02:28.000Z",
          "Titre": "As for the product",
          "Contenu": "As for the product, I rate it at 4 stars, Service 2 stars as the  communication is not very good. When there is a problem reported (as I had late last year),the answers given are often conflicting from service person to service person (thats a problem as well -each time you contact Strong on an issue (same issue) you get someone else, and not the same person you thought you were dealing with). last- general communication, while no news is usually a good thing It would be nice to see some type of communication that keeps the customer informed of any changes, updates new options etc.."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Manuel Enrique",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:34:40.000Z",
          "Titre": "Not working for me know",
          "Contenu": "Recently I try to used it with American websites (like HBO) and immediately they found out the proxy server and I was not able to continue. What can I do?.  The only reason I paid for a VPN is to be able to get to this places.  Waiting for your answer"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T19:29:21.000Z",
          "Titre": "I cannot access ITV from your VPN…",
          "Contenu": "I cannot access ITV from your VPN servers in UK!  You were working on this six months ago but still no progress.The work around you suggested - which was to use the DNS service - is not viable, since the carriers apply bandwidth restrictions (throttling) which stops the streaming.  The result is that the user has to pause the stream, ESC the full screen, reload the page, and then select the restart option from ITV.  This may be okay for one occurrence and hour, but some carriers do repeated stops every few minutes which destroys the value of streaming a TV show.  This is ongoing and I suspect a permanent problem - new users beware!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hussain",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:34:20.000Z",
          "Titre": "Cumbersome to log in",
          "Contenu": "Cumbersome to log in. Not user friendly. Changing passwords is not easy.  Often times takes a long time to find a server and log on. Price of $ 55 a year is too high. Other VPNs with higher quality online service offer $ 36 a year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JJ Blackley",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T16:08:23.000Z",
          "Titre": "No Renewal Reminders",
          "Contenu": "I have a problem with them not sending renewal reminders.  I noticed a charge on my statement and when I checked my email I saw NO reminder email about the upcoming charge. If I'd known/remembered, I would have canceled. Given the environment we are in, I do not need a VPN right now.  If I'd remembered about the renewal, I would have canceled before the charge. I did like their service when I got to use it, but not sending email reminders about renewals is unethical.  Best practice should be to send reminders about upcoming renewals for ALL subscription services.  We are in subscription hell these days. It's impossible to keep up with all of them...  Do better."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2019-07-01T12:06:04.000Z",
          "Titre": "I am not able to watch Netflix on my…",
          "Contenu": "I am not able to watch Netflix on my laptop. It states I have an error. I have tried to troubleshoot using the website and have been unsuccessful. So I am resulted to Netflix only on my cell phone."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Mitchell",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T15:21:35.000Z",
          "Titre": "I’ve had many problems with speed…",
          "Contenu": "I’ve had many problems with speed variance.I’ve worked with Sabai Technologies to eliminate all the variables and the last hurdle was Strong VPN.I have three accounts which I’m about to cancel."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "julie araiCustomer",
          "Nb_Reviews": 3,
          "Date": "2019-02-25T23:40:57.000Z",
          "Titre": "I am a loyal customer",
          "Contenu": "I had an issue with my service and I was able to reach someone on the chat line in real time. They fixed the problem remotely. I was very relieved to know that help was just a click away."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Delray",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:23:10.000Z",
          "Titre": "Fairly reliable",
          "Contenu": "For the most part, StrongVPN has been pretty good. I have had some problems streaming. It would not work a couple of weeks ago on the WiFi of my hotel and in the Air France lounge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Merton Watson",
          "Nb_Reviews": 4,
          "Date": "2019-06-28T10:32:04.000Z",
          "Titre": "Strong VPN runs slow way too slow ,has…",
          "Contenu": "Strong VPN runs slow way too slow ,has to be looking for stronger servers often.  So much so that I have given up on using it, hardly ever uses it much now and that's honest."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Eran Carmon",
          "Nb_Reviews": 2,
          "Date": "2021-10-20T15:07:58.000Z",
          "Titre": "Have been using Strong VPN for over a…",
          "Contenu": "Have been using Strong VPN for over a year but lately ESPN+ stooped being supported by them, will probably change VPN provider at the end of my term!"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T00:33:34.000Z",
          "Titre": "It crashes with some frequency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EdZ",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T12:35:54.000Z",
          "Titre": "good good - servers need help",
          "Contenu": "the support is good.  I wish the server performance/location was improved.  I lose over 70% of my 1 Gb bandwidth running on their servers. Firestick only sees 150 Mbps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan B",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:24:52.000Z",
          "Titre": "StrongVPN will not access DirectvNow…",
          "Contenu": "StrongVPN will not access DirectvNow and now Amazon prime here in Mexico. Don’t know why they stopped but it infuriates me because I just ordered Strong 3 weeks ago."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Gon Z",
          "Nb_Reviews": 1,
          "Date": "2009-08-17T17:02:37.000Z",
          "Titre": "Ok Service",
          "Contenu": "When I got my VPN Account with them it was kind of slow, then I try wittopia and the same it was even worst, found [link removed] and so far so good good VPN speed and service."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jim Rodgers",
          "Nb_Reviews": 1,
          "Date": "2016-04-14T10:11:41.000Z",
          "Titre": "It's okay.",
          "Contenu": "Not the best, but probably not the worst. They stopped my 24 hour direct help without telling me. Would probably have changed providers if they had told me."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2020-02-06T18:01:10.000Z",
          "Titre": "It is a good vpn but it needs to…",
          "Contenu": "It is a good vpn but it needs to support more apps like apple tvIt needs to have more options for strong dns like dallas, TX"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Majid",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T18:19:15.000Z",
          "Titre": "It’s been working well for me but…",
          "Contenu": "It’s been working well for me but lately since 10 days it keeps cutting off every minute, and it gets hard to get it back on"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T00:08:54.000Z",
          "Titre": "Frequent disconnection or connection…",
          "Contenu": "Frequent disconnection or connection problem at random time of the day when using vpn in china or speed decreased"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:35:41.000Z",
          "Titre": "It slows the speed of my downloads and…",
          "Contenu": "It slows the speed of my downloads and uploads. I appreciate the added security but not the inefficiency that is lost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wally",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T23:28:02.000Z",
          "Titre": "Ever since your company changed servers…",
          "Contenu": "Ever since your company changed servers a few months ago, I keep getting disconnected a few times a day."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Jian",
          "Nb_Reviews": 3,
          "Date": "2019-06-27T18:22:43.000Z",
          "Titre": "Connection is everything",
          "Contenu": "When I use StrongVPN in China, half of the time I couldn’t get an effective connection."
        },
        {
          "Note": 3,
          "Lieu": "NI",
          "Pseudo": "MAC",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:44:53.000Z",
          "Titre": "I like that it is very user friendly…",
          "Contenu": "I like that it is very user friendly BUT am troubled it doesn't work with Netflix."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Alfred",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T00:46:14.000Z",
          "Titre": "Takes a long time to connect in China…",
          "Contenu": "Takes a long time to connect in China and gets disconnected every now and then."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Guy",
          "Nb_Reviews": 2,
          "Date": "2019-06-27T20:00:59.000Z",
          "Titre": "Netfix does not work with it..",
          "Contenu": "Netfix was the reason we took Stron VPN.. but it does not work with it."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Simeon",
          "Nb_Reviews": 1,
          "Date": "2019-08-01T09:52:29.000Z",
          "Titre": "Review",
          "Contenu": "It's fine, sometimes ot doesn't work, but it's ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Mark Sight Stockhall",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T06:46:18.000Z",
          "Titre": "Your Android app does not work",
          "Contenu": "Your Android app does not work. More than 6 months already"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Ole",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T18:04:25.000Z",
          "Titre": "Quit often it is disconnected",
          "Contenu": "Quit often it is disconnected, when I am here in Spain!"
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "Min",
          "Nb_Reviews": 1,
          "Date": "2019-07-01T01:01:41.000Z",
          "Titre": "Not stable and cannot get connected…",
          "Contenu": "Not stable and cannot get connected recently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aidan Mcgarvey",
          "Nb_Reviews": 7,
          "Date": "2019-06-27T23:58:55.000Z",
          "Titre": "i am not sure of the subject matter"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Paco Valenzuela",
          "Nb_Reviews": 1,
          "Date": "2016-07-22T10:40:13.000Z",
          "Titre": "hard to get the service working",
          "Contenu": "slow support dosnt help at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T09:53:09.000Z",
          "Titre": "Average speed it's o.k"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T18:35:59.000Z",
          "Titre": "Good service but expensive"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Khalid",
          "Nb_Reviews": 11,
          "Date": "2019-06-28T08:58:39.000Z",
          "Titre": "Reliable and fuss-free paid VPN service",
          "Contenu": "Reliable, fuss-free VPN."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Glinys",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:21:37.000Z",
          "Titre": "This is the only VPN I have used",
          "Contenu": "This is the only VPN I have used.  Very satisfied except that when it is active, the microphone on my android products will not work. Also, Duolingo will not work when the VPN is active. Not sure if this is common on all VPN's or not"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Mouzafphaerre Postal",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T11:34:40.000Z",
          "Titre": "Strongly recommended (with minor caveats)",
          "Contenu": "I have been a satisfied and persistent customer for years. I do recommend the service despite some nuisances noted below, which should explain why I rated 4 instead of 5. But first, the positives:+ Virtually no speed drop. You hardly feel you're using a VPN bridge+ Wide range of servers to pick from around the world, although that bit is open to improvement (no servers in Japan, for instance).+ Stable, seamless, efficient connection. With the help of the client automatizing the switch, you don't have to worry about micromanaging your connection settings. Even if the client fails, your native connection is simply restored without a hassle.+ Good customer service and long-time customer benefits.And now why I give 4/5 instead of full honors:- Occasional, admittedly infrequent downtime. It doesn't happen too often but when it happens, it happens.- Recent price rise. The US thinks it has an inflation problem. Those of us who have become used to living under constant hyperinflation and devaluation policies are laughing. Sorry for not being able to empathize.- Clunky interface. You can only turn off the client from the system tray (which is a downgrade from earlier versions a few years ago) and sometimes, if thankfully not very often, it silently crashes."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Lunda Wright",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T22:47:35.000Z",
          "Titre": "I love the multiple country options as…",
          "Contenu": "I love the multiple country options as well as the multiple device sign in. Then in, it is fast and a steady connection when it is successfully running. The only downside is that, from time-to-time, it fails to assign an IP address. This can be frustrating in a pinch. To solve it, I sometimes end up restarting the application several times or, when that doesn't work, I restart my laptop."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ruth",
          "Nb_Reviews": 4,
          "Date": "2023-03-29T22:41:10.000Z",
          "Titre": "The customer service is excellent",
          "Contenu": "The customer service is excellent - very efficient and responsive. The only frustrating part is sometimes not being able to access various channels and a note that comes up saying \"your internet details have changed\" (or something like that). What seems to happen is I leave it and go back the next day and it is fine but can be frustrating. I've tried changing browsers but that doesn't seem to help. Fortunately it isn't very often but still annoying!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-04T20:51:40.000Z",
          "Titre": "Good technical support from Ruth",
          "Contenu": "Good technical support from Ruth, Josh and Eugene... Changing server locations to maintain service from US based streaming providers is a bit complicated and requires some knowledge of routers; that process could be improved to make it a simple click function...Regards,Dave M"
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "GC - Rashid Breedy",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T21:04:23.000Z",
          "Titre": "I like that I can watch Hulu, but...",
          "Contenu": "I like that I can watch Hulu, Amazon Video and Google Video with no issues. But I don't understand why they still recognize that I am in another country. Actually there are sites that said this content is geographical restricted. So it is not allowing me access all US content. So it is like you have to activate whatever feature this is to let me see content from different apps or sites. For example Google always knows I am in Costa Rica and not in US."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry, K C Enterprises USA LLC",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T16:13:18.000Z",
          "Titre": "We have been with StrongVPN for many…",
          "Contenu": "We have been with StrongVPN for many years now and they have always done great work and provided super service.  Only suggestion would be a little quicker response to non-emergency support tickets, but then again not a big item of concern.   If you are looking for a hosting company with great service, this is one of the best.  We have been on the web for over 30 years and have had our share of non-responsive hosting companies so take our word you could do a lot worse and spend a whole lot more money with someone else."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan Clarke",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T06:20:01.000Z",
          "Titre": "Overall a satisfactory and reliable…",
          "Contenu": "Overall a satisfactory and reliable product with first class support, However have recently experienced the connection being dropped and slow download speed. Occasionally have been unable to contact VPN server but suspect this is due to my location (China)"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Thierry Le Pennec",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T08:31:48.000Z",
          "Titre": "Give a 4 stars",
          "Contenu": "Give a 4 stars. Easy to use.Good connectionPrice reasonable Phone app is very goodFor the  missing star:IPv6 address wasn't hidden May it's done now"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexis Vanlandingham",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T18:43:53.000Z",
          "Titre": "A crucial part of security on any device.",
          "Contenu": "I absolutely love this service. I use it for both my Android phone and my Windows laptop in both have just been wonderful to integrate this VPN with. I love all the step by step instructions that you guys have on your website really helps novices be able to understand what to do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adani Simkin",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T18:41:04.000Z",
          "Titre": "Why Flag does Not cgange",
          "Contenu": "usually i like all services.Recently i had something strange that happen to me. Been at israel and been at USA. So i tlak about both of them because its similar event.What happenBeen at israel i try to turn the VPN into a USA location, but the flag of Israel has Not changed (flag should change to USA one) i tried some other countries but flag stay Israel one.The same happen to me at USA when tried to VPN of other countries flag stay USA.i hope i explained the issue as simople as i could."
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "John Sands",
          "Nb_Reviews": 3,
          "Date": "2022-09-09T07:19:09.000Z",
          "Titre": "John Sands’ review",
          "Contenu": "The VPN is excellent and very effective. My only problem is the increased price which makes thisVPN costly when compared to some others."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "Kuo Hapo",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T06:14:02.000Z",
          "Titre": "Overall good experience, but speed coul be faster",
          "Contenu": "Overall good experience...Although the speed could be faster....Still in my opinion slower than what it should be"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T20:26:28.000Z",
          "Titre": "Very happy with the service provided",
          "Contenu": "Very happy with the service provided, I have been with the company for a few years and have never had any problems."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DW",
          "Nb_Reviews": 3,
          "Date": "2022-09-23T18:28:24.000Z",
          "Titre": "Good reliable service",
          "Contenu": "Good reliable service, easy to use, great response time, many choices of portal."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Grant Christie",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T08:08:22.000Z",
          "Titre": "Easy to reveal either through the chat…",
          "Contenu": "Easy to reveal either through the chat feature, I did the chat at 4.30am NZ time as I was watching Formula one and I was helped promptly. Thanks again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-07-20T18:28:43.000Z",
          "Titre": "Very Reliable",
          "Contenu": "This has been a very reliable service. No problems in the last few YEARS!Very pleased, good price. Gave you an 8. Can't give you a 10 as that would leave nothing to strive for.Keep up the good work."
        },
        {
          "Note": 4,
          "Lieu": "OM",
          "Pseudo": "DR. ELMO M. PURPURA",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T06:45:06.000Z",
          "Titre": "The service is very good",
          "Contenu": "The service is very good! However, there are a few times my VPN is NOT working right away."
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Rosie Kam",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T18:24:11.000Z",
          "Titre": "Easy and fast access",
          "Contenu": "Like the easy app, and use frequently and every time works great"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T22:25:31.000Z",
          "Titre": "Sometimes it crashes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg.",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T18:18:53.000Z",
          "Titre": "Having Router Wiregaurd Protcol."
        },
        {
          "Note": 4,
          "Lieu": "MU",
          "Pseudo": "Wassim Sookia",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T08:07:57.000Z",
          "Titre": "Reliable",
          "Contenu": "Very reliable and secure with an excellent customer service."
        },
        {
          "Note": 4,
          "Lieu": "BM",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T16:16:31.000Z",
          "Titre": "I have found Strong VPN effective for…",
          "Contenu": "I have found Strong VPN effective for the most part and response time to queries has been really quick and pertinent.I do find that if I have not used any links for a few days I need to check the service,  update my region and confirm my addres as if it is a newly registered address.  The reconnection takes about five minutes sometimes more to sync."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AVF",
          "Nb_Reviews": 1,
          "Date": "2020-10-04T17:15:26.000Z",
          "Titre": "VPN was a new technology for me and…",
          "Contenu": "VPN was a new technology for me and Strong VPN turned out to be easy to set up  and has, for the most part (90%), been reliably useful.  I will say, out of fairness to Strong VPN, that my difficulty with connection was in some remote places in Eastern Africa.  Every time I see 'VPN' next to the WiFi signal, I do react with a sigh of relief - all is good!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2020-03-31T18:49:37.000Z",
          "Titre": "Top Notch service",
          "Contenu": "Top Notch service. I would to service is fantastic,  any issues whether is be bill , technical or customer service related strong Vpn is on the ball. Have been using this for more then 10 yrs & have recommended to most of my friend & family who were having issues with other side not doing what actually say or constantly losing the vpn service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "I Tell’ya This",
          "Nb_Reviews": 1,
          "Date": "2019-11-27T19:22:57.000Z",
          "Titre": "Reliable VPN with Excellent Support",
          "Contenu": "I have used StrongVPN for about 8 years. First subscribed when I went to work in the Middle East and wanted a secure connection for financial transactions. Works flawlessly almost all the time. Would rate at 5 stars except I have had 3 or 4 occasions in the past 6 months when I simply could not get a connection. That’s unusual though. This is not the only VPN I have used, but it is the only one I have recommended."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Frederick Kilgore",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T00:10:06.000Z",
          "Titre": "StrongVPN Review",
          "Contenu": "I've been a subscriber of StongVPN since February 2013. The service quality and in particular the technical support is very good & what retains me as a customer. The only reason for not giving ⭐⭐⭐⭐⭐ is that I hope it inspires all at StrongVPN to continue to improve & aim to be the best at what they do.Sincerely, Frederick Kilgore"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T18:30:39.000Z",
          "Titre": "Service has been good but not happy I have to do a reconfiguration",
          "Contenu": "The service has been easy to work with and was reliable. The recent change to a new server that required reconfiguration however is a  problem for me as I am not at the house that utilized the service and will not be able to do anything about it till I return in late September.If it proves difficult to reestablish the VPN when I return I could end up dropping the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Smith",
          "Nb_Reviews": 6,
          "Date": "2019-06-27T18:25:12.000Z",
          "Titre": "For the most part StrongVPN and its service are excellent.",
          "Contenu": "For the most part, StrongVPN is an excellent product.  If something goes wrong, their customer service is also excellent.  One area needing improvement is the start-up icon.  Crank up your PC, then Strong appears, and usually connects to the site you've last chosen.  But then you have to manually \"X\" it out.  It should appear, connect, then disappear -- automatically.I unequivocally recommend this product."
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T00:37:15.000Z",
          "Titre": "I am happy with the service.",
          "Contenu": "I am happy with the service.I have used it for a few years now.I reside in China as a westerner so the VPN is always under attack.I had a lot of issues connecting or dropping out until I was giventhe information to manually set up. Since then rarely any problems.I use a pc desktop. A laptop , an iPhone and an IPad.Please keep getting me over “the Great Firewall”."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TracyB",
          "Nb_Reviews": 2,
          "Date": "2019-06-27T21:03:15.000Z",
          "Titre": "Between 4 & 5 STARS",
          "Contenu": "Frankly, my rating should be between 4 and 5 stars, but I can only select one of the other.  Since I subscribed, I have had great service from StrongVPN.  It's easy to use, it was easy to install and when I've had issues, Customer Service was always available to Chat and help me resolve any issues.I don't foresee changing to any other VPN any time soon."
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "Rodney Sands",
          "Nb_Reviews": 5,
          "Date": "2019-06-21T11:46:15.000Z",
          "Titre": "I've been using this service for nearly…",
          "Contenu": "I've been using this service for nearly 10 years.Service is excellent,  Not a 10 because it often fails to access BBC, Net Flicks, or ITV.  I recognise that those channels actively search out and prohibit VPN access so a 9 versus a 10.If any more services start to recognise that the VPN is a VPN, my feeling is that the service will no longer meet the objectives,  Am hoping you can surmount this issue with some enhancement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fletcher",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:46:12.000Z",
          "Titre": "Best VPN I've tried (and I've tried at…",
          "Contenu": "Best VPN I've tried (and I've tried at least a half dozen). The only drawback is the occasional inability to send emails (Thunderbird) while using the VPN. It is necessary to exit the program, then send, then restart the VPN. This is true of all the VPN services I've tried. (Receiving emails is not affected by StrongVPN). StrongVPN is fast to access, and does not seem to impact computer speed negatively. It is easy to use the settings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T00:45:22.000Z",
          "Titre": "l feel pretty much secure with StrongVPN, and would recommend it to others.",
          "Contenu": "I feel secure with StrongVPN, and would recommend it to others. My only issue(s) is when using OpenVPN, if the connection drops, it will never reconnect unless I kill the StrongVPN app then restart. It re installs TAP and then says press connect. Pressing connect does nothing. It's worth mentioning that all other protocols work consistently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Michael",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T16:45:32.000Z",
          "Titre": "Strong VPN great on mobile, less so on the desktop.",
          "Contenu": "Strong VPN loads and holds on my smartphone well. I feel more secure knowing my actual IP is blocked as I make use of my mobile device. On my desktop, Strong VNP sometimes disconnects. I make a habit of monitoring it. Sometimes remote site access is blocked because of security settings in either Strong VPN or the customer's access protocol. Also, if I am on Strong VPN, and use a customer VPN before I RDP, I have to disconnect from Strong. This is not a complaint, only an observation."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paulo",
          "Nb_Reviews": 29,
          "Date": "2019-06-27T17:45:02.000Z",
          "Titre": "I use StrongVPN when overseas to access UK",
          "Contenu": "I use StrongVPN when overseas to access UK based websites and it always works flawlessly apart from a recent issue with the BBC iPlayer although that has now been resolved (hence 4 stars as I'm not sure whether this will become a recurring issue). StrongVPN works so much more reliably than other VPN's that I never use any other."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "paddy o'reilly",
          "Nb_Reviews": 2,
          "Date": "2019-06-17T21:13:44.000Z",
          "Titre": "I have used StrongVPN for about 6…",
          "Contenu": "I have used StrongVPN for about 6 years, mostly in China but also in other southeast asian countries. The product itself has been reliable but by far the most impressive element of the service has been the always prompt and efficient responses from tech support for a barely semi-literate (me!) in the techno comms world"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2019-07-05T02:30:51.000Z",
          "Titre": "On most occasions works well",
          "Contenu": "On most occasions works well. Only problem I have is that when connected (maybe just to UK site - not sure as not tried email through other locations) my apps tend to think I am in UAE so when log into my gmail it is in Arabic.I don't think it is gmail problem as it only happens when I an logged in to Strong VPN"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Maurice",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T08:01:47.000Z",
          "Titre": "It seems to slow down internet if you…",
          "Contenu": "It seems to slow down internet if you hit the wrong server.  It would be nice if it automatically hooked you up to the fastest server it has available, without having to manually search for it yourself.  That can be quite time consuming, if you need a fast speed, If that was fixed, I'd give it a 5 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reynaldo",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T23:00:14.000Z",
          "Titre": "Excellent Technical support!",
          "Contenu": "Excellent Technical support!From time to time, signal is lost at night (3 times this year) for no aparen reason, and it's back by itself in the morning, WiFi hast strong signal, but no connection. I know this because my local router is the only one working. Not sure what is the problem."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "John Crewe",
          "Nb_Reviews": 3,
          "Date": "2016-10-06T00:51:50.000Z",
          "Titre": "Use on Asus Router",
          "Contenu": "Although Strong VPN don't provide customer support on Asus routers using original Asus firmware their customer support did provide details to successfully set this up. It is now really easy to turn on and off on the router.I have heard however from a close friend that Strong VPN released his details to the content owner after he had downloaded a movie via a bit torrent site. Very worrying if this is the case seeing that Strong VPN  state that they don't keep any logs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Morgan",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T18:11:45.000Z",
          "Titre": "So far, real good!",
          "Contenu": "So far, so good.I've used StrongVPN now for over two weeks and I'm upping my rating to 4 stars. It would be 5 stars except it's not exactly the kind of thing a newbie computer user would have an easy time with installation. I had to use the chat feature and ended up talking to 3 different techs before I got one who could cut through my confusion (and I kept my cool during the whole session) and helped me get it installed and working. So, thanks to that, it's running great and it doesn't appear that any URL I navigate to can detect it's a VPN...but maybe, hard to tell. Most of them, it sails right through."
        },
        {
          "Note": 4,
          "Lieu": "BB",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T13:38:29.000Z",
          "Titre": "Totally and 100% Satistied",
          "Contenu": "I have tried other VPN and have even switched from StongVPN to try others but I have realised that  have the best experience with Strong and i have retuned to them  and have been using for over 5 years. I usually only do 3 months at a time with the others to test but i signed up with strong for 1 year stints and they have not failed me yet.... Whenever i have an issue, it is quickly resolve regardless of the time i report.. excellent support who  work with you until your issue has ben resolved no matter how long it take.. Two thumbs Up.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chiew Liang",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T03:52:54.000Z",
          "Titre": "The performance of StrongVPN is not…",
          "Contenu": "The performance of StrongVPN is not very stanble in China.Sometimes the connection will disconnect automatically when I use it half way and even the StrongVPN icon disappeared when use it on mobile phone, sometimes it is very hard to connect to StrongVPN.Others are so far so good."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Laura-mae Gullin",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T13:47:53.000Z",
          "Titre": "I spend a lot of time in the Caribbean…",
          "Contenu": "I spend a lot of time in the Caribbean and strong VPN always proves super reliable.  I had reason to contact customer service for some advice a couple weeks ago and it was quick and spot on!!!  I'm a very satisfied customer and would recommend it for those who travel especially."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Bayle",
          "Nb_Reviews": 7,
          "Date": "2019-06-27T18:55:31.000Z",
          "Titre": "When it works",
          "Contenu": "When it works; which to be fair is most of the time and when it doesn't the help desk really does help, it's terrific.  It's just that sometimes it won't load and then I have to re-start the laptop which is bit of a pain.However, I wouldn't be without it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr. Andrew Vickers",
          "Nb_Reviews": 14,
          "Date": "2019-06-27T20:23:10.000Z",
          "Titre": "My only beef is that I try to use the…",
          "Contenu": "My only beef is that I try to use the VPN to watch UK tv whilst abroad. There is no problem with ITV Hub, Channel 5 Player etc but BBC iPlayer often doesn’t work . I think that’s because the are quick to recognise the IP addresses of VPN companies and know that I am not in the UK. In fact, if I am in the UK and have the StrongVPN on, it won’t let me watch iPlayer content. If I contact StringVPN about this, I often have to go through quite prolonged measures to allow me to use my VPN but this is only transient and after a few days or even hours, I’m back to square 1."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "frans Olgers",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T18:39:19.000Z",
          "Titre": "It's OKE",
          "Contenu": "It works without problems and enough speed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kuo",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T19:47:30.000Z",
          "Titre": "StrongVPN is easy to use on iOS",
          "Contenu": "StrongVPN is easy to use on iOS. I use primarily devices by Apple. It is engaged on-demand when connected to non-whitelisted WiFi. However, it is not exactly Mac friendly. I had to uninstall it from my MacBook Pro, because it produces some weird problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Lenaghan",
          "Nb_Reviews": 2,
          "Date": "2019-06-28T15:28:52.000Z",
          "Titre": "I've been a StrongVPN user for about 6…",
          "Contenu": "I've been a StrongVPN user for about 6 years using both StrongVPN and StrongDNS services.I have been very satisfied with their service and support with one exception. We know that a number of websites try to block VPN access, some with more success than others. For example, BBC iPlayer access via StrongVPN was blocked for over a year - the only way I found out it was unblocked was through an exchanges on a  support ticket that was about BBC iPlayer access via StrongDNS. It would be nice if there was a way of signing up for alerts on known issues like this instead of having to open support tickets"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dolores Perricone",
          "Nb_Reviews": 1,
          "Date": "2019-09-09T14:55:29.000Z",
          "Titre": "Love the protection that VPN provides…",
          "Contenu": "Love the protection that VPN provides and glad to have it.My only issue is that it seems to turn itself off even when the phone remains in service.Easy to reconnect but there is sometimes hours of delay before I notice that the logo is not showing"
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "Geoffrey Barnett",
          "Nb_Reviews": 3,
          "Date": "2019-11-21T03:51:26.000Z",
          "Titre": "I have got this request a second time",
          "Contenu": "I have got this request a second time. I repeat, speed n connection good most of the time. Recently it has improved. My problem is still no access to BBC iPlayer and has been for many months. When I say I am located in China, no assistance offered."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Daniel Kotlikov",
          "Nb_Reviews": 2,
          "Date": "2016-09-29T01:15:04.000Z",
          "Titre": "Works in China",
          "Contenu": "While I had my snags with StongVPN, their support is very good. Even when a certain configuration stops working, their techies assist and change things on their side to make things work from China. Its not as cheap as other services, but the support alone is worth it."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Olorunmowaju Damilola",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T12:27:32.000Z",
          "Titre": "Olorunmowaju damilola Oluwaseun",
          "Contenu": "Olorunmowaju damilola Oluwaseun opay 7048086189"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Nils Ingve Svanberg",
          "Nb_Reviews": 7,
          "Date": "2020-07-07T21:13:48.000Z",
          "Titre": "Great VPN experience",
          "Contenu": "Great VPN experience, 5 out of 5, DNS to access BBC in the UK has however been variable.  Another plus is that you are accessible on the chat for help.  I would recommend this service to anybody looking for reliable and fast service"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Sahir Siddiqui",
          "Nb_Reviews": 8,
          "Date": "2016-05-07T10:51:50.000Z",
          "Titre": "easy & convenient to use",
          "Contenu": "Easy to use app to configure the VPN settings in iOS.  It allows you to easily switch servers, and then installs all the certificates, policies etc that iOS requires - and also saves the server name, username & password.   Overall - very nice and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daryl",
          "Nb_Reviews": 3,
          "Date": "2019-06-27T18:32:39.000Z",
          "Titre": "I use StrongVPN during my extensive…",
          "Contenu": "I use StrongVPN during my extensive international travels.  Most of the time, it works without any issues.  I am thankful for the protection it provides--especially when I am working in countries renowned for extensive hacking communities."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T15:39:38.000Z",
          "Titre": "Doesn’t work on some sites",
          "Contenu": "I use strong vpn when I amIn Mexico to access US IP. However, several movie sites like Netflix and prime video areAble to find that I am not in US, so strong vpn DOES NOT work as well as I would like. I amLooking at changing VPN.."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Adel",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T18:55:21.000Z",
          "Titre": "I'm still using strongVPN client for…",
          "Contenu": "I'm still using strongVPN client for windows Version 1.6.1 because its allow me to connect using PPTP protocol Client version 2.2.1.0.818dacb does not have PPTP. I hope to see PPTP available in all of your clients.Regards"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T23:55:43.000Z",
          "Titre": "I would give Strong VPN a five if it…",
          "Contenu": "I would give Strong VPN a five if it could be configured to be used with a smart tv!  Other than that, SVPN is intuitive and highly reliable with low latency. Great product and worth the money especially since I'm overseas."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Seiichiro",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T00:54:35.000Z",
          "Titre": "I live in japan and strong VPN works…",
          "Contenu": "I live in japan and strong VPN works fine from japan but sometimes I travel to CHINAI couldn’t connect strong VPN from China I know VPN is restricted IN CHINA but is there another way to connect ?Thank you for advice"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alireza",
          "Nb_Reviews": 2,
          "Date": "2019-06-28T13:14:24.000Z",
          "Titre": "so far even if I had an issue regarding…",
          "Contenu": "so far even if I had an issue regarding the geographical restriction strong VPN able to solve the issue I am happy with service they providing for me for past few years and that's the reason I stayed with this team"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:42:25.000Z",
          "Titre": "Works great but cannot get the app to…",
          "Contenu": "Works great but cannot get the app to connect on demand on the desktop version.  On iPhone can click the button to do this but does not work and then can't connect unless I turn the button off.OTHERWISE i LOVE IT."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "baglady1955",
          "Nb_Reviews": 2,
          "Date": "2019-06-27T18:29:04.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use, reliable in the US. Problems overseas in airports and some public spaces with open wi-fi, but no problems with password-protected wi-fi. Transparent billing and ability to start and stop service is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "whenphysicsfails",
          "Nb_Reviews": 1,
          "Date": "2016-06-10T21:16:49.000Z",
          "Titre": "Great Service",
          "Contenu": "Had some issues with servers overseas. Overall great app/service. Most impressed with StrongVPN's customer service. Absolutely blew me away. Very quick response time and people responding had great knowledge and patience."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Tara",
          "Nb_Reviews": 2,
          "Date": "2019-06-27T17:42:57.000Z",
          "Titre": "Love the service and the way they treat…",
          "Contenu": "Love the service and the way they treat their custs. Just wish when using the vpn for countries other than US that they would work a bit better. Japan and australia never work and the UK is more like 50/50."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Steve Oakes",
          "Nb_Reviews": 7,
          "Date": "2020-05-18T21:03:50.000Z",
          "Titre": "Good service and great servers",
          "Contenu": "For the most part, strongvpn has a consistent strong signal through its different servers. The customer service is great and quick. If you use the 24 hour chat the service is even easier and faster."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:51:39.000Z",
          "Titre": "Great program...yes there's a but...if…",
          "Contenu": "Great program...yes there's a but...if I let it run for too long while downloading it likes disconnecting. That's when I get ISP warnings but when it doesn't disconnect I don't get any."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T13:58:03.000Z",
          "Titre": "Servers sometimes go down with no warning",
          "Contenu": "My only concern is that a bit too often the servers go down with no warning.  Sometimes just the one you're using, sometimes it seems all of them.  Otherwise I love it.  ABSOLUTELY no lag at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David P",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T22:35:29.000Z",
          "Titre": "Always there",
          "Contenu": "Always worked. If and when which is seldom we have a problem they fix it. If they can right away they tell you but they get it fixed pretty soon. Good service keeping on top of the changes that come."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T00:57:22.000Z",
          "Titre": "Good solid service",
          "Contenu": "Good solid service.   It just works. The one time I had a problem, the tech support chat tool provided the help I needed and stayed online with me until I made the recommended adjustments."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Donovan Grynn Luhila",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T19:38:09.000Z",
          "Titre": "StrongVPN has delivered on promise.",
          "Contenu": "StrongVPN has delivered on its promise - it has worked consistently. And on the few times that it didn't work, a call to the support centre has very quickly led to a resolution of the problem."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Nana khadija Ahmad",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T09:20:04.000Z",
          "Titre": "Good morning"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Grant",
          "Nb_Reviews": 2,
          "Date": "2019-07-16T15:40:38.000Z",
          "Titre": "I've found the VPN easy to use",
          "Contenu": "I've found the VPN easy to use and not a bad price, would like it to be the price I signed up for and not find it has increased after it was auto renewed which I also didn't agree to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:04:23.000Z",
          "Titre": "Great support"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ethan123",
          "Nb_Reviews": 1,
          "Date": "2016-09-29T17:12:42.238Z",
          "Titre": "Works great, however not with all websites",
          "Contenu": "The VPN itself works flawlessly and is perfectly speedy, unfortunately however, some services are starting to block known VPN providers (including this one) such as Hulu, Netflix and FoxSportsGo."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Richard Pinard",
          "Nb_Reviews": 3,
          "Date": "2020-05-01T06:07:09.000Z",
          "Titre": "What is good for me from Strong VPN is…THE VERY GOOD TEXHNICAL SUPPORT",
          "Contenu": "What is good for me from Strong VPN is the level of technical support..this has improve especially over the past few months.I drastic improvement from the time prior to that"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Bin Dorim",
          "Nb_Reviews": 1,
          "Date": "2019-09-13T08:58:21.000Z",
          "Titre": "Very good support",
          "Contenu": "Very good support, got help any time I needed  it.Can recommend the service. sometimes you have to switch to another city, which is inconvenient. So only 4 stars out of five."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:52:23.000Z",
          "Titre": "Mixed",
          "Contenu": "While having the VPN is helpful, it seems to slow down the internet, reduces the band width. Because of this, I will sometimes disconnect, just to have more band width."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Alan & Carol",
          "Nb_Reviews": 20,
          "Date": "2019-08-31T07:20:21.000Z",
          "Titre": "VPN not working for the BBC",
          "Contenu": "Further to my last review for StrongVPN like other people on Trust pilot we have encountered several problems since then on trying to access the BBC I player the VPN stops being effective and it has now been 2 weeks and we are still awaiting a fix. As this was the prime reason we signed up for a VPN it is obviously very disappointing. The customer support service team are always very helpful and quick to respond but at the moment we keep getting the same response “we are currently working on it”. Over the years that we have been customers we have recommended our friends and relatives to StrongVPN who have also signed up but unfortunately they are also having the same issues and are now reviewing their options also. We wish StrongVPN all the very best as they have given us excellent service up to now but we need more stability for our BBC connection."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Graham",
          "Nb_Reviews": 1,
          "Date": "2019-06-30T12:37:52.000Z",
          "Titre": "Flexibility of countries for VPN",
          "Contenu": "i want to have a more up to date version that allows me more flexibility to have VPN in other countries so that i can experience not just the ones that i am close to."
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T23:42:26.000Z",
          "Titre": "Great speed and rapid response from…",
          "Contenu": "Great speed and rapid response from customer service! However, the company should regularly check the connection issue from China and fix the firewall problem asap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Valdez",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T19:43:58.000Z",
          "Titre": "Strong vpn is great",
          "Contenu": "Strong vpn is great! I only rated 4 stars just because occasionally my VPN disconnects on it's own. So frequently keep checking to make sure I'm connected."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Mr Stromquist",
          "Nb_Reviews": 2,
          "Date": "2019-06-29T10:40:01.000Z",
          "Titre": "I surf behind the Great Firewall",
          "Contenu": "I surf behind the Great Firewall.  StrongVPN has been a lifesaver for me. The service has been very responsive to my help requests when the Great Firewall has succeeded in blocking ports and interrupting services, by providing more robust configurations, currently OPEN VPN FTP protocol.  It's a challenge to connect at times, and often requires a reboot to clear caches before a connection is possible, but once connected on OSX Mojave, the service is locked in.  IOS IKEv2 protocol is more variable, slow to connect, and generally only good for 1-2 minutes before disconnecting.  I use StrongVPN interchangeably with a SSL (socks) proxy server giving me the security of always being able to contact StrongVPN through the Socks host and vice versa for service.  I am satisfied with the StrongVPN service except for the IOS version, and a customer continuously for ~6 years."
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "Yang",
          "Nb_Reviews": 2,
          "Date": "2019-06-28T02:40:32.000Z",
          "Titre": "Sometimes it’s still blocked by Chinese…",
          "Contenu": "Sometimes it’s still blocked by Chinese government and hard to open the vpn for browsing. And always hard to use vpn on mobile devices such as iPhone in China."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen L",
          "Nb_Reviews": 10,
          "Date": "2021-04-16T16:23:00.000Z",
          "Titre": "Generally good and quick customer…",
          "Contenu": "Generally good and quick customer service. Occasionally experience issues with the service but just need to change type of vpn channel to fix it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ra",
          "Nb_Reviews": 1,
          "Date": "2016-06-25T12:44:56.000Z",
          "Titre": "Strong vpn",
          "Contenu": "Excellent softwear works on all types of apps such Netflix Hulu and soWill keep renewing my membershipI strongly everyone to use it and get the benefit of this app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tish",
          "Nb_Reviews": 2,
          "Date": "2019-06-30T19:24:12.000Z",
          "Titre": "I love it.....however to have to…",
          "Contenu": "I love it.....however to have to remember to connect EACH time I want to use my computer is difficult. I don't know why it can't stay connected."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Anita",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T20:06:58.000Z",
          "Titre": "I love it",
          "Contenu": "I love it.  Except I was getting Amazon Prime fro just a month and now not at all   I am a member of Amazon Prime in the USA but I’m in Mexico a lot now"
        },
        {
          "Note": 4,
          "Lieu": "AL",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2021-03-11T08:09:42.000Z",
          "Titre": "Good VPN",
          "Contenu": "Good VPN provider for a fair price. Takes a little while to connect to sometimes, but trying a different server usually resolves this issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2019-07-05T16:05:12.000Z",
          "Titre": "Sometime the site appears to be down…",
          "Contenu": "Sometime the site appears to be down and unable to log onto. Generally, these are very limited times and usually can log on shortly after down time."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Alan S",
          "Nb_Reviews": 2,
          "Date": "2016-05-15T11:59:46.000Z",
          "Titre": "Good customer service.",
          "Contenu": "Good customer service, especially patient when things get complex.Speeds are goodEasy and cheap to swap servers.Little technical knowledge required."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T16:40:40.000Z",
          "Titre": "Pros and cons",
          "Contenu": "The advantages:1. The price is much affordable than the competitors: AstrillVPN and ExpressVPN.2. Now comes with 250 GB of SugarSync® Secure Storage which is a big plus.4. SugarSync® works fast enough and doesn't require a VPN in China.3. The online customer support works with very high efficiency.The disadvantages (only for connections from China):1. The VPN connection speed is not always stable compared with the competitors.2. The newest version of the app doesn't work for China, we only use the old one.3. The old version of the app is a little old school, if you use it with an Android TV, you will need a mouse to navigate, while the new version used to work ok with the remote controller buttons.4. Split tunnel is not available. If you connect the VPN from China, the Chinese websites/apps will not work well, and if you don't connect the VPN the other international websites/app will not work well. So you have to switch on and off manually all the time."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bertil Frohling",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T05:34:00.000Z",
          "Titre": "it is exellent and easy and can see a…",
          "Contenu": "it is exellent and easy and can see a future for strongvpn just getting better and better Many regards to yous all and stay safe and happy"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Reza",
          "Nb_Reviews": 1,
          "Date": "2020-02-16T22:19:54.000Z",
          "Titre": "I’m using this VPN for5 years and…",
          "Contenu": "I’m using this VPN for5 years and totally satisfied because its very easy to use with no interruption and minimal effect on your speed."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Thompson",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T03:02:28.000Z",
          "Titre": "I've been using StrongVPN since 2012",
          "Contenu": "I've been using StrongVPN since 2012. My primary use is for streaming Netflix, Hulu & F1TV. I'm still unable to get Amazon Prime US working, had to get PureVPN to get that working.Lately I have been using the VPN mostly on my Amazon FireTV 4K. I'm sure with all the data you are aware that most of your users are using the VPN for streaming services. One grievance I have - I wish you would help us more with Netflix blocks, I wish you had a way to collect quick feedback from customers when Netflix can identify the VPN from a server or city and you can refresh the IP's quicker.One other small feedback, please tweak the UI of the FireTV 4K app a little. The timer and the IP address is always a little covered because its too much in the corner.Overall I rely on your service heavily, your support staff has always been great but I wish you'd make things a little better for streamers by collecting quick feedback when Netflix starts identifying VPN's."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Ivan",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T06:53:51.000Z",
          "Titre": "The application works wonders in Europe…",
          "Contenu": "The application works wonders in Europe but is poor in China. It often fails and works only after multiple tries on different locations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ezra",
          "Nb_Reviews": 1,
          "Date": "2019-07-07T12:08:30.000Z",
          "Titre": "I really love using StrongVPN",
          "Contenu": "I really love using StrongVPN. However, it has dropped a couple of times without me knowing that is why I didn't give it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Julene Powell-Wright",
          "Nb_Reviews": 1,
          "Date": "2018-12-23T10:02:28.000Z",
          "Titre": "It does what I need it to..",
          "Contenu": "I've used StrongVPN for a year. It does what I need it to. A few buffer issues here and there but nothing major. Thanks StrongVPN."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2019-06-28T02:56:32.000Z",
          "Titre": "Super customer service",
          "Contenu": "Super customer serviceGood productDevelopers cannt seem to get china working but competition does.  Quite happy with product"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Happy Minwalla",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T18:04:29.000Z",
          "Titre": "I have tried several VPN providers but…",
          "Contenu": "I have tried several VPN providers but strong VPN is in my mind the most trustworthy and reliable. I have stopped looking at other VPN."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alvin D Easterday",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T08:48:24.000Z",
          "Titre": "VPN never disconnects Very fast online…",
          "Contenu": "VPN never disconnects Very fast online help via Teanveiwer  when I need help  As of the moment two thumbs up for Strong"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVEN  VAN BEEK",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T18:05:09.000Z",
          "Titre": "Feedback",
          "Contenu": "I thought I'd already answered your survey. If no, it works, I presume since I wouldn't know if it didn't. Your support is good."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T19:01:24.000Z",
          "Titre": "It's very easy to connect and very…",
          "Contenu": "It's very easy to connect and very reliable. We never have issues using it or getting technical problems. And it's not too expensive given the quality you're getting in service. I always recommend it to my friends."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T11:23:45.000Z",
          "Titre": "Strong VPN has a prompt support team…",
          "Contenu": "Strong VPN has a prompt support team along with a friendly platform."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alan B. Cranford",
          "Nb_Reviews": 12,
          "Date": "2023-10-15T05:16:43.000Z",
          "Titre": "USE STRONG VPN TO KEEP YOUR SANITY WHILE OVER SEAS!!!",
          "Contenu": "I have used Strong VPN since my first teaching experience in China - which enable me to follow my NASCAR races weekly.. on the next trip, Strong VPN allowed me to watch in sequence ALL of the Matlock PI episodes.Strong VPN has always had \"customer service\" that out performed ANY other internet company, not just VPN services but ALL services. I can find cheaper VPN services today BUT NOBODY can match Strong VPN's CUSTOMER SERVICE!  I HAVE USED STRONG EVERY DAY SINCE 2013!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rahul",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T07:46:07.000Z",
          "Titre": "Been using StrongVPN since 2016",
          "Contenu": "Been using StrongVPN since 2016. Has never let me down. A true no-log VPN service. Priced extremely well, and has incredible customer support. Apps available for all platforms. Servers available in a large number of countries. Very highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stella Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T21:59:12.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I called the Help Line and spoke with Ken who is knowledgeable and was exceptionally patient in assisting me in reactivating my Strong VPN account. Ken provided the information I need to use Strong VPN once again. I am grateful for this exceptional product and excellent support!"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T04:23:59.000Z",
          "Titre": "China",
          "Contenu": "CS response is quick and most of time, to the point and helpful.What needs to be improved, if possible, is service for customers working in Mainland China. Not sure how but if possible making the APP work better and more stable connection is much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T10:08:34.000Z",
          "Titre": "Stable service with reliable help team",
          "Contenu": "In difference of many previous VPN providers the service has been functioning and in case of rare problems, the team has been available plus they did not assume that it was my fault, in some cases the team admitted that they are repairing something. This is really great! Keep up good work!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Phillip Sear",
          "Nb_Reviews": 9,
          "Date": "2023-08-27T19:44:25.000Z",
          "Titre": "Excellent service since joining",
          "Contenu": "Excellent service since joining, and apps and Chrome extension easy to use.  Only small point that could improve is that I am asked every few days to log back into the Chrome extension on my desktop (would prefer that to be monthly or less frequently)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Pogue",
          "Nb_Reviews": 4,
          "Date": "2023-11-13T18:50:48.000Z",
          "Titre": "Customer service",
          "Contenu": "Your customer service is exceptional. I have recommended you to several friends and family members. Thank youJoyce Pogue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T18:23:27.000Z",
          "Titre": "Never without Strong VPN at home or overseas. Dependable, excellent security. Recommend.",
          "Contenu": "Excellent product that I’ve been using for many years and that I depend on world-wide.  I appreciate the extra security layer and also the fact that I can access US apps overseas since it looks like my computer is US based while away.And, the support, should a person ever need it for technical assistance or general questions, is superb.  While in US had problems w Comcast Xfinity network and it was causing erratic issues with my VPN.  The technical team at Strong VPN immediately answered my request for help with a solution. It worked. They even followed up to ensure it was resolved. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Mutlu",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T17:00:27.000Z",
          "Titre": "Very happy with the service",
          "Contenu": "Especially during the last one year I didn’t have any problems at all with connectivity. Also the required set-up with my new ipad worked smoothly and automatically without requiring any intervention or input on my side."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Adeel Hussian",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T08:10:28.000Z",
          "Titre": "I am using Strong VPN from the last 10…",
          "Contenu": "I am using Strong VPN from the last 10 years and have also recommended and install in to all my family and friends devices, and each one of them are very satisfied with their services. Whenever I need assistance every tech officer always do their best to solve my multiple issues at anytime of the day. keep up the good work with many thanks..."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Ernest",
          "Nb_Reviews": 3,
          "Date": "2023-06-18T18:51:38.000Z",
          "Titre": "StrongVPN client satisfied since 2015",
          "Contenu": "I'm a client of StrongVPN since 2015. The service reliability is very good everywhere I connect. Easy to use in all devices with plenty of server options available.Everything can be improved, but StrongVPN is close to the excellence.Definitely a great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LeGant",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T04:59:59.000Z",
          "Titre": "Simplicity to use",
          "Contenu": "Simplicity to use, amazing results A+++ vpn"
        },
        {
          "Note": 5,
          "Lieu": "LR",
          "Pseudo": "Angelique Weeks",
          "Nb_Reviews": 2,
          "Date": "2022-07-25T21:24:59.000Z",
          "Titre": "Prompt, courteous and swift...",
          "Contenu": "Each time I attempted to log-into my VPN  I kept getting an error message about \"a rate limit due to too many failed attempts.\"  However, when I contacted the StrongVPN help desk, I was able to get prompt, courteous and swift assistance in resolving my problem.  Thanks for your professional service as usual.  Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Russ Hannah",
          "Nb_Reviews": 4,
          "Date": "2023-02-13T13:00:39.000Z",
          "Titre": "Quick human service",
          "Contenu": "A human comes to the online chat almost immediately - no time spent with useless bots. Very quick identification of the issue and quick resolution. Sometimes I've given remote access so they can check quicker than having to explain everything to me in text. Could always see everything that was happening, so felt comfortable. Always quick, and always fixes the problem."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Abdulkader Zrekat",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T18:09:06.000Z",
          "Titre": "I live in UAE and calling through the…",
          "Contenu": "I live in UAE and calling through the watsapp or social media can’t happen. My family living abroad and i have to call them daily by using StrongVPN. I love this VPN. Strong connection and no technical issues. The support team are available 24 hour. Very supportive and kind. Thank you so much guys. I am really enjoying Strong VPN."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Anderson",
          "Nb_Reviews": 2,
          "Date": "2022-08-14T19:39:50.000Z",
          "Titre": "For 10 years I have relied on StrongVPN",
          "Contenu": "For over 10 years I have relied on Strong VPN service to assist me in staying connected while traveling aboard.   Their extremely dependable team has always been available to help should need arise.   Thank you."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Peter Dale",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T17:26:17.000Z",
          "Titre": "Strong VPN does what it promises and…",
          "Contenu": "Strong VPN does what it promises and attends to customer issues without delay.People should be getting Strong VPN in view of the government legislation to control the internet."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lisa J Schmitt",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T19:07:24.000Z",
          "Titre": "Great app! actually the best !",
          "Contenu": "When i first installed on my laptop i had difficulty but took it to my computer guy and he fixed it in a couple of minutes (I am not tech savoy).  Love using it as i can watch tv shows etc in another country.  Subscription price is worth it.  Very easy to use.  Looking forward to more countries and more access to their tv networks.  Hopefully soon there will be an app i can download to my smart tv instead of using a firestick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T19:33:41.000Z",
          "Titre": "Great Service with Strong VPN!",
          "Contenu": "I've been using Strong VPN for approximately 14 years.  I started with them when I was in Iraq and have stayed with Strong VPN due to their great VPN service and their customer service.  When I experienced a situation(s) over the course of these 14 years I didn't know how to resolve I contacted customer service and everything was resolved very quickly and professionally.  I'm able to select multiple locations to connect through with no observable delay in internet speeds.  I use Strong VPN on all my computers and devices and will not go to anyone else."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T08:12:51.000Z",
          "Titre": "it's strong VPN",
          "Contenu": "I Like it a lot, because all the porno website was blocked in our area, with this application I am free :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2022-04-20T18:28:59.148Z",
          "Titre": "Excellent tool to protect your devices",
          "Contenu": "Excellent tool to protect your devices.  i use it on my phone and computer and feel completely at ease while doing do.  I owned a MAC computer that, when i bought it, was told that I needed no protection.  I was traveling using my computer and it was attacked and compromised.  I installed STRONG VPN on my next computer (and cell phone) and have had no problems since.  It really works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Valued Customer Chris Wong",
          "Nb_Reviews": 3,
          "Date": "2022-09-04T19:42:01.000Z",
          "Titre": "StrongVPN has a strong supporting team",
          "Contenu": "StrongVPN has a strong supporting team, all through these years I don’t know how many times I have asked for help, each time to will help me patiently and take me step by step to solve my problem..  The subscription fee they charge is reasonable The technical part is improved a lot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T19:04:46.000Z",
          "Titre": "I have had Strong VPN since 2017 and I…",
          "Contenu": "I have had Strong VPN since 2017 and I couldn't be more happy with it. I have no reason to want to change to any other provider. Strong VPN is always reliable, affordable, easy to use and I always feel safe whenever I am not using my own Wi-Fi."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Ernest",
          "Nb_Reviews": 3,
          "Date": "2022-05-24T20:27:08.000Z",
          "Titre": "User of StrongVPN for 7 years with excellent service",
          "Contenu": "I'm a client of StrongVPN since 2015. The service reliability is excellent everywhere I connect. Easy to use in all devices with plenty of server options available.Despite everything has marging for improvement, I think thatStrong VPN applications and services provided are very good and close to the maximum excellence.Definitely, a superb service."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-27T20:56:18.000Z",
          "Titre": "Error 3000 hindering the use of service",
          "Contenu": "Error 3000 hindering the use of serviceI turned to the support with this issue but when I chose another location, eventually the issue was solved by itself. However, I feel welcome to contact you should it happen again. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Tony M",
          "Nb_Reviews": 3,
          "Date": "2022-03-18T20:59:10.000Z",
          "Titre": "Customer service is extraordinary",
          "Contenu": "Customer service is extraordinary. They make connection fairly promptly.  I'm really not that computer savvy, however anytime I need support they are patiently giving me direction. There is always a  followup to ensure issues are resolved.  I feel confident and happy to recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Timothy",
          "Nb_Reviews": 4,
          "Date": "2022-08-27T20:47:54.000Z",
          "Titre": "I appreciate the quick and accurate…",
          "Contenu": "I appreciate the quick and accurate analysis of the StrongVPN Support team.  I have been with this company for several years and have aways received professional service and advice.  I live in China where CONNECTIVITY is a challenge.  I rely on StrongVPN to allow me to continue with my clients outside of China.  Thank you to the Strong Support Team"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Deepak Chatwani.",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T06:19:01.000Z",
          "Titre": "One of the best VPN",
          "Contenu": "One of the best VPN. I had never face any problem about random disconnection or slow speed.Some times I keep VPN connected for more then 24 hrs and forget about it.I am subscriber of this StrongVPN since last 3yrs.I appreciate it's service. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Alfred Lamothe",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T06:33:16.000Z",
          "Titre": "Satisfied Long Time User",
          "Contenu": "We have been using StrongVPN for a number of years now.  Never had a dropped/refused connection.  Never experienced noticeable lag.  Never had to call technical support.  Works as advertised every time.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T23:53:04.000Z",
          "Titre": "The technical agents are very helpful…",
          "Contenu": "The technical agents are very helpful to fix your problems. In this occasion they did the best and restored their service promptly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T15:51:52.000Z",
          "Titre": "Reliability",
          "Contenu": "I’ve been using StrongVPN for several years while working overseas due to its reliability, and for me the compatibility with routers outstanding service and customer support a must for US expats"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T00:06:09.000Z",
          "Titre": "Intuitive and Reliable",
          "Contenu": "I've had StrongVPN for several years now and never had an issue. It's simple and reliable, at a very attractive price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terry Holmes",
          "Nb_Reviews": 3,
          "Date": "2023-07-26T18:54:06.000Z",
          "Titre": "Happy customer",
          "Contenu": "The service is good and customer service is top notch. Been with them for years after trying others. Sign up, you won't be disappointed - trust me"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kimberly Gelowitz",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T22:17:31.000Z",
          "Titre": "Great customer service and support",
          "Contenu": "Great customer service and support. I use their DNS service. I was with another company, and Strong VPN acquired that company. It's been a few years, and Strong VPN hasn't let me down. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Abeer Khalil",
          "Nb_Reviews": 3,
          "Date": "2022-09-19T20:19:17.000Z",
          "Titre": "Incredible customer service",
          "Contenu": "Incredible customer service. I didn’t have to spend hours explaining what I wanted agent understood what I wanted and immediately came through Smart professional and efficient this is how it should be and they are .."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Duncan Graham",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T18:12:50.000Z",
          "Titre": "I have subscribed to STRONG VPN for…",
          "Contenu": "I have subscribed to STRONG VPN for many years. Their service is reliable, consistent and the staff are Uber-helpful.  I thoroughly recommend them"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Spurgeon",
          "Nb_Reviews": 4,
          "Date": "2023-05-08T22:06:57.000Z",
          "Titre": "Very Good Service",
          "Contenu": "Any problems that I have had with using Strong VPN have been promptly and efficiently dealt with.I use Strong DNS to access BBC TV which has proved mostly problem free - thank you!"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Rene P.",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T05:31:32.000Z",
          "Titre": "Great throughput and consistent service",
          "Contenu": "Great throughput, consistent service - StrongVPN has been working for me for many years. Working in countries with strong censorship and high rates of cyber criminality, I've been using this VPN to connect back to financial services, databases and remote administration. Pricing is reasonable and there are many servers to choose from."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Barry-Aydanur Altan Hickerson",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T16:47:20.000Z",
          "Titre": "The best VPN service",
          "Contenu": "I am an American  living in Turkey.  I have had STRONGVPN since April 2015 and have enjoyed the ease of access showing me at a USA IP Address.  I feel it is the best VPN Service available."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Juan",
          "Nb_Reviews": 5,
          "Date": "2023-07-21T17:07:17.000Z",
          "Titre": "great customer service",
          "Contenu": "after an initial missunderstanding the staff was very commited in solving my issue, follow up was really good until everything was done. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T19:50:47.000Z",
          "Titre": "It´s very important for me to have a trustable VPN",
          "Contenu": "It´s very important for me to have a good VPN when I use public wifi networks, mainly during travel times. Stong VPN has proved to work very well when I need it."
        },
        {
          "Note": 5,
          "Lieu": "BM",
          "Pseudo": "Ronald Wolffe",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T11:58:36.000Z",
          "Titre": "I find this to be a great vpn where i…",
          "Contenu": "I find this to be a great vpn where i live my ip address gets block quite a bit with strong vpn i have been able to accompolish projects i was unable to do with my normal ip address thank you strong vpn."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Dan Järvinen",
          "Nb_Reviews": 23,
          "Date": "2022-11-04T21:32:16.000Z",
          "Titre": "it was good and fast connection and im…",
          "Contenu": "it was good and fast connection and im was abel to do what i shuld do,,i was in sweden when i firs use it could not play from ther i was going in to norway by using VPN"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Cft",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T14:46:53.000Z",
          "Titre": "Very reliable service",
          "Contenu": "Very reliable service. Quick and effective response to technical problems, Staff really work hard to help me get around technical issues, Can always count on them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar Lopez",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T02:43:28.000Z",
          "Titre": "Viewing my favorites tv programs…",
          "Contenu": "Viewing my favorites tv programs outside from the U.S. is something I value as great. That’s why I’m a satisfied customer with Strong VPN."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T01:35:47.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "I have been using Strong VPN and the company they purchased for 11 years now and have always had fast reliable service and quick replies the rare time I have experienced any issues, often right through their Chat Line. Highly recommend to anyone looking for fast reliable and affordable VPN Service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Farnam Ardavani",
          "Nb_Reviews": 2,
          "Date": "2022-05-22T04:47:23.000Z",
          "Titre": "I have been using Strong VPN Since 2014…",
          "Contenu": "I have been using Strong VPN Since 2014 for my connection issues within Iran. The service is reliable and seamless and whenever I need support, I have received an excellent support. The price is a little bit high, but regarding the service, the compromising of service to price is acceptable to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Hewell",
          "Nb_Reviews": 8,
          "Date": "2022-05-04T18:10:54.000Z",
          "Titre": "String VPN is easy to install and use",
          "Contenu": "String VPN is easy to install and use. Logging on and connecting to the service is very straight forward. Once connected, I can stay connected for hours. When traveling I am constantly connected without experiencing any disconnects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T01:47:19.000Z",
          "Titre": "Great customer service",
          "Contenu": "We have used StrongVPN for almost a decade...both internationally and stateside.  A dependable platform with great customer service."
        },
        {
          "Note": 5,
          "Lieu": "AW",
          "Pseudo": "Leanne LaMontagne",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T04:03:13.000Z",
          "Titre": "If I have any kind of problem with…",
          "Contenu": "If I have any kind of problem with their product, I know someone is always there to assist me.  It's hard to find anything you can buy with that kind of confidence these days."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bryon",
          "Nb_Reviews": 2,
          "Date": "2022-04-01T16:27:02.000Z",
          "Titre": "I have used StrongVPN for 10 years now",
          "Contenu": "I have used StrongVPN for 10 years now. It is extremely reliable and allows access to online services without fail. The customer service is excellent.I highly recommend StongVPN"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Valuedjose Bustani Customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T01:26:06.000Z",
          "Titre": "VON off",
          "Contenu": "Normally, the service is perfect. Nevertheless, in the last ten days VPN switches off whenever I turn off the Ipad"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pfj57",
          "Nb_Reviews": 4,
          "Date": "2022-03-19T14:36:39.000Z",
          "Titre": "Great Features",
          "Contenu": "Great Features, On Demand for outside Wifi's. Choices in Links. Great reviews in PC Mag, CNet, etc. Definitely highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-07-15T04:44:22.000Z",
          "Titre": "A great VPN",
          "Contenu": "I could use almost every server locations in China. It's one of the best vpns to bypass censorship. The only con was that I wasn't able to use WireGuard in China."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kimberly Gelowitz",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T23:49:45.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "This is an amazing company to deal with. The customer service is amazing. I would highly recommend using StrongVPN."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alan B. Cranford",
          "Nb_Reviews": 12,
          "Date": "2023-04-18T02:37:10.000Z",
          "Titre": "Strong VPN has the BEST customer…",
          "Contenu": "Strong VPN has the BEST customer service of any online company I have used or dealt with. There service ALWAYS works and is quick."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ChrisB",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T18:12:28.000Z",
          "Titre": "We have been using StrongVPN for a…",
          "Contenu": "We have been using StrongVPN for a while. Extremely handy while traveling away from home base. Recently had an issue that was extremely well handled by the team. Kudos all around"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Drtaxsacto",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:03:25.000Z",
          "Titre": "The name says it all - a great VPN",
          "Contenu": "Strong is consistently effective no matter where I am"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "client; Mike D.",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T17:54:44.000Z",
          "Titre": "Very easy and effortless to us their…",
          "Contenu": "Very easy and effortless to us their VPN and if Customer Service is required you will find it’s excellent. Mike D."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Nigel Saunders",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T16:14:51.000Z",
          "Titre": "Had String VPN for many years and I’ve…",
          "Contenu": "Had String VPN for many years and I’ve found it works perfectly for me. Customer service is very fast and they’ve always resolved my issues."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T18:27:40.000Z",
          "Titre": "Nearly 10 years of flawless use",
          "Contenu": "Nearly 10 years of flawless use. Literally can't remember a single outage or tech problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 4,
          "Date": "2023-02-23T22:51:09.000Z",
          "Titre": "Top notch service",
          "Contenu": "The service is alway top notch and as a long time subscriber to Strong VPN I have always had excellent support when needed."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Joe Gallagher",
          "Nb_Reviews": 4,
          "Date": "2023-02-10T17:26:08.000Z",
          "Titre": "I use the smart DNS service to get…uk tv from abroad.",
          "Contenu": "I use the smart DNS service to get local stations from abroad and it is reliable and great quality for the lqast 12 months.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Beardsley",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:10:47.000Z",
          "Titre": "Attention to Detail",
          "Contenu": "The thoroughness of the attention to detail of the techs -- particularly when dealing with a senior such as myself, who isn't too tech savvy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Sahlen",
          "Nb_Reviews": 3,
          "Date": "2022-06-10T18:25:11.000Z",
          "Titre": "Great resource for Technologically challenged",
          "Contenu": "Whenever I have a problem with my vpn, the live chat and tech support is terrific. I am technically challenged older person."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Mrs Diana Cook",
          "Nb_Reviews": 17,
          "Date": "2023-08-24T12:19:18.000Z",
          "Titre": "I am very happy indeed with strong",
          "Contenu": "I am very happy indeed with strongvpn. Reception is perfect and any eventual problems are always sorted out immediately by the very courteous and efficient technicians."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Lyons",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T00:12:49.000Z",
          "Titre": "Been using Strong VPN for many years",
          "Contenu": "Been using Strong VPN for many years.  Their support is outstanding.  Client very easy to load. Great VPN choices across the globe.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Jian",
          "Nb_Reviews": 3,
          "Date": "2022-03-29T21:50:50.000Z",
          "Titre": "Inside China out",
          "Contenu": "I spend most of my time in China and I have tried many way to get a connection to the outside world, StrongVPN is the most effective one."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Georgia Makitalo",
          "Nb_Reviews": 4,
          "Date": "2022-11-15T12:11:40.000Z",
          "Titre": "I am very happy with Strong VPN",
          "Contenu": "I am very happy with Strong VPN. The product is always secure and trouble-free. If I ever have a question or concern, they are easy to reach and they respond and resolve quickly!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Marylou Badeaux",
          "Nb_Reviews": 3,
          "Date": "2022-02-27T03:16:25.000Z",
          "Titre": "Consistent access to everything I want…",
          "Contenu": "Consistent access to everything I want to watch.  If there is a glitch (seldom), customer service quick and on point."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Valued Customer Robert",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T21:15:00.000Z",
          "Titre": "When you have only basic IT experience…",
          "Contenu": "When you have only basic IT experience it is good to know that StrongVPN has accomplished technical engineers who can assist you to have your VPN up and running within minutes."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T11:41:53.000Z",
          "Titre": "remember do log in more easy and new…",
          "Contenu": "remember do log in more easy and new password I never do it fast enough I am 75 years so maybe you dont like olf customer ?byeole strange"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Sorinus Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T03:59:26.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, secure and reliable vpn. They have great technical support .Services are high quality at affordable price."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T03:34:27.000Z",
          "Titre": "The technical response is professional…",
          "Contenu": "The technical response is professional and fast. The connecting is stable and fast. I love to use StrongVPN."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T18:42:19.000Z",
          "Titre": "Review requests",
          "Contenu": "I gave a fulsome review 2 days ago. I'm afraid you don't analyze them which is my only negative."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Marek Xu",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T04:49:16.000Z",
          "Titre": "Good Service",
          "Contenu": "Very fast customer service. They gave multiple great, working solutions to connection problems. Afterwards, the VPN connection was very fast and reliable."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T22:29:01.265Z",
          "Titre": "Works with all the streaming services…",
          "Contenu": "Works with all the streaming services that I use so that I can maintain a secure network connection while gaming, listening to music, or watching video."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ezra Adler",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T21:46:28.000Z",
          "Titre": "Really great service when you need a…",
          "Contenu": "Really great service when you need a VPN. I have used a couple other services and nothing is as good as Strong. Thank you for providing great service."
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "joela070395",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T21:45:58.000Z",
          "Titre": "Fast and reliable insurance.",
          "Contenu": "I have been using your services for several years and I feel satisfied, it is safe and easy to use, when I browse I feel safe because of the privacy it offers me, I am sure that I will continue using your services for many more years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 4,
          "Date": "2023-11-07T01:34:20.000Z",
          "Titre": "The app is easy to use and I feel protected",
          "Contenu": "The app is easy to use and I feel protected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer PeterB",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T04:09:00.000Z",
          "Titre": "all went well",
          "Contenu": "all went well, just needed some verification on my subscription. Used chat all good."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Timothy",
          "Nb_Reviews": 4,
          "Date": "2023-08-26T23:21:35.000Z",
          "Titre": "StrongVPN is a reliable service with a GREAT Support Team",
          "Contenu": "StrongVPN is a reliable service with a GREAT support team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guido Teichner",
          "Nb_Reviews": 3,
          "Date": "2022-09-26T18:10:53.000Z",
          "Titre": "Good Strong VPN",
          "Contenu": "Ordered Strong VPN. Installed it in a few minutes. Opened it and got access to my Comcast home streaming service while in Spain......What more can one ask."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Lady J.",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T14:27:40.000Z",
          "Titre": "I don't use Strong VPN I use Strong DNS…",
          "Contenu": "I don't use Strong VPN I use Strong DNS which used to be called UnBlockus\"\"\"Strong VPN took over or changed name. UnBlockus/Strong DNS is very good."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T07:01:50.000Z",
          "Titre": "very successful"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alberto J.",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T18:59:59.000Z",
          "Titre": "No complications, Best of the Best",
          "Contenu": "No complications! Easy to Use.Works great and with confidence in all your platforms.Best of the best!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Francesco",
          "Nb_Reviews": 4,
          "Date": "2022-07-23T05:44:32.000Z",
          "Titre": "Always had a great experience with…",
          "Contenu": "Always had a great experience with StrongVPN and always got good support when issues arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T14:00:45.000Z",
          "Titre": "StrongVPN is a great service and worth the $'s!",
          "Contenu": "StrongVPN is:   - Very reliable!   - Great tech support!    - Awesome value!What else can I say? :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T19:10:41.000Z",
          "Titre": "Reasonable cost",
          "Contenu": "Reasonable cost, many areas to connect to, easy to use, and excellent cusomer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T18:40:00.000Z",
          "Titre": "Very responsive to problems",
          "Contenu": "Very responsive to problems, when they occur (which is not often)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-28T19:22:47.000Z",
          "Titre": "Always have one problema I have very…",
          "Contenu": "Always have one problema I have very good service. In the future if is possible need a little more speed. Thanks !"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T20:10:42.000Z",
          "Titre": "I got a fine connection always"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T01:52:57.000Z",
          "Titre": "Courtesy and results",
          "Contenu": "Each time I have a problem with the software, a solution is found. It is that simple. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Murray",
          "Nb_Reviews": 3,
          "Date": "2022-04-10T11:37:42.000Z",
          "Titre": "Still using Strong VPN after ten years",
          "Contenu": "Still using Strong VPN after ten years. It simply works and support is quick to help if I struggle to install on a new device."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Santiago...",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T19:02:31.000Z",
          "Titre": "Great VPN always Strong...",
          "Contenu": "Great VPN like always and opportunity to enjoy different solution for Enterprise and Consumer.Keep it up!..."
        }
      ]
    }
  ]
}