{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.acitydiscount.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheech",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:25:25.000Z",
          "Titre": "P Point Market",
          "Contenu": "My Company, P Point Market has purchased kitchen equipment from A City Discount (03/25/2019)The store instead of placing a balance back in our credit card, placed a IS Credit ($3,798.00).When the issue was found, I contacted ACity to get the balance back into my account.  A City Discount said that because it is an old account they can't do the reimbursement.  We think this is an abuse and at least they could give us an opportunity to get some merchandise. Very bad for this company.  Please advise how to handle this type of abuse"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connie V",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T19:17:53.000Z",
          "Titre": "I have used this company for well over…",
          "Contenu": "I have used this company for well over $10,000.00 worth of business. You would think that a $50.00 dispute would have been resolved in a more timely manner but it took over a month. I ordered a lift gate for delivery, but the driver didn't use it. I have video and pictures documented and sent to ACityDiscount. However, ACityDiscount said the driver was disputing my word so they would not give me the refund, without more investigation. It wasn't until started calling twice a week did I get to speak to a manager, Summer. She was extremely rude and curt. Larry and Brian were always very pleasant when I talked with them, (many times I might add) but they were unable to resolve the issue without me going over their heads. A little kindness goes a long way. Unfortunately Summer will have me looking elsewhere in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Reed",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:09:57.000Z",
          "Titre": "scam company",
          "Contenu": "0rdered $2,500 of four different types of chairs, salesperson told me that they dont have those no more and they keep them listed on there website to get people to call them. I feel this company is a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Wolken",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T15:03:05.000Z",
          "Titre": "DON'T BUY FROM THESE PEOPLE!",
          "Contenu": "DON'T BUY FROM THESE PEOPLE!I ordered a simple metal lifter/handle for deep dish pizza pans.  I received it in a box that was big enough to hold a motorcycle helmet and the lifter was so flimsy and poorly made that I wouldn't trust it to pick up anything hot or otherwise.  Okay, so I wrote them a note saying I wanted to return it and they said that they would have to get a return authorization from THEIR supplier first and then I would have to pay return postage to both them AND their supplier.  HAH!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ernest Brand",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T17:13:52.000Z",
          "Titre": "TMGM36 Griddle",
          "Contenu": "Ordered a TMGM36 Griddle 7/30/21 it was back ordered finally received 10/18/21.  All the accessories were missing. Legs, Drip Pan regulator, and orifices for LP gas. Talked to a someone about this and was sent the legs, drip pan and one of three orifices. Still missing the regulator and two of the orifices. talked to them again and have had no responce"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seunghyun Louis Lee",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T20:00:08.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible....I got a lot of stuffs in this space.But I realized that I got over size sandwiches prep cooler and griddle. So, I try to return it.They told me they will charge 25% from my prep cooler and griddle....OMG....Even I did not used it.......I could not trust that......I decided to do re-sell it. That's better for me.I got Horrible Experiences.I ask them show me return policy ,they said do not have return policy.....omg"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peggy harris",
          "Nb_Reviews": 1,
          "Date": "2018-07-23T19:30:51.000Z",
          "Titre": "I bought a imperial 6 burner stove",
          "Contenu": "I bought a imperial 6 burner stove. I still haven’t recieved the screws for the wheels. The oven was way off temperature wise and the calibration was not covered under warranty so it cost me another $350. Burners don’t work well.  Imperial says pulling 7 amps when it is suppose to pull 12 per burner is “ok my man” to the tech.  Service department does not help at all.  Wanted to return the stove and they won’t take it back. Don’t buy from them it has been horrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Biti Pies",
          "Nb_Reviews": 1,
          "Date": "2014-09-09T18:56:35.000Z",
          "Titre": "If you like being ripped off, buy from ACity!",
          "Contenu": "We ordered an item from ACity that showed up in horrible condition.  It was a Hobart Vertical Cutter-Mixer.  It was missing key components and was in general disrepair.  Upon requesting service from the company, they gave us the runaround, and finally told us the problems were our fault, and we had not other options.  If you like poor customers service, poor products, and an overall bad experience, shop ACityDiscount!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2020-04-23T20:07:01.000Z",
          "Titre": "This place is the worst of worst on…",
          "Contenu": "This place is the worst of worst on customer service - I bought a piece of equipment and asked them for help and I will even pay - but no not until leave message with manager and he will get back with you next am - did he NO - I have been chasing done parts so I can open"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ivy Amar",
          "Nb_Reviews": 2,
          "Date": "2019-06-30T17:07:31.000Z",
          "Titre": "I appreciate giving me the lowest price…",
          "Contenu": "I appreciate giving me the lowest price possible, even less than the web price. The salesman was very easygoing and helpful. The blender jar came quickly and is just what I wanted.  Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John J",
          "Nb_Reviews": 3,
          "Date": "2017-03-16T22:52:42.000Z",
          "Titre": "Never shipped my order! Wants me to file claim on a shipment UPS never received!",
          "Contenu": "They want me to file a claim with UPS on a shipment in which their tracking number showsUPS Never receiving! Avoid! Ripe Off! Horrible Customer service! 1Z246AT94253709328"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Pirkl",
          "Nb_Reviews": 9,
          "Date": "2018-03-06T18:01:43.000Z",
          "Titre": "Zero Progress-No Call back-Zero rating",
          "Contenu": "Since last post they contacted me but now it has been over 10 days and nothing is being done.  Not only that, now they refuse to answer their phones!  Left several msgs and got nothing back! Leaving me out to dry I guess. You buy a new item that states it has the \"best warranty in the business\" you would expect to be able to use that warranty, but apparently not for me.  They left an answer saying they provide 5star service but as everyone can see that is just not so.  Not even the decency to call and let a person know what is going on, what they are doing to correct the problem or at least just to let me know they answer their phone msgs!  Guess I have to send this complaint to the BBB and Consumer Protection Agency for their review of this problem.  Hope everyone else got great service from these guys, just letting you know I have not after 10 days!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Nass",
          "Nb_Reviews": 4,
          "Date": "2018-07-04T16:00:51.000Z",
          "Titre": "Very good customer service over the…",
          "Contenu": "Very good customer service over the phone quick and easy.Been 6 day since order hope I receive it soon as I am outof product.  Not sure when it should arrive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cms jerry",
          "Nb_Reviews": 1,
          "Date": "2015-01-22T14:36:37.000Z",
          "Titre": "great selection of quality merchandise",
          "Contenu": "great selection of hard to find quality merchandisevery reasonably priced outstanding customer service fast delivery will definitely use this again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent DiSalvio",
          "Nb_Reviews": 2,
          "Date": "2017-12-10T01:59:16.000Z",
          "Titre": "Deceptive dishonest business practices",
          "Contenu": "If you're looking for restaurant equipment DO NOT PURCHASE FROM THE COMPANY BELOW. They sold me a split door freezer last year listed as \"new\" which was actually manufactured by True in 2005. The compressor went just two weeks ago. True only covers their compressors for 5 years and will not cover it because the unit is 12 years old. When delivered there was a USED sticker on the freezer and they still claimed it was new.  These folks are crooks.  There service manager is arrogant and rude and claims the unit was never even turned on and checked yet they still would not fix the compressor.   By the way....The Better Business Bureau has 11 complaints logged against this business!!!  Live & Learn.  Your reply below is a lie.  The unit was manufactured in 2005 according to True who said they would have honored the warranty on the compressor.  True stated you cannot sell a piece of their equipment that was manufactured 12 years prior as new, but you did.  Never been used huh, I guess that's why you guys slapped a USED sticker on the unit.  Regardless of your warranty True would have honored the compressor warranty so your argument is moot, and a lie.  You people are crooks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Grady",
          "Nb_Reviews": 1,
          "Date": "2018-12-17T16:40:06.000Z",
          "Titre": "Stay away from Mike Ellin",
          "Contenu": "I want to say that this review is solely based off of the customer service I have received from Mike Ellin, the Showroom Manager, since Justin Kennedy.I received a wall mount bracket that came with two plates but only one arm, in my mind this tells me I am missing an arm. I emailed Justin who I purchased it through and received no response. After a couple of weeks, Mike emailed me back saying that I only ordered one bracket and any others would have to be purchased. I asked follow-up questions, again thinking there should be two arms and received no response. I sent two more follow up emails with no response to Mike. I emailed the customer service email describing the service I received, funny enough it went to Mike. He did email me back, saying he did not see any order I have ever placed, nor does he have an account with my name on it. I have spent over $10,000 at ACD in the past year. I responded again with all of my information and have yet to received a response back, this was 5 days ago.Some of the salesmen may be great, but if they have to answer to this guy for any issues that come up I can promise you that you will not be taken care of as a customer. There are other options out there that want your business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Pirkl",
          "Nb_Reviews": 9,
          "Date": "2018-02-21T22:46:19.000Z",
          "Titre": "Refusal to Contact their customer",
          "Contenu": "I bought, what was promoted as new, 2 Coldtech refrigeration units which were to have the factory warranties.  Now it is time to use the warranty and I find out from the company there never was a warranty attached with these units!  ACity had even listed these units touting the company's warranty as 'the best in the business with 3 years bumper to bumper'.  They NEVER indicated these were being sold without a warranty.  Even my invoice states these items as being 'NEW' not used or discontinued models.  My disgust with Acity stems from their REFUSAL to call me back or put someone on the line when I call who can help!  They will not even be respectful enough to return a phone call.  Coldtech execs were very upset to hear of these practices and have since contacted Acity.  I am sure this feedback will do little to make them call or uphold the warranty they advocated with the units.  I hate to go to the Consumer Protection Agency and BBB but maybe that is my only course of action here as everyone at ACity is in hiding.  Seems everyone has had a great experience with ACity, lets see if they change my mind a re-write a new feedbackOne Very upset customer.  Do not like being misled and then left holding the bag!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dwayne Fulbright Harry's Hideaway Bar & Grill",
          "Nb_Reviews": 2,
          "Date": "2013-03-19T19:24:11.000Z",
          "Titre": "Worst experience Ever !!!!",
          "Contenu": "Went in to buy two dishwashers went thru with the sales man to make sure I got the right ones. we got it all figured out then I gave him my credit card he ran it thru and of course it went thru then he tells me after the fact that they have to do a verification that would take 10 min. of my time by charging a random amount to my credit card thats when it all started if you use keybank they do not post there charges for a day or so so I told him forget the order I would just buy it from webresaurant who are awesome bought many of things of greater value from so he told me he coulnt cancel the order Imaginge that so i asked to talk to a superviser told him to just cancel the order after talking to him for 10 min him trying to get me to convince me to not cancel the order he hung up on me. what great customer service the they called me again the next day hounded me about doing this verification mind you I have bought from them before without any problems just to get this whole experience over with it took almost an hour to do this I told him to be sure one of the owners or someone high up called me guess what not a call do yourself a big favor pass these guy by terrible and very unprofessional buy somewhere else. would give them negitive stars if I could"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2018-12-14T20:38:36.000Z",
          "Titre": "Bought a used True two-door freezer for…",
          "Contenu": "Bought a used True two-door freezer for about $2000.00 in October.  Didn't work at all when finally plugged in (mid November)  I did call \"A City Discount\" and left a message.  No reply.  Spent $894.29 on refrigeration repair (just got the bill now, hence the review).  It was made operational, but leaking water into freezer compartment.  Then this week, the kitchen filled with a burnt electric smell and it went dead again.  Parts are on now on order. I had ordered equipment from them before, so, as a return customer, was hoping to at least get a return call.  No such luck.  My advice: don't go for their used equipment. My repairman says that the unit clearly had been worked on before as it had cheap replacement parts (which were the latest parts to fail).  I should have bought new, but I was caught needing to meet a health inspector's demands at a time where funds were short.  Now I'm out $2,900 and waiting on the next bill-- and I'll still have the leak in the freezer compartment to deal with... and I'm pretty sure I'll continue having issues.For $3,800 I could have bought a True T-49F new with 3 years warranty on parts and labor, 5 years on the compressor.Don't throw your hard-earned money away on folks who won't even return your call.  You will regret it, like I am right now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mohammad Fallaha",
          "Nb_Reviews": 2,
          "Date": "2020-07-11T18:57:48.000Z",
          "Titre": "LIARS AND THIEVES",
          "Contenu": "DO NOT TRUST OR DEAL WITH THIS SCAM COMPANY LEAD BY MARTY. THIEVES AND LIARS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Wadsworth",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T14:18:47.000Z",
          "Titre": "worst customer service and don't trust their website",
          "Contenu": "(Atlanta, GA.) I will never go back to that store. I called ahead and asked if they had continuous feed food processors in the showroom on display and the girl on the phone asked which brands and I told her and she said yes. So I drove 30 minutes to get there. When I walked in no one asked to help me so I asked where they would be. When I went to look there were none on display. On 2 brands in boxes, not on display and not one of the brand that I asked about. So I went back to the counter a 2nd time and had to interrupt a conversation between 2 employees to ask if there were any out in the store somewhere. The answer was no. So I went back to the shelf looking for the brand that I was interested in and could not see it. I looked on line and it said it was in stock (which I checked before driving so far).  So I went back to the counter a 3rd time and once again had to stop their conversation (between 2 employees) and ask if someone could help me. The girl asked what I needed, so I proceeded to ask about the appliance. She did not know what I was talking about so I showed her on my phone and that it was in stock but I could not see it anywhere. She looked it up and said it was online only. I asked her why it said \"in stock\" , she had no answer. And STILL no offered to go back to the shelf with me and take a look. I told her that I called before I came and drove 30 minutes to look at a product that was supposedly in stock. I was exasperated at the level of customer service and knowledge of their products. I just walked out. Don't expect any sort of help if you go to this store.Update after response 12/2/21I did not ask for a specific model. I wanted to see the brand which was not on the shelf and showed as \"In stock\" on your website, which I was told was not kept in the store and online only.  If it is not in the store it should not say \"In stock\". Its as simple as that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2017-06-07T20:26:01.000Z",
          "Titre": "Shipped promptly",
          "Contenu": "Shipped promptly, and was just what I ordered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry calhoun",
          "Nb_Reviews": 1,
          "Date": "2013-09-04T22:22:26.000Z",
          "Titre": "The cooler still not working",
          "Contenu": "It should of been check beforehand"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dion Page",
          "Nb_Reviews": 5,
          "Date": "2018-02-26T17:13:42.000Z",
          "Titre": "Great customer service"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "sesethu madikane",
          "Nb_Reviews": 2,
          "Date": "2021-05-29T18:10:30.000Z",
          "Titre": "Great reasonable price for good…",
          "Contenu": "Great reasonable price for good products."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tx1015",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T15:51:18.000Z",
          "Titre": "Well I have not received my nugget ice…",
          "Contenu": "Well I have not received my nugget ice machine no way of tracking it. It says it is still processing. I understand I placed the order on Saturday. But it Should have processed and shipped By now. My payment was processed quickly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rupesh Bhatt",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T15:59:14.000Z",
          "Titre": "Need to impropve on customer service",
          "Contenu": "The Customer service was not that great. I talked to the sales guy over the phone before actually visiting the place. When the sales representative came, he looked confused when I told him that we talked over the phone."
        },
        {
          "Note": 2,
          "Lieu": "BS",
          "Pseudo": "Lisa Thompson",
          "Nb_Reviews": 1,
          "Date": "2017-07-13T12:49:20.000Z",
          "Titre": "Need an invoice for shipper tried call",
          "Contenu": "Need an invoice for shipper tried call Larry no answer left messages as well, goods are still at the mailboat, kindly email invoices please to t let me know results2426011396"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Mayer",
          "Nb_Reviews": 1,
          "Date": "2013-03-22T13:30:21.000Z",
          "Titre": "Wrong size rack delivered",
          "Contenu": "Even though the wrong rack arrived the team at ACityDiscount quickly ordered the correct one, arranged to have the first rack picked up and everything was handled correctly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott C.",
          "Nb_Reviews": 3,
          "Date": "2017-06-04T04:41:45.000Z",
          "Titre": "Read the Terms and Conditions",
          "Contenu": "CS wanted my credit information a second time, after receiving it via website.  Claimed trying to verify my identity.  Tried to cancel order, since this was not in the terms and conditions and I am very protective of my credit rating.  CS was going to charge me for cancellation, even though their terms and conditions of sale did not require a second credit authorization.  After extensive back-and-forth, CS manager finally sent machine, but with caveat:  I had to personally inspect merchandise prior to signing for receipt, or I would be liable for any damage.  I don't know if they would do business with me again, even though this transaction ended up being proper, legal, and not fraudulent.  I could not do business with them again, at least via their website, because I am not sure they believe that I am who I say I am (in other words, they believed my sale to be a fraudulent transaction)."
        },
        {
          "Note": 2,
          "Lieu": "JM",
          "Pseudo": "Tyrone Morrison",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T05:24:29.000Z",
          "Titre": "Am new here so am just see what going…",
          "Contenu": "Am new here so am just see what going to happen"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Jirik",
          "Nb_Reviews": 3,
          "Date": "2013-03-13T04:02:44.000Z",
          "Titre": "Annoyed & Frustrated",
          "Contenu": "I was not very happy with my experience. All the items were great, with the exception of one thing. If you are considering ordering a commercial hood here, don't! The sales staff do not have the required knowledge to help in markets across the country. I am in MN and my salesman sold me a hood that is illegal here. I would suggest using a local company, as they know the local codes, even if it costs a little more. The consumer should not be required to read all codes and know them. If there is a so called sales specialist, it should be their job to know the requirements.\r My other annoyance has to do with payment. If you are custom ordering something or getting custom pricing, then this is not the place for you. My salesman would email estimates, I would confirm the desire to order, then wouldn't hear anything! I guess it is my job to track down the salesman to buy something? Last I checked, when someone wants to give you money, you should be seeking them out. I felt like I was working to place my order, not acting as the consumer. Everything that is custom has to be ordered by phone, so this is where my issue was. I guess the entire process was just far too difficult. To really put the icing on the cake, my salesman would very rarely call me, or return a call. If I didn't call him, then nothing would happen. Even then, nothing happened. I would ask questions, but never get any actual feedback. Just frustrated I guess! \r Stick to the standard stuff and you'll be just fine! Also, know what you are ordering, because the sales staff doesn't!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Libby Morissette",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T00:47:22.000Z",
          "Titre": "I had problems with the ordering…",
          "Contenu": "I had problems with the ordering process and customer service. The shipping was delayed and it took me a lot of time contacting customer support."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Lonnie Moore",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T20:46:38.000Z",
          "Titre": "Every thing is perfect but I…",
          "Contenu": "Every thing is perfect but I recommended with 3 Star because I feel they recommended with 3 star."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael G",
          "Nb_Reviews": 2,
          "Date": "2019-08-07T19:05:01.000Z",
          "Titre": "Poor Quality of Product",
          "Contenu": "Service was good but the quality of the product I purchased was poor.  I bought two Imperial Electric fryers and the repair company has been out twice in the past year to make repairs.  I reached out to Imperial and their hands were tied.  I wish their website had a place on the product page to put reviews.  I have had the identical problem with each fryer breaking down within days of one another.  Obviously there is an issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T21:35:30.000Z",
          "Titre": "Expensive bacon press",
          "Contenu": "The item was found under bacon press but the real name was steak weights. My wife said they will work just as well. I found them to be a bit pricey and the order was right at 80.00  and we didn't get free shipping I first thought we would get free shipping  but it was on another order. All and all if your looking for kitchen type utensils this is the place for you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Gale",
          "Nb_Reviews": 1,
          "Date": "2018-06-22T21:05:39.000Z",
          "Titre": "Well we got the product",
          "Contenu": "Well we got the product, however there was a problem with Old Dominion shipping.  They had setup a time for delivery at between 2 and 4 pm on Friday.  When they had not arrived by 5 pm I called them.  They told me them that the cooler could not be delivered until Tuesday.  We had made arrangements with a moving company to help us at the original delivery range. We had to reschedule that for Tuesday.  This was very inconvenient and waisted several peoples time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2017-07-16T16:04:37.000Z",
          "Titre": "Love the sink, packaging problems.",
          "Contenu": "Love the sink, however, the packaging did not protect the product. When cutting the tape on the box to open it, the utility knife cut a horizontal scratch across the top of the sink compartments. To my surprise, there was no protective cardboard under the tape to prevent a knife from cutting into the sink when cutting thru the tape. I will try to buff out the cut in the top of the sink dividers with some steel wool or emery paper.Please improve your packaging!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARY K. MCKEEL",
          "Nb_Reviews": 1,
          "Date": "2014-01-13T20:00:47.000Z",
          "Titre": "Have not tried, but will ride to good health with healthy smoothies",
          "Contenu": "I just opened the package.  Everything seemed fine but then the removable jar and base came apart.  I put it back together, but I'm not sure if it was correct because there were no directions for assembly.  I won't know until I have cleaned and sanitized the blender.  On the other hand, I received the product in a very timely manner. Tracking was very easy and efficient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evelyn",
          "Nb_Reviews": 1,
          "Date": "2014-05-24T16:47:55.000Z",
          "Titre": "Great place",
          "Contenu": "It was my first time coming to this store. Has many items, but it could use more employee's. If looking for used equipment they have a variety of options. I went three days in a row and each time I have to walk the whole store to get a sales or front desk to help me out. Unfortunately one of the items I purchased which is the sandwich prep cooler didn't work out. Besides that everything else was good and in working condition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee Stevens, 24/7 HVAC Service Co. NH",
          "Nb_Reviews": 1,
          "Date": "2013-05-26T17:38:23.000Z",
          "Titre": "Excellent and speedy service",
          "Contenu": "On the part of ACityDiscount, all was great. The shipping side of things needs some work so the product gets to the correct hub for delivery. This may not be a default of ACity, but in the shipping co-ordination. Product arrived with no damage during shipping, but unit was defective from the factory, and easily repaired on site. A defective unit comes from all different companies and does not reflect on ACityDiscount in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pris",
          "Nb_Reviews": 1,
          "Date": "2016-09-15T14:54:17.000Z",
          "Titre": "Service great but needed to communicate and never heard",
          "Contenu": "Got my high quality product faster than promised, all was good there.  Web site stated at last minute that my ($3.00) item package would require a signature, so tried to contact to cancel.  Never heard back, but day I was gone all day, found the package on my front door with apparently no signature required ......"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Buckel",
          "Nb_Reviews": 3,
          "Date": "2014-09-30T22:56:04.000Z",
          "Titre": "Sale did not work as expected",
          "Contenu": "We wanted a high temperature commercial dish washer.  High temperature is capable of raising 120 degree incoming water to at least 180 degrees for the rinse.  I did not read the spec sheet close enough and found that the machine I bought requires 140 degree incoming water to get the rinse up to 180 degrees.  There are cost penalties associated with running the hot water tank that high and also the risk of scalding someone washing there hands.  Other than that the lowest price was quoted on the first call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave R",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T01:14:29.000Z",
          "Titre": "Received Adcraft table in excellent…",
          "Contenu": "Received Adcraft table in excellent condition, and you can see extra padding inside, so they take care of ensuring the table is not damaged. Without casters on the table, the price did seem higher than what I paid last year via another company. Overall satisfied."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn Lizotte",
          "Nb_Reviews": 2,
          "Date": "2017-07-05T14:55:13.000Z",
          "Titre": "very helpful - but description a bit deceiving",
          "Contenu": "Items shipped and arrived quicker than was originally told (was on back order), however on the purchase of the ice maker itself.. it was a bit deceiving as the ice bin shows on the picture but the there is only a small blurb about \"Please note the Image shown may reflect a different configuration. Pictures are for reference only.\" - but it really should have said \"Does not include storage bin\".But the people we dealt with on the phones were great and helpful and did there best to get us the product as quick as possible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "a Little frustrated",
          "Nb_Reviews": 1,
          "Date": "2017-03-29T12:18:01.000Z",
          "Titre": "Lift gate",
          "Contenu": "Did not realize you do not bring the product in the business .I had to leave the cooler outside till the movers came the next day. It is still out on the landing till 4:00 this afternoon .Have not opened the package till It is inside.However the delivery man was most helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DPMWBG",
          "Nb_Reviews": 1,
          "Date": "2018-10-22T13:21:09.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy, fast delivery and communication on item being shipped.  The one negative is when I emailed them to ask if a hose could be connected to the drain the inside sales rep responded by saying he/she was not a plumber but they supposed I could ask one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T21:22:20.000Z",
          "Titre": "We have ordered on two separate …",
          "Contenu": "We have ordered on two separate occasions through ACity.  Both times our stainless steel mop sinks have come damaged, so we have had to bend them back into original shape.  Fedex, the delivery service, did not let us open the box to check for damage first, they said that was not their company policy.  They said if it wasn't signed for, that it was their property and they would have to take it with them.  So, whose responsibility is it? ACity or Fedex?  Either way, I have somewhat damaged sinks that are now my property and my responsibility, yet not in the condition in which I ordered them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Restaurant on the Corner",
          "Nb_Reviews": 1,
          "Date": "2014-10-11T16:35:34.000Z",
          "Titre": "Good but could be better on service",
          "Contenu": "Was helped to a great extent, would patronize again, spent close to few hundred, but sales person didn't close deal with me I left and went to REM and spent over 10 times that much an hour later.\r Could spent that with you guys."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FAHP",
          "Nb_Reviews": 1,
          "Date": "2016-08-02T15:43:50.000Z",
          "Titre": "Great product prices,  expensive shipping",
          "Contenu": "The online order form was giving me trouble so I called. Within 10 minutes, everything was straightened out and finalized for shipping. My only complaint was the high shipping cost. It was almost as much as the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bobby",
          "Nb_Reviews": 1,
          "Date": "2013-03-04T23:47:51.000Z",
          "Titre": "Too Pushy",
          "Contenu": "The purchase experience was all positive and the sales staff were superb.  One item was to be picked-up later, a refrigeration unit.  Sales staff noted that there would be contacts encouraging pick-up after one and two weeks.  No problem.  But the reality was that multiple contacts were made by both sales staff and management, with the management contacts bordering on hostile and threatening.  The item was finally picked-up but guys, chill out.  When you start treating your customers like car salesmen do with high-pressure tactics and threats just to try and sell a delivery after you've already been paid, you may drive them away to your competitors.  In fact you already have in at least one instance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles N.",
          "Nb_Reviews": 1,
          "Date": "2014-04-25T19:32:09.000Z",
          "Titre": "good prices but sales rep very hard to get a hold of",
          "Contenu": "Came in with my wife looking for a preo table.  Raffled to Mike I guess the show room manager,  very nice and knowledgeable, shored us what he had and we told him we would be in contact when we could set up a delivery time. Well we tried to reach him for the next 3 days we were told he was bz and he would be told we called or transfered to his voice mail,  which I left 3 messages letting home know we wanted to buy and needed delivered asap. On 3rd day I talked to jon and told him I need to buy this prep table ASAP and if Mike won't call me back I'm going somewhere else so Jon took my order but I had to argue about the discount Mike had promised finally got the price and item delivered.  Otherwise would have given 5 stars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doc Waldie",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T16:15:35.000Z",
          "Titre": "Our order was messed up on your end",
          "Contenu": "Our order was messed up on your end. After a couple phone calls the problum was cleared up and we got all of our order. Thank you for making it right.         Doc Waldie"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ladonna K. Ok.",
          "Nb_Reviews": 1,
          "Date": "2017-03-26T16:14:21.000Z",
          "Titre": "Disappointed",
          "Contenu": "The service was great for the purchase of my ice machine but I didn't receive it as promised. It was promised for delivery by Thurs. or Fri. but I didn't receive it until Monday."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2018-08-21T15:50:34.000Z",
          "Titre": "Some kinks, but it was resolved in a fair manner",
          "Contenu": "The assistance that I received in the store was great.  I also felt that I was able to find the right product for the right price.  However, my purchase was damaged upon delivery and it was difficult to come to a reasonable agreement on making this right.  Good customer service can make or break a business.  Upon delivery, I called customer service to discuss the damage to my product and was placed on hold for well over 20 minutes.  Once I was able to speak with a customer service representative, the issues was still left unresolved.  Once I was given an offer to compensate for the damages, it was unacceptable.  When a customer has an issue that is not of their own doing, the company should take care of the issue as quickly and fairly as possible.  In the end, I was able to resolve the problem in a fair manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Gour",
          "Nb_Reviews": 1,
          "Date": "2019-05-04T17:59:47.000Z",
          "Titre": "The piece of equipment was delivered…",
          "Contenu": "The piece of equipment was delivered without notice during lunch. Because the parking lot was full during the lunch period the 265 lb grill was left across the parking lot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eliot",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T17:36:51.000Z",
          "Titre": "Upset that they came after me for sales tax",
          "Contenu": "I'm upset that you guys came after me for sales tax after the sale was complete.   Not an honest way to do business.  Should have on the ebay listing and during checkout."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2013-10-19T19:38:02.000Z",
          "Titre": "Delivered as advertised, but no shipping options or information.",
          "Contenu": "It was easy enough to find what I was looking for and order. However, there were no shipping options. I had no idea how long it would take until after I placed my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karl Owens",
          "Nb_Reviews": 1,
          "Date": "2013-03-04T22:07:55.000Z",
          "Titre": "I'll let you know once I receive it all....",
          "Contenu": "Along with the tables you had in Atlanta we ordered chairs that aren't scheduled to ship until 3/6/13 and stools until 3/11/13!!! \rWhat's up with the delay?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Schaefer",
          "Nb_Reviews": 1,
          "Date": "2013-10-22T20:46:46.000Z",
          "Titre": "good prices over all with good response times",
          "Contenu": "Over all good prices, customer service could be better. When salesman tells you something and then dont never do it, it gets old. but over all good review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pleasant Valley",
          "Nb_Reviews": 1,
          "Date": "2018-05-10T15:02:10.000Z",
          "Titre": "It would be great if the photos of the item matched the item…",
          "Contenu": "It would be great if the photos of the item were the actual photos or the description were not so generic.  Only two baskets came versus the four it shows in the picture.  We were lucky we had one more basket to mostly fit in there on hand.  We were also lucky to have had dividers from our previous ice cream freezer or we would have had a big mess of novelty ice cream products just heaped together in the baskets.  These freezers should come with the parts needed to display ice cream neatly.  My previous freezer had four baskets with each divided into 3 compartments with extra storage below.  I'm now down to three baskets with reclaimed dividers and no room for a 4th basket and no storage space there to fill.  This cuts down on my organization and ability to carry the same product.  The old dead freezer and the new freezer have the same dimensions.  The sale went well, the freezer was delivered right on time, and it seems to be working well, so far."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "sebestian",
          "Nb_Reviews": 2,
          "Date": "2017-01-17T03:14:49.000Z",
          "Titre": "Good Exeperience...",
          "Contenu": "First time I shop on the this website. I am very love it because they are convenient and easy to get in, and looking for some item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rustam saiyed",
          "Nb_Reviews": 1,
          "Date": "2013-09-18T01:58:09.000Z",
          "Titre": "good price but not on time delivery",
          "Contenu": "very good price friendly sales person good product but my delivery was one week late than promise date but its ok not that bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Ehalt",
          "Nb_Reviews": 1,
          "Date": "2017-03-31T16:34:59.000Z",
          "Titre": "Long delay in delivery",
          "Contenu": "Long delay in delivery. Three days from GA to AZ, six days from Phoenix to Sedona, 120 milesVery costly for my business"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Wacha",
          "Nb_Reviews": 1,
          "Date": "2014-08-09T18:32:26.000Z",
          "Titre": "Shipper wouldn't bring it to the proper location",
          "Contenu": "The delivery man just dumped it at the front of our restaurant although we asked to have it brought to the store room."
        },
        {
          "Note": 3,
          "Lieu": "GP",
          "Pseudo": "ChrisD",
          "Nb_Reviews": 3,
          "Date": "2015-12-12T02:42:05.102Z",
          "Titre": "good prices slow shipping",
          "Contenu": "they have great prices and selection, however, their communication on shipping time frames and details need work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Merle Perrin",
          "Nb_Reviews": 2,
          "Date": "2017-02-19T18:13:25.000Z",
          "Titre": "Blender Jar",
          "Contenu": "I had one the same size but shaped differently. The top is a joke. But the one I have will work on this one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T18:26:32.000Z",
          "Titre": "I ordered the wrong size",
          "Contenu": "I ordered the wrong size. I can still use them, description should have dimensions though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rex",
          "Nb_Reviews": 1,
          "Date": "2017-02-22T17:04:04.000Z",
          "Titre": "2 weeks for delivery???",
          "Contenu": "product and cost were the reasons for purchasing here but dont be in a hurry! 2 weeks for me, wow!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2018-03-11T01:06:51.000Z",
          "Titre": "Dealing with ACityDiscount rep Adam was…",
          "Contenu": "Dealing with ACityDiscount rep Adam was fine. But we had trouble dealing with UPS. We followed the tracking directions - called the number provided - and got a rep who was clueless. We gave her all the relevant information and she said the order did not exist. Yet we had been told it had been shipped and we should call this number. After more than one call with both my husband and I talking to the UPS person she finally realized that we had been given the wrong number. The number we needed was UPS Freight. The ship was promised for 2 different times, then delayed. The trucker who finally delivered the steel table and sink was very good to deal with, fortunately, after the previous aggravation. He offered to open the box when I said I wanted to inspect the merchandise and waited patiently while I looked it over to be sure there was no visible damage and that a table, 4 legs, sink, and faucets were included. I highly recommend you contact UPS and be sure reps know that to immediately put the customer in contact with UPS Freight rather than regular UPS if it is a large package. Better yet, have that information included in emails from ACity Discount. The frustration we experienced could have been completely avoided with better communication."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mickael Sanders",
          "Nb_Reviews": 1,
          "Date": "2018-09-06T16:44:02.000Z",
          "Titre": "This was my first time dealing with…",
          "Contenu": "This was my first time dealing with this company and so far I don't have any complaints"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2016-12-11T21:42:27.000Z",
          "Titre": "Damaged product",
          "Contenu": "Price was excellent & delivery time was good. My product was damaged during delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2017-01-14T17:13:53.000Z",
          "Titre": "Great but no notice of delivery",
          "Contenu": "Item came quickly but was left in the street with no one letting us know it was there"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2016-10-19T14:07:24.000Z",
          "Titre": "Good product",
          "Contenu": "Exactly what I order, good product. Did not receive tracking information to my email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2013-04-29T23:32:24.000Z",
          "Titre": "timely deliverly",
          "Contenu": "used food warmer...could have been cleaned better.  Still had lime deposits inside."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Baytown",
          "Nb_Reviews": 1,
          "Date": "2013-07-31T19:53:30.000Z",
          "Titre": "Good",
          "Contenu": "Would be better if the salesperson would answer the phone when customer calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yasier",
          "Nb_Reviews": 2,
          "Date": "2013-06-02T23:51:07.000Z",
          "Titre": "the refrigerator was not the same as showing in the photo and had a dent"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2015-11-03T20:34:55.667Z",
          "Titre": "Too many Delays on A-City Doscounts part",
          "Contenu": "Ordering took days due to your people getting one anothers approval"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T17:06:28.000Z",
          "Titre": "It was quite the challenge in the…",
          "Contenu": "It was quite the challenge in the beginning of the transaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandi Williams",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T17:03:06.000Z",
          "Titre": "Need a better pricing system...No price …",
          "Contenu": "Need a better pricing system...No price on products in store..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pm plumbing",
          "Nb_Reviews": 2,
          "Date": "2017-03-30T14:19:04.000Z",
          "Titre": "I received exactly what I had ordered …",
          "Contenu": "I received exactly what I had ordered with prompt shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reginald Brown",
          "Nb_Reviews": 5,
          "Date": "2019-03-20T16:12:56.000Z",
          "Titre": "Driver did not have hand truck upon…",
          "Contenu": "Driver did not have hand truck upon delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 1,
          "Date": "2016-04-13T01:01:30.000Z",
          "Titre": "I think is best",
          "Contenu": "I think is the best of all time favorite sites"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SDR Personal Chef Service",
          "Nb_Reviews": 1,
          "Date": "2015-11-02T19:43:22.814Z",
          "Titre": "Nice",
          "Contenu": "Up to date equipment and reasonably priced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yvette Camacho",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T16:19:22.000Z",
          "Titre": "Shipping cost it’s hight"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BRP",
          "Nb_Reviews": 1,
          "Date": "2016-02-02T16:56:27.378Z",
          "Titre": "so far my expeience is good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "unhappy",
          "Nb_Reviews": 1,
          "Date": "2017-04-24T15:46:46.000Z",
          "Titre": "to many follow up emails"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Conner-Westbury Funeral Home",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:04:45.000Z",
          "Titre": "Great, customer service",
          "Contenu": "Mike was the associate that helped and he was very knowledgeable and helpful."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Devante Chisholm",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T03:53:50.000Z",
          "Titre": "ACityDiscount has great prices and…good customer service",
          "Contenu": "ACityDiscount has great prices and their service was very efficient and professional. Received a phone call telling me when I should expect delivery and an e-mail to track package if necessary. Delivery carrier called the morning of delivery to insure someone would be home to accept package. Stainless sink arrived in good condition (well packaged on a pallet). Would buy from this merchant again .."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Mary Jean Acosta",
          "Nb_Reviews": 5,
          "Date": "2023-10-20T02:03:00.000Z",
          "Titre": "Nice gadget shop",
          "Contenu": "The staff is good,they are willing and patient assisting the costumer.the gadget is affordable and 100 percent legit.try your own and you will believe in me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ionies Island Kitchen",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T13:39:10.000Z",
          "Titre": "Search for kitchen equipment",
          "Contenu": "They die not have the items I needed in stock and were not expected before another 6 weeks or so. The supply chain issue so not their fault. The sales person was helpful and patient with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Herman Parker",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T13:44:57.000Z",
          "Titre": "I recently purchased a dishwasher from…",
          "Contenu": "I recently purchased a dishwasher from ACityDiscount, and I was very impressed with their service. The staff were knowledgeable and helped me choose a model that fit my needs and budget perfectly. The delivery process was smooth and efficient, and the installation team did a great job setting up the dishwasher and making sure everything was working properly before they left. Overall, I had a great experience with this company, and I would definitely recommend them to anyone in the market for a new dishwasher or other home appliances."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Msk",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T20:43:48.000Z",
          "Titre": "over all i am satisfied still not used…",
          "Contenu": "over all i am satisfied still not used my wok once i used it will update more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clarence Brown Conference Cent",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T18:44:16.000Z",
          "Titre": "Placed order online and it was…",
          "Contenu": "Placed order online and it was delivered in a timely manner. I did have questions while shopping online and logged in to chat and was never answered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "All About Kids Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T23:32:15.000Z",
          "Titre": "A city Discount is awesome I just…didn't like the person that waited on me",
          "Contenu": "A city Discount is awesome I just didn't like the person  that waited on me. Service was great delivery was awesome"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randall Dockery",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T13:47:59.000Z",
          "Titre": "Ordering was easy and efficient",
          "Contenu": "Ordering was easy and efficient Shipping was not so good. The package was not delivered when they said it would be. Two days later"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Luke Ramdin",
          "Nb_Reviews": 8,
          "Date": "2023-04-20T12:02:43.000Z",
          "Titre": "ACityDiscount is a great site",
          "Contenu": "ACityDiscount is a great site. This is a very nice place to buy cheap products! I love it! The prices are amazing, and I can get my product within a few days. This is the best site for me to get things like this because I don't have time to go shopping or visit stores. They have everything I need at an affordable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T16:36:07.000Z",
          "Titre": "Easy to Work With!",
          "Contenu": "Easy to purchase product. ACityDiscount shipped out product timely. Item arrived as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "American Learning Centers",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:02:07.000Z",
          "Titre": "Quick service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T09:02:23.000Z",
          "Titre": "Really contented with the furniture",
          "Contenu": "Really contented with the furniture. Very helpful staff reasonable prices & good quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJs Fish  Wings",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T22:50:06.000Z",
          "Titre": "Josh was very helpful and knowledgeable…",
          "Contenu": "Josh was very helpful and knowledgeable about the equipment. Good experience over all."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Rusabel Lasanda",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T07:06:10.000Z",
          "Titre": "i have a great experinced i bought a…",
          "Contenu": "i have a great experinced i bought a philip screw, it is past and easy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William M. Spears",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T03:26:17.000Z",
          "Titre": "all in all a great experience and you…",
          "Contenu": "all in all a great experience and you do good work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julio Lergier",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T19:59:48.000Z",
          "Titre": "Leslie Great Job!",
          "Contenu": "Great Kob by Leslie, she went out of her way to find a machine for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "john Goodhue",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T11:55:17.000Z",
          "Titre": "Roof fan",
          "Contenu": "Had what I was looking for and delivered on time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Woodys Eats and Treats",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T15:31:42.000Z",
          "Titre": "very helpful,was quick delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah Ezekiel Zeidman",
          "Nb_Reviews": 15,
          "Date": "2023-03-09T15:37:57.000Z",
          "Titre": "Georgia peach plumbing is my hero",
          "Contenu": "Georgia peach plumbing is my hero love Noah"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Clegg",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T01:34:51.000Z",
          "Titre": "goods delivered before promised",
          "Contenu": "goods delivered before promised. Fair pricing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Martin",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T07:50:49.075Z",
          "Titre": "kitchen products wide variety..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Harvey",
          "Nb_Reviews": 3,
          "Date": "2020-12-05T16:49:11.000Z",
          "Titre": "I have not received my purchase",
          "Contenu": "I have not received my purchase, as of yet.  I see that it was shipped USPS, so I am expecting it any day now.  I saw what appeared to be a tracking number, but the site did not have the tracking number set up as a link to track my items.  Other than that, I was very satisfied with my purchase.  Again, I have not received the package to see the condition of the items that I purchased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Armando Castro",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T17:27:27.000Z",
          "Titre": "Need to change the prices on the display boxes to match the computer prices",
          "Contenu": "Buy the knifes set but was priced $150 and they charge me$175 .i ask they why and say the price was change on the computer but not on the display box so they still charge me $175 even if i show them the box was marked $150"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G Milliner",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T15:52:52.000Z",
          "Titre": "Our buying experience was amazing but delivery was not",
          "Contenu": "Our buying experience was amazing and the oven is perfect. The only issue we had was with the delivery : the oven was unexpectedly delivered. We had received no tracking number, and no appointment taken (despite clear instructions on the packing slip) and the +100lb package was left in full sun on the parking lot, not even close to our door. We actually received a shipment email and tracking number 1 week later..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sofia Pereira",
          "Nb_Reviews": 3,
          "Date": "2021-05-22T17:42:54.000Z",
          "Titre": "Good selections of electronics…",
          "Contenu": "Good selections of electronics available at very reasonable cost. Premium quality products. Offers amazing deals and discounts on every product which we bought from their site. Happy with the quick shipping process and attentive customer support service. Satisfied with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rissadacutie",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T16:17:10.000Z",
          "Titre": "Acitydiscount good deals",
          "Contenu": "Acitydiscount provides one on one consultation catered to the clients needs.You may have to call a few times but they will give you advise in the right direction. They also will provide written quotes.They also ship direct to wherever you are in the U.S so don't worry if you are not located near them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Smith, Willow Praise Church",
          "Nb_Reviews": 3,
          "Date": "2018-11-14T02:10:51.000Z",
          "Titre": "All the staff I spoke with were polite…",
          "Contenu": "All the staff I spoke with were polite and helpful when I was trying to complete the order and payment. We are a Church that utilizes out kitchen for a weekly community dinner, other meals on weekends and a Thanksgiving community meal so we needed the refrigerator ASAP. You had my order ready to deliver in less than a week.  We will be doing business with you again soon. Thank you, Barbara Smith, Willow Praise Church"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2018-11-16T20:57:57.000Z",
          "Titre": "Purchased a sliding top cooler ...",
          "Contenu": "I did my homework before purchasing so I didn’t need a lot of help.  The shipping company seemed to have the unit a long time before scheduling delivery after I was told it was out for delivery.  I was asked to do a review 4 days before receiving the cooler.  The unit itself is well built, looks and operates good so far, and was purchased at a very fair price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERS",
          "Nb_Reviews": 3,
          "Date": "2018-11-03T19:13:39.000Z",
          "Titre": "Shipment was fast, UPS abused the shipping carton.",
          "Contenu": "No problems with their service as the shipment went out the next day after purchasing online. The only issue I had was with UPS abusing the microwave carton by apparently dropping it at least once and puncturing the box in three places.  It’s a miracle the microwave arrived unscathed and functions well. I would highly recommend ACD shipping department place FRAGILE stickers on these shipments to at least hope someone with UPS will take care in S&H."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Enteng Hutasoit",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T11:43:25.000Z",
          "Titre": "This store surprized by the assortment of furniture here.",
          "Contenu": "In my opinion, it's very important for human to find the time in their tight schedule in order to dedicate it to household chores. That's why I once have decided to start finding a proper store to decorate my room with new stuff and replace the old furniture with a new one. This store surprized by the assortment of furniture here. You can easily find the most suitable option of couch for example and you won't actually spend too much time on it. This is the main feature, that everything goes very fast here. Customer support is on a solid level, mostly because they are very responsive and I guess quite responsible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lor Kutchins",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T13:04:44.000Z",
          "Titre": "Excellent..But",
          "Contenu": "Excellent. Would rate five stars if the product would have been packed with more protection. The legs came loose and dented the product in transit. Not major enough damage to endure the hassle of refusal, return and replacement, but nevertheless a disappointment. Repairable damage. Happy with the product and the buying experience otherwise, especially followup and perceived concern about the buying experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2017-08-18T02:03:48.000Z",
          "Titre": "The merchandise was delivered on time …",
          "Contenu": "The merchandise was delivered on time but was severely damaged. The driver took it back and I contacted the merchant to replace or refund. The merchant promptly sought for a replacement unit and secured one and shipped it as soon as they could. The kitchen project was delayed a little but overall the merchant did good job following up with the customer. I will recommend the merchant to others for their after service.,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B Hood",
          "Nb_Reviews": 1,
          "Date": "2017-10-31T17:37:24.000Z",
          "Titre": "I had a great experience buying my …",
          "Contenu": "I had a great experience buying my convection stove eye . Salesmen told me you could use any cookware on it . On outside of box when I received it , it says you have to use certain kind of cookware . Could you clear that up for me ? I haven’t opened it yet to read about it in case I decide to return it . I certainly hope I don’t . Thank you !!!!👍👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest P. Parra",
          "Nb_Reviews": 1,
          "Date": "2017-10-17T16:22:39.000Z",
          "Titre": "So far so good.",
          "Contenu": "This single transaction worked out fine. I got a email when it was shipped and the item has been delivered in good shape.   I also ordered a much more expensive item from them the same day on a separate order-----(Ice Machine) but so far have not gotten a email as to whether the second order has shipped yet or not, or when it is expected to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray Allen-Pippins BBQ",
          "Nb_Reviews": 1,
          "Date": "2017-10-25T18:24:55.000Z",
          "Titre": "TurboAir-M3 series",
          "Contenu": "Overall I was pleased with my purchase of the turbo air refrigeratorAdam was very helpful in helping me select the right unitthe reversing of the door was quite involved-much harder than I expectednot your problem turbo airIt's been running since last Thursday(19th)We are experiencing an issue with door sensors-found out this is ajust released new model--It's having some issuesHaving to replace the control panel unitall covered by warranty"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WT",
          "Nb_Reviews": 2,
          "Date": "2019-01-21T19:21:28.000Z",
          "Titre": "Good product; poor packaging. WT",
          "Contenu": "Appears to be a good quality product. Packaging was very poor with absolutely no padding between the box and the product. Miraculously, there was only very slight damage during shipping. The seller advised me in advance to check the product before accepting; I expect the poor packaging has been a problem for them before.  Any heavy metal object should be packaged better than this before it is given to truckers and package handlers to toss around. Overall I am very pleased with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel M.",
          "Nb_Reviews": 1,
          "Date": "2018-03-26T21:45:02.000Z",
          "Titre": "Not bad",
          "Contenu": "Everything was prompt and quick. My only issue is the lack of clarity on the website about returns. There needs to be a clear tab or option that details how to get into contact with the returns process. (To note, return not needed because of ACityDiscount) But everything else was as expected and delivered correctly the first time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2019-02-10T16:53:26.000Z",
          "Titre": "Overall very good service and quick to…",
          "Contenu": "Overall very good service and quick to answers questions. I also appreciated the email confirming the power supply thing.The only point of improvement I would add to that is featuring pictures of the plug. While we had a three phase set up with 50 amps the plug was slightly different which delayed us a bit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen N",
          "Nb_Reviews": 1,
          "Date": "2018-01-08T03:55:39.000Z",
          "Titre": "Pros (and cons I think I can live with)",
          "Contenu": "I didn't expect the shipment to arrive so quickly.  The price was 2/3 of what I would have paid to Vitamix for this particular blender carafe.  I only wish that I had received the exact model shown on the online page, which had the original rubber ergonomic handle--as opposed to this thin plastic one; also, the lid jiggles around as if it will fall off when I'm blending.  The original lid has a special lip that secures the seal.  I will see if my original lid will fit the new carafe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gedaph",
          "Nb_Reviews": 2,
          "Date": "2018-06-22T14:52:28.000Z",
          "Titre": "Quick Fix for Old Chairs",
          "Contenu": "The seats were perfect for replacing our two old chairs and they arrived very quickly.  I would give 5 stars, but one seat has a tiny vertical stress tear (1 inch) in the very front.  We don't care enough to send it back, but maybe it snuck past quality control.  Or perhaps it tore during shipment?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cow Country Sweets",
          "Nb_Reviews": 2,
          "Date": "2019-01-20T19:24:02.000Z",
          "Titre": "I would give 5 stars",
          "Contenu": "I would give 5 stars, except for the delivery information.  One appliance was coming by Fedex and because I set it to go to my business address, there is no way to get notified as to when it might arrive. The only information I was given is that it could arrive between 8:00am & 8:00 pm.  For the other, the tracking number wasn’t identified, on the invoice, and I had to contact the shipping company to get an idea as to when it would arrive. Being that I am in a rural area, deliveries take longer than usual.  Still waiting on the oven to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elliott",
          "Nb_Reviews": 2,
          "Date": "2018-02-28T14:46:56.000Z",
          "Titre": "Ice machine arrived with a dent in the…",
          "Contenu": "Ice machine arrived with a dent in the side. Shipping box wasn't damaged, so it was boxed that way from the manufacturer. Wasn't a big deal for me as the machine is under my island and the dent isn't in view. Everything about the purchase went smooth and item arrived promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AarielD’Cruz",
          "Nb_Reviews": 4,
          "Date": "2021-04-22T13:08:37.000Z",
          "Titre": "Excellent customer support service",
          "Contenu": "Excellent customer support service provided by ACityDiscount. Bought one Electric 6 Burner Restaurant Range with Standard oven which can be used for commercial as well as house purpose. Liked the quality of the product very much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 2,
          "Date": "2021-06-01T19:03:43.000Z",
          "Titre": "Ice Maker Scotsman 65lb Undercounter",
          "Contenu": "First, I paid $50 to have it brought into the house.  That did not occur.Second, the condenser is loud.  Is that common with this model.  I did not have this issue with the previous ice maker.  Any idea why it is so loud???"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Malone",
          "Nb_Reviews": 2,
          "Date": "2017-09-27T12:37:07.000Z",
          "Titre": "The experience in placing and receiving …",
          "Contenu": "The experience in placing and receiving my order was very easy and I received what I ordered in a timely manner. There was no shipping damage to the equipment which means that it was packaged well and the shipping company that delivered it took care in handling it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SE",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T23:08:17.000Z",
          "Titre": "Normally would be five stars",
          "Contenu": "Normally would be five stars.  Product and shipping are still good quality and fast.  Packaging this time was in a much larger box, had some concern about product integrity, but appears to be in good shape."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Davis",
          "Nb_Reviews": 3,
          "Date": "2017-12-04T16:37:33.000Z",
          "Titre": "The ice machine I ordered took a little …",
          "Contenu": "The ice machine I ordered took a little longer to get to me than originally discussed but my salesman, Ned followed up as best he could, I think the issue was with whom the distributor was for this particular machine. Good prices and good communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mo",
          "Nb_Reviews": 2,
          "Date": "2018-01-17T17:29:09.000Z",
          "Titre": "I am very satisfied with the speed of …",
          "Contenu": "I am very satisfied with the speed of the delivery, but the driver failed to give me a call even though it was stated on the slip. I was called from another site, by the time I arrive in 20min, the driver was gone after dropping off the equipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori Weir",
          "Nb_Reviews": 2,
          "Date": "2020-02-20T16:34:47.000Z",
          "Titre": "Delivery from purchase to front door…",
          "Contenu": "Delivery from purchase to front door was wonderful. However the product itself is in question. The cooler doesnt seem to be cold enough and it's been on for 3 days now. Gonna give a little more time and see what happens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer #1",
          "Nb_Reviews": 3,
          "Date": "2018-02-17T18:19:35.000Z",
          "Titre": "The thermostat Control is in the way of…",
          "Contenu": "The thermostat Control is in the way of installing the legs on Deep fryer have to remove thermostat control in order to secure them too unit ...... Have not used fryers yet we'll get back with you on how they function at a later date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BBQ Man",
          "Nb_Reviews": 1,
          "Date": "2020-07-25T17:35:43.000Z",
          "Titre": "The product ordered is as advertised…",
          "Contenu": "The product ordered is as advertised and was delivered in a timely manner. The shipping box was damaged and noted as such by the USPS and the item was not damaged. However, the shipping charge was excessive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica August",
          "Nb_Reviews": 2,
          "Date": "2022-04-21T08:21:47.549Z",
          "Titre": "quality products...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "marko",
          "Nb_Reviews": 2,
          "Date": "2017-12-14T12:00:51.000Z",
          "Titre": "drain pan",
          "Contenu": "The item was good, only problem in shipping, ups had to have me sign for the package, I missed them 3 times and had to drive 20 miles to pick it up at the ups hub. Don\"t know why  I had to sign for a 20 dollar item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tool Crib assistant",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T18:13:47.000Z",
          "Titre": "Individual pieces",
          "Contenu": "They arrived before the expected date and were exactly what was needed.  Thank you for your assistance.  I liked that I could buy them as individual pieces instead of packs of 12."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Pirkl",
          "Nb_Reviews": 9,
          "Date": "2018-04-03T15:19:06.000Z",
          "Titre": "Update on ACity's response",
          "Contenu": "Well, ACity finally came through.  They covered the service call and gave a little extra for the inconvenience.  They did have to fight with the manufacturer like I did but guess they had more leverage and won out.  Got the check today.  Bad thing is, the other unit I bought from them (same manufacturer) now went down. Must be something about getting close to end of warranty. They said it should be no problem reimbursing me this time as they straightened things out with the manufacturer. I would have gone to 5 stars but with all the initial problems, no call backs etc I went with 4 due to their fighting for me with the manufacturer.  I'd buy from them again but will ask more questions also. Just good business practices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesus",
          "Nb_Reviews": 1,
          "Date": "2017-08-28T17:30:40.000Z",
          "Titre": "This message is to the freight company you used for my delivery...",
          "Contenu": "Every person I talked to was very helpful and pleasant to deal with.  Your people are customer service oriented.  The one think I didn't liked is that the freight company you used from GA to RI, never bothered to give you the delivery date of my purchase.  I actually called to cancel the order and was put on hold, then the sales rep told me that the item was already in transit.  Had I known, I could've pass that info along to my client who was nervous about not having his item on time.  I also spent some time looking for an alternative.  I think the freight company you hired could have done a better job.  I thought of letting you know to see if you'll pass my message along to them.  Maybe they need some feedback.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valier Public Schools",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:46:33.000Z",
          "Titre": "easy to find and check out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dallaas Bagels",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T14:34:29.604Z",
          "Titre": "good services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Southern Plate Catering",
          "Nb_Reviews": 1,
          "Date": "2018-12-26T20:24:42.000Z",
          "Titre": "I recieved my order today and haven't…",
          "Contenu": "I recieved my order today and haven't had a chance to put it to work. So far it looks sturdy enough to do what I need to do. Would like to put it to work before i give it five stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2017-08-21T02:26:26.000Z",
          "Titre": "I received a quality product at a …",
          "Contenu": "I received a quality product at a reasonable cost. The shipping via UPS was lousy which delayed the receipt considerably. I would recommend you to a friend. Have questions about the shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff New",
          "Nb_Reviews": 3,
          "Date": "2018-12-03T00:04:13.000Z",
          "Titre": "Great place to shop",
          "Contenu": "I shopped around for six months and A City Discount had the best over all prices.  Customer service was fantastic my only regrets was not ordering before they started charging sales tax"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A. Scaduto",
          "Nb_Reviews": 1,
          "Date": "2018-01-24T17:59:20.000Z",
          "Titre": "the products I ordered were delivered …",
          "Contenu": "the products I ordered were delivered on time and in perfect condition. This company sent enough information for me to track and know within an hour of delivery. I will be ordering again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Not",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T19:50:00.000Z",
          "Titre": "Water Filters for Ice machine",
          "Contenu": "Not now.  I said all I had to with rating above"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 7,
          "Date": "2019-07-30T14:29:11.000Z",
          "Titre": "Quick Delivery",
          "Contenu": "Had what we wanted and was able to deliver it quickly. Ordering on the phone took longer than I would have liked. Overall, I am happy to continue doing business wit ACityDiscount"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony P.",
          "Nb_Reviews": 1,
          "Date": "2018-01-01T17:20:25.000Z",
          "Titre": "Fast shipping & great selection",
          "Contenu": "Fast shipping great selection although the lid arrived slightly dented I would say it was the shipping companies fault it wouldn’t prevent me from purchasing from Acitydiscount again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2019-01-27T23:56:58.000Z",
          "Titre": "Positive experience, excellent customer service",
          "Contenu": "First experience I had issues with the order I had placed however they were very quick and helpful in rectifying the issues I had. I placed a second order and it went flawlessly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 2,
          "Date": "2021-06-30T17:47:10.000Z",
          "Titre": "Good price Really fast delivery    Only…",
          "Contenu": "Good price Really fast delivery    Only problem was that the shipping company did not call us they just showed up on Friday night luckily we were at work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2020-08-30T18:02:14.000Z",
          "Titre": "Ordered a part for my wife's mixer",
          "Contenu": "Ordered a part for my wife's mixer, was able to use Amazon Pay which made things nice and easy. The part arrived earlier than expected and in good condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B P",
          "Nb_Reviews": 1,
          "Date": "2018-09-11T19:35:10.000Z",
          "Titre": "more detailed instruction on connection…",
          "Contenu": "more detailed instruction on connection more detail on shipping other than that fast delivery very easy to work with will do business with company again as needs arise"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Di",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T03:35:38.000Z",
          "Titre": "The item was ship promptly and although…",
          "Contenu": "The item was ship promptly and although the aprons are of ecellent quality, the pinstripes on them are larger than they appear . I was looking  for thin pinstripe aprons."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Upendra Rout",
          "Nb_Reviews": 4,
          "Date": "2022-03-19T19:51:08.000Z",
          "Titre": "Every time kitchen cleaningI am Upendra I have belong Odisha Jajpur I am very punctuality I am very sincere I have work hard",
          "Contenu": "Every time kitchen cleaning. Every time let's on kitchen insi. Everytime second gas cylinder. Kitchen room every time clean"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul P. Mavour",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T18:34:13.000Z",
          "Titre": "But for the fact that I was not told…",
          "Contenu": "But for the fact that I was not told when my dough mixer was shipped, and the expected delivery date and time, I would have given ACITY DISCOUNT fivw stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ting Ting",
          "Nb_Reviews": 1,
          "Date": "2017-09-18T00:43:50.000Z",
          "Titre": "One of the 6 burner not working",
          "Contenu": "One of the 6 burner not working,  contacted to salesperson, got the telephone number for manufacture support, the mechanic came within two days and got it fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Harden",
          "Nb_Reviews": 1,
          "Date": "2018-08-20T15:44:48.000Z",
          "Titre": "Online prices are good",
          "Contenu": "Online prices are good, but don't send me a catalog that says \"call\" for all the prices. That just gives me ideas to Google and look elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melinda Hansen",
          "Nb_Reviews": 3,
          "Date": "2020-03-23T16:39:07.000Z",
          "Titre": "It was quick",
          "Contenu": "It was quick, easy, and the product was delivered fast. The only draw back is the shipping cost was almost two times higher than the item I ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenny Mojica",
          "Nb_Reviews": 5,
          "Date": "2023-01-07T05:50:53.000Z",
          "Titre": "I love trying new things!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alisha Evans",
          "Nb_Reviews": 5,
          "Date": "2021-01-27T14:20:07.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service. The sellers are very knowledgeable and there is a focus on making sure you get the right equipment at the best price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Restraint owner",
          "Nb_Reviews": 1,
          "Date": "2018-01-24T21:17:16.000Z",
          "Titre": "There could have been a better …great quality",
          "Contenu": "There could have been a better description as far as the measurements of the item between the actual basket size and the total size of the basket."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2018-07-02T00:14:13.000Z",
          "Titre": "Unit is great and a good value",
          "Contenu": "Unit is great and a good value. Shipping company didn't deliver on the day they were supposed to, and I took the day off work to wait for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 3,
          "Date": "2019-06-16T23:42:35.000Z",
          "Titre": "I gave it a 4 star",
          "Contenu": "I gave it a 4 star because you failed to say in the description that it was being shipped from outside the US and causing an international fee"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew L. Bent",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T05:32:40.000Z",
          "Titre": "The process was smooth at the very…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ART of DFW",
          "Nb_Reviews": 1,
          "Date": "2019-10-30T02:36:12.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, fast delivery.  Could communicate quicker initially.  We did not know if the item was in stock for three days after ordering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Lakhani",
          "Nb_Reviews": 4,
          "Date": "2020-06-21T20:31:37.000Z",
          "Titre": "Rudy was very helpful for the time I…",
          "Contenu": "Rudy was very helpful for the time I purchased it to the time I got the item delivered. The delivery company was not very communicative."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G Miller",
          "Nb_Reviews": 1,
          "Date": "2017-12-11T17:12:01.000Z",
          "Titre": "Item was needed quickly",
          "Contenu": "Item was needed quickly, would have liked the option of next day delivery, but still arrived within a few days, repair was made and all is good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "crista johnson",
          "Nb_Reviews": 2,
          "Date": "2018-04-23T17:44:37.000Z",
          "Titre": "on target.....showed up when they said…",
          "Contenu": "on target.....showed up when they said and is just as represented....look forward to getting it up and running with the rest of our kitchen!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyron",
          "Nb_Reviews": 3,
          "Date": "2021-07-26T11:49:24.000Z",
          "Titre": "Got new ovens from this guys",
          "Contenu": "Got new ovens from this guys, and they are sure quality as it look like. Delivery took a longer time from the expected ETA."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Zack Brookes",
          "Nb_Reviews": 6,
          "Date": "2021-09-16T17:46:14.000Z",
          "Titre": "I was thrown abit back by the prices to…",
          "Contenu": "I was thrown abit back by the prices to be honest, will be returning. thought id leave a review as it so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 2,
          "Date": "2017-09-24T17:41:54.000Z",
          "Titre": "I haven't received my murchendise yet.",
          "Contenu": "I haven't received my murchendise yet. Wrong information was provided to me about the delivery date and I am still waiting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Watkins",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T17:32:03.000Z",
          "Titre": "Thank you for your help and please be…",
          "Contenu": "Thank you for your help and please be sure to send me a catalog.  I didn't like your website its not easy to navigate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam H.",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T17:57:29.000Z",
          "Titre": "Third appliance purchased from …",
          "Contenu": "Third appliance purchased from ACityDiscount and everything has been 5 star worthy until this last delivery (first time fedex was the carrier). I had requested a call be made before delivery and provided a cell phone plus backup landline. After never getting a call on either and seeing the status change from delivery on Thursday to pending, I decided to call fedex. After a 20 minutes of transferring to different departments I was told that someone did call and when I disputed this was promptly hung up on. I went and got phone records from my cell provider after this, and those proved to me there never was a call. Back to calling fedex and twenty more minutes of shuffling around and I get a supervisor and the best they can do is 5 days later even though the shipping center where the item is is within 15 miles of the destination. The shipping portion of this particular order was incredibly frustrating, and completely unlike the previous orders from AcityDiscount.com. Removing fedex from the equation would bring this rating back up to 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Polly Bearden",
          "Nb_Reviews": 2,
          "Date": "2020-03-23T08:29:12.000Z",
          "Titre": "Order didn’t arrive on date it was…",
          "Contenu": "Order didn’t arrive on date it was supposed to had to call multiple times and was suppose to be called back but wasn’t"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Island Girl Cafe",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T18:46:04.000Z",
          "Titre": "The boxes for the hood ducts",
          "Contenu": "The boxes for the hood ducts, were too small by 5 to 6 inches. They had to be rebuilt. Everything else was find."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ujamaa Construction",
          "Nb_Reviews": 1,
          "Date": "2020-12-24T12:18:44.000Z",
          "Titre": "Great Service",
          "Contenu": "Adam, provided us with great customer service. We appreciated the equipment arriving in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimmy D",
          "Nb_Reviews": 1,
          "Date": "2018-10-15T00:12:31.000Z",
          "Titre": "The ice machine works great but",
          "Contenu": "The ice machine works great but, there was a little damage to the unit. Either in shipping or lading idk"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boldman Janae",
          "Nb_Reviews": 3,
          "Date": "2021-08-18T04:44:05.000Z",
          "Titre": "The seller is happy to work with you if…",
          "Contenu": "The seller is happy to work with you if you have any problems. I will buy from him again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rockin h ranch",
          "Nb_Reviews": 1,
          "Date": "2017-09-30T19:57:12.000Z",
          "Titre": "Only problem I had was they insist on …",
          "Contenu": "Only problem I had was they insist on adult signature and it is not convent as I work 6 days a week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T19:27:40.000Z",
          "Titre": "I made one call to my salesman and I…",
          "Contenu": "I made one call to my salesman and I had my equipment I needed . Great customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Audrey Sykes",
          "Nb_Reviews": 1,
          "Date": "2019-04-29T09:17:32.000Z",
          "Titre": "Good service and affordable prices",
          "Contenu": "Good service and affordable prices. With delivery coped very quickly. It was nice to cooperate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frenchy",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T16:02:51.000Z",
          "Titre": "Staff was friendly",
          "Contenu": "Staff was friendly. I made my selection, loaded quickly, and got on with my day easy process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael",
          "Nb_Reviews": 7,
          "Date": "2023-12-18T23:47:00.000Z",
          "Titre": "the staff was polite knowledgable very…",
          "Contenu": "the staff was polite knowledgable very efficient, as always  the product was exactly as described. thank you"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Trude Keller",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:46:49.000Z",
          "Titre": "As Described, Fast Shipping",
          "Contenu": "I ordered a dozen melamine serving spoons and they arrived fast. Price was reasonable compared to other sellers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deep Creek Baptist/Amy Segars",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:49:50.000Z",
          "Titre": "This purchase was made as a…Food warmer for church kitchen",
          "Contenu": "This purchase was made as a representative of my church   My experience with ACity was excellent.  Sales Associate John Zheng was absolutely the best.  He helped me with many questions relating to our needs and was patient with my many questions and calls.   Communication was prompt from sales to delivery.  Five stars is not enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Rohla",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:30:27.000Z",
          "Titre": "As Described, Fast Shipping",
          "Contenu": "I ordered a dozen melamine serving spoons and they arrived fast. Price was reasonable compared to other sellers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Fuentes",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:17:38.000Z",
          "Titre": "Brand new appliance in the box",
          "Contenu": "Brand new appliance in the box, great communication, and quick shipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnnys NY Style Pizza",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:06:51.000Z",
          "Titre": "Super friendly and helpful staff",
          "Contenu": "Super friendly and helpful staff! Had something delivered and they were in and out with 30 minutes, quick and efficient."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "geoff njuguna",
          "Nb_Reviews": 9,
          "Date": "2023-12-09T00:35:52.000Z",
          "Titre": "making a deal with you was was a best…",
          "Contenu": "making a deal with you was was a best ever experience. fast and reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ridgeback Smokehouse Products",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:00:07.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service from support staff and others in the mix to get my slicer to me QUICK! I appreciate it! Also, customer service assisted me in picking out the perfect product for my business."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "marilia braga",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T12:57:18.000Z",
          "Titre": "No hassle with the purchase",
          "Contenu": "No hassle with the purchase. Delivery was the same day as payment. A very nice surprise. Overall experience was very positive. The delivery guys were friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Rubby",
          "Nb_Reviews": 5,
          "Date": "2023-09-13T19:28:53.000Z",
          "Titre": "5 decades experience is authentic …",
          "Contenu": "5 decades experience is authentic  indeed wit Acitydiscount It was never a waste of my money shopping with u, I always admire my kitchen utensils , kettle, cooker ,etc anytime I enter my kitchen It’s still new as if it was shopped just yesterday All thanks to you Great deals ; great discount!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Garba saidu kabir",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T20:40:05.000Z",
          "Titre": "Very sefty and durable items"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur E Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:29:43.000Z",
          "Titre": "You were quick on sending out my order right on time",
          "Contenu": "You were quick on sending out my order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TDS Construction",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:59:12.000Z",
          "Titre": "Pleasant experience 👍🏼",
          "Contenu": "Staff was helpful and got a great price on a used eye/ handwash combo sink."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Conyers SDA Church",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T03:54:17.000Z",
          "Titre": "No hassle with the purchase",
          "Contenu": "No hassle with the purchase.  Delivery was the same day as payment.  A very nice surprise. Overall experience was very positive.  The delivery guys were friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Fordrendis",
          "Nb_Reviews": 18,
          "Date": "2023-07-07T15:50:19.000Z",
          "Titre": "Bought a panini grill",
          "Contenu": "There are tons of different furniture and equipment, and, actually, I applied for services to this company when I made a slight renovation of my kitchen. The assortment stunned me for real, and I found a paning grill of a high quality. Couple of tasty paninis were already done! Now I know where to order stuff quickly and free of any hustle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Facilities Mgr",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:33:25.000Z",
          "Titre": "Right experience",
          "Contenu": "Having the part available online and free shipping was great. The local retail store was out of stock and 2X the cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Majerles Black River Grill",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:40:08.000Z",
          "Titre": "Overall great experience",
          "Contenu": "Overall great experience. I called to make sure the online order went through correctly. The representative made sure the order was placed correctly, helped me add on an additional shipping service, and sent a tracking number as soon as it was available. The product we order was exactly what we wanted. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Italian Pie Restaurant",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:19:07.000Z",
          "Titre": "Awesome people to deal with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T18:15:55.000Z",
          "Titre": "Personable Service",
          "Contenu": "Fellow that I spoke with on the phone did an awesome job asking me questions and helping me determine what I needed.  We had a little bit of trouble when my wife picked up the machine since I purchased it and she was picking it up but they worked through it with us and we were able to pick it up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiger Mountain Vineyards",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:55:35.000Z",
          "Titre": "Customer service...THE BEST",
          "Contenu": "Customer service was almost better than our best wine! Shopping online then calling to getting a Real Person (Alex) to help me with my decisions.  Followed up by a call from the manager to make sure everything was good.  THEN, my shipment showed up in 2 days!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oak Rd Lutheran Church",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T19:32:17.000Z",
          "Titre": "New Upright Freezer",
          "Contenu": "I worked with Larry, who laid out the pricing, including some delivery options, and clearly described the process. Once I placed the order, I was kept informed of the timing of the delivery. The unit was delivered on the day that Larry said it would, and the gentlemen that delivered the unit, and removed the old one were very professional, and fully met our expectations. The whole process was smooth, and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shan Sultan",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T17:52:52.000Z",
          "Titre": "Brian Bennett was just great",
          "Contenu": "Brian Bennett was just great, and my guy came and picked it right up. They were actually the same price as a big online retailer that we usually order from, which is really great since we could go by and pick up the kitchen equipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Dely",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T20:24:59.000Z",
          "Titre": "Great help!",
          "Contenu": "The rep we used for help, was super knowledgable and got us product and delivered when he said it would be. We are from Tucson, AZ we will be using this company again for more product when needed. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terris Table LLC",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:56:31.000Z",
          "Titre": "Everyone was friendly and helpful",
          "Contenu": "Everyone was friendly and helpful.  A salesperson walked me to the item I was looking for and purchased."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Preemptive Intel Cyber Securit",
          "Nb_Reviews": 7,
          "Date": "2023-04-06T22:41:41.000Z",
          "Titre": "With a remarkable services provided by…",
          "Contenu": "With a remarkable services provided by A city discount.  The equipment for our kitchen  was taken by acitydiscount.com.  Really very professional in making our life easier and approachable.  Really obliged by giving us required Kitchen Equipments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Retro Contracting",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:42:35.000Z",
          "Titre": "Brian Bennett was amazing",
          "Contenu": "Brian Bennett was amazing!  He went out of his way to find the right unit for us.  He was patient with our inquires and extremely helpful and prompt.  I would definitely recommend your services."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Lorenzo Chaves",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T05:00:58.000Z",
          "Titre": "Really good",
          "Contenu": "Everyone really put a big effort into my small order and made sure I had the right product and even called me when there was a question about my delivery! The kind of customer service you dream about!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria Mayfield Banks",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T23:40:08.000Z",
          "Titre": "Comfortable and Excited.",
          "Contenu": "Larry was excellent and made me feel comfortable and excited about this important purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "residence",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T18:55:47.000Z",
          "Titre": "Everyone really put a big effort into…",
          "Contenu": "Everyone really put a big effort into my small order and made sure I had the right product and even called me when there was a question about my delivery!   The kind of customer service you dream about!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jai Baga Balaknath Ji LLC",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T18:16:05.000Z",
          "Titre": "We received excellent service From Alex…",
          "Contenu": "We received excellent service From Alex and his Manager. They took time to show and explain detail the products they carry and eager to source which was not available on the store"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Bushra Rehman",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T13:00:32.000Z",
          "Titre": "Easily to order and fast dilvery highly…",
          "Contenu": "Easily to order and fast dilvery highly recommend . U all must place ur order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug A",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T12:57:49.000Z",
          "Titre": "My salesman",
          "Contenu": "My salesman, Brian, made the process easy and simple.  He kept me informed as the order processed.  Great experience for a first-time buyer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walnut Grove Apiaries",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T18:16:47.000Z",
          "Titre": "Easy online ordering",
          "Contenu": "Easy online ordering. Catalog came with order for quick ref and shipped quickly. Quality products. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Best Western Plus McDonough",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:16:46.000Z",
          "Titre": "Another successful sale",
          "Contenu": "We get all of our hotels appliances from A City Discount. They have amazing customer service, and they always have what we need in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Youngstown Presbyterian Church",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T20:13:47.000Z",
          "Titre": "Exceptional Customer Service",
          "Contenu": "Josh responded to my msg asking for help early the next day.  Facilitated my ordering, helped me process tax exempt cert. and got me to order confirmation all in a matter of a few hours.  Truly Exceptional customer service."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "peter jhon",
          "Nb_Reviews": 4,
          "Date": "2023-04-16T10:49:39.000Z",
          "Titre": "I recently purchased a dishwasher from…",
          "Contenu": "I recently purchased a dishwasher from ACityDiscount, and I was very impressed with their service. The staff were knowledgeable and helped me choose a model that fit my needs and budget perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T12:39:46.000Z",
          "Titre": "Great, fast and cheap. Pick three",
          "Contenu": "Brian was great when we spoke. After ACity shipped the order, he took the time to send a personal email providing tracking info and thanking me."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Zeynep Kocael",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T16:31:58.000Z",
          "Titre": "Really good experience",
          "Contenu": "Everyone really put a big effort into my small order and made sure I had the right product and even called me when there was a question about my delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Libby Zappala",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T22:36:01.000Z",
          "Titre": "Knowledgeable Staff and Customer…",
          "Contenu": "Knowledgeable Staff and Customer Service is what makes ACity Discount a great company to do business with. They go above and beyond to be sure we're satisfied. Would definitely recommend them to anyone outfitting a restaurant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis A",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T16:30:07.000Z",
          "Titre": "this company takes their job seriously",
          "Contenu": "this company takes their job seriously, they messaged me to verify that what was ordered was the correct part for my project and all work great.  thanks I recommend it 100%"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T20:01:00.000Z",
          "Titre": "Great price on the ice machine and bin.",
          "Contenu": "Great price on the ice machine and bin.Outstanding communication and fast shipping.I would deal with them again without hesitation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:10:21.000Z",
          "Titre": "Alex was great with helping me find the…",
          "Contenu": "Alex was great with helping me find the right ice maker - I will always ask for him - no I don't know him - he is not a buddy and we are not related"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benedicte Cooper",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T04:58:53.000Z",
          "Titre": "Amazing personal service. Bryan Bennett was great.",
          "Contenu": "Helpful, friendly, efficient.I bought a new 6 burner gas range.Customer service is great, delivery guys were amazing.5 stars :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Town and Country",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T00:16:08.000Z",
          "Titre": "You had the item that I was looking…",
          "Contenu": "You had the item that I was looking for. Your representative Adam was able top find the item in stock. It was delivered in a timely fashion. This is my second purchase from your company. I will purchase again as needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Dew",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T12:25:15.000Z",
          "Titre": "Outstanding services",
          "Contenu": "Outstanding services! Great communication with customer service. Products are great at a great price. No issues what so ever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Event services of phila",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:37:41.000Z",
          "Titre": "Easy to order great shipping service…",
          "Contenu": "Easy to order great shipping service was excellent. Product came quickly. Would use you guys again and again thank you so very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued LifeLock Customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T17:44:03.000Z",
          "Titre": "Easy purchase",
          "Contenu": "Easy purchase after speaking w a sales rep. Packaging helped my items arrive without damage. Thank you and not only will I purchase from you, I’ll be telling about this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shute",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T15:58:38.000Z",
          "Titre": "The customer service is excellent",
          "Contenu": "The customer service is excellent, they have fast service and delivery, and good prices. I was contacted before the shipment and the driver was very helpful. I will definitely visit them again."
        },
        {
          "Note": 5,
          "Lieu": "ET",
          "Pseudo": "Mahamed Ahmed Muhumed",
          "Nb_Reviews": 6,
          "Date": "2023-10-13T15:20:41.000Z",
          "Titre": "Mahamed Ahmed muhumed",
          "Contenu": "I have more years in city discount because my experience is atleast 7 years"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B and B Cool Air",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:02:37.000Z",
          "Titre": "Fast reliable service from the…",
          "Contenu": "Fast reliable service from the salesperson and exactly what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana Frolo",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T05:43:48.000Z",
          "Titre": "amazing i am very interested in the…",
          "Contenu": "amazing i am very interested in the product once the goods look very luxurious let's all shop here.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Chen",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T01:24:45.000Z",
          "Titre": "Good quality, fast shipping, no problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Miller",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T15:51:04.000Z",
          "Titre": "What I like most the website easy to…",
          "Contenu": "What I like most the website easy to understand easy to put your information and easy tracking it was great thank you"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Bhuri Bhudiman",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T04:15:34.000Z",
          "Titre": "My experience is with electrical goods",
          "Contenu": "My experience is with electrical goods. Very good experience. I satisfied it.everyone can b trust it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "todd sarnstrom",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T19:26:09.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, fast delivery.  Product was exactly as I expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clean Eatz",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T19:50:08.000Z",
          "Titre": "Helpful staff and delivery",
          "Contenu": "Alex was very helpful answering questions to help in my selection of equipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren Maxwell",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T20:04:49.000Z",
          "Titre": "Great Follow-up!…",
          "Contenu": "I worked with Brian and he was very accomodating and knowledgeable about the product I was purchasing.  Great follow-up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Walton",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:32:47.000Z",
          "Titre": "Faster than expected!",
          "Contenu": "Item showed up much faster than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terra Gaucha",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T17:55:45.000Z",
          "Titre": "They went above and beyond and we will…",
          "Contenu": "They went above and beyond and we will definitely be their client!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Rayan Rizwan",
          "Nb_Reviews": 7,
          "Date": "2023-09-24T12:08:10.000Z",
          "Titre": "My experience is with electrical goods",
          "Contenu": "My experience is with electrical goods. Very good experience. I satisfied  it.everyone can b trust it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elite Catering Company",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T21:30:37.000Z",
          "Titre": "Execellent Quality of shipping and fast",
          "Contenu": "Great instructions on receiving and resolving issues thankfuly there was not any on our order will  be coming back aging in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Staci Maier",
          "Nb_Reviews": 15,
          "Date": "2023-04-19T10:06:20.000Z",
          "Titre": "I purchased the coffee grinder",
          "Contenu": "I purchased the coffee grinder, it was well packaged and arrived in perfect condition. Shipping was very fast. Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neeraja Punnam",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T23:53:26.000Z",
          "Titre": "I like about here is All kind’s of…",
          "Contenu": "I like about here is All kind’s of equipments on one place . No need to go any other place . Very neat and clear you pick so easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy Harris",
          "Nb_Reviews": 8,
          "Date": "2023-08-04T07:33:12.000Z",
          "Titre": "like what most customers saying",
          "Contenu": "like what most customers saying, ACITYDISCOUNT is what we could trust forever"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wally n",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T14:49:05.000Z",
          "Titre": "I am impressed with the quality of the…",
          "Contenu": "I am impressed with the quality of the product and the packaging was very sufficient for protection of the equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randolph Gascon",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T07:06:13.000Z",
          "Titre": "Everything was great",
          "Contenu": "Great customer service and follow up. Quick delivery & Nice product at good price. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Winters",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:14:14.000Z",
          "Titre": "Exactly what I ordered shipped it in…",
          "Contenu": "Exactly what I ordered shipped it in record time and I'm very happy with this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TLC",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T17:50:56.000Z",
          "Titre": "Excellent price for a water filter",
          "Contenu": "Excellent price for a water filter, very fast delivery. Will purchase from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Centerburg Senior Services",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T23:36:16.000Z",
          "Titre": "The deliver was made very quickly and…",
          "Contenu": "The deliver was made very quickly and the item arrived in excellent shape"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maplewood Mill Hill",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T15:57:13.000Z",
          "Titre": "easy to order and good prices and fast…",
          "Contenu": "easy to order and good prices and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Forrell Hillery",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T18:40:15.000Z",
          "Titre": "Very informative about what I was…",
          "Contenu": "Very informative about what I was looking for and very easy for purchase afterwards."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "ASHRAF KHAN",
          "Nb_Reviews": 5,
          "Date": "2023-07-25T05:36:45.000Z",
          "Titre": "Very good experience",
          "Contenu": "Very good experience. I liked. Comfortable with low prices. Plz visit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smithfield Foods",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:38:47.000Z",
          "Titre": "Customer support was great",
          "Contenu": "Customer support was great. We received our exhaust fan two days before expected arrival!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Parties Galore Inc",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T01:03:56.000Z",
          "Titre": "Excellent customer service and great…",
          "Contenu": "Excellent customer service and great prices! The salesmen took the time to explain the products to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bakers Country Store",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:40:46.000Z",
          "Titre": "Service",
          "Contenu": "Costumer service is great buy all my stuff from them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jessie sy",
          "Nb_Reviews": 6,
          "Date": "2023-02-22T08:14:46.000Z",
          "Titre": "Best retail",
          "Contenu": "Shopped for my upcoming cafe. The pricing was reasonable, and the staff were really helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD BARKER",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T16:00:06.000Z",
          "Titre": "Good Price",
          "Contenu": "Good Price,  staff knew the business.  Item arrived in 3 days in perfect condition"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Camerato",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T19:45:56.000Z",
          "Titre": "They were able to Pivot to make sure my…",
          "Contenu": "They were able to Pivot to make sure my item got to the right address. Great communication"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Kesavan Krupa",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T07:12:50.000Z",
          "Titre": "Great",
          "Contenu": "Great! Useful for many entrepreneurs to start their startup business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Brewer",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T18:25:23.000Z",
          "Titre": "Executing the order was a breeze",
          "Contenu": "Executing the order was a breeze, and the swift shipping and delivery were impressive. I wouldn't hesitate to make another purchase and suggest this company to others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "saffan",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T00:47:56.000Z",
          "Titre": "Got contacted before the shipping",
          "Contenu": "Got contacted before the shipping. Delivery on time. The driver was very helpful. Overall a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronnie L Czarney",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T19:23:22.000Z",
          "Titre": "Faucet",
          "Contenu": "Ez to navigate the site, product was as advertised..on time delivery.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spruill Art center",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T14:06:17.000Z",
          "Titre": "Mike was a big help in assisting me…",
          "Contenu": "Mike was a big help in assisting me with my shelving and working with my budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GLENNA",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T18:48:10.000Z",
          "Titre": "ORDER WAS CORRECT AND RECEIVED IN GOOD…",
          "Contenu": "ORDER WAS CORRECT AND RECEIVED IN GOOD CONDITION"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T13:56:45.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service.  Rudy is the best!  Everything is exactly like it supposed to be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Tillack",
          "Nb_Reviews": 6,
          "Date": "2023-04-23T03:05:03.000Z",
          "Titre": "Item received in great condition",
          "Contenu": "Item received in great condition.  Packed super-well.  Good product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Good Food & Company",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T19:21:25.000Z",
          "Titre": "Always great customer service",
          "Contenu": "Brian is always super helpful. The whole customer service team on the showroom floor is super professional and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amelia Shumake",
          "Nb_Reviews": 8,
          "Date": "2023-05-06T11:37:41.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! Great company, delivery was on time and the product worked great! Well packaged and arrived safely. Thanks to their staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wilmer Gingerich",
          "Nb_Reviews": 5,
          "Date": "2023-04-15T18:23:27.000Z",
          "Titre": "Super fast delivery on quality…",
          "Contenu": "Super fast delivery on quality products! Excellent communication from Acity discount too. You keep your customers well informed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Preciado Heating and Cooling",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:45:25.000Z",
          "Titre": "Hood guy help me and explain what fan…",
          "Contenu": "Hood guy help me and explain what fan is the correct for hood. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay R",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T01:20:26.000Z",
          "Titre": "Pricing is on point and anytime i have…",
          "Contenu": "Pricing is on point and anytime i have any questions a sales associate is always knowledgeable about the products in inventory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mixx Atlanta",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T19:27:48.000Z",
          "Titre": "Driver was very helpful and pleasant",
          "Contenu": "Driver was very helpful and pleasant.  Delivery was on time!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa D Engle",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T17:54:41.000Z",
          "Titre": "It was quick deliver for our business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Kinkley",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T04:34:29.000Z",
          "Titre": "Great purchase experience",
          "Contenu": "Great purchase experience. Bought a wine cooler a month ago. It's a good way for my wine.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Acere Cigar",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T18:29:58.000Z",
          "Titre": "Ben and the delivery team are…",
          "Contenu": "Ben and the delivery team are rockstars! I appreciate y’all!"
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "M mahdem",
          "Nb_Reviews": 13,
          "Date": "2023-07-16T12:30:43.000Z",
          "Titre": "Ben and the delivery team are…",
          "Contenu": "Ben and the delivery team are rockstars! I appreciate y’all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Brandon",
          "Nb_Reviews": 12,
          "Date": "2023-03-13T08:52:54.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, great service and delivery at a great price. The driver contacted me immediately before delivery and the driver was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mary M",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T07:56:35.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Very responsive and good team they did a great job very friendly and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seventh Wave Refreshments",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T14:38:29.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! Highly recommend ACD for all your food service needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodi Witherspoon",
          "Nb_Reviews": 6,
          "Date": "2023-01-11T18:39:03.000Z",
          "Titre": "great follow up quick service",
          "Contenu": "Easy to order items.  Items in stock Great follow up Great experience"
        }
      ]
    }
  ]
}