{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.soundcore.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Oliver K",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:35:12.000Z",
          "Titre": "Missing Charging Case; They Offer No Replacement (not even paid)",
          "Contenu": "I bought the Soundcore VR P10 in summer on sale and was quite happy with them, but I lost the charging case this week. I got in contact with their support and they told me they do not offer any charging cases for my earpods and now I am forced to buy new ones. But I rather buy from a different company because, then I at least know that they would offer me solutions regarding needed accessoirs etc. I advice you to other brands."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T11:28:40.000Z",
          "Titre": "Dreadful service and a worthless warranty",
          "Contenu": "I purchased some soundcore life A1 earbuds from Amazon in March 22. This week (20.11.23) I found the left earbud would not charge, the contact on the earbud had corroded.I contacted Amazon who advised me that the product has a 3 year warranty and I should initially contact Soundcore.I contacted Soundcore, sent a copy of my receipt, a photo of the corroded connection on the earbud. To my amazement Soundcore have refused to accept responsibility and are totally ignoring the 3 year warranty. Luckily Amazon have stepped up and once the earbuds are returned to Amazon they are going to issue a full refund.Hang your head in shame Soundcore."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Ladida Pugs",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T13:51:23.000Z",
          "Titre": "Soundcore Liberty 4NC",
          "Contenu": "As promised to soundcore team. Poor service following purchase of a poor product (Liberty 4NC) deserves mention.1. Despite all the options the buds don't fit and tend to fall out of the ear. Similar situation when my wife tried. 2. Customer service is sluggish 12 emails.plus and counting3. Info is misleading, initially informing shipping will be refunded later stating this is not the case. Other than poor quality design, sound has been average at best. Should have stuck to my favourite brand (sony), you get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jeremy Havard",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T18:17:27.000Z",
          "Titre": "Before ordering anything off this crew",
          "Contenu": "Peeps before ordering anything off this crew just remember whilst all the ad blurb sounds great... IT'S NOT. Anything defective happens after 3 months you get a secondhand replacement, we are talking earphones here. Soundcore prefer to call them \"renewed\" & carefully checked...mmm, we all know what they mean. SECONDHAND.My P3's stopped working on one side and were exchanged, 6 months later the exact same fault occurred so I contacted again, this time... awww too late the warranties up, so I'm left with 2 duff sets now.The irritating thing with the P3's is they know there are issues with one side ceasing to work and or not holding charge but still sell the earbuds knowing full well that they can just send out more \"renewed\" junk then a few months later the problem just comes back and hey ho you're outa warranty. What a way do business.He then offered me 20% off some more thinking I'm stupid enough to buy anything else from Anker.Avoid them and their awful warranty rules. My advice stick to a reliable brand like Samsung or Sony."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brett  Casey",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T12:36:02.000Z",
          "Titre": "Do not order from soundcore if you…",
          "Contenu": "Do not order from soundcore if you expect any kind of customer service! The courier they used left my parcel to be stolen, then trying to report this to them has been a nightmare! They didn’t log calls I made, they didn’t read any of my emails I sent them properly, they do not return calls, they don’t even sound like they know how to do their jobs when talking to them on the phone! They sound confused! I still have not had my issue resolved! Since ordering through their website I have had my card details used in a fraudulent transaction and had to cancel my card! All I want is a refund on the goods! They have deliberately ignored this request and are trying to send a replacement! When I have stated every single time I want a refund. It is beyond frustrating! Do not order from these cowboys!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lucas",
          "Nb_Reviews": 7,
          "Date": "2023-11-24T11:44:00.000Z",
          "Titre": "What a utter shambles",
          "Contenu": "What a utter shambles, I ordered a Bluetooth speaker on 16th November and today I tried to call the support line to see where is my purchased product. I have been told by that my product is not in the system and they cannot see it anywhere even though I have confirmation and tracking provided, they did not even know what tracking system provided - I have lost almost £40 and support is quite inept not knowing what system they use to track the product after buying - utter joke - I want my money back!!!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Berk Sulusoglu",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T15:29:08.000Z",
          "Titre": "it is not possible to return anything with this brand!!",
          "Contenu": "A bit more than one month ago I ordered a soundcore space one headphones in Rotterdam. Even though I liked the quality I decided to return them as I wanted to buy another one. The return policy at Soundcore does not work at all!! I sent so many emails but all I got standard emails that they send to all customers initially.  30 days to return the product has lapsed for me and I am so frustrated with this service. This is how soundcore  treat their customer unfortunately, ignoring them when they want to return the orders. I made so many purchases from this brand but they disappointed me big time."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Fatboy Slim",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T18:04:48.000Z",
          "Titre": "Ebay reference daddycoolme",
          "Contenu": "Ebay reference daddycoolme, beware when buying soundcore products from this company especially ankerdiect.uk on ebay, they never reply too messages also they try and hold your funds for as long as they can without dispatching your order, ignore fake reviews this company is a company run by companies abroad, also if your product becomes faulty they want nothing to do with the repair side, be warned."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leigh",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T08:31:30.000Z",
          "Titre": "Customer service is an absolute joke",
          "Contenu": "Customer service is an absolute joke! Bought soundcore headphones on 11th July and was told will be delivered in 2-3 days , 8 days later they don't care where my package is and told me I have a contract with evri and not them !!! This is horrendous customer service seems like a SCAM!!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Remco",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T15:21:13.000Z",
          "Titre": "Predatory, ludicrous company.",
          "Contenu": "Never purchasing anything from this predatory company ever again.At the time, I purchased some sleeping earbuds. The product died on me within 3 weeks. I started the warranty procedure, and then get told \"We can only refund 70% of the price you paid\". Excuse me what?You're telling me, I pay nearly 150 euros for cheap, chinese made earbuds, for them to die after three weeks, and then get 70% refund? Ridiculous, predatory company. This review was also posted on their website. Try and find that. It's gone. I truly hope this review here helps protect people from this horrid company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:40:39.000Z",
          "Titre": "I purchased a Soundcore Motion+ speaker…",
          "Contenu": "I purchased a Soundcore Motion+ speaker two years ago. I have used it no more than 10 times since then. In fact I have only had to recharge the speaker twice. I recently tried to recharge the speaker and it would no recharge. I tried all the troubleshooting suggestions, have used Anker charging equipment, and the speaker will not recharge. I notified Soundcore with the problem and was given this response:\"Thanks for contacting us and letting us know your issue. We are so sorry to know the speaker stopped charging correctly. Based on your description, it seems like the issue is with the deivce.I'm very sorry to say the order you sent us expired its 18-month warranty in Novermber, 2022, so, unfortunately, it is not possible to exchange or refund it. If your defective item might be from a different order made within the past 18 months, please let me know so I can process the warranty claim.Know that we register all defects and evaluate them statistically.  These statistics enable us to identify increased defect rates or concentrated product issues, so thank you for letting us know about this.We sincerely apologize for these circumstances and wish you all the best in the future.\"So they've admitted the issue is with the device. But what they're really telling me is that we sold you a lemon and you need to suck it. Keep in mind I have used this speaker no more than 10 times and have only recharged it twice. Now I'm left with a $100 paperweight. Not a good value.The response from Anker to my review advised me to contact them about the problem and that they would be willing to help me. I contacted them and they told me they could not help me. I’m still stuck with a $100 paperweight."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "paul batchelor",
          "Nb_Reviews": 21,
          "Date": "2023-04-26T18:00:26.000Z",
          "Titre": "I would never purchase another item",
          "Contenu": "I would never purchase another item from soundcore, and definitely recommend that if anybody does then purchase from amazon and not soundcore website. I purchased their life A1 in ear buds from soundcore as they were cheaper on their website. Big mistake, when received and started to use I could not believe how bad the sound quality was, they were so quiet, tinny and with no Bass. I contacted soundcore as I believe they were faulty. They said send them back and pay postage yourself as its not a quality related issue, though it was. If they say nothing wrong with them, then their sound quality is worse than a £1.99 pair down the market."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Olivia K",
          "Nb_Reviews": 5,
          "Date": "2023-02-22T08:00:36.000Z",
          "Titre": "Bluetooth issues",
          "Contenu": "Bluetooth issues - Haven't been able to connect the device to any other ones. It's akin to sending a faulty cable. Nothing about returns automated, I had to write an email and wait for a postage slip from service team to avoid incurring any charges for \"damages\" when item is in transit. No response from service team yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T15:22:11.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. Right earbud stopped working less than 11 months after purchase. They say they have an 18 month warranty, right? WRONG. I sent a copy of my purchase for these earbuds dated July 2022. I called them in June 2023 after 30 days of \"trouble shooting\" with their customer service. They had the gall to claim it's passed the warranty date and they can't resolve the issue with earbuds. I sent you a photo dude with s/n numbers, full receipt, etc. Clearly a scam warranty."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Xxbbgzgg",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T04:27:32.000Z",
          "Titre": "Quite disappointed",
          "Contenu": "I was so excited and looked forward to my speaker, but it never came. I tried contacting the delivery company, couldn't get through.I tried contacting Soundcore, they couldnt give me any help as they say they dont know where the parcel is either; I waited anxiously for days, not knowing what was happening, and as I reached out to them again, I was advised to place another order."
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "Tonka",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T13:50:58.000Z",
          "Titre": "No delivery and horrible answer from customer service",
          "Contenu": "Purchased the headphones through the company 5 months ago via Amazon and they still haven't arrived, nor did anyone from Amazon or AnkerDirect gave any reason why, or offered a refund or any other solution.Two weeks ago boyfriend purchased headphones directly from Soundcore online store only to receive a response 2 weeks later that they don't have it in stock and that we should purchase it through Amazon for 20€ surcharge (?!?!). So I'm curious as to weather or not we're going to see any of the two headphone sets ever, not to mention the refund if they are not able to deliver what was purchased."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard B",
          "Nb_Reviews": 4,
          "Date": "2022-12-19T10:15:19.000Z",
          "Titre": "Ordered headphones on 26 Nov as present…",
          "Contenu": "Ordered headphones on 26 Nov as present for Christmas, still not recieved as stuck in Evri delivery depot since 30 Nov and no idea when they will be delivered. Not strictly Anker/soundcores fault but I will not be ordering again unless they change to a reputable courier."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Isi",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T15:03:00.000Z",
          "Titre": "Soundcore lies",
          "Contenu": "I bought the Liberty Pro 2 and realised they weren’t a good fit, also it doesn’t connect automatically to my iPhone (like AirPods will do). I contacted the customer service and took me more than a week to get a reply. Even that they state on their website they have a 30 days money back for any reason, they refuse to do it, saying they have trouble with the warehouse address in Australia. They have offered me to keep the product and I could get a 20%, 30% and in the last email 80% refund, but be careful because you won’t get your money back.Definitely not worth the try 👎🏼"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elbert Bassham",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T15:41:19.000Z",
          "Titre": "Soundcore wireless VR earbuds went in the trashcan",
          "Contenu": "I found soundcore wireless VR earbuds to be worthless and they are in the trashcan right now. * The instructions were so tiny that magnifying glass should come with them.* It took several tries to over a couple of days to finally get them to connect to my phone via Bluetooth.* The fit in my ears was poor and I feel that the earbuds could fall out too easily.* The final clincher was that the sound quality was lousy. The range of sound was only in the highest frequencies - no bass at all."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "David O'Keeffe",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T11:01:08.000Z",
          "Titre": "Sleep A10 - Worse than useless",
          "Contenu": "I recently purchased the Anker Soundcore Sleep A10 earphones after hearing about their advertised \"noise blocking\" feature. With a new baby in the house, I was desperate for a solution that could help me block out the cries and disturbances so that I could rest for my early morning drives.What I received, however, was a product that could only be described as worse than useless. The Soundcore Sleep A10 earphones are nothing like what is described on the website. Every little external sound is not only audible but seems to be magnified!I even tried different settings and adjustments, hoping that I might have missed something, but to no avail. The simple foam earplugs I had been using previously proved to be much more effective.I feel utterly misled by the claims made by Anker. This product has not only failed to fulfill its basic promise, but it has also added to my frustration during a time when I needed support the most. I cannot in good faith recommend these earphones to anyone looking for a noise-blocking solution.It's back to the drawing board for me, and a lesson learned to be more skeptical of over-hyped products."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Bree Sharp",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T11:31:13.000Z",
          "Titre": "No Customer support",
          "Contenu": "Purchased 2 speakers on the 29/06 for my work. To my surprise I was very impressed to know my delivery will arrive within 2 days... HOWEVER, No one was at the address when the parcel was \"delivered\". I arrived back to the property 03/07 to find NO parcels or ANY \"sorry we missed you\" cards.I contacted their support portal twice through their \"live chat\" option and I am yet to receive a response. Their Live chat is just a robot that is useless and provides you with a contact form...Was our items delivered? Please provide proof if they were!!!!If not - Where are they?I will leave this review on any platform I can find! Please someone URGENTLY address this issue"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ana",
          "Nb_Reviews": 3,
          "Date": "2023-01-31T12:24:06.000Z",
          "Titre": "No warranty, No trustful brand.",
          "Contenu": "9 months ago I bought a Liberty Air 2 pro, I used it few times when going on holidays and the charger case do not work properly. Soundcore publicises \"hassles free 18 months warranty\" don't trust that, after almost a week trying to get a label to send my defective product to repair they tried to send me a inferior old small buds as replacement, I said no, as I paid more for the Air2 because it fits me better. Them they said if I do not want their inferior replacement they can do nothing than refund me only with 70% of the value as the product has been with me for 9 months! I ask myself, it is not my right to have my original product repaired or replaced for one similar or of superior quality? Never thought Soundcore could be so unprofessional organisation. Stay away from it!"
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Ana Elias",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T10:56:37.000Z",
          "Titre": "I will recommended to keep away from…",
          "Contenu": "I will recommended to keep away from this company.Im very disappointed and frustrated with the customer service. They  clearly stated  the company was unwilling to accept any responsibility for the delivery mishap, despite the fact that I did not have the option to choose the delivery company. So now Im left with not product and not respond from either Soundcore or the delivery company. Unreliable!I have contact customer service several times; despite they promise to get back in 24hr, I have no had other respond than the automatic reply, so thank you for not very helpful reply!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tim Mammitzsch",
          "Nb_Reviews": 40,
          "Date": "2023-03-16T02:15:45.000Z",
          "Titre": "Support by AI chat bot ... REALLY???",
          "Contenu": "You all know, Soundcore is nothing else than Anker. And while the products often are at least good enough for their price, the great customer support they once had, which was really willing to help, actually helpful and did not just throw copy & paste answers at you like most other »customer supports«, especially of big companies, do.Today, it has reached a new level of fail: my support request was answered by a stupid AI chat bot! :-D I guess, this is »evaolution« since they do not even need to pay someone for the useless copy & paste aanswers anymore. But much more important, it shows their kind of respect for their customers: NONE!Sure, if I am »lucky«, sometimes a »real« answer arrives somewhen; in a week, or two ... a month, but mostly never. On top of that, what can be expected of that is mentioned already above.In the end, you will have to pray that your Anker/Soundcore products never fail, since if you are expecting customer support, not even prayers will help you ...No, that's not dramaturgy; it is really this bad/sad! =("
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Davi",
          "Nb_Reviews": 27,
          "Date": "2023-04-09T15:19:35.000Z",
          "Titre": "scam marketing and I'm thinking of…",
          "Contenu": "scam marketing and I'm thinking of reporting their scam to the police.I bought the q30s, AND NOWHERE, NOWHERE, does SOUNDCORE WARNING THAT:1. WHEN THEY ARE WIRED, THEY WORK VERY BADLY, LIKE 2 euro HEADPHONES.2. THE SAMPLE RATE IS 8000, unusable with most audio software.to all users, you can report this fact and ask for a refund.They said \"a good product require times\", but not with my money, scammers with chinese products."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "awrylemming",
          "Nb_Reviews": 23,
          "Date": "2022-11-29T16:04:20.000Z",
          "Titre": "I did not receive my order",
          "Contenu": "I did not receive my order, and it was not replaced as they were, apparently, now out of stock. Won't be using this company again."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 12,
          "Date": "2022-12-13T09:12:10.000Z",
          "Titre": "Unfortunately my delivery was slow and…",
          "Contenu": "Unfortunately my delivery was slow and I didn't receive it all. About 3weeks between items. And not all of it at that. The audio in the frames was poor with crackling. Very disapointed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "dan bennett",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T17:18:24.000Z",
          "Titre": "Awful customer service",
          "Contenu": "I was bought some space A40s as a Christmas gift. They are great earbuds but only a month in one stopped working. I read all the info on the website and tried resetting both the earbuds and my phone, disconnecting and reconnecting….None of this worked so I got in touch with customer services. They told me to try all the same things and that I’d have to provide my purchase details.I did it all again just to try, then sent all my order details over to them where they have now completely ignored me for over a week. So I’m the bin they have gone. Great if they actually work. If you have a faulty set then don’t expect any help from the company who don’t seem to care."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Agnes",
          "Nb_Reviews": 12,
          "Date": "2023-01-05T15:51:29.000Z",
          "Titre": "Recently purchased the Liberty 3 Pro.",
          "Contenu": "Recently purchased the Liberty 3 Pro.After a lot of research I went for it. Nobody mentioned that connection to PC via Bluetooth is impossible.If it connects no sound. If it loses connection there is no way it connects again. So dont buy it if you want to use for PC do your research well."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Muhammad Waleed",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T01:01:36.000Z",
          "Titre": "Looked like the earphones were used or…",
          "Contenu": "Looked like the earphones were used or just manufacturing imperfections. Customer care sends long irrelevant autgenerated kind of responses. Ears hurt after using as well."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DP",
          "Nb_Reviews": 13,
          "Date": "2022-10-21T23:18:56.000Z",
          "Titre": "One star is far to much for these…",
          "Contenu": "One star is far to much for these people! There rubbish courier have lost the goods and soundcore are being absolutely no help what so ever! Instead they choose to insult me by telling me there is just a delay because of covid!! When the goods have clearly not been scanned for 5 days Please get over yourselfs admit your rubbish courier evri have lost or stolen my parcel and sort it out! Keep your money people dont waste it on this awful company with their none existent customer service! There are much better companies out there who will be appreciative of your custom"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sukhvinder Gill",
          "Nb_Reviews": 7,
          "Date": "2022-11-03T10:24:17.000Z",
          "Titre": "Items not delivered and no refund",
          "Contenu": "A very similar experience to the one posted by \"DP\" on Oct 22nd '22 - in a nutshell: AWFUL!!Ordered some Sport X10 earbuds on 3rd October, but order hadn't arrived after one week. The tracking info stated this with a date of 5th October:We're processing your parcel at our hub· EVRiI contacted Soundcore and they blamed COVID for the delays and said please wait 3 to 5 days more.Once again nothing arrived and I asked for a refund. Now Soundcore said the delivery firm will only issue refunds after 10 days have elapsed after the due delivery date.Then Soundcore said they will issue a full refund if nothing arrives by the 19th....16 days after placing my order. So, the 19th arrived and Soundcore said a full refund will arrive in 3 to 5 days. A full 11 days later....NO REFUND!! Are we blaming COVID again??Will ask my credit card company to take care of this for me.Soundcore...will never shop with this company again!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Lord",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T16:57:52.000Z",
          "Titre": "Love the product...but...",
          "Contenu": "Love the product, Getting delivered was a headache."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin Jones",
          "Nb_Reviews": 36,
          "Date": "2022-08-02T15:29:01.000Z",
          "Titre": "Why are you blaming me??",
          "Contenu": "I have many Anker products and until now they have had my loyalty and respect, however my latest purchase has been lost/stolen in transit via Amazon, and what does Anker/Soundcore do? They punish me!!! They have refused a refund after promising it, tracking of the product has now disappeared, but I still have to wait? Incredibly bad service they despatched it, they chose the courier, they lost it, but the only person being blamed is the customer!! INCREDIBLE.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kains Almeida",
          "Nb_Reviews": 15,
          "Date": "2022-07-19T23:07:03.000Z",
          "Titre": "May be great product but they are…",
          "Contenu": "May be great product but they are digging their own grave by being irresponsible and giving the responsibility of shipping to a stupid company. Purchased successfully headphones but 20 days haven’t arrived yet reason. Post code and house no missing. Somebody gave wrong details for delivery. Even me having confirmed correct adresss at time of order. Stupid teams working there all got to be sacked!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ben Robart",
          "Nb_Reviews": 35,
          "Date": "2022-09-05T17:52:49.000Z",
          "Titre": "Filed a warranty claim with them for my…",
          "Contenu": "Filed a warranty claim with them for my faulty Liberty 3 Pros. Replacement turned up today and I've been sent someone else's USED earbuds. Absolutely disgusting. Will never use an Anker product again."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Johannes",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T10:21:27.000Z",
          "Titre": "More expensive than on Amazon"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Keston Sylvester",
          "Nb_Reviews": 3,
          "Date": "2022-11-16T08:39:02.000Z",
          "Titre": "I have not received my item from this…",
          "Contenu": "I have not received my item from this company as yet."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "WAQAR ASLAM",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T00:43:09.000Z",
          "Titre": "Not recommend.",
          "Contenu": "Not recommend.I ordered soundcore liberty air pro 2 a month ago and still waiting for my package. There is no tracking record and there customer service is non responsive as I am sending them emails and they are not even replying. I hope they are not going to send me my package and even not going to refund me. I highly do not recommend to order something from their website. Enjoy with my money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Victoria anderton",
          "Nb_Reviews": 3,
          "Date": "2022-06-22T12:09:54.000Z",
          "Titre": "THANK GOD FOR AMAZON'S COSTUMER…",
          "Contenu": "THANK GOD FOR AMAZON'S COSTUMER SERVICE!!! This is the second pair of ear buds I've had that have stopped working. I contacted Anker (like Amazon told me) for some support regarding this issue stating on the email that I had completed all of their advice on their trouble shooting page, to no avail. The response from Anker was a list copied and pasted list from their trouble shooting page and to tell me that I had exceeded my 18month warrently.... I bought them.in February 2021 so that's 16 months. Thankfully I went to Amazon who were really helpful and was able to return and buy ear buds, from a different brand.."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "troyboy veteran",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T13:13:21.000Z",
          "Titre": "ordered life Life Q30",
          "Contenu": "ordered Life Q30 - Black: Bad shipment. Would not recommend this site, bad service. The package would arrive in 7 days has not arrived. Had to call so many people and they couldn't help me."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "F",
          "Nb_Reviews": 4,
          "Date": "2021-10-25T08:13:37.000Z",
          "Titre": "Awful service",
          "Contenu": "I have had the same experience as per Simon's review below. Should already have received the buds as ordered on 12th but no update until I chased 3 or 4 times. Item has now allegedly been posted but no delivery date given, needed these urgently for work but now they have my money and I have no buds.Noticed Simon's review has a generic response below which doesn't appear to have resolved the situation, hoping for an actual response with a resolution."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Cez Bart",
          "Nb_Reviews": 4,
          "Date": "2022-06-24T12:05:20.000Z",
          "Titre": "No respond about mistake address/missing parcel.",
          "Contenu": "Highly not recommending buying by website www.soundcore , they're sending parcels by Amazon as a third party with no option click&collect which is crucial when is going about value devices. If they will loose your parcel or make mistake with delivery address or anything else will happen, keep in mind that you will never find out what happened with your parcel. Have been ordered speakers flagged up as delivered and don't see my speakers no money no contact with Amazon courier only automatic answers which are worthless, no evidences that the parcel was delivered in correct address only marked on web as delivered, even if you have Amazon account it doesn't matter they are third party only."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Caroline & Darren",
          "Nb_Reviews": 3,
          "Date": "2021-08-14T14:49:36.000Z",
          "Titre": "Q20 headphone",
          "Contenu": "I bought a pair of Q20 headphone  that i don't go outside with as I just listen to music in doors at home. one day the headphone felt very uncomfortable on my head. having a closer look one of the headphone hinge was broke on the headphone. i put it down to me. So i bought a another pair the same ones and  guess what's happened hinge has broke.is there a design fault or bad materials being used.. i would like some feed back please"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John MacLaverty",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T16:36:23.000Z",
          "Titre": "Product not working",
          "Contenu": "I am a fan of this company’s work.Until I bought the Liberty Air 2 pods.I am reasonably tech savvy - but despite following instructions / watching you tube videos / resetting / rebooting / watching red lights & counting blinks…I am unable to get both pods working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 2,
          "Date": "2022-07-03T03:52:47.000Z",
          "Titre": "I shopped on Soundcore",
          "Contenu": "The Soundcore website contains offensive imagery promoting prejudice and pseudodiversity. Not diverse at all, in fact. It's a shame because I was looking forward to my Soundcore speaker."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T09:34:06.000Z",
          "Titre": "2 weeks and still no communication on shipping",
          "Contenu": "I ordered the headphones 2 weeks ago and have not yet received any shipping information nor received the package. I understand that Covid makes things backed up, but 2 weeks seems a very long time to receive zero communication regarding shipping. Even a simple email saying \"hey, we're backed up, please be patient\" would help. Otherwise I'm left wondering if my order has somehow been forgotten."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr GK",
          "Nb_Reviews": 5,
          "Date": "2020-11-18T02:29:17.000Z",
          "Titre": "Sound quality is really poor for these…",
          "Contenu": "Sound quality is really poor for these headphones with lot of echo. Both head phones remain out of sync and producing noticable delay. It destroys any usability as the delay and echo is very distracting as feel you are trying to catchup on two conversations at same time. Possibly a defective product being shipped out. Nevertheless expected better from Anker brand."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Syedali Shah",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T11:01:22.000Z",
          "Titre": "Soundcore is just a piece of shet.",
          "Contenu": "Soundcore is just a shet. I orderd wireless on 24-11-20 and the time of delivery was 3-5 working days. But what happened i really i didnt recieved my order even on 8-12-2020 and today they have cancelled my order and making my  money refund. I hate soundcore. Its just a worst service. I will give \"-5\" star to this company."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "O-N-M",
          "Nb_Reviews": 11,
          "Date": "2020-05-17T12:24:35.000Z",
          "Titre": "Disgraceful customer service for returns",
          "Contenu": "They claim that they have an easy returns policy, which is blatant lie. The order number they issue does not work to register a return claim. Had to send multiple customer service messages back and forth until I got return instructions. Despite sending the headphones via recorded Mail more than two weeks ago, the refund process is still ongoing. Horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Josh",
          "Nb_Reviews": 3,
          "Date": "2020-10-30T07:16:12.000Z",
          "Titre": "These are the worse",
          "Contenu": "These are the worse, most frustrating Bluetooth earphones I’ve ever used. They always need repairing w my iPhone each time I use them and  always w problems, such as only one earphone will connect if they connect at all. I’ve spent hours on commutes trying to connect my headphones. These suck!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brett",
          "Nb_Reviews": 3,
          "Date": "2021-12-06T19:59:31.000Z",
          "Titre": "Warranty issue!!!.",
          "Contenu": "Warranty issue!!!.. even though I provided a order number and screen shot of headphones with serial number and proof of age. They would not repair of look at my faulty headphones. Shocking customer service"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris Maiden",
          "Nb_Reviews": 15,
          "Date": "2021-09-23T07:29:11.000Z",
          "Titre": "Total rubbish IMO",
          "Contenu": "I think that these are Total rubbish.£80 earphones stopped charging after 4 months. Soundcore/Anker refuse to honour the warranty.Rubbish productRubbish customer serviceI am going to AVOID LIKE THE PLAGUE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Smith",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:27:57.000Z",
          "Titre": "Don't order directly from Soundcore!",
          "Contenu": "I honestly like Soundcore but I will not be buying their products any more out of principle and will def use Amazon going forward to buy things as they have great customer service, although I don't like them as a company but reliability is a big deal. I ordered a Motion Blur Blue tooth Boom box $150. As I was checking out the system asked if I wanted  use the same billing as mailing. I clicked yes and thought I was good. My fault for not checking the billing address right away but no where on my check out did it show the address their system had pulled from google. Now my item has been shipped to the wrong address and they are unwilling to provide a refund. I even contacted them while it was still in their warehouse and they refused to adjust the address. Use amazon please if you are going to get their products but going forward I will no longer be getting anything from them, an error on their end should be remedied by them, this is god awful customer service. Here is one email:Dear Sean Smith,Thanks for your reply.The warehouse ship the items according to the shipping address from the order details. Besides, due to our policy, if the package is not received due to the wrong address being provided, we are not able to provide a refund or arrange a re-delivery.Below is the latest tracking information for your reference:1. soundcore BeatLight B32 LED Light StripUSPS Tracking Number: 92055903050308000003995832. Expected Delivery on THURSDAY 10 November 2022 by 9:00 pm.2. Motion Boom Plus - BlackUPS Tracking Number: 1ZE356F80337835873. Estimated delivery Today, November 10 by 7:00 P.M.Sorry for all the inconvenience. Have a great day.Second email I received: Dear Sean Smith,So sorry to learn about the address needing to be changed!  Unfortunately, the order is already in the works and it's not possible to change the address or cancel at this time.I wonder if it's possible for you or someone to get it from the address it's being shipped to, or if the package could be forwarded to where you are? Please let us know how it works out for you."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris. B.",
          "Nb_Reviews": 12,
          "Date": "2022-09-01T13:52:36.000Z",
          "Titre": "Great product. Lousy, incompetent courier, hopeless customer services.",
          "Contenu": "As it seems to be the same as other reviews; great product, lousy courier. I ordered my Soundcore 3 on the 19th August. The tracking lists it out for delivery 21st August followed by the same for the 22nd with undeliverable added. Several emails with customer services who keep replying that it has been delivered. I reply, yes, to the courier's depot. Read the words at the top stating 'undeliverable.' The address is correct. UPS, DPD and the postman have no problems. Indeed, our postcode applies to only three houses and will usually bring you to our door. (Incidentally, why don't couriers ask someone if they are having difficulties finding an address? We are rural and within in two miles of us, any other house would put them right). Finally, I gave the alternative address of our local butcher in our village for another try. Yesterday, 31st August, I had to drive the three miles to collect my package. I had asked customer services to mark the package for my attention. Did they? Did they heck; not even my name! They did offer me a ten per cent discount on a future purchase but it really is not worth the hassle."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Thewolf",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T17:48:49.000Z",
          "Titre": "I paid for an empty package.",
          "Contenu": "I paid for an empty package, when i tried reaching out to suport services they only answered once and i m still waiting for their answer because i don t want my money back i want the headphones."
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Gabor Csontos",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T07:45:35.000Z",
          "Titre": "Don't buy: Works well for a few weeks, already third times",
          "Contenu": "First I used a Soundcore Liberty Air 2, what I loved to use, until it worked. Good fit into the ear, medium sound quality and reasonable price. But at one point one of the speaker started to switch off in every 5 minutes, or lost the connection. The service didn't repair that but refunded the money. That's ok! Let buy a a Liberty Air 2 Pro. I can say as an initial point than in case of the Air 2 but the dark clouds came quiet quick. After a few months usage one of the speaker makes beepy sound over 70% volume in case of every Mid and Treble sounds, impossible to use. And the other one makes much lower volume than the other. Okay, back to the service, it has been repaired. I got back and the right speaker volume is around 50% of the left one so when I am listening it seems that it has no sound. I understood that is not a high-end product but seriously, it's something like a cabaret or a Chaplin movie, you could smile on that but in general you would cry."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert Muino",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T09:51:41.000Z",
          "Titre": "Baffling Purchasing Process",
          "Contenu": "Can't tell you about the quality of the products but their purchasing process is baffling. I ordered a pair of these on Monday and the payment went through only to refund them and say additional 'Checks' were needed. I only ordered them directly from their website so as to receive a discount however I imagine if I had ordered from Amazon I most likely would have received the item by now.There support team only seems to reply at night in the UK make for a very frustrating process. They have requested a second email address to verify the payment which makes absolutely no sense. It's the most bizarre purchasing process I've ever encountered and given I'd like a pair of headphones sooner rather than later I'll be taking my business else where.It's a shame because anker products are normally very good"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "B C",
          "Nb_Reviews": 8,
          "Date": "2022-12-02T16:07:39.000Z",
          "Titre": "they used evri (known as hermes)  Slow dispatch",
          "Contenu": "Slow dispatch, slow delivery, they used evri (known as hermes) so they automatically get 1 star because it ruined my experience"
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "Christos Photiou",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T09:57:55.000Z",
          "Titre": "order 2 q30 headphones",
          "Contenu": "order 2 q30 headphones. Order never received. Redelivery arranged. Only 1 piece arrived and they sent me after 1 week the 2nd piece."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Neha",
          "Nb_Reviews": 14,
          "Date": "2023-01-19T15:28:10.000Z",
          "Titre": "Disappointing ear buds",
          "Contenu": "Disappointing ear buds, constant crackling. Poor customer service"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "J Vd jagt",
          "Nb_Reviews": 3,
          "Date": "2022-01-07T00:13:00.000Z",
          "Titre": "I have never seen the product Come to…",
          "Contenu": "I have never seen the product Come to me house soyea i dont know whats gong on there with guys but no product no pay realy also..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TimD",
          "Nb_Reviews": 2,
          "Date": "2021-04-19T21:25:33.000Z",
          "Titre": "Soundcore Epic Fail",
          "Contenu": "I bought a pair of earbuds.  First one didn't work, they sent a second pair, those didn't work either. I called again and said their must be something wrong with this model.  They said no, no problems, so I agreed to try a THIRD time.  Still, the earbuds don't work properly.   They say they will give me money back, but what about the wasted time and frustration?  Bottom line, don't buy this junk!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Moritz Köchig",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T08:43:45.000Z",
          "Titre": "Shipping was awful",
          "Contenu": "Shipping was awful, still don't have my unit, need to wait another week to even be handled by support"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T16:58:00.000Z",
          "Titre": "Truly shocking customer service.",
          "Contenu": "Truly shocking customer service.I pre-ordered the Liberty 3 Pro on 12th October, and at the time their website stated all orders would be shipped by the 19th.Well, they've not arrived, the order status has not been updated, and their support emails have gone unanswered (I've sent two emails now with no response.)I spoke to their Live Chat team - they're response was \"You'll have to email them\", all orders are due to go out sometime after 22nd November for everyone who ordered on the 13th.Except I ordered on the 12th. They then said they have no access to stock levels and again told me to email.In the meantime, I have no headphones, no response, and they still have £120 of my money.Not recommended.  I'm sure the product is great given the reviews I've seen, but I'll open a dispute with PayPal and never buy from them again, as I wouldn't trust their warranty process if anything went wrong.EDIT - I'm sure Anker will add their stock response to this review saying \"email us\".I have, twice. You've not replied. I'm sure you'll see the email from the PayPal disputes team though."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 8,
          "Date": "2020-10-29T14:35:32.000Z",
          "Titre": "Disappointing",
          "Contenu": "Poor quality, don't stay in your ears very well. I wish I purchased something more expensive and better quality."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Jeroen",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T09:35:02.000Z",
          "Titre": "No Update on my order in weeks",
          "Contenu": "I ordered some wireless earbuds from the Soundcore website late November. They are supposed to be a Christmas present but, even though they have had my money for more than two weeks now, I have not received any update whatsoever. The status still says \"processing order\" after all this time. At the very least I would have liked there to be an acknowledgement that I already paid and I would also very much like there to be an estimate of when I can expect my order to arrive.I'm not sure what to do at this point.. I need those earbuds for Christmas but it seems that my order is either in a state of limbo or Anker just doesn't care to process their orders in a timely manner. I wouldn't even care about stuff taking a bit longer if they would at least be open about it and let me know but the way things are currently handled is not acceptable. I tried asking for an update through the mail but they don't seem to respond to those so that doesn't get me anywhere either. I might just have to cancel and try to get some other earbuds in time for christmas. My advice for those that are reading; do not order anything from Soundcore by Anker if you need something in a timely manner and care about knowing what's up with your order."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Venkata Lakshman Kumar Reddy",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T10:34:01.000Z",
          "Titre": "Sound is not in sync with the video and…",
          "Contenu": "Sound is not in sync with the video and audio is sometimes breaking creating disturbance,"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "RD",
          "Nb_Reviews": 4,
          "Date": "2020-09-09T09:33:21.000Z",
          "Titre": "I do not know Soundcore",
          "Contenu": "I do not know Soundcore. I ordered something at Eufy (but still haven't received it)."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "barry wilson",
          "Nb_Reviews": 8,
          "Date": "2022-01-03T07:37:31.000Z",
          "Titre": "2 attempts at buying life p3 headphones…",
          "Contenu": "2 attempts at buying life p3 headphones and still not received them!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charan Sai Chennamsetti",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T09:40:48.000Z",
          "Titre": "I never received anything",
          "Contenu": "I never received anything. On what I've to provide the review?"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Zes",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T08:40:08.000Z",
          "Titre": "Bas customer service",
          "Contenu": "Vefy bad customer service"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-15T08:19:53.000Z",
          "Titre": "Product quality poor",
          "Contenu": "Product quality poor and had to be returned but great customer service"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Xin",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T01:51:28.000Z",
          "Titre": "I only use 3 months,now the left one…",
          "Contenu": "I only use 3 months,now the left one can’t connect Bluetooth."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Raymond Dunn",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T10:52:31.000Z",
          "Titre": "Sound quality was poor",
          "Contenu": "Sound quality was poor. Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Artur Vilaca",
          "Nb_Reviews": 2,
          "Date": "2021-08-28T23:01:39.000Z",
          "Titre": "Fake promisses, no response from technical team and 9 months wasted on an issue that is still yet to be resolved.",
          "Contenu": "Horrible customer service.Around the end of August last year, I decided to buy a pair of earbuds, and a pair of \"Liberty Air Soundcore 1\" were at a discount of 50€ on PCdiga (Portuguese Retailer), so I bought them.After 2 months of using them, the earbuds suddenly stopped working, because the right side earbud was overheating when I put it in the charging case.I had never dropped them and always took care of them. Also, I didn't use them a lot, I only used them around 3-4 days a week, for 4-5 hours a day. I only charged them once per day (and some days I didn't even charge them, they were just kept in the case).So, of course, I emailed the retailer, but they said that they couldn't do anything and that I should contact soundcore, and that's what I did, I emailed soundcore asking for help, and at first, they said that they would be able to resolve my problem, even though I had bought the product from a retailer.Fast forward to 9 months later, 19 emails later, and a lot of waiting for their responses (sometimes they didn't even respond to me and I had to email them back again, after weeks or months), and my problem is still not resolved because soundcore told me (in their last email) they couldn't do anything because I had bought the product from a retailer, something that they assured me wasn't a problem 9 months earlier (and yes, the product is still in the 2-year warranty period).Now I have a pair of earbuds that are malfunctioning and 50 euros wasted.And by the way, they told me 3 times over the course of 9 months that: \"A technical team would email me to help me resolve my issue\". After I complained 3 different times that they did not email me, they told me that they can't help me.If soundcore decides to email me back and finally help me by resolving the issue (which let me remind you, was not my fault, the product started overheating out of nowhere after only using it for 2 months, this is obviously due to a problem with the product itself) then I would be more than happy to change my review back to a better grading.Extremely disappointed and angry."
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Evaldas",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T18:30:28.000Z",
          "Titre": "Item have not been received"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Petrica Vasilici",
          "Nb_Reviews": 4,
          "Date": "2022-01-14T01:37:36.000Z",
          "Titre": "Item never arrived"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vineta",
          "Nb_Reviews": 2,
          "Date": "2020-11-28T11:52:53.000Z",
          "Titre": "Never recieved the item"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andy",
          "Nb_Reviews": 19,
          "Date": "2023-09-25T11:09:14.000Z",
          "Titre": "Durability Questionable",
          "Contenu": "Purchased a pair of SoundCore Q30 headphones in December 2021 which have now become unusable as I get a high pitched squealing in one side of the device.Contacted Tech Support who confirmed that the device is most likely defective and as out of warranty, nothing could be done.  They did offer an escalation to Management who also confirmed that they could not extend warranty or replace as this was to ensure equity for all customers.  They did however offer a 20% discount on other devices from the website.Overall, very disappointed particularly as the headphones haven't been overly used, weren't cheap and reviews were positive and I'd be expecting them to last longer than 21 months."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anatoly Kashlevskiy",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T23:25:52.000Z",
          "Titre": "Terrible support",
          "Contenu": "Good products, terrible support.You virtually unable to reach them by phone and their so called live chat really is only useless bot with no possibility to speak with live representative."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Avril",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T23:24:09.000Z",
          "Titre": "Headphones cracked x2",
          "Contenu": "Really loved headphones and sound quality was brilliant however physical headphones cracked and broke within year and half . Same happened to my boyfriend who bought the same headset as loved the noise cancelled feature however his cracked in the exact same place . Not good enough structure quality for price that you're paying"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Kelly Sheeran",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T01:30:35.000Z",
          "Titre": "Very good  headphones till the left…",
          "Contenu": "Very good  headphones till the left channel stopped working, support has been hopeless making me jump through hoops and asking the same questions.  Even though the product is under 18 mth warranty appear to have only offered a 25% refund which does not fly, I want them repaired or replaced.  They still have not replied."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Robert Siegmund",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T06:48:12.000Z",
          "Titre": "The sound quality is sufficient for making calls",
          "Contenu": "I have the headphones paired with different devices mobile phone , notebook android tv . Even the originals from Samsung that come with the mobile phone purchase and the cheap headphones for 6€ from Ebay have a better, richer sound than this Life p2 mini. Unfortunately, this EQ function is of little use here. It could be recommended to people who have hearing deficits in the upper frequency range"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Philip Broughton-Mills",
          "Nb_Reviews": 5,
          "Date": "2023-02-16T10:44:01.000Z",
          "Titre": "11-day delivery",
          "Contenu": "Earphone dispatch from the warehouse took 5 days, plus delivery 6 days via UPS and required a signature, for a total of 11 days from ordering. Would have been next-day and no signature from Amazon for the same price, but I made the mistake of pitying the company and buying directly from their official website. I will never order from the Soundcore website again after such a slow delivery time."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David Charles",
          "Nb_Reviews": 11,
          "Date": "2023-03-30T18:42:01.000Z",
          "Titre": "I love Anker products and I have a lot…",
          "Contenu": "I love Anker products and I have a lot of items. I did not know the Anker Soundcore Icon Stereo existed and was not aware of their rules for buying. I happened to see the Icon advertised on eBay from a shop. I bought one, brand new, and on delivery one could see it was brand new and unopened. Then I read and found that you need two for stereo sound. So I ordered another and again it arrived very quickly and packed in the same way. The problem arose when I tried to get them to work. They worked individually as expected but I cannot get them to play together. I have had some correspondence with Anker and they asked to see the receipts. I emailed  them  the receipts and said that I know Anker packageing.  They replied “ Please understand that since your product was purchased through good_to_buy1, we do not have your order in our own system, and unfortunately, there is nothing we can do to process a warranty unless an order is placed through us directly.” So do not buy things other than through Anker!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "G Birch",
          "Nb_Reviews": 7,
          "Date": "2023-02-27T11:36:19.000Z",
          "Titre": "The Q30 soundcore headphones was not…",
          "Contenu": "The Q30 soundcore headphones was not working as it did not allow me to use the noise cancelling when I pressed it,  I do not have a smart phone"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T02:43:39.000Z",
          "Titre": "Good headphones, bad customer service",
          "Contenu": "Sadly my Q45 arrived damaged because of the way it was packed. For some reason the usb charging cable was in the case with the headphones and pressed against one of the cushions which punctured it and looks pretty bad. I contacted customer support to get new cushions, but I could only get 10% discount or send it back. Since I do like the headphones and think it's a bit ridiculous to sent it back for a cushion that is replaceable, I asked again but I got the same reply. So I decided to escalate the issue to a manager and answer was the same, 10% discount or send back since they don't have the cushions I was told. To me it's pretty weird the cushions can be bought on the US and UK website, but not EU. Furthermore it's restricted to US and UK citizens, so if you live in EU and need new cushions, you can't get them.So with back against the wall I had to make a choice, send it back for a damaged cushion, a part you replace after a year anyways, or take the discount. I decided to go for the discount and buy cushions on UK website, didn't know then that it's region restricted, found that out with ordering. So now have a damaged cushion on a \"new\" pair of headphones and can't buy replacement cushions.Pretty weird in my opinion customer service can't help with spare parts and parts are region bound."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Michael  Joseph",
          "Nb_Reviews": 8,
          "Date": "2022-07-06T07:30:45.000Z",
          "Titre": "The earbuds themselves are great BUT…",
          "Contenu": "The earbuds themselves are great BUT none of the supplied tips fit my ears or have a proper seal. Spoke to Soundcore and the only advice they could give was ‘you could try buying some different tips off Amazon or return the earbuds’. I did get some alternative tips and they do work better."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Disappointed Fan",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T06:48:23.000Z",
          "Titre": "Return process is complicated",
          "Contenu": "The ordering process was fast and easy. But the return process, which is advertised, was forcefully kept complicated and took for quite a long time. No other technical page makes the return process such a mission (SN). I was a big soundcore / anker fan, but this was kind of disappointing."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Miles",
          "Nb_Reviews": 5,
          "Date": "2022-07-11T14:37:38.000Z",
          "Titre": "No replacement eartips and bad service",
          "Contenu": "No replacement eartips are offered for the Liberty Air Pro 2, so I was encouraged to purchase new headphones from Soundcore by the service team. Although I am still in the warranty period with the Liberty Air Pro 2, I was only offered a ridiculous 15% discount on an expensive new pair of headphones. I can't use my headphones without eartips and other brands don't fit 100%. I'm pissed and won't be recommending Soundcore devices to anyone anymore, even though the devices are good. And in my circle actually all use Soundcore, hopefully after being informed no more."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Zor X",
          "Nb_Reviews": 12,
          "Date": "2022-06-02T13:16:24.000Z",
          "Titre": "I really would love to give more bcz I…",
          "Contenu": "I really would love to give more bcz I have mixed emotions. The sound quality and the app is amazing. But I've had 3 pairs and all have broken or stopped working with various different problems. Bear in mind one was a replacement under the warranty but now I have 2 pairs which both me and my wife used which are faulty."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jawad Yousaf",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T00:51:41.000Z",
          "Titre": "After 02 months of use",
          "Contenu": "After 02 months of use, the left earpiece speaker is not working properly and just making noise. Otherwise, the sound quality was great, for calls in noisy environments I would rate it as 4/10. compared to other headphones without the ANC it performed better for calls. if the speaker problem would not happen then I would rate it 10/10 for the price it costs."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mrs Alison Bird",
          "Nb_Reviews": 7,
          "Date": "2022-01-21T09:34:17.000Z",
          "Titre": "Delivery Issues",
          "Contenu": "Ordered my item and was then told that it would be delivered by a certain date.  When the date arrived it was not received and the delivery message still said it was going to be delivered on a date that had gone past.  Spoke to customer services who told me to wait in case it turned up and if it wasn't there in 3-4 days then call them.  Item did not arrive so phoned customer services and it was delivered 2 days later by Royal Mail."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Ferrer",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T10:21:47.000Z",
          "Titre": "Useless for music",
          "Contenu": "Useless for music. You feel like Dom Jolly in Trigger Happy obnoxiously walking around with audio blaring out. Passable for podcasts with the sound down to almost zero. Lenses too large."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ruby Fussell",
          "Nb_Reviews": 2,
          "Date": "2021-02-16T22:48:15.000Z",
          "Titre": "Good quality headphones however a…",
          "Contenu": "Good quality headphones however a massive design flaw for me - the buttons to pause/play are on the side of the headphone meaning you can’t listen to music/podcasts in bed unless lying straight down on your back, otherwise the button gets pressed and stops/starts playing music! Finding this increasingly annoying as I like to listen to music to sleep so can’t honestly recommend these headphones."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Leonardo",
          "Nb_Reviews": 2,
          "Date": "2020-12-19T11:29:01.000Z",
          "Titre": "Connection problems",
          "Contenu": "The sound is pretty good.Basses are not so powerful, but acceptable.The real problem consist in audio stuttering every 10 seconds or so, muting for a second, and after some minutes of listening it makes me nervous.Often, only one bud connects.I didn't have these problems even with 20€ buds, I'm disappointed.Otherwise, battery life is pretty good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2020-11-17T08:57:34.000Z",
          "Titre": "Hiss and not great sound, returned",
          "Contenu": "The headphones suffered from an annoying hiss/white noise, anker support said this was from a small amount of an early batch, this was from nearly a year ago and they said this was fixed, however the s/n showed the ones I had were from a new batch and should have been OK, So I've returned.Also the general sound were nowhere near this amazing sound quality that most YouTube reviewers were claiming, and I still preferred the sound from my old Enacfire e19R which I am looking to replace due to their diminishing  battery life"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Aless",
          "Nb_Reviews": 3,
          "Date": "2021-02-10T21:56:24.000Z",
          "Titre": "soundcore life P2 - poor mic",
          "Contenu": "I bought the soundcore life P2 earbuds. Sound quality is good however the microphone is very poor quality. I bought actually for using it for calls, however the other persons on the line can barely hear me. I can simply not use them for this purpose. I have been very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "FrancisL",
          "Nb_Reviews": 12,
          "Date": "2022-10-12T11:56:35.000Z",
          "Titre": "Ear buds poor fit",
          "Contenu": "I bought a rather expensive pair of SoundCore ear buds in Taiwan. The sound was ok. However, appalling fit and always felt like they were about to fall out (often did). After about 4 months, one of the buds stopped working (I went back to my wired ear phones.) In the UK to I thought I would try to get a replacement earphone or get faulty one fixed  Soundcore made it awkward. A week later I was using the one good ear bud in a field. It fell out in long grass, totally disappearing. I went home and threw the rest of the Soundcore stuff away.(date of experience) Just appalling. I have bought an Oppo pair now. They don't fall out. If your Soundcore buds dont fall out or break, the sound is ok, but for me buying the product is a big regret, and attitude of customer service while understandable from their point of view (yep, could have tried to replaced in TW), means that I won't be buying from this brand again.  I read the reply. A bit empty in my opinion. I DIDN'T get the response I was hoping for (BEFORE losing the one good Earbud). Also, not quite sure what paperwork I have in Taiwan. The main point stands, expensive purchase is basically useless after ~4 months. I am currently wearing my WIRED Sennheiser phones, still going strong after ~4 years."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Miss Maryum Naeem",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T08:16:22.000Z",
          "Titre": "The left headphone doesn’t work",
          "Contenu": "The left headphone doesn’t work? Please could I get an exchange, it’s not even been a month.I’d like to purchase a different pair instead, I don’t mind paying the little amount more Please could someone help"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Tom De",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T10:34:02.000Z",
          "Titre": "Nice but asynchronous",
          "Contenu": "The sound is great the only thing about it is that the sound and a video aren't synchronized so it's just a thing for music not what I was expecting."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris Irwin",
          "Nb_Reviews": 3,
          "Date": "2020-12-06T11:43:46.000Z",
          "Titre": "Products are good but service is not",
          "Contenu": "The Soundcore products are good, but they offer no spares replacement service in the UK, so if you lose an earbuds or the charging case you cannot buy a replacement. For a company that claims to have great customer service this is very disappointing. Having resorted to eBay to buy a second-hand charger to replace one I lost I discover they also changed the design of the Liberty Neo so that newer earbuds will not work in the older case, even though the model name is the same. The newer products comes without any code marking at all - very poor. Customers services answer is just \"buy another set\"."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Anhar Alsarhi",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T02:50:26.000Z",
          "Titre": "Problem with Bluetooth connection.",
          "Contenu": "Problem with Bluetooth connection.Come and goes."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Simon P",
          "Nb_Reviews": 2,
          "Date": "2022-06-05T00:23:44.000Z",
          "Titre": "Good concept but only really good for making phone calls.",
          "Contenu": "I had high hopes for these and as a general fan of Soundcore these came as a huge disappointment.First off the sound and volume is at best ok for people I have given them to try but for me they are terrible as I have a large head and they only come in one size meaning the main speaker on the arch of the arm is to far away from my ear.This meaning they are very quite and tinny in sound even with EQ changes. But to make things worse if you turn up the volume more than 80% they F**t constantly even listening to folk music and they also have this awful clipping effect dipping the volume as soon as any bass comes in.They also do not fold up very well or fit the supplied case very well and the battery life is at best 3 hours for me on fully volume. Good things are they are nice sunglasses but I would only except to pay more than around £30 for them and they are very good as for phone calls, being very clear both ways. I will be returning mine as I do not feel they are worth no way near the asking price."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Karen",
          "Nb_Reviews": 4,
          "Date": "2020-09-15T08:26:17.000Z",
          "Titre": "The sound is fine, but too bulky",
          "Contenu": "The sound is fine, but it’s quite bulky and whilst I’m using the small ear plug, it still drops out of the ear easily."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Mourad Benmehirisse",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T20:03:08.000Z",
          "Titre": "i didn't like it",
          "Contenu": "i didn't like it, whene i make the cask i don't feel good"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "BOB",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T09:28:49.000Z",
          "Titre": "Probably best to spend more on better quality brand!",
          "Contenu": "Battery life is good Bluetooth connectivity is poor"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Oudendijk",
          "Nb_Reviews": 3,
          "Date": "2020-12-09T23:22:44.000Z",
          "Titre": "The earbuds connect poorly and…",
          "Contenu": "The earbuds connect poorly and synchronise badly."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "The Maverick",
          "Nb_Reviews": 81,
          "Date": "2022-06-10T10:38:26.000Z",
          "Titre": "Q30 Misselling - No ANC or EQ in Wired Mode!",
          "Contenu": "This review is specifically for the Q30 Life Headphones:I originally rated my review at 5 stars as after downloading the Soundcore App to gain access to the multiple equaliser settings (which you have to do or the sound is flat).  The Equaliser provides loads of presets and this worked a treat - uploading the profile direct to the headphones via Bluetooth.Everything was going fine for a week, and the ANC noise cancelling function worked very well too.1 week later I was shocked and annoyed to find that when I came to use the headphones with the AUX cable supplied on some of my other devices like my PC or my soundbar - the headphones cancel both the equaliser settings and the Noise Cancelling Functions!In other words the headphones revert to a flat horrible sound like you are inside a tin can.  There is nothing you can do about it and the ANC button changes to a pause and play button!This is totally underhanded and what is worse is that Soundcore / Anker make no mention of this on their Amazon product web page.  So they have crippled two of the core and primary functions without telling you prior to purchase.So if you are on an aircraft or have no compatible bluetooth device, you cannot effectively use these headphones as the sound is unbearably poor quality without the equaliser functionality and you can forget any noise cancellation functionality.The fact that Soundcore omitted to  make this fact know to buyers has really ticked me off.  However, if you buy their more expensive Q35 headphones, these functions are miraculously restored...  From research I have done, it seems that early models of the Q30 did have these features enabled with the wired AUX connection, but a firmware update has now disabled it and anyone buying a new pair like I had just done a week ago will already have this later firmware preinstalled so there is nothing you can do.I sent mine back to Amazon on the basis that these were sold not as described.  Soundcore should come clean with their customers and clearly state that the Equaliser and ANC functionality ONLY works if connected via Bluetooth!  Then customers would have an informed choice.I am now looking for another set and will not be purchasing the far more expensive Q35s as I believe this is why they crippled the function to get people to buy the more expensive set that are almost identical in every other way, but do have the both these functions working in wired mode and bluetooth mode."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Theodor K",
          "Nb_Reviews": 30,
          "Date": "2023-03-01T10:24:58.000Z",
          "Titre": "A+ customer service, quality have decreased",
          "Contenu": "Everything affiliated with Anker used to be top quality; both the product and the customer service.The customer service is still some of the best i have ever experienced. They go above and beyond to make sure you are satisfied and that is so nice.However, the quality of their headphones seem to have gone down. Bought the Liberty 3 pro headset which had several issues (connectivity, sound, weird noises, bad ANC etc.). They were so kind to send me a new pair but this pair also had problems. So many that is seems like a product that is still in beta.They get 3 stars because of their customer service, not the quality of the products."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Jorge Gomes da Silva",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T16:51:25.000Z",
          "Titre": "Liberty 4 background Noise",
          "Contenu": "Liberty Air 2 Pro prevented background noise much better than Liberty 4. That's a shame because the lifepro 4 are 50% more expensive."
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "VU",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T11:46:12.000Z",
          "Titre": "damaged box but works ok",
          "Contenu": "The delivery was fast, there was a 2 box, the big one cartoon paper was almost completely damaged. the other box with speaker inside was OK."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Henry Crone",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T07:46:09.000Z",
          "Titre": "SoundCore Earbuds",
          "Contenu": "Good sound and comfortable to wear (earbuds).However, not able to control volume; serious shortcoming."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T08:43:37.000Z",
          "Titre": "I contacted post-sale via WhatsApp",
          "Contenu": "I contacted post-sale via WhatsApp. Took 2 days for them to tell me 2 where to get replacement gear. Also, the gear was only available on the German version of the shop. Lastly, there could be all colours of replacement gear available, not only black."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Aimee c",
          "Nb_Reviews": 8,
          "Date": "2022-12-12T02:30:14.000Z",
          "Titre": "Earbuds ok, Overhead phones not ok",
          "Contenu": "Bought the q35 over head phones which came with a free pair of in ear buds. Ear buds pretty good fit and sound quality. Feel is very plasticky and cheap. The over head one was worse very poor quality, again plasticky cheap and you can hear the music through the head phone when not worn. So on low- med volume other people can hear what you’re listening to. So not recommended if you care about privacy."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Tobias",
          "Nb_Reviews": 4,
          "Date": "2022-12-28T17:29:48.000Z",
          "Titre": "Wrong item at first but success in the end",
          "Contenu": "I ordered a soundcore 3 from the European store and got my package around 3 days after ordering but they sent me the wrong item. So, rather than a speaker, I received an ice scraper for car windows. I contacted Anker and after several messages and long response times from Ankers side they sent me a new package. So, finally, I received the ordered speaker just in time for Christmas."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mark Taylor",
          "Nb_Reviews": 7,
          "Date": "2023-01-30T20:01:25.000Z",
          "Titre": "Poor delivery company",
          "Contenu": "Your delivery company choice is poor, they had the item at depot for 4 days before it magicly appeared at my door, their tracking was very poor."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "cliente",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T14:25:59.000Z",
          "Titre": "Ear pain is not a reason for 30 days free return",
          "Contenu": "When I wanted to return earbuds that were reasoning ear pain,  they asked me for a shipping fee or offered me a discount. I chose to accept the discount and gift the earbuds to someone else, when they could have offered me something else that I would have been happy with. Like a free return or the chance to try a different model. While I'm satisfied with Soundcore's sound quality, from now on I'll prefer to buy elsewhere with free returns."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Babu",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T18:10:53.000Z",
          "Titre": "OK Soundcore Life P3... could be better.",
          "Contenu": "Before I bought this Soundcore Life P3, did some research and noticed mixed reviews. But mostly good.  Unfortunately my experience is not good so far.  Kinda OK. The problem is, when you take the earbuds from the charging case and try to connect to the phone, the earbuds don't switch on.  However,  if you keep the earbuds back on the charging case and reset them and try again...bingo. It works.  Obviously it's annoying.  Isn't it?  Having said that it doesn't happen all the time. I would say..3 or 4 out of 10 times.Sound quality is good. Noise cancellation is effective."
        },
        {
          "Note": 3,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T10:30:33.000Z",
          "Titre": "It’s OK",
          "Contenu": "Good sound yes, nice looking but noise cancellation not really different from normal sound."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andy Riddell",
          "Nb_Reviews": 6,
          "Date": "2022-11-24T15:12:48.000Z",
          "Titre": "Love Soundcore but..............",
          "Contenu": "Love Soundcore, always stunning design and sound but just purchased the sport X10 and I am so gutted, the sound and look as always is stunning and the wing around the ear is perfect for me but as a review on there own website states, the headphones aren't deep enough so the ear wing is a waste of time as it just doesn't sit in the ear properly and moves about during exercise, the curve bit at the back also doesn't sit in the loab bit perfect either, make this actual ear pod part deeper and you really do have the perfect ear pod but until then I'll be returning as you can't concentrate on a run or exercise for constantly keep having to push it in, gutted as I love them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mssoares",
          "Nb_Reviews": 5,
          "Date": "2023-01-24T02:20:36.000Z",
          "Titre": "Looks good and sounds decent but it…",
          "Contenu": "Looks good and sounds decent but it lacks clarity specialy on the high notes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Logan Gentry",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T18:08:28.000Z",
          "Titre": "Shipping problems",
          "Contenu": "Didn't ship my product for a week finally contacted them and was told they didn't have the color and blamed it on covid."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Marc Price",
          "Nb_Reviews": 10,
          "Date": "2022-12-19T19:11:58.000Z",
          "Titre": "Speedy delivery",
          "Contenu": "Speedy delivery, great packaging, shame the product isn't the finished article though."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "ANA MARIA POENARU",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T09:49:17.000Z",
          "Titre": "Best earcufs",
          "Contenu": "The order left late and arrived after 1 month.The products are amazing"
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Alexander Kvochkin",
          "Nb_Reviews": 2,
          "Date": "2022-07-27T17:26:43.000Z",
          "Titre": "Taps works terrible, cannot copy equalizer settings",
          "Contenu": "Sound ok but… The use of taps is terrible. You can accidentally touch the earpiece with some side (even with the outer side of your hand) and start the next track. But if, as it should be, tap twice with the fingertips where necessary, nothing happens. There is no function to copy the equalizer settings to the custom option for tweaking, say, high frequencies..."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Meni Harati",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T17:27:55.000Z",
          "Titre": "Sound ok but noise blocking was a bit…",
          "Contenu": "Sound ok but noise blocking was a bit of disappointing.I bought it as recommended from a friend but I was a bit disappointed as the noise blocking in any phase didn't block the noise from outside and the left headphone was not stable and fell from the ear even that I change the size of the silicon"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "HP",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T14:15:56.000Z",
          "Titre": "Unresponsive customer support (Updated)",
          "Contenu": "Due to some specific features which have found to be not available on the device, I decided to return them. When I contacted the customer service via email to do so, there was no response, and there still is none.Edit: After leaving above review and one star, then receiving a response by Anker, I contacted the customer support again. This time, they responded and resolved my concern."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Steven Bodsworth",
          "Nb_Reviews": 8,
          "Date": "2021-12-08T17:38:11.000Z",
          "Titre": "Not up to expectation",
          "Contenu": "After my first purchse of some Q30s I was WOWed by the sound quality and performance - Better I thought than my Bose QCs!So I purchased some Life P3s hoping for a similar experience only to be truly dissapointed.Soundcore customer care were very good about it and offerred a refund if I returned them but I really could not be bothered as they did work.....just not as well as I had hoped."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2021-12-07T18:16:09.000Z",
          "Titre": "My first order arrived with DHL in less…",
          "Contenu": "My first order arrived with DHL in less than two days the second  order I placed one week  later using a -24€ coupon has not yet arrived  after 10 days I can see it has been traveling  through half Europe. I assume the discount  has to do with the shipping  cost. You get a discount at the cost of delivery time and the worst thing is that they don't  even mention  it."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Kevin Putt",
          "Nb_Reviews": 3,
          "Date": "2021-12-14T07:10:40.000Z",
          "Titre": "Connectivity has been an issue.",
          "Contenu": "The headphones are comfortable and affordable.  Unfortunately, I have had constant problems connecting them to my laptop, which is what I bought them for.  In the end, I had to give up and am now using them with a different PC.I think that it would be useful to have a specific driver to support the headphones to avoid this issue."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T07:40:47.000Z",
          "Titre": "Liberty Air 2 works ok on the phone but not so well on laptop",
          "Contenu": "Liberty Air 2 works ok on the phone but when using on laptop for Teams calls connectivity and sound are patchy. Pairing the individual buds appears to confuse the set up. I was looking at a Jabra earpiece but as I wanted the flexibility to use on my laptop this seemed the better option at the time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Olivia",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T18:23:41.000Z",
          "Titre": "Good but not worth 100£",
          "Contenu": "These headphones are really good for listening to music. I love the design and the colour, but the way they’re built is a bit weak, I’m constantly scared that they’re gonna break and the sound leaks. Also the noise cancellation is stronger in one ear and weaker in the other."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T19:04:44.000Z",
          "Titre": "Shipping was partly a disaster.",
          "Contenu": "Shipping was partly a disaster.Soundcore please, if you allow special characters like ű, ř, ž etc in address/name/city etc, then please at least somehow convert them to readable characters. It is quite common in Europe to have special characters in addresses/names.UPS received my address missing 4 letters because of this reason, so I had to write them directly to fix my address, which they couldn't find for 3 days.Soundcore support while they replied, could not help to fix my address, instead they offered to remail my package if not delivered.Product works fine though, I would order from them again."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T10:27:42.000Z",
          "Titre": "The product itself is excellent quality…",
          "Contenu": "The product itself is excellent quality especially at this price point. The instructions that come with it though are not great, instead of just using pictures maybe it should have written instructions as well. It didn't help that I had to install a Bluetooth adapter on my PC as well which was not as straightforward as it should have been, so maybe my score is a bit skewed because of this."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Siddesh",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T10:00:45.000Z",
          "Titre": "Average sound quality good make",
          "Contenu": "Bought the Anker Soundcore Liberty2 as part of Black Friday week sale. Had done a lot of research prior to buying a good pair of wireless earbuds and finally decided to buy these ones. Overall the build quality, controls and charging looks good based on my couple of weeks usage. The sound quality is kind of average though that’s what I found."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Elviss Zutis",
          "Nb_Reviews": 2,
          "Date": "2020-09-21T05:24:47.000Z",
          "Titre": "Not so good as you would expect.",
          "Contenu": "At the start, the earbuds were really good. Connected them via Bluetooth and were really happy about the quality and high possible volume to change. Then I had a problem where earbuds would not having connectivity with the phone and I needed them to restart. Now it got worse, they disconnect more often than before. I haven't switched to another device. I have read articles where many people suffer from this problem."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Connor",
          "Nb_Reviews": 2,
          "Date": "2020-11-06T17:56:56.000Z",
          "Titre": "decent for price, but really over all not that decent.",
          "Contenu": "honestly for the price paid the usage time length is the only positive i can really throw out first, connectivity after a fortnight has weirdly become quite problematic, sound quality itself isn't all that great and rather lack of bass overall but for how cheap they are i wasn't expecting this to be huge quality, ultimately the connectivety is the problem for me and the lack of some areas in certain genres in the sound quality let it down, but listening time makes up for it."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cecy",
          "Nb_Reviews": 2,
          "Date": "2020-09-18T12:12:55.000Z",
          "Titre": "Good product...shame it doesn't fit.",
          "Contenu": "The quality and build of the product as well as the sound was excellent. However, I had some problems with synchronisation of the buds requiring resets and also the buds were too large for my ears - even with the smallest ear inserts and wings resulting in discomfort/pain after prolonged wear (>1 hour)."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ishy",
          "Nb_Reviews": 2,
          "Date": "2020-12-10T16:25:37.000Z",
          "Titre": "Quite Disappointed",
          "Contenu": "I brought these for my husbands birthday and liked them that much he brought me a pair :) However no matter what buds I try they keep slipping out :( they have fallen out at the gym and also just with them around the house. Bits great when you have young kids about that want to put everything in their mouths!I didn’t need to change my headphones as I’ve already got a pair. I thought these would be better for me as the charging case comes in handy when on the move however I think possibly should’ve just of just stuck with me old ones :( and have reverted back to using them."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Richard P",
          "Nb_Reviews": 13,
          "Date": "2020-09-21T08:48:16.000Z",
          "Titre": "The sound quality is really good for…",
          "Contenu": "The sound quality is really good for the price. However the Bluetooth pairing is a really hit and Miss process. The unit suffers from an intermittent issue where only one ear bud pairs with my phone and no amount of resetting / repairing appears to resolve the situation."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Heather Field",
          "Nb_Reviews": 7,
          "Date": "2020-11-04T08:27:23.000Z",
          "Titre": "Lacking ‘roundness’ to the sound",
          "Contenu": "Lacking ‘roundness’ to the sound - not for me. Also for me blocking the ear with a snug fitting silicone shield meant I was hearing too much noise from my own body. Though company refunded the cost promptly honouring their 30 day no quibble refund policy ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Hannah",
          "Nb_Reviews": 2,
          "Date": "2020-10-27T09:17:28.000Z",
          "Titre": "Good value for the price",
          "Contenu": "Very comfortable so far, I’ve had to wear them for a couple of hours straight through as well as shorter bursts. Seems to be good for calls, yes, even through a mask. Noise cancelling isn’t so strong that I get horrid feeling of falling that I’ve experienced before. But enough that you can be aware of traffic etc and still perfectly hear your music/podcasts. Two things not so great - 1 is sound bleed is quite bad so not good if you are working alongside someone who needs silence. Or if you’re in the quiet carriage on a train! Also, after 2 weeks, there’s a loud crackle / bang sound that’s started. How do I fix this???"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kem",
          "Nb_Reviews": 5,
          "Date": "2020-11-17T15:00:03.000Z",
          "Titre": "The mic on the headphones isn't always…",
          "Contenu": "The mic on the headphones isn't always clear for calls outside of the house. So if you are seeking crystal clear vocals then it might not be for you. The music quality is great though, but all in all not bad for the price."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Ivan",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T08:20:27.000Z",
          "Titre": "The Q30 Headphones",
          "Contenu": "The Q30 Headphones sound quality is great. Awesome value for the price paid. However, I think there are still bugs to be fixed (when jumping between two devices audio, the volume gets too high and it hurts my ears)."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T14:46:08.000Z",
          "Titre": "Great, but not for runners",
          "Contenu": "Good sound, look and feel. They just will not stay in while running. I’ve tried all the ear pieces That come with the unit to no avail. Shame. Everything else was great. If you run, look else where."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Chris Leakey",
          "Nb_Reviews": 6,
          "Date": "2020-09-15T17:21:58.000Z",
          "Titre": "Tried to cancel one of my 2 orders just…",
          "Contenu": "Tried to cancel one of my 2 orders just 5 minutes after ordering (duplicate order by mistake), and was told I couldn't cancel because the order had already been dispatched. Really?!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Leigh",
          "Nb_Reviews": 10,
          "Date": "2020-12-14T09:27:40.000Z",
          "Titre": "Superb at launch for £80, 2 weeks later for £60...Oh Anker.",
          "Contenu": "'Superb for £80 quid I thought!' for a Brand New Product that only shipped in the UK on 15th November. Then they had a 25% off 'flash sale' less than a week later, which is now a permanent '£20 quid off' voucher. For a new product, I was miffed. 25% off. I'll never buy new product from Anker. I'll just wait a few weeks for a massive sale.Q30 Headphones are spot on, Noise cancelling works fine in all 3 modes, connected immediately, any Bass/Mid/Treble issues can be tuned well enough with the Equalizer app, and were I reviewing JUST the Q30's for £60, they would be a solid 4.5/5.EDIT: Soundcore replied saying the voucher was from Amazon, though I bought directly from their UK store  - uk.soundcore.com -  which now has a permanent £20 off Voucher on the site and no mention of Amazon."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "PAUL RIVETT",
          "Nb_Reviews": 2,
          "Date": "2020-11-17T08:23:08.000Z",
          "Titre": "Great sound but disappointed with the…",
          "Contenu": "Great sound but disappointed with the battery life for the budd only get 5-5.5 hours and the docking station, but as I say the sound quality is great."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "H. Dijkstra",
          "Nb_Reviews": 27,
          "Date": "2022-01-25T08:31:33.000Z",
          "Titre": "Motion Boom, average quality",
          "Contenu": "I ordered the Motion Boom. A well made and solid speaker with a reasonable  sound. A littlebit pricy for its performance."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "MR R B",
          "Nb_Reviews": 33,
          "Date": "2020-10-13T13:40:04.000Z",
          "Titre": "Good sound quality,poor microphones",
          "Contenu": "Good sound quality for the price,despite having 4 microphones call quality is very poor in noisy environments not very good as they claim."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "T James",
          "Nb_Reviews": 4,
          "Date": "2020-09-15T08:07:41.000Z",
          "Titre": "They work well when listening to music…",
          "Contenu": "They work well when listening to music but are a disappointment when it comes to making phone calls - people can’t hear my at all well."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Nina",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T10:04:35.000Z",
          "Titre": "The microphone doesn't work properly on…",
          "Contenu": "The microphone doesn't work properly on the earbuds and some songs have a strange sound, i think the ones with a more heavy bass"
        },
        {
          "Note": 3,
          "Lieu": "SI",
          "Pseudo": "Matej",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T14:25:04.000Z",
          "Titre": "Sound is good but its disconnecting",
          "Contenu": "Sound is good but its disconnecting, also problem with reconnecting to pc after beeing connected to phone"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "IVAN",
          "Nb_Reviews": 9,
          "Date": "2020-11-04T08:14:08.000Z",
          "Titre": "Hello",
          "Contenu": "HelloI ordered 2 items one of them liberty neo the battery life is about 4 hours not 7 hours .I am a bit disappointed"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alex Norton",
          "Nb_Reviews": 14,
          "Date": "2020-12-09T14:58:14.000Z",
          "Titre": "They are fine",
          "Contenu": "They are fine for the price, i sometimes find they disconnect and splutter in some situations."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "T Wood",
          "Nb_Reviews": 29,
          "Date": "2020-12-09T12:20:48.000Z",
          "Titre": "Website easy to use",
          "Contenu": "Website easy to use, delivery swift. Cannot comment on product as bought as a Xmas present."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Iulia C.",
          "Nb_Reviews": 3,
          "Date": "2020-09-15T08:31:37.000Z",
          "Titre": "Package received from amazon..",
          "Contenu": "Package received from amazon... didn't expect that since I ordered in the Anker site."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Romulo",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T10:23:20.000Z",
          "Titre": "Bankrupt after charges to send the product back!",
          "Contenu": "For some reason it took longer than normal for the product to arrive, despite it was on stock and it was dispatched by Amazon (even though I order from Soundcore's website directly). I live in Linz (Austria) and normally an order from Amazon takes 3-4 days to deliver, from Soundcore's website it took 8 days. I was looking forward so much to get the product and when I received it, I figured out I had ordered the previous generation (Liberty Air). I thought they had sent the wrong product but I realised I made the mistake of ordering the wrong one. Unfortunately, when I filled the returning form I got to know I would need to pay for the shipment back, since it was my mistake. I got a little upset but accepted it, thinking it would cost me the normal 4-5 euros that most of companies charge for shipment. Shockingly, it costed me 14 Euros!! I paid 70 Euros for the earphones and just to send back I needed to pay 14!! At the end of the day, I was heavily penalised by my mistake, even though in present times most companies don't charge for returning items. Finally, because of this I am not going to order the Liberty Air 2 anymore, unfortunately. If I didn't need to pay this absurd in the shipment return, I would have placed a new order for the correct product. Bad for me, bad for Soundcore, nobody is happy. Good job!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alwin",
          "Nb_Reviews": 3,
          "Date": "2020-12-01T08:41:37.000Z",
          "Titre": "falls out of ear easily"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gaz",
          "Nb_Reviews": 6,
          "Date": "2023-07-24T16:38:54.000Z",
          "Titre": "Definitely worth a shot at the right price!",
          "Contenu": "The delivery was fast and the headphones sound good. You do have to experiment with the various EQ settings to get the right sound for different types of music. Also, the sound is only loud and clear enough with noise cancellation activated."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jack Timbers",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T01:34:11.000Z",
          "Titre": "4.9* q 35s had over a month now",
          "Contenu": "4.9* q 35s had over a month now,  clearly notice the improvement from q30s, to be honest wowwwzzzzz!!!! amazing sound, super loud, personal equaliser 👌 naughty!! Battery life…incredibleWater test,, u get these bad boys wet ur buying me new ones!Price bargain! Won’t get this kinda quality for the price!"
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "Jana Harvanova",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T15:27:44.000Z",
          "Titre": "Nice, stylish yet affordable earbuds",
          "Contenu": "Really good price/quality ratio. The sound is really crisp and clear, the bass is there but not that resonating or strong (comes down to preference, I like it this way). The app is amazing, the vast selection of equalizers and also a custom option is great. The noise cancelling is ok, slightly worse than what Space A40 has, but considering it's also cheaper than A40, it's not really a negative. The only thing I think is a pity is that there is no HearID support for these earbuds, so no customization for your hearing. The only reason why I give them 4/5*, otherwise they are perfect."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T12:23:52.000Z",
          "Titre": "Fantastic sound and features at reasonable prices",
          "Contenu": "Anker produce excellent-sounding products under the Soundcore brand at very reasonable prices. The new Liberty 4 earbuds are the equal of Apple AirPods in every way but at half the price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steven Bodsworth",
          "Nb_Reviews": 8,
          "Date": "2023-01-18T19:19:56.000Z",
          "Titre": "Good sound but the App needs work",
          "Contenu": "Good sound, but the noise cancelling is not as good as other brands in my opinion. It would be nice if the Soundcore App also allowed connection to multiple devices (Like the big competition do!). However for the money, good overall!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Umang Maheshwari",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T15:19:07.000Z",
          "Titre": "Good shopping experience. Go for it",
          "Contenu": "Overall my shopping experience on the website was pretty good. I ordered a pair of headphones, which to honest I didn't like that much. This was my first time bad experience with soundcore, however, the company made all the efforts to make it right, and refunded my money as soon as I raised a refund request. Quite satisfied with the purchase in general."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Elena",
          "Nb_Reviews": 4,
          "Date": "2023-03-12T13:02:17.000Z",
          "Titre": "The connecting to device sound is very…",
          "Contenu": "The connecting to device sound is very loud and hurting my ears. There is no way turn those “maintenance” sounds off. When connected to a PC the sound has some crackling at times. Otherwise, sounds good if listening to music on an iphone."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JONATHAN POCHIN",
          "Nb_Reviews": 6,
          "Date": "2022-12-15T13:58:54.000Z",
          "Titre": "I've been aware of Anker since i was…",
          "Contenu": "I've been aware of Anker since i was given a Bluetooth speaker as a present. I feel there products are unique and robust. These headphones just clear up what i already expected. And that is that they are excellent"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alessandro",
          "Nb_Reviews": 3,
          "Date": "2022-12-18T22:31:12.000Z",
          "Titre": "Replacement parcel received",
          "Contenu": "Edit:Thank you SoundCore to rectify the delivery issue. A new item was sent out with super fast delivery (different courier, interestingly). Well done making it happen before Christmas. Haven't tested the product yet, but good job. Original review:Still haven't received the parcel, 3 weeks late as I write this (through Evri). Contacted Soundcore customer care which said they'd raise it with the courier (parcel clearly trackable as not delivered or lost)I think they should have sent me a new unit and attempted to recover the lost one for themselves. Especially since I ordered it in early Nov as Christmas present and I still dont have it. Happy to change the Trust pilot score if the item arrives in time for Christmas."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ROGER MOORE",
          "Nb_Reviews": 16,
          "Date": "2022-12-12T10:39:22.000Z",
          "Titre": "Value for money Bluetooth speaker",
          "Contenu": "Value for money Bluetooth speaker, could have been built better, some blue tooth speakers have a slightly better sound stage, but u won’t notice the difference. Value for money speaker.  Def recommend 👍"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 4,
          "Date": "2022-12-17T05:15:49.000Z",
          "Titre": "I give 3 stars for \"life P3\"because of…",
          "Contenu": "I give 3 stars for \"life P3\"because of design. My previous Anker earbuds life p2 was much cheaper than life p3 and much more comfortable I mean it was easier to put to the ear and it was steady on."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Cristian Bulea",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T09:24:26.000Z",
          "Titre": "Sound OK just with custom EQ",
          "Contenu": "Sound OK just with custom EQ. I bought 2 motion + speakers for stereo experience. It is amazing effect.In case of using in pair mode (stereo) the sound drop 2-3 seconds even if use aux cable or bluetooth connection (TV / phone / laptop) in fw 45.49. From reviews until now this it is a issue of this last firmware vs previously fw: 39.39. I don't found to make downgrade to 39.39 the both my motion + speakers. Maybe you can help me to find a solution for drop sound from time to time in case the speakers are use in pair (stereo) mode.Thanks."
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "Markus Pae",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T20:42:35.000Z",
          "Titre": "Good for the price",
          "Contenu": "Noice canceling wasn't the best but you can't compare 80€ headphones with 220€ so overall it's good but still has room for improvment"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T00:42:17.000Z",
          "Titre": "pretty nice quality",
          "Contenu": "pretty nice quality, except it's a little bit disconfortable on the top of my head, when used for long periodes of time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon H",
          "Nb_Reviews": 19,
          "Date": "2022-12-14T07:35:45.000Z",
          "Titre": "Issues rectified after a little delay",
          "Contenu": "Original experience is still left below but have to give credit to Soundcore they did come back to me and have sorted a new order at the black Friday price.----++++----Pretty poor service following purchase of a Black Friday item.Received an email days later to say they had ran out of stock and as an alternative could offer me a pair of pink headphones (I had ordered some sunglasses).Replied stating that it wasn't an appropriate alternative so I was told I would be given a refund.I then spoke to a friend who informed me he was given a different style of sunglasses as a replacement. Contacted CS again to request option of alternative glasses, reply stated this is not possible as refund process had started I requested for option to repurchase at the black Friday deal but have not heard anything back so if I now want this option I will need to pay double what the black Friday price was."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Volkan Taç",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T11:17:21.000Z",
          "Titre": "Sounds great BUT",
          "Contenu": "Sounds great so I wanted to buy 2 for the TWS mode but apperantly it doesnt work well, it sometimes disconnects randomly and become annoying"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Matej",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T11:05:39.000Z",
          "Titre": "The noise canceling is way better than…",
          "Contenu": "The noise canceling is way better than my previous headphones had. They are bit basy for me, but the EQ helps."
        },
        {
          "Note": 4,
          "Lieu": "UZ",
          "Pseudo": "NTV",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T21:10:06.000Z",
          "Titre": "I bought soundcore life p3 yesterday…",
          "Contenu": "I bought soundcore life p3 yesterday and i have no experience yet but i think it’s good for its price I think I’m gonna like this"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael Keane",
          "Nb_Reviews": 3,
          "Date": "2022-12-26T10:44:46.000Z",
          "Titre": "I was deliverd the wrong product that…",
          "Contenu": "I was deliverd the wrong product that was annoying but it was resolved after a few emails just a inconvenience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vin Wofter II",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T03:29:20.000Z",
          "Titre": "I just purchased the Soundcore (Life…",
          "Contenu": "I just purchased the Soundcore (Life Dot 3i) earbuds a few days ago and I absolutely love them 💯. The phone app options are cool and many EQ options to choose from. I also like noise cancelation,noise transparency, and normal options for surroundings if needed. Keep up the great work and I'm sure I'll be investing more of your superior electronic products!Your Loyal Fan,Marvin"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Silviu Ionut Stelea",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T06:54:01.000Z",
          "Titre": "Great and cheap",
          "Contenu": "Hello! I think this is a very good cheap speaker. I like the design, the touch, but I thought the sound will be a little bit more up, but anyway is a great cheap speaker."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Haagse Harry",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T12:21:43.000Z",
          "Titre": "Speedtest delivery and good quality…",
          "Contenu": "Speedtest delivery and good quality sound, what more can you wish for!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Pablo Bort",
          "Nb_Reviews": 4,
          "Date": "2023-01-20T13:21:19.000Z",
          "Titre": "Really good value/price",
          "Contenu": "Really good value/price, great sound and volume in a ver compact and light device. Feels very well finished and high-end"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chidozie Kevin Uba",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T04:25:29.000Z",
          "Titre": "Okay",
          "Contenu": "Good delivery although I didn’t get a call it was just dropped."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "dan",
          "Nb_Reviews": 2,
          "Date": "2022-12-17T12:15:52.000Z",
          "Titre": "sound great!",
          "Contenu": "Great sound,good quality build but little to small for me.Maybe i will buy some bigger frames."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Vedran",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T10:50:36.000Z",
          "Titre": "Soundcore Space A40",
          "Contenu": "Great bang for the buck. A40's have great sound and are comfortable to use throughout the whole day."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "P Challis",
          "Nb_Reviews": 6,
          "Date": "2023-01-31T09:36:13.000Z",
          "Titre": "Easy to order direct from Soundcore",
          "Contenu": "Easy to order direct from Soundcore, good communication direct from Soundcore about date of delivery etc, extremely disappointing that delivery carried out by an Amazon Prime courier"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "AHMED AHMED",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T11:21:06.000Z",
          "Titre": "I like it",
          "Contenu": "Sounds gr8 ,custom eq and the homies like it .......dont think my neighnbours do though"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROSYL SALDO",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T08:33:58.000Z",
          "Titre": "Worth the price",
          "Contenu": "Great product, battery lasts me days. Sound quality is good and fit in the ears is nice."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pauline Curtis",
          "Nb_Reviews": 12,
          "Date": "2023-01-31T09:15:15.000Z",
          "Titre": "Sometimes disconnects for no reason",
          "Contenu": "Sometimes disconnects for no reason. Otherwise they are fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mike Sachpazoglou",
          "Nb_Reviews": 4,
          "Date": "2022-09-22T04:35:29.000Z",
          "Titre": "Liberty P2 good value for money",
          "Contenu": "I bought the P2 as a replacement for my P3s which had an accident. (Well one of them did.) Compared to the p3s, the P2 are a bit chunkier. Less appealing visually as they are larger, but also less comfortable.On the plus side, I'm happy with the sound and I prefer having actual buttons than the touch commands which on the p3s are not responsive at all.Overall I'd say the P2 are good value for money, I wish they were smaller (and worked with the soundcore app)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sandesh Bhat",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T02:44:05.000Z",
          "Titre": "Audio Leader",
          "Contenu": "Soundcore doing good job in audio industry, providing value for money products."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Rectian",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T21:46:45.000Z",
          "Titre": "2 weeks usage",
          "Contenu": "Using it for the past 2 weeks. It sounds good. Since the headphones goes deeper, hearing anything from outside is impossible. It's good in fact, you're not distracted by the outside noise. The charger is quite big compare to other wireless headphones of similar price. Though the headphones itself not protruding from the ears and they snuggle fit nicely.  Overall I am satisfied."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Kon L",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T23:40:22.000Z",
          "Titre": "Either poor build, bad glue, or something",
          "Contenu": "Hello, in general the it sounds great, there is just one problem. Whenever something is played louder the left speaker shakes, especially if moving like walking it is a lot more noticeable, annoying and makes a certain vibration, which ultimately interrupts the listening experience and the immersion into music. I’d actually love this problem to be fixed somehow, sending it back or something? Only problem is I don’t know how long that would take and it’s really hard to live without any over ear music."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Leroy Ketelaars",
          "Nb_Reviews": 5,
          "Date": "2023-02-24T10:22:18.000Z",
          "Titre": "seamless experience from purchase to delivery",
          "Contenu": "online store and order tracking worked well, seamless experience from purchase to delivery."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "ddddd",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T14:47:02.000Z",
          "Titre": "i love the overall expereience",
          "Contenu": "i love the overall expereience, but there are some things that are not so great.you can hear the wind very strongly in the songs, when the weather is windy and when i talk and use the microphone people can barely hear me, or if it's windy they can only hear the windfor iOS, the app suggested that i should use the app as a widget to change the modes more easily, and it doesn't work, the app and the widget crashed and i had to delete and re-download the app.but i a love the headphone, the sound is amazing"
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Zsolt Szabó",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T14:36:17.000Z",
          "Titre": "Soundcore OK. UPS not OK.",
          "Contenu": "Soundcore was professional and up to the task. However, UPS and it's partners were a mess. I could only get my shipment after the last attempt, as UPS kept diverting the package to the wrong address. After lot's of time on the phone with customer reps, at least I got my package."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Boyd",
          "Nb_Reviews": 30,
          "Date": "2022-05-28T09:54:16.000Z",
          "Titre": "Purchased Q30 headphones direct from…",
          "Contenu": "Purchased Q30 headphones direct from Soundcore and worth the money. The only thing that lets them down in my opinion is the battery warning signal as it starts to run out. It goes from medium power left to low but keeps repeating the signal every 30 seconds so you can't effectively use them without recharging, also when being charged they turn off."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Barré",
          "Nb_Reviews": 2,
          "Date": "2022-07-16T08:31:42.000Z",
          "Titre": "Very good choice : superb",
          "Contenu": "Fast delivery, and good surprise about the quality of product. The sound is correct for the size of the device, but remarks are: 1- the sensation of box vibration in the low frequencies is to ameliorate, for example on \"the weekend\" performer (starboy), necessary to apply equalisation as \"W\" signature, or presets as équilibre, signature at least for a better experience ,2 -power level 16watts too short. Not sufficient in certain cases for room bigger than10 m2 or outdoor.So, soundcore 3 is a very good choice for price/audio/quality , and I recommend! I am waiting for the version 4 😊"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Andrey C.",
          "Nb_Reviews": 4,
          "Date": "2022-07-13T11:58:48.000Z",
          "Titre": "My first experience with Soundcore is…",
          "Contenu": "My first experience with Soundcore is awesome! Seamless with Apple, great sound quality and with so many earplug sizes it is easy to find the best fit. The only reason I give 4 stars is because I can not connect it to multiple devices."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Thenahandi Mangala",
          "Nb_Reviews": 3,
          "Date": "2022-07-21T08:48:38.000Z",
          "Titre": "Sound excellent",
          "Contenu": "Sound excellent, App with change facility and eq us very good, range is over 12m, overall excellent . Must improve call time, 4 hr not enough but good with compare with high price earbuds. call answer/reject is not working."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gray Garrod.",
          "Nb_Reviews": 11,
          "Date": "2022-01-11T17:16:52.000Z",
          "Titre": "Purchased some Soundcore earbuds",
          "Contenu": "Purchased some Soundcore earbuds, great earbuds, very happy. I would've given 5 stars but I was originally sent a bottle of Baby bubble bath direct from Amazon instead of the buds which was a surprise. However after a short phone call to Anker I was sent the original purchase within a couple of days, and I got to keep the bubble bath, bonus."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Parrish",
          "Nb_Reviews": 14,
          "Date": "2022-01-02T09:19:38.000Z",
          "Titre": "excellent sound quality",
          "Contenu": "excellent sound quality, comfort and speed of connection, love these headphones. The noise cancelling aspect is a revelation (not experienced it before) but it can make my head feel slightly foggy for some reason, possibly due to pressure built up in the cups. No opinion on longevity yet as only had them a few days. Would recommend."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Kayra",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T15:45:26.000Z",
          "Titre": "amazing headphones",
          "Contenu": "really light and pretty headphones, the pink is so nice, and the noise cancelling is incredibly good, the sound is very clear. I just have a small issue sometimes it feels like the song's volume decreases without me doing anything and I haven't noticed that with my regular earphones. also I just have a suggestion, maybe add an option to skip songs faster? I feel like I have to keep the button pressed for more than one second for it to skip"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rod",
          "Nb_Reviews": 2,
          "Date": "2022-01-20T12:29:27.000Z",
          "Titre": "Although it was too late to change the…",
          "Contenu": "Although it was too late to change the delivery address, as I requested, Soundcore customer service was polite and relatively prompt. The Frames ordered are good - the sound is a little tinny, as expected from this type of product, bit it is clear, and is very good for things like audio books. Unlike other people reviewing 'smart' glasses, I did not expect or intend these to replace regular ear buds, but to serve as good sunglasses with added functionality, and these therefore for the purpose."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chelsea Parker",
          "Nb_Reviews": 10,
          "Date": "2022-05-13T17:11:30.000Z",
          "Titre": "Really good value",
          "Contenu": "Really good value, I love that you can choose to use noise cancelling or not. Excellent build quality for the money as well, I didn't want ones that are only made of plastic. Only criticism is I wish the loudest setting was louder"
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T08:50:57.000Z",
          "Titre": "Life Q30",
          "Contenu": "Sound quality and build quality are very good, noise cancelation works very good on pc fan noises. When it is relatively quiet around sound cancellation can give a low pithed rumble out nowhere and you have to swith it off. Microphone gives a reverb on other callers end. Price-performance is very good."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Teo Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T13:15:32.000Z",
          "Titre": "I haven't used them all that much but I…",
          "Contenu": "I haven't used them all that much but I can't say i have encounter any problem connectivity is good and the ANC is also very good. But if you expect to cancel out the tv or loud voices it's a no no. For its price however i would recommed it with closed eyes. Get it if that's your budget."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Falko",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T12:26:57.000Z",
          "Titre": "The sound of the life p3 is quite good",
          "Contenu": "The sound of the life p3 is quite good, especially good base.But the noice cancelling could be better.Overall a very good product for this price and the app is also very helpful"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "iConesque",
          "Nb_Reviews": 5,
          "Date": "2022-02-02T08:59:05.000Z",
          "Titre": "The Life P2 Mini is an ideal choice for those who are yet to jump onboard the wireless earbuds experience",
          "Contenu": "The Life P2 Mini is an ideal choice for those who have decided to explore the world of wireless earbuds for the first time, especially for those who were hesitant at the beginning of the emerging technology. Excellent value for a lot of earbuds."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Zaqia",
          "Nb_Reviews": 10,
          "Date": "2022-01-25T13:45:18.000Z",
          "Titre": "Some teething problems, but all in all a positive outcome",
          "Contenu": "Unfortunately after exactly one week of minimal usage the earphones stopped working for me. They wouldn't charge or connect to my phone. Even after a full day of charging they'd only connect to let me know that battery is at 10% and then disconnect automatically. I’ve tried every tip I can find online, but to no avail. Thoroughly dissatisfied as they are now of no use to me, and I've had to repurchase wired earphones! Only positives were the purchasing process and efficient delivery.**Update**The team contacted me and provided excellent customer service. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Donovan Richards",
          "Nb_Reviews": 7,
          "Date": "2021-07-05T22:04:00.000Z",
          "Titre": "awesome sound and great fit... But...",
          "Contenu": "awesome sound and great fit. Personally betterthanmy sennheiser momentum true wireless.One down side... And I hope they fix it in a firmware update. Keeping In mind these are still near £100 in UK and for all those loyal soundcore fans, I really wish they added a hear-through/ambient-noise function in the app. Allowing the 4 existing microphones to pic up our surroundings. I run with these on the daily and it's the one thing these are missing.#Soundcore #soundcoreliberty2pro #soundcorefirmwareupdate"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "D K",
          "Nb_Reviews": 4,
          "Date": "2020-11-17T11:19:43.000Z",
          "Titre": "As high quality and full of bass as…",
          "Contenu": "As high quality and full of bass as other reviewers have mentioned. The only issue I found was in the speaker dropping bluetooth connection with small devices (eg ipod nano 7th gen) when moving the ipod around, or putting it in your pocket. This hasn't affected other bluetooth speakers (eg. YOYO (S) Cambridge) that I have. Other than that, the sound and build quality, waterproofness and battery life are great."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Daren Tennyson",
          "Nb_Reviews": 11,
          "Date": "2020-10-13T08:04:59.000Z",
          "Titre": "Great product",
          "Contenu": "I have had a soundcore motion plus for a few weeks now and I am very impressed with it. The sound quality is excellent and the battery life, design and build quality are all very good.I do think the app could be a bit better and a small gripe is that the way it turns in and off is very annoying. But that's a very small issue on what is overall a great product I would definitely recommend"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Edward Rajah",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T00:13:34.000Z",
          "Titre": "Soundcore",
          "Contenu": "I absolutely love your earpods. They have great sound and easy to use. I especially like the multiple features the buttons have.One negative Is unlike airport they don't have their own app or noise cancellation once taken out of the ear."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr. Jonathan Wainwright",
          "Nb_Reviews": 9,
          "Date": "2020-09-09T08:18:31.000Z",
          "Titre": "Soundcore Life Q20 are a really good…",
          "Contenu": "Soundcore Life Q20 are a really good set of bluetooth headphones with noise cancelling. I personally find the noise cancelling has a slight his when switched on, and find the ear cups block out most sound anyway, so have it turned off. Other than that, the sound quality is pretty good for my needs (Spotify, Netflix etc.) and has a reasonable volume range, which goes plenty load enough for me."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Vancho Curevski",
          "Nb_Reviews": 3,
          "Date": "2020-11-20T16:09:48.000Z",
          "Titre": "The product is just perfect i have only…",
          "Contenu": "The product is just perfect i have only one issue and that is that I was expecting the more volume and the head[hones to be more loud but that is maybe just my opinion. Otherwise i love everything about them, very comfortable, the battery is going on for very long time, the sound is perfect clear without any interruptions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Wil",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T10:19:59.000Z",
          "Titre": "Great item but falls out of my ears…",
          "Contenu": "Great item and I love it.Only setback is it falls out of my ears sometimes especially if eating.It maybe a :don't eat with earplug\" thing, since the ear will be moving when you eating naturally.If falls at other times its probably due to my ear anatomy just like other buds I have worn.SOUND IS GOOD AND CLEAR."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Denis",
          "Nb_Reviews": 27,
          "Date": "2020-12-16T09:45:45.000Z",
          "Titre": "I have been asked to write this review",
          "Contenu": "I have been asked to write this review, although all I can say is that it was delivered without a problem. I was surprised it was delivered by Amazon despite being ordered off the Anker web site, although this was not a problem. Finally I cannot comment on the product as it is a present and has not been used yet."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sarah",
          "Nb_Reviews": 3,
          "Date": "2020-12-09T14:07:50.000Z",
          "Titre": "I bought the Soundcore Liberty Neo ear…",
          "Contenu": "I bought the Soundcore Liberty Neo ear buds for home working and running. Posted quickly, connected easily to my phone and computer. Comfortable, pretty good noise cancelling and haven’t fallen out when running yet (occasionally feel slightly loose but I just press them in again). Pleased with them, recommended."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rakesh",
          "Nb_Reviews": 4,
          "Date": "2020-12-06T15:47:18.000Z",
          "Titre": "Liberty Air 2 are a well made product.",
          "Contenu": "Liberty Air 2 are a well made product, with good connectivity, and feel premium.Sound quality is decent too, especially after selecting the preset EQ settings using the App.  Bass is acceptable, although I prefer a little more bass.  Only issue so far is the earphones have fall out of the ear a few times."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MR RAMANATHAN RAJENDRAN",
          "Nb_Reviews": 3,
          "Date": "2020-12-26T22:06:34.000Z",
          "Titre": "Dear Customer Service team,",
          "Contenu": "Dear Customer Service team,I need your support at the earliest possible . The left earpiece is having problem connecting with Bluetooth. Further I need to discuss another issue as well. Do you have a phone number I could call and speak with you please. Thank youregardsR Rajendran"
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "John McEnroe",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T07:40:18.000Z",
          "Titre": "Sometimes the audio can stutter or lag",
          "Contenu": "Sometimes the audio can stutter or lag, so connectivity isn't always perfect, but I only noticed this a few times and other than this, this earbud is really good. Especially for the price. Never falls out of my ears."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T08:16:04.000Z",
          "Titre": "Decent sound and charging.",
          "Contenu": "Decent sound and charging.In common with this type of bud, a little difficult to get used to insertion into ear to get proper bass effect.Would benefit with stronger documentation on choice of size of rubber inserts that are appropriate, and orientation of bud in ear."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adnan",
          "Nb_Reviews": 1,
          "Date": "2020-09-09T08:10:19.000Z",
          "Titre": "I like it !!",
          "Contenu": "I find it very useful for calls. Handy tool for people working from home or on the go. Battery life is good. I normally use only one piece for calls for better situational awareness and effectively doubling the call time if needed. Music enthusiasts won’t recommend this due to lack of bass but not bad for casual listening. Design is sleek. There are some extra rubber caps in the box to fit different size ears. QuickStart guide is simple and easy to use and provides instructions for commonly used features like skipping a song etc.Happy with quality and price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lois Zurawski",
          "Nb_Reviews": 4,
          "Date": "2020-11-04T16:17:42.000Z",
          "Titre": "Amazing quality headphones",
          "Contenu": "Amazing quality headphones, really good fast charging and battery last a long time. hundred percent good value for money only downside and the reason why I put four stars is that the  charging case is very flimsy it feels quite cheap and like it could easily break"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Zahra McHugh",
          "Nb_Reviews": 14,
          "Date": "2021-12-10T17:01:43.000Z",
          "Titre": "Overall I am very pleased with my…",
          "Contenu": "Overall I am very pleased with my purchase, however one of the ear wings was missing, Customer service have promised to send one as soon as they are available. Otherwise I would have given a 5 star rating.Mac"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Brendan Buckley",
          "Nb_Reviews": 13,
          "Date": "2020-09-09T09:39:44.000Z",
          "Titre": "The earbuds are really very good",
          "Contenu": "The earbuds are really very good. The sound quality is excellent and they are very simple to use. Unfortunately my first pair developed a fault but Soundcore were very quick to replace them without any fuss. I would buy from them again without any hesitation."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Waylon",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T10:25:42.000Z",
          "Titre": "Super product",
          "Contenu": "This is a great product that works perfectly, charges quickly, and the sound quality is top notch. The reason it has only 4 and not 5 stars is because I think the noise cancelling can be improved upon."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David R",
          "Nb_Reviews": 28,
          "Date": "2020-11-04T09:37:20.000Z",
          "Titre": "Liberty Air 2 - not noise cancelling",
          "Contenu": "Liberty Air 2.Sound is very good. Setting up with Bluetooth required several resets of my phone, the app is meh and operating the ‘touches’ is error prone and difficult. These headphones are NOT noise cancelling. Disappointing for Soundcore."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "KURTIS HEMBLING",
          "Nb_Reviews": 5,
          "Date": "2020-11-13T18:32:39.000Z",
          "Titre": "Call Quality?",
          "Contenu": "Premium Call Quality seems false but it might just be my mobile network/ my location in the city that's hampering the call quality. Otherwise, music playback is really nice, I'm a basshead and these deliver good bass, so long as you're not completely blocking your ears with them, I always need the left bud slightly loose in my left ear if I want the best bass response out of them.I haven't tried many different buds to compare these to so I don't have any insights to the quality of the mids and highs. Get them on a sale like I did (think they were £56 on the website) and you shouldn't be disappointed."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Gustavo Pereira",
          "Nb_Reviews": 5,
          "Date": "2020-09-18T10:44:45.000Z",
          "Titre": "Products are good but not PERFECT!",
          "Contenu": "Products are good but probably still in resarch. My first product Soundcore earbuds did not work perfectly and after sales of Anker Factory was not so welcome with me. Otherwise I bought a Headphone set and I am satisfied till the moment."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "JoArn",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T10:15:14.000Z",
          "Titre": "I paid for an empty package (Soundcore has since sent a new box with headphones)",
          "Contenu": "SEE EDITS BELOWI ordered Soundcore Liberty Air 2 Pro headphones directly from the Soundcore website. Today they arrived and the original packaging was empty! I tried to call Soundcore and the listed number didn't work. I then contacted them via email and they have not responded. They have my money and I have no headphones. I am furious and this is fraud.Edit 1: I didn't receive a used product. I received no product. I have reached out to support and they have not yet resolved the issue. Anker has my money and I have an empty box.EDIT 2: After emailing with customer support, Soundcore has sent a new package and this time it contained the headphones. The issue is resolved."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Philip Devlin",
          "Nb_Reviews": 3,
          "Date": "2020-11-25T09:38:20.000Z",
          "Titre": "First pair of wireless earphones and…",
          "Contenu": "First pair of wireless earphones and overall I'd heartily recommend. The sound quality is warm and woody. Bass is rich. Comfortable to wear. Forget I'm wearing them sometimes. still coming to terms how to use them."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Luke",
          "Nb_Reviews": 2,
          "Date": "2022-03-22T00:16:01.000Z",
          "Titre": "Life P3 are Good earbuds",
          "Contenu": "Life P3 are Good earbuds, but with too much bass ( for me ) i have changed the smartphone eq reducing 32 and 64 hz and the sound is very good now. Amazing app i love it."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Tudajfor",
          "Nb_Reviews": 4,
          "Date": "2020-09-15T09:37:27.000Z",
          "Titre": "Soundcoer Motion +",
          "Contenu": "According to ULAF from YT this is the best, under 100€, BT speaker, and I can only trust him. I'm very satisfied with it and I got it for 69€.For everything else about this BT speaker, go visit ULAF's channel on YT."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "dinesh kumar",
          "Nb_Reviews": 2,
          "Date": "2020-11-03T13:21:45.000Z",
          "Titre": "Worth for money",
          "Contenu": "I used in my 9 hours air travel.. NC is good for this money..sounds is clear.. I am giving 4 star because of courier provide.. delivery delied 9 days,  because of their system couldn't recognise the UK valid address.."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Deborah",
          "Nb_Reviews": 16,
          "Date": "2020-09-15T11:49:24.000Z",
          "Titre": "Great for the price",
          "Contenu": "Great for the priceNot as good as my wired Apple ones.  The customer service was excellent especially after major hassle with a different company (IFrogz).  Being older would love better instructions on setting up."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Angela Wilson",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T07:51:43.000Z",
          "Titre": "Anker Soundcore Life Q30 Headphones",
          "Contenu": "The Soundcore Life Q30 are a good pair of headphones for drowning out the noise on a busy commute. Their sound quality is rich and clear for the asking price that easily outshines a lot of budget competitors."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Fran",
          "Nb_Reviews": 3,
          "Date": "2021-12-24T14:45:15.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! Happy.ñ with my purchase. The only thing is transportation service was not the best, never knew where my product was and did not notify when arrived"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T10:09:50.000Z",
          "Titre": "Very good sound quality",
          "Contenu": "Very good sound quality, comfortable and slick. Although the noise cancelling only fully works if the volume is loud. All around very good and I can't expect the best quality NC for £80."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Matt Fulford",
          "Nb_Reviews": 5,
          "Date": "2022-07-13T09:26:14.000Z",
          "Titre": "Soundcore 3 speaker",
          "Contenu": "The speaker is pretty good (esp considering it was a touch over £40). Well made and solid. Delivery was fast too."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Larry",
          "Nb_Reviews": 10,
          "Date": "2020-10-13T08:04:39.000Z",
          "Titre": "Pleasantly surprised.",
          "Contenu": "Was concerned if I had made the right choice after buying the ear buds. Perfect fit, perfect sound and perfect balance from my android phone. Would recommend to anyone reading this."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T09:13:32.000Z",
          "Titre": "soundcore",
          "Contenu": "alles gut , super sound"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Taku-Ayuk Buma",
          "Nb_Reviews": 10,
          "Date": "2020-11-24T08:32:53.000Z",
          "Titre": "Designing",
          "Contenu": "The product is fits my ear and doesn't come off .This is something that I really like.I would prefer it to be a little bit smaller in size. But it's okay for the price too."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Hoare",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T13:19:18.000Z",
          "Titre": "Very pleased with my Soundcore speaker…",
          "Contenu": "Very pleased with my Soundcore speaker , easy to use , sounds good , flashing lights are cute but I’m not using them much . Excellent service , delivered in a couple of days ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "mr a newman",
          "Nb_Reviews": 15,
          "Date": "2020-09-15T14:35:12.000Z",
          "Titre": "This is a great not fantastic Bluetooth…",
          "Contenu": "This is a great not fantastic Bluetooth speaker.volume wise it has plenty and good Bass but to say it is hi def sound mmmmm not quite so only 4 stars.over all id recommend it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mehrdad Moradi",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T14:04:45.000Z",
          "Titre": "Good quality for its price"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Sury",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T10:06:34.000Z",
          "Titre": "Good for the price",
          "Contenu": "payment smooth, speakers delivered in good shape,sounds good and the battery charge is good... for the price."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "MICHAIL MITSOURIDIS",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T16:06:23.000Z",
          "Titre": "The battery and the delivered sound…",
          "Contenu": "The battery and the delivered sound quality are average in my opinion.Except for that, excellent connectivity, nice ear fit and very nice design!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Kiran Yogi",
          "Nb_Reviews": 2,
          "Date": "2020-11-05T18:42:54.000Z",
          "Titre": "Quick Delivery & Appealing Product",
          "Contenu": "In time delivery. Very well packed. Thumbsup to SoundCore for that. Too early to speak about the product. Overall SoundCore Liberty Air2 product seems to be appealing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "morgan",
          "Nb_Reviews": 2,
          "Date": "2020-10-27T12:04:02.000Z",
          "Titre": "What you should know",
          "Contenu": "I have had the headphones for about 2 weeks now. When reseving them, in the package was the headphones themselves, a charging cable, an AUX cable, instructions and a bag to carry the headphones in. The headphones themselves are really good. Great sound and directional awareness. Main problems I have is the metrical and joints in the headphones feels really cheap for £50. Another small problem with them is that when using the active noise canceling i sound that turning your head would throw it off and make sounds but to be fair that is the same for all N,Cs I have tried. Over all they are great. Iver been being them for everyday use as well as in recording situations and found both to work nice. If anything should change it would be to make more of the product out of metal, that way it would feel more premium and would definitely be worth more."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony Arney",
          "Nb_Reviews": 13,
          "Date": "2021-12-13T16:22:22.000Z",
          "Titre": "Soundcore q35",
          "Contenu": "Headphones are good but had to wait a while for delivery with not much correspondence. Would have been easier and quicker to order from Amazon."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John D Bavister",
          "Nb_Reviews": 11,
          "Date": "2020-09-15T16:24:03.000Z",
          "Titre": "Great sound for a great price",
          "Contenu": "Great sound for a great price. A little louder would have been the icing on the cake. Maybe too much to ask for the price, still very very pleased with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Blagovest Petkov",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T08:15:19.000Z",
          "Titre": "Good sound",
          "Contenu": "Good sound, nice build quality, microphone capture too much side noise that's why I gave 4 star."
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "Kert",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T14:16:18.000Z",
          "Titre": "Delivery was fast",
          "Contenu": "Delivery was fast. Sounds are well balanced and are controllable from app. Battery lasts very well and Active noise cancellation is good."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T08:17:40.000Z",
          "Titre": "Very nice headphones",
          "Contenu": "Very nice headphonesThey look good, enough battery time.Sound is not so bass strong as advertised but pretty much OK for the price. I would buy it gain...."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "TIM PALMER",
          "Nb_Reviews": 3,
          "Date": "2020-09-09T11:09:13.000Z",
          "Titre": "Great sound quality",
          "Contenu": "Great sound quality, great battery life but only issue for me is the fit. When running they feel like they will come out so keep needing to reposition.."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Dariusz  Bober",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T08:11:49.000Z",
          "Titre": "This is good product",
          "Contenu": "This is good product. Very good battery lives, good sound. Good quality materials.👍😊"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Martin Visser",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T09:37:19.000Z",
          "Titre": "Good sound on low volume",
          "Contenu": "Good sound, powerful bass in low volume. With more power the lower frequencies are no longer clear"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shaban Afzal",
          "Nb_Reviews": 15,
          "Date": "2023-12-18T06:32:52.000Z",
          "Titre": "Amazing clear sound",
          "Contenu": "I purchased the soundcore liberty pro 4 and not only is the design sleek and nice, the sound is so crystal clear and the bass is just perfect. They are loud, clear and beautifully designed. The case is well designed and built. The ANC is good and blocks out the unwanted noise in my work office. I like the App and different presets. A truly wonderful brand that keeps getting better and better. Absolutely thrilled with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Kiril Korenev",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T20:54:11.000Z",
          "Titre": "The best speakers and reasonable…",
          "Contenu": "The best speakers and reasonable prices. Good brend!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Daniel Kadeřávek",
          "Nb_Reviews": 3,
          "Date": "2022-12-13T10:19:04.000Z",
          "Titre": "I ordered from Czech Republic and…",
          "Contenu": "I ordered from Czech Republic and delivery time was 3 business days to my hands. Very satisfied. Communication of service line is quick. I was communicating with service line via WhatsApp, because I had some questions about how to turn off my headphones If I don't want to put them back to the case, because they are immediately recharged then. Their response was very kind and quick."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "trafficracer",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T10:48:54.000Z",
          "Titre": "Amazing deal of a lifetime!",
          "Contenu": "I've sent them a question about the new Q45 about the discount (how long it would be there) as I wasn't able to afford it at the time. They said they couldn't tell me but sent me an exclusive 10% discount for when I could afford this. Really generous guys they are! When I could afford this on black Friday I was still allowed to add the discount. This is certainly the deal of a lifetime and I thank them whole heartedly for it! The Q45 in question is an amazing product for the cost. Certainly worth taking a look at!"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Jozef Farkas",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T19:10:33.000Z",
          "Titre": "great earbuds for workour",
          "Contenu": "great sound,great battery life,one of few with good ip rating.and they stay like a rock in my ear due the good hooks..but probably not good for very big ears...iam very happy....already to plan to buy new liberty pro 4 since i bought these only for most workouts...need audiophile earbuds also ..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr James Gamble",
          "Nb_Reviews": 56,
          "Date": "2023-02-17T09:25:12.000Z",
          "Titre": "The mini 3 is good however my so called…",
          "Contenu": "The mini 3 is good however my so called LG Smart Tv is not so smart and you cannot sync the tv to the speakers.This results in the lips moving but the sound follows a few seconds later and makes tv viewing imposible. I have had to revert to a single Mini 2 unit which brings the souns nearer my chair to avoid looking for the remote control especially when a film with music blasts out and then is hard to hear when the actors etc are speaking.I no doubt will fins another use for my 2 Mini 3 speakers."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mo",
          "Nb_Reviews": 5,
          "Date": "2022-12-13T00:05:02.000Z",
          "Titre": "Liberty 3 pro do not sound great out…",
          "Contenu": "Liberty 3 pro do not sound great out the box, but then I have hearing loss due to my age. I fine tuned the EQ and wow! Incredible sound, especially on Tidal. They are comfortable to wear as well. My main negative feedback is the battery life, it is just not good enough."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Dear Mr Moore",
          "Nb_Reviews": 4,
          "Date": "2023-01-27T12:03:29.000Z",
          "Titre": "Simple and easy to follow link up.",
          "Contenu": "Simple and easy to follow link up instructions. Excellent sound, I can now follow my favourite radio programmes anywhere in my house.Clear sound. Only one slight downside : the marking of buttons which should be painted white against the black cover, as I have sometimes pressed the wrong button."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Natalie  Simmons",
          "Nb_Reviews": 19,
          "Date": "2023-01-25T11:23:21.000Z",
          "Titre": "I love these headphones",
          "Contenu": "I love these headphones. I find the audio quality for listening to music fantastic and also use them for studying for a qualification that I'm working towards - so the noise cancelling feature is perfect for when I'm trying to concentrate and need to block out what is going on around me.I also found these were a really comfortable fit - usually I find things that fit on my head too bulky, large or heavy. These feel comfortable for long periods."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Pierre",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T13:32:27.000Z",
          "Titre": "Good products, outstanding aftersales",
          "Contenu": "Very good products, that seem to have huge pros and little cons. We are not far with every new product to reach something superior to any model far more expensive. The sound is often great, the soft is amazing, even if it disconnects sometimes, microphone depends on the models, anc is pretty good.But where Soundcore outshines everything is with their aftersales service. I am very surprised at reading some of the reviews here. I've been quite picky with them, sending back the device several times because of little kinks or defects, and they have been nothing but exceptional. They replaced then upgraded my device, were always there, replying fast, even when I would take 3 weeks to do so. I can't recommend them enough."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Edwds Faye",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T21:42:13.000Z",
          "Titre": "If 10 stars existed as a score, they’d get it!!",
          "Contenu": "I wish I could give this product and company 10 stars!!My initial delivery had a slight issue (through no one’s fault) and when I contacted customer service, I not only received a replacement without difficulty but also a follow up email to check all was well. So thoughtful in the modern age!The headphones themselves are fantastic! I’ve tried Apple, Bose and various others and I will never turn back from Soundcore now.Fantastic company!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Aurelia",
          "Nb_Reviews": 6,
          "Date": "2022-12-13T13:46:20.000Z",
          "Titre": "Great sound",
          "Contenu": "I already was a Soundcore 1 user and had a great experience with that version but the Soundcore 3 is a serious step up. The bass makes the music sound richer and the app allows you to set up your own EQ profile if you want to. Definitely recommend this product!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M Grant",
          "Nb_Reviews": 12,
          "Date": "2022-12-22T10:33:44.000Z",
          "Titre": "Second pair",
          "Contenu": "Second pair, as original pair earpieces are showing splits, but still work perfectly after a year. Wear these everyday, all day to watch TV and game etc, so am really hard on them. These never disappoint me, unlike others in the same price bracket. Noise Cancelling at this price is amazing. Replacement earpieces would be a good idea in the future."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Maria Kapaniri",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T17:33:09.000Z",
          "Titre": "Excellent sound quality, unbelievable surrounding noise cancellation",
          "Contenu": "I highly recommend this purchase! The product comes in a special semi-hard case, its material & construction are quite above average and the quality of sound -combined with not expected noise cancellation- very impressive. Perfect price-quality ratio!"
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Sreejith  Sidharthan",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T17:32:29.000Z",
          "Titre": "Before i talk about the product",
          "Contenu": "Before i talk about the product , i really wanna appreciate the response of your customers service.I was struggled with the delivery in some point and the way they resolve the problem was much commendable.Then when it comes Q45 i would say that a class with mass stuff though.i fell in love with the headphone from the first sight and rest in head quite comfortably.enjoyed the way how she sounds in my ears and significantly the app and its customizations is simply awesome sound-core signature bass up is my fev till now.It was one of my happy purchases and highly recommended.Lokking forward for your upcoming products"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr James Gamble",
          "Nb_Reviews": 56,
          "Date": "2023-02-17T11:57:16.000Z",
          "Titre": "No problems with the 2 x Soundcore…",
          "Contenu": "No problems with the 2 x Soundcore Mini3 I purchased. sadly my LG Smart Tv is not so smart and does not have the ability to synchronise with the Soundcore Speakers. The lip movement on the tv is seconds in front of the sound from the speakers and makes watching TV impossible.I ahve switched back to a single Mini 2 which brings the sound to be nearer my chair and reduce the need to look for the remote when sound volumes ( especially music) blares out from the TV followed by speech that I cannot hear !"
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Mehdi Boubetra",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T13:58:05.000Z",
          "Titre": "Soundcore motion boom plus",
          "Contenu": "I already have the headphones Q30 and bought the speaker motion boom plus, it's just insane regarding sound quality, for me it's the best value speaker compared to all others, u can even compare it with JBL boom box 3 which is 3 time the price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dee",
          "Nb_Reviews": 9,
          "Date": "2022-12-09T16:36:00.000Z",
          "Titre": "Very good quality.Excellent Price.",
          "Contenu": "Very good quality headphones at a very reasonable price. I've got two sets of their headphone, over ear and in ear. Both have a great sound quality. I also love the soundcore app and find it easy to navigate. Wonderful. Keep it up Soundcore."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Boris Vögeler",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T08:06:02.000Z",
          "Titre": "The headphones really have a very good…",
          "Contenu": "The headphones really have a very good sound. The sound settings are very extensive. The real reason for purchase was the pulse measurement function. Here the app has a little catching up to do. The functions are only rudimentary and, for example, have no connection to Apple Health or other Sport apps."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Olufemi",
          "Nb_Reviews": 12,
          "Date": "2023-04-12T11:08:40.000Z",
          "Titre": "Excellent quality",
          "Contenu": "Excellent quality. I have a life P2, A30i and space 40 which I use for work and gym. Excellent sound, noise cancelling in A30i and Space 40 is really good. Stays in your ears even working out vigorously. I washed my p2 in my pockets and it is back to life after a few days of drying. I wouldn't pay for Apple or Samsung earbuds. Just my personal experience"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T19:20:10.000Z",
          "Titre": "Happy customer",
          "Contenu": "So, review after 4 months. I love this company. I made a mistake and ordered headphones in blue color, after fast (1 day respond time) exchange of emails it wasn't any problem to change the color of headphones and they sent me the ones I wanted (without any backlogs). Which is something I have never experienced before. So I am happy with the Soundcore support."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "koschwarz",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T09:40:21.000Z",
          "Titre": "Perfect for me",
          "Contenu": "I love this Sport X10. Sounds good, I dont think its too bassy as they say in reviews. It fits perfectly in my ears, the button is easy to find and push. Rotating the hook is a good idea, it allows a smaller charging case, but I needed some time to get used to it, especially to which direction I should rotate it but I think its worth it for the smaller case. I like the nosie reduction function, it doesnt eliminate every noise but I dont like to eliminate all external sounds anyway, however when its windy or there is some other outside noise, it does it job, I can hear what I listen to. The connection is very stable and has the maximum range that my phone allows, comparing the connection to that previously owned earbuds had, this is the best I have so far."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Vanja Kovacev",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T12:40:40.000Z",
          "Titre": "It was overall good experience",
          "Contenu": "It was overall good experience, from online purchase to unboxing and first listening. Package is well designed, product offers wide range of fitment options. Sound quality is really good for this price range, and ANC also. Would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Najmeh",
          "Nb_Reviews": 6,
          "Date": "2023-07-28T13:11:07.000Z",
          "Titre": "Great products",
          "Contenu": "Great products,  the best on the market for the price. They have amazing costumer service.  All their products is covered by manufacturer warranty.  Would definitely recommend them."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "TheRealPanda",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T12:24:08.000Z",
          "Titre": "Best budget friendly yet still high quality headphone",
          "Contenu": "I wanted a budget friendly headphone with noise cancelling, and after some research and YouTube reviews i came across Soundcore, to be honest i am very surprised about the quality of the headphones.- optic and feel: the optic is simple and chic, i like the button design too, and the cushion material feels so soft and easy on your ears.- battery life: amazing battery life, i haven’t charged it yet since i got it 2 weeks ago, and i always had ANC on.- sound quality: some ppl say the bass is too heavy but tbh i like it, and you can configure that in the app, which is awesome. Plus it gives you 3 different ANC modes.I am very happy with the purchase, if you are looking for a budget friendly but still very good noise-canceling headphone, def consider Soundcore."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DANIELE CIRAULO",
          "Nb_Reviews": 21,
          "Date": "2022-12-23T21:20:09.000Z",
          "Titre": "Hearing is believing!",
          "Contenu": "Motion Boom Plus is great product. The sound is unbelievable. Sound signature is very similar to the JBL boombox 3 as owed one recently. The difference being that this product costs half the price! Amazing customer service from the company."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Cormac Mohan",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T08:34:30.000Z",
          "Titre": "I have B&W Px7s and Sony wh1000xm4s and…",
          "Contenu": "I have B&W Px7s and Sony wh1000xm4s and bought the soundcores for work... I was surprised that the Space Q45s can hang with the other two without any problem at all for one 3rd of the price... well done guys keep it up"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Margherita Bertellini",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T11:25:38.000Z",
          "Titre": "Great customer service!",
          "Contenu": "After my trustworthy pair of earbuds gave up after a good few years of use, I purchased the Soundcore Life A1 a few months ago. Recently the left earbud started to malfunction so I contacted customer support via email, as they were still under warranty and I am pleased to say that I have received the best customer service in a long time. Not only they were quick to respond, they even CHASED me, to understand if the problem had been solved and to understand if the replacement was to my standard. I a still flabbergasted"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "T.F",
          "Nb_Reviews": 3,
          "Date": "2022-12-15T17:31:01.000Z",
          "Titre": "I purchased the Soundcore Liberty Pro 3…",
          "Contenu": "I purchased the Soundcore Liberty Pro 3 earbuds. The quality of the product is really good. I had some troubles with the shipping but the Customer Service was very supportive. Sound wise the earbuds are excellent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lucas Heaven lets-talk-tech-uk",
          "Nb_Reviews": 9,
          "Date": "2023-03-31T17:08:00.000Z",
          "Titre": "Ok as a Tech reviewer I've been a very…",
          "Contenu": "Ok as a Tech reviewer I've been a very proud owner of Ankers most excellent portable Bluetooth speaker which is the Soundcore Motion BoomThis speaker I've owned for over 2 years and I use on a daily basis, and the battery still gives me over 20hrs of playtime and it still sounds as good as the 1st day I got it.Before the Soundcore Motion Boom I owned the Anker Soundcore Boost (over 3 years old) and even this speaker is still very useable and I have no complaints... And moving along to Ankers Bluetooth headphones I own the Soundcore Life A2 NC,and again battery life and sound quality are still as good as I first bought them 2 years agoSo if you want to find out more regarding the above Anker Soundcore BT speakers & earbuds then watch my Tech channel @lets-talk-tech-uk as I've got some content of these (and possibly more) being aired very soon .. so don't forget to Subscribe so you don't miss out on the latest Technology and if it's good it's good and if it's bad then I'll let you know"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Ricardo Araújo",
          "Nb_Reviews": 3,
          "Date": "2023-02-23T11:47:41.000Z",
          "Titre": "I'm a big fan of soundcore products!",
          "Contenu": "I'm a big fan of soundcore products! I love the sound and the flexibility that the app gives us in terms of personalization. Very pleased with my Liberty 4's. The only thing I would like to be better is the transparency mode, that has a lot of white noise and is louder than the real noise around you. A bit like if you were wearing a earing aid device. If I put them on at the gym, with loud music around, it is a bit stressful to my ears... must turn of transparency before the gym! Other than that, nothing else to complaint about. Very nice and detailed sound, comfortable to wear, good battery life and for me a very good overall product and better than others, much more expensive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nick Finch",
          "Nb_Reviews": 19,
          "Date": "2022-12-12T02:38:05.000Z",
          "Titre": "Brilliant",
          "Contenu": "Brilliant, so impressed with how much bass these have but also how good they sound. I only went for these as I wanted heavy bass in ear buds and read reviews which led me to these and I’m so pleased I did."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Arian Pashazadeh",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T11:52:03.000Z",
          "Titre": "Brilliant Support and product",
          "Contenu": "After informing them about the problem with battery of my liberty 3 pro, they responded quickly and within 3-4 emails they informed me of replacement part being shipped and I received it within 2 day. Support was quick and very helpful without giving me any headaches. Buds themselves are great for their price and as someone who uses AirPods pro and liberty on daily base for over a year, I will pick soundcore any time of the day. Better noise cancelling, way better microphone and call quality, surprisingly better connection stability with apple watch than AirPods, better ear placement and tighter grip for using during workouts."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Holding",
          "Nb_Reviews": 15,
          "Date": "2023-02-06T15:52:05.000Z",
          "Titre": "…5 star to sound and value for money",
          "Contenu": "Ready connection to bluetooth to all my devices sound quality overall very please.Very good balance to quality and value for money.Would like the control buttons more conspicous to the eye.ie in colour to black background and more bolder in size."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Tomislav Bilandžić",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T23:52:28.000Z",
          "Titre": "Delivered on time and great quality",
          "Contenu": "I ordered around holidays holidays and while it took a longer time to ship them they still arrived on time (even day before scheduled time).I always liked other Anker products and the headphones I ordered are no different. Great value for price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 13,
          "Date": "2023-01-17T21:03:36.000Z",
          "Titre": "Anker Soundcore Customer Service - BRILLIANT!",
          "Contenu": "I’ve got several Soundcore and Anker products because I have read good reviews about them and have to say I have not been disappointed with their quality and performance.Until now I have enjoyed the products and recently replaced other company’s broken earbuds with A40 earbuds,  Travelling to work and using another earbud was good but difficult to make out dialogue but the A40 earbuds noise cancelling feature was so successful and being able to tune them to my own hearing was great. I would really recommend them.Where Anker really shone was when a fault developed in the left earbud. I contacted Anker customer service, checked a few things and had a replacement pair within 4 days. I was expecting them in 10-14 days. Under promising and over delivering, that what I call great customer service. Praise when praise is due.Thanks for your great service and great products.Michael Mckee"
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "Ivan Debeljak",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T11:02:34.000Z",
          "Titre": "I have your earbuds, headphones and speakers",
          "Contenu": "I have your earbuds, headphone and a speaker - excellent sound, long lasting battery and great sound cancelation. And I bought your speakers for two of my friends and they are very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T03:15:43.000Z",
          "Titre": "You can get to know a company better…",
          "Contenu": "You can get to know a company better when things go sideways... I've received my headphones very quickly and I was happy for a few days, but found two things that made me want to return them. There was no return address on the website, just the option of opening a ticket, this took me back at first. I did just that and I was within a day contacted by the support person, given all the details I needed regarding the return address closest to the place I live. I was under the impression that I'll get my money back when the package gets delivered to Anker, but they were kind enough to trust and provided a return before the package reached their return warehouse. For my recent Amazon return I got a refund after 2 weeks... I've recently been through 5 headphones, build quality wise Anker's were truly the best. If it wasn't for the way the ANC worked on a train ride I would gladly keep them over the Bose I ended up with keeping."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T13:36:33.000Z",
          "Titre": "most value for the money company I've…",
          "Contenu": "most value for the money company I've seen in my life, you guys are amazing, you're changing the industry of overpriced tech, hope you're recognized by everyone."
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Jonas Jovaišas",
          "Nb_Reviews": 4,
          "Date": "2023-01-24T20:25:57.000Z",
          "Titre": "Quality products, smooth purchase process",
          "Contenu": "Purchase process was really smooth, wide payment options and fast shipment to Lithuania from Poland. Products from Soundcore are great as always, it's not my first!"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Monori Attila",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T08:51:05.000Z",
          "Titre": "I'm bought my Q30 about a 3 weeks ago…",
          "Contenu": "I'm bought my Q30 about a 3 weeks ago from soundcore.eu, in black week sale. It was written on the page, delivery will be 3-7 business day. And really, on the 6th day, the new headphone!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jonathan Le Vine",
          "Nb_Reviews": 31,
          "Date": "2023-01-05T17:36:39.000Z",
          "Titre": "Delivery of first pair went missing…",
          "Contenu": "Delivery of first pair went missing over Christmas. The SoundCore Team were quick to get another pair of Life Q30 earphones out to me. Outstanding clarity, range and comfort! Best bluetooth earphones I have owned. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CHRISTINA BELL",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T01:52:06.000Z",
          "Titre": "Speakers delivered as ordered.",
          "Contenu": "Speakers delivered as ordered.Excellent sound produced from them - very pleased with these. I bought 2 to use in stereo - paired with my iPhone without difficulty and the connection sound is not overly loud."
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "George",
          "Nb_Reviews": 23,
          "Date": "2023-07-28T10:22:25.000Z",
          "Titre": "Great customer support",
          "Contenu": "The headphones are best value for money, and even though I had some issues their customer support helped me resolve it fast."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Olivier Lenfant",
          "Nb_Reviews": 4,
          "Date": "2022-12-27T13:24:32.000Z",
          "Titre": "Quality and service at its best",
          "Contenu": "Headphones arrived in good time. The headphones look and sound premium for a fraction of the cost of major brands. Can't believe what they have produced. I work as a sound engineer so was pleasantly surprised."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Abel Claudiu",
          "Nb_Reviews": 6,
          "Date": "2023-01-24T02:29:54.000Z",
          "Titre": "I guess worth the money",
          "Contenu": "The headphones are nice , comfortable, the sound is clear and great , great lows , I can't complain about it ! I have one issue thought , I bought a second pair of liberty 2 pro that weren't working properly, now I bought the pro 3 , those are better! I"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T14:10:00.000Z",
          "Titre": "Great quality + Awesome App",
          "Contenu": "Great quality, material wise as well as the sound (Soundcore Life Q30). I really like how many options you get with the Soundcore-App, really unique!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Horia",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T10:27:25.000Z",
          "Titre": "The products are great",
          "Contenu": "The products are great. I got a pair of life q30 headphones and a boom+ both of which perform amazingly well for the price.I ve had issues with the delivery but i dont think it s their fault so i wont give out a worse review because of them"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Robinson",
          "Nb_Reviews": 5,
          "Date": "2023-02-16T13:59:45.000Z",
          "Titre": "The ordering of Q30 ANC headphones",
          "Contenu": "The ordering, tracking & delivery of the headphones was very straightforward. The quality of the headphones & case is very good. I have yet to properly try the noise cancellation but the app pairing & options is really impressive!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Donnelly",
          "Nb_Reviews": 8,
          "Date": "2023-01-18T11:55:12.000Z",
          "Titre": "Superb quality earphones!",
          "Contenu": "Fantastic product! Great sound quality, excellent battery life and the docking case is great and secure! Delighted with my purchase and the great quality of this product, thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 19,
          "Date": "2023-02-27T06:22:41.000Z",
          "Titre": "Quality products",
          "Contenu": "I purchased a pair of bluetooth headphones and I love them. They were only $45 and they sound just as good as a high end brand of wired headphones that were $200.They paired quickly and maintain a solid connection. They support pairing to two devices so I have them paired to my computer and TV.I read a review that stated the start up sound hurt their ears. Yes, it is loud. Just don't put them on until they connect! Duh.I would definitely recommend this brand."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "A. Berg",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T10:56:41.000Z",
          "Titre": "Am very satisfied with the product",
          "Contenu": "Am very satisfied with the product. I use it often for meetings, I can be good heard acoustically. Listening to music is great too. The battery lasts a long time, great headphones."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "anonieme gamer",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T20:10:54.000Z",
          "Titre": "Quick response and very easy",
          "Contenu": "My earbuds were broken and they replaced them, took less than 1 day to sort everything and a few more for a new pair to arrive. Very nice and polite . 10/10 would buy from again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pam Waggott",
          "Nb_Reviews": 4,
          "Date": "2023-03-01T18:27:52.000Z",
          "Titre": "Q30 ANC Headphones - a winner",
          "Contenu": "Great headphones at a very reasonableprice. Easy Bluetooth set up and Noise Cancelling does exactly that.  Good sound and delighted with the storage case too!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Edmond Simionescu",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T09:38:48.000Z",
          "Titre": "Amazing sound quality and volume",
          "Contenu": "I bought a Motion Boom Plus speaker recently and I must admit I never had a speaker that was so loud or that had such a strong bass."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Stefan Matei",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T10:02:06.000Z",
          "Titre": "I have a Flare2 and the Motion Boom…",
          "Contenu": "I have a Flare2 and the Motion Boom Plus. Very happy with the sound quality and the equalizer makes quite a differece! Customizing sound to personal preference is a must. Now I want the Rave Plus 😅"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andy Gilliland",
          "Nb_Reviews": 4,
          "Date": "2023-02-17T06:38:02.000Z",
          "Titre": "Amazing customer service and super…",
          "Contenu": "Amazing customer service and super sound to match! These guys know what they are doing so don’t even think twice and make the purchase."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "hrvoje zecevic",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T15:36:18.000Z",
          "Titre": "Great product",
          "Contenu": "Fast delivery, good customer service, Great product for Great price. Much less battery usage when connected via 3.5 mm."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T10:13:37.000Z",
          "Titre": "Great headphones",
          "Contenu": "Great headphones, the small ones as well as the big ones. And the possibilties to personalize the EQ settings via App... Outstanding. I love my Soundcores!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlie Ward",
          "Nb_Reviews": 5,
          "Date": "2023-03-01T16:13:15.000Z",
          "Titre": "Sound worth listening too",
          "Contenu": "The sound is second to none there crisp & clear with bass like a wrecking Ball,vocals are amazing iv tryed all types of music & they bring something special too them all, there easy to use very innovative with versatile controls"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Eugene",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T03:04:59.000Z",
          "Titre": "Quality of the products is extraordinary especially for this price",
          "Contenu": "I have headphones liberty 3 pro and q45 space. Quality of the products is extraordinary especially for this price. I like them very much. Thanks to Soundcore company and team you doing ex"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Antony BENAMOU",
          "Nb_Reviews": 3,
          "Date": "2022-12-20T13:09:09.000Z",
          "Titre": "Best ones.",
          "Contenu": "I searched a lot and they are the best sleeping wireless headphone on the market, in term of design they are a little bit less conforatable than the BOSE ones but as you can't listen to music or video with the BOSE ones, it's a blocker."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "IMLND",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T04:47:22.000Z",
          "Titre": "Purchased some A3i headphones from soundcore.",
          "Contenu": "Ordered a pair of A3i headphones from soundcore. Got them on sale at a good price. It's my first time buying anything from soundcore but very happy with my purchase.Good fit and very impressed with the sound quality."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Julie Mc",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T13:58:06.000Z",
          "Titre": "Excellent Company",
          "Contenu": "Excellent Company, speedy replies with good customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nathalie Hales",
          "Nb_Reviews": 4,
          "Date": "2023-02-27T09:16:14.000Z",
          "Titre": "Great noise cancelling - fab value for money",
          "Contenu": "The headphones are really comfortable on the ear and are the best noise cancelling headphones my daughter has tried.  She is thrilled with them"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Nikica Grgić",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T14:36:09.000Z",
          "Titre": "Life P3",
          "Contenu": "I ordered Life P3 from Czech Republic. Delivery time was 3 business days. Delivered by UPS. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Barrett",
          "Nb_Reviews": 9,
          "Date": "2023-02-06T09:20:09.000Z",
          "Titre": "Quality product at a good price",
          "Contenu": "Quality product at a good price. Great that parts are available, delivery is quick and communication good as well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nick Hart",
          "Nb_Reviews": 15,
          "Date": "2023-03-29T10:30:01.000Z",
          "Titre": "These are excellent",
          "Contenu": "These are excellent. Well made and hold the charge for ages with great sound and noise cancelling- and all for a fraction of the price of the famous brands."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dustain  Jones",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T10:41:06.000Z",
          "Titre": "I have purchased a lot of soundcore…",
          "Contenu": "I have purchased a lot of soundcore products they arrive quick and the quality for the money they cost is unbeatable if you are looking for speakers or headphones buy SOUNDCORE"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Ingram",
          "Nb_Reviews": 25,
          "Date": "2023-02-28T21:06:37.000Z",
          "Titre": "Had an issue regarding the ear tips I…",
          "Contenu": "Had an issue regarding the ear tips I had bought for my Liberty 4 set.  Very good customer service overall!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T07:22:47.000Z",
          "Titre": "The Soundcore Q30 headphones are my…",
          "Contenu": "The Soundcore Q30 headphones are my second product from Anker. The first being Anker Select 3. Quality vs Price - brilliant."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Tim Kurowski",
          "Nb_Reviews": 4,
          "Date": "2022-12-17T20:46:02.000Z",
          "Titre": "Recommendation for the whole family.",
          "Contenu": "Soundcore by anker is a really nice product. Sound and Bass are great and rhe costs are absoluly astonished. Top quality for really fair price."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Meneer jeffrey",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T06:40:25.000Z",
          "Titre": "Good service good products!!",
          "Contenu": "Good service after return the products.Answers questions really quick!Let them no for the refund when its return and money back.Good service!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chester John Fauni",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T20:48:23.000Z",
          "Titre": "Good Sound",
          "Contenu": "Very helpful people and high quality audio for a much cheaper price compare to bigger brands"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "ThM",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T11:59:05.000Z",
          "Titre": "Excellent Inear",
          "Contenu": "Soundcore wonderful. Have now 3 Inears in the family and they are all very good. Also the App is excellent."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "CustomerMark Lycett",
          "Nb_Reviews": 6,
          "Date": "2023-02-17T23:59:05.000Z",
          "Titre": "Great sound",
          "Contenu": "Great sound, brilliant bass for such a small speaker, easy to use,  definitely a good buy"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Valentinas  Bosijakas",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T18:23:19.000Z",
          "Titre": "good quality sound for sports and…",
          "Contenu": "good quality sound for sports and exerciseperfect fitgood assembly qualitygood and useful app"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Luisa",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T22:53:15.000Z",
          "Titre": "It was delivered fastly and the quality…",
          "Contenu": "It was delivered fastly and the quality is good for. It is not expensive. I had another pair for five years and was always happy with them."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Normanoris",
          "Nb_Reviews": 24,
          "Date": "2023-01-18T23:50:40.000Z",
          "Titre": "Got 3 soundcore devices",
          "Contenu": "I found this brand by chance while watching reviews for new earbuds. My first device I bought was the Liberty Air 2 Pro. From there I bought a Life G35 and a Motion+. All 3 costs around 100€ but are totally worth it. Soundcore makes products that is true to the value of money."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Vladimir Lengyel",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T09:26:46.000Z",
          "Titre": "Brilliant headphones",
          "Contenu": "Great sound, lightweight , outstanding ANC , long-lasting battery. In one word - Great !"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Ján",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T08:31:08.000Z",
          "Titre": "I recently reached out to Soundcore's…",
          "Contenu": "I recently reached out to Soundcore's support team regarding an order of headphones, and I was incredibly impressed with their customer service. Not only were they quick to respond to my request for help, but they were also courteous and professional throughout the entire interaction. After reviewing my order, they determined that I was entitled to an additional refund, which they promptly processed and kept me updated throughout the process. The entire experience was seamless and hassle-free, and I highly recommend their products and support team to anyone in need of high-quality audio equipment and exceptional customer service."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Marco",
          "Nb_Reviews": 4,
          "Date": "2023-03-09T14:21:04.000Z",
          "Titre": "Ottimo rapporto qualità prezzo",
          "Contenu": "Great over ear headphones. Great sound, good materials and very good application. Very satisfied with the purchase."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T10:53:09.000Z",
          "Titre": "Great experience",
          "Contenu": "I've had mine for about a month now and it's been good so far. It's got great sound quality and a long-lasting battery."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Andrzej Rylski",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T12:45:40.000Z",
          "Titre": "Exceptional sound",
          "Contenu": "Exceptional sound, great wireless connection and charging. Very nice noise cancellation. Calling is draining battery much more than music listening however."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Dragos",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T11:14:38.000Z",
          "Titre": "Soundcore Motion Boom+",
          "Contenu": "Soundcore Motion Boom+, such a good sound in a light package with a great price, it might lack a little bit of deep basse but it absolutely fits my needs with a little bit of tweaking (I wasn't satisfied with the signature setting so I gave it a try playing with the equalizer and it sounds impressive, especially as a pair), the app is ok and intuitive (I would like to see the percentage of the battery remaining and a more sensitive volume setting). Great buying experience and a highly recommend portable speaker."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Yordan Petrov",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T09:53:39.000Z",
          "Titre": "I am very pleased with the purchase of…",
          "Contenu": "I am very pleased with the purchase of Soundcore Motion+ speaker, the sound is great."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Ilea David",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T11:35:08.000Z",
          "Titre": "Very innovative company",
          "Contenu": "Very innovative company. I really enjoy that they use premium materials and components for the best prices on the market."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Chikin K.",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T15:21:28.000Z",
          "Titre": "I am very satisfied with the sound…",
          "Contenu": "I am very satisfied with the sound quality and overall performance. Nicely manufactured head phones."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Mark Lesyk",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T11:51:06.000Z",
          "Titre": "Your devices are super-cool",
          "Contenu": "Your devices are super-cool. This is my 3-rd speaker, and it is immortal)"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T08:57:09.000Z",
          "Titre": "Very good quality",
          "Contenu": "I have been using them for a couple of weeks and the sound is pretty good and it feets my ear perfectly"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Henry",
          "Nb_Reviews": 8,
          "Date": "2022-12-10T00:04:09.000Z",
          "Titre": "Excellent company",
          "Contenu": "Excellent company, understanding staff great customer service values - highly recommend their products also"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Daniela",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T15:37:09.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, product arrived within estimated time when purchasing, everything went really smooth and no need to contact customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 5,
          "Date": "2022-12-17T09:32:00.000Z",
          "Titre": "Brilliant Service",
          "Contenu": "Quick, easy to use, and efficient service.Arrived before the expected date.Definitely would use again."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Piotr Felke",
          "Nb_Reviews": 16,
          "Date": "2023-02-27T19:52:22.000Z",
          "Titre": "Nice experience and good quality of Space Q45",
          "Contenu": "I`m happy from the my purchase from soundcore, easy web shopping , shipping on time. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kylie Sykes",
          "Nb_Reviews": 5,
          "Date": "2023-01-25T08:31:15.000Z",
          "Titre": "Well made and of good quality",
          "Contenu": "Well made and of good quality. No issues with setting it up. Duel linking to phone and chrome book was easy :)"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Barbara Kramser",
          "Nb_Reviews": 12,
          "Date": "2023-01-21T11:08:23.000Z",
          "Titre": "Sound is great",
          "Contenu": "Sound is great, fits very good, becauce of 5 types, delivery fast"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T09:09:17.000Z",
          "Titre": "Best Customer Support and very good…",
          "Contenu": "Best Customer Support and very good products. I have a lot from soundcore."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Fodor Tibor",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T21:17:26.000Z",
          "Titre": "On the road to perfection",
          "Contenu": "I am perfectly satisfied with the product. Great bass and nice clear sound.And the battery life is also long"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "AltiQ",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T08:34:54.000Z",
          "Titre": "Great!",
          "Contenu": "Delivery time was quick and the support team was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Christoph U.",
          "Nb_Reviews": 7,
          "Date": "2023-02-06T22:18:33.000Z",
          "Titre": "Fast delivery and solid headphones",
          "Contenu": "Fast delivery and solid headphones. It's my second purchase."
        }
      ]
    }
  ]
}