{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.progecad.us",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T22:52:11.000Z",
          "Titre": "Progecad 2024 manual",
          "Contenu": "I ordered Progecad 2024and have your notification that it was sent. Now, just how in the hell do I need to do to get the manual into this computer  for printout???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T. Mike Healy, PE",
          "Nb_Reviews": 1,
          "Date": "2016-11-03T23:09:03.000Z",
          "Titre": "Product failed to install",
          "Contenu": "On install the installation failed attempting to write to the registry. An email from tech support suggested I reinstall with the virus checker disabled.That didn't help. The program is left in a semi-working state.Totally useless."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ron",
          "Nb_Reviews": 1,
          "Date": "2016-12-14T03:19:19.000Z",
          "Titre": "Does't work",
          "Contenu": "Can't Get it to work with any 3d drawings sent from client.Send ti report, they answered quickly but the fix may or may nothappen in 2017 and if I have to pay again to get a program thatworks I can assure you that will not happen.Hoping to get a free fix soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent Messina",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T01:29:17.000Z",
          "Titre": "THE OLD ONE I HAD WORKED BETTER",
          "Contenu": "A LOT OF PROBLEMS WITH THIS NEW ONE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald  Hunt",
          "Nb_Reviews": 3,
          "Date": "2023-04-24T18:14:20.000Z",
          "Titre": "I don't believe that I ever ordered…",
          "Contenu": "I don't believe that I ever ordered ProgeCAD."
        },
        {
          "Note": 2,
          "Lieu": "CY",
          "Pseudo": "Rubem Jablonka",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T19:08:04.000Z",
          "Titre": "ProgeCad is a SCUM Take easy don't lose 499US$",
          "Contenu": "ShalomI did have the 1 month trial and looks ok BUT after purchase I discovered that I received something else, not the same product.One important function of import PDF is a very bad function and isn't like in you tube tutorials.Try to communicate and NADAI think that they have a good scum and this is the reason of low price.So take distant the product isn't what you expect and the service and support ZERO"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg Sweeting",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T00:19:08.000Z",
          "Titre": "Sh***y customer support",
          "Contenu": "When I purchased the program, the salesman told me I would getting customer support and even gave me the number to call. When the program crashed (many times), I reached out to them and the answering machine said, please leave a message & someone would be getting back to me and I did.....nothing. When the program crashes it also sends a message to the customer support team and there I also left messages for a call back......and nothing.So please, be very careful with this program and the company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2016-11-14T22:20:35.000Z",
          "Titre": "Issues",
          "Contenu": "1- The program loads much slower then the 2010 version2 - The editing of lines and objects does not always work without regenerating and saving in order to view the changes3 - Tried saving as older format (2000) dxf for Surer base map but will not open nor will the older 2010 Proge Cad open it.  Wasted a great deal of time trying to get some basic features to work.Im running Win-10 OS with graphics card.  Older 2010 ProgeCad worked much better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C. E. Crowley",
          "Nb_Reviews": 2,
          "Date": "2015-12-17T18:07:54.414Z",
          "Titre": "progeCAD support on their TimeSchedule",
          "Contenu": "Have yet to get this Program to run properly in Windows 10. Shuts down on Start-up, throwing an unrecognizeable error message. The best support has come up with is to remove and re-install, and contact them during Italian hours only.\r What I see is that it keeps installing a 32-bit version on my 64-bit machine."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Logan Starkey",
          "Nb_Reviews": 1,
          "Date": "2017-02-24T09:23:17.000Z",
          "Titre": "You pay for what you get",
          "Contenu": "I am a consulting engineer and use Progecad every day, all day. What it does do:- replicates 90% or autocad functions- has potential to achieve equivalent outputs as autocadThere is a significant BUT:- extremely unstable for non-basic tasks- poorly optimised for even computer hardware assembled with CAD in mind- significantly crash and bug heavyFor a domestic user this isn't particularly relevant; however as someone who lives and breaths design work, every hour lost counts, every repeat of a task is tedium, and lag is hell. I work in a team of 15 engineers and this program is known as 'progecrash', and that is absolutely no hyperbole. I have spoken, emailed, and discussed with the programers of progecad all this, and yet, their focus is on adding functions and gimmicks (to keep up with autodesk), not stability. You want good and reliable? you buy autocad. You want cheap? you get cheap, and it feels cheap, and you get treated cheap. This is the 'Made in Indonesia' of the CAD world; the 'Xu1' drill at bunnings is 30 bucks, and thats for a reason; view this the same."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2016-05-07T19:16:29.000Z",
          "Titre": "Just got the program",
          "Contenu": "I just got the program iCad...it looks fine.I am trying to get someone in tech support and am not getting a response other than automated with no answers. I am not happy that I can not work and get info when and how I need it. I do not work 8 to 5....I am self employed and need to be able to get info when needed, not at iCad's convenience. \rThis is my first"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Roy",
          "Nb_Reviews": 1,
          "Date": "2016-10-16T01:14:42.000Z",
          "Titre": "Disapointed",
          "Contenu": "When I found out the ProgeCAD would not be undateing my New copy of ProgeCAD 2017 to the latest up of IntelliCAD 8.2 I was not happy. I now want to return it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anthony",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T08:05:24.000Z",
          "Titre": "I haven't gotten deep in to the…",
          "Contenu": "I haven't gotten deep in to the software to give a true experience as of today. But will be using it a little bit every day. Will get a better explanation later."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jordan",
          "Nb_Reviews": 6,
          "Date": "2018-04-28T22:09:16.000Z",
          "Titre": "Exactly as the reviewer said",
          "Contenu": "Exactly as the reviewer said, this software has bugs.  Hatching is tricky, plotting is tricky (the Mview windows 'move' when the plot command is sent).  Nothing they will do to fix these issues, the moving drawing after the plot command is there from the 2009 version.  They will not fix the issues. What's more, I put comments about this on their Youtube videos, they erased all my comments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Martin",
          "Nb_Reviews": 3,
          "Date": "2016-11-30T02:26:57.000Z",
          "Titre": "Good value, but with frustration.",
          "Contenu": "I have been a ProgeCAD Pro user since 2013.  The software is a good value, but you have to be willing to deal with some frustration.  Usually it is little problems that take a long time to get worked out.  Unless installing on a fresh Windows install, you often deal with things not installing correctly, most often you get a \"Error creating registry key: Code 5\" for some components.  For example, the PDF printer installation is notoriously frustrating in this way.Once you get past the pain of the installation, the basic operation is remarkably stable and rivals AutoCAD which costs 10x more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2016-02-17T12:16:29.535Z",
          "Titre": "Not Bad But Not A-CAD",
          "Contenu": "Been using progeCAD for a few weeks now. Been using A-CAD since 1991! The smoothness of A-CAD operation is clearly noticeable when going from progeCAD at home to A-CAD at work.\r App starts fast and seems to have all you would want. After using for several minutes the GUI seems to wane a bit and the mouse response begins lagging the user input. At times it's hard to pick an entity due to the lag. Also, when selecting inside reference for hatch and the complete inside area is not visible on the screen, it hangs the command and you end up killing it through the Task Manager. I've had to set the auto save incremental time to 1 minute due to the many crashed during hatch commands to reduce the work loss.\r Again, it's not bad for 500 bucks but it's not A-CAD either."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2016-11-20T22:38:31.000Z",
          "Titre": "Undecided",
          "Contenu": "I worked with AutocAD for many years and after retiring, I really missed it. I considered a annual subscription but I prefer a perpetual licence for the few projects I might do. Enter progeCAD. While it is very similar to AutoCAD, I don't have all the shortcuts I had at work. My experience creating a new file went well. My first experience editing a small existing file created in AutoCAD resulted in a number of crashes and freezes mid command.  It reminded me of using AutoCAD with Window 95!  Price wise ProgeCAD is worth the frustration. Even AutoCAD LT is twice the price and you don't get as much. I am sure that I will adjust in time and get the bugs ironed out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don O.",
          "Nb_Reviews": 1,
          "Date": "2016-04-26T16:01:45.000Z",
          "Titre": "Had difficulty with payment",
          "Contenu": "Desired to pay for the product but it was installed on my son's laptop. Was Frustrated in making that happen. Took multiple attempts in getting the process to recognize what was going on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hal L. Stamm",
          "Nb_Reviews": 1,
          "Date": "2016-01-14T00:04:21.104Z",
          "Titre": "necessary upgrade",
          "Contenu": "had 2014 version and had to upgrade to 2016 version because 2014 was not compatible with Mac El Capitan.  Seems like there would have been a better way to handle it then hit my pocket."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Baule",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T22:52:45.000Z",
          "Titre": "Always received prompt response on any…",
          "Contenu": "Always received prompt response on any issues I had.Very pleased with progeCAD.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T01:55:12.000Z",
          "Titre": "Very compatible with old drawings I've…",
          "Contenu": "Very compatible with old drawings I've had. Even fixes some problems draftsite was having with images and frequent crashing. This software is quite stable for me. It does have a few quirks such as the snap from function not working properly and selections where objects overlap can be a bit wonky, may just be a matter of getting used to it. Can't beat the lifetime license though, biggest selling point for me, wish more companies still had this model. Would definitely purchase again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2016-09-21T18:27:46.000Z",
          "Titre": "cost effective acad alternative",
          "Contenu": "Works well and good price, with identical ACAD command structure. I'm running Win 10 64bit intel i5-2300 cpu 2.8Ghz 6G ram, and seems to have a few memory bugs requiring program refresh from time to time (workspace starts to experience quirks after 1 hr or so heavy use - w/multiple dwgs open). Overall, fine for what I use it for (occasional 2d construction drawings)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T22:43:51.000Z",
          "Titre": "A great value",
          "Contenu": "A great value. The drawing system lets you start just like the most expensive system but with more.  The ability to incorporate images and PDF's is important in today's society.However,  a email gave a link to a instruction manual that end in error 403 page not found."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GK",
          "Nb_Reviews": 1,
          "Date": "2016-02-29T18:13:55.541Z",
          "Titre": "iCADMac",
          "Contenu": "Basic functionality is the same as much higher cost systems with added features not included in higher cost programs. From library's to import of PDFs and export of 3D PDFs. The library of 3D blocks could be more extensive and more like ProgeCad. Walls and 3D are not as extensive as ProgrCad. Great to work natively in OS X though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KenScustomer",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T14:05:09.000Z",
          "Titre": "Updated",
          "Contenu": "Like: After several weeks of testing/using it, I find it reliable and functional. All in all, it’s pretty nice software at a very attractive price."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Murray S",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:15:34.000Z",
          "Titre": "Very much Autocad  freindly",
          "Contenu": "The UI is very similar to AutoCadd makeshift the transition fairly seamless. Some functions are awkward in how they perform reducing speed in drafting. But overall 4 of 5 for sure"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Neil",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T17:28:29.000Z",
          "Titre": "Could really use a good manual",
          "Contenu": "Let me first make it very clear that I am not slating progecad. In all of the advertising it states that the transition from autocad to progecad is quick and easy. I have been using autocad r14 from 1999 and it has obviously had 23 years worth of updates and improvements which i knew when i bought my progecad 2024. The big difference is if i got stuck with autocad, i had a 1600 page manual from which i could almost always work out how to do whatever i wanted to do. My problem with progecad is there doesnt appear to be a manual, or at least not an up to date one. I could only find two manuals both approximately 200 pages but one is from 2011 and one from 2015 and neither are very comprehensive. If I am wrong and there is a manual I apologise. This would have been a 5 star review but for the lack of a decent manual. Also I can't find any tuition for the program apart from videos on YouTube. I am very much a classroom person but cannot find any hands on courses for progecad. Once again if I am wrong about this I apologise and would greatly appreciate being pointed in the right direction.Neil Walker"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hydrad",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T21:35:12.000Z",
          "Titre": "The purchase went well",
          "Contenu": "The purchase went well, but I was unable to purchase any of their other products because they said their download system was not compatible with Google Chrome.  Go figure!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2016-12-16T20:04:18.000Z",
          "Titre": "good value",
          "Contenu": "Progecad is a good value but it does glitch - especially as files get bigger.  I mostly work on the residential scale so I usually like to keep all my drawings in one work space but towards the end of a project Progecad cannot handle the file size - so I have to break it into separate files (also seems to have something to do with the autosave...)  I run the program on a very good machine (16 gb memory, nvidia driver).  I am hoping the new 64bit version handles the memory better.  I did buy an upgrade as the overall program works well and I like that I can buy the whole program versus the perpetual license subscription that autocad requires.  Hopefully they can get the kinks worked out as it would be nice for autocad to get a decent competitor in price and quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lourenco Diegues Filho",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T22:29:48.000Z",
          "Titre": "There are some issues with the move…",
          "Contenu": "There are some issues with the move command. It doesnt complete in some situations and you have to restart the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T00:07:14.000Z",
          "Titre": "Very responsive service and technical…",
          "Contenu": "Very responsive service and technical help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2015-11-26T13:56:15.052Z",
          "Titre": "Pretty close to AutoCAD, lot less $$$",
          "Contenu": "I still mostly use it when I work at home, so haven't gotten totally used to some of the minor differences, but they are minor.  Works well with all my files going back and forth between AutoCAD and ProgeCAD."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian Leitner",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T02:22:29.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good!  Minor differences that I can live with.  No dynamic blocks but one big thing is sheet sets don't seem to have fields to add to the title blocks.  Still screwing around to see if I can make it work.  An option to archive the sheetset would be nice as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2016-05-13T00:55:56.000Z",
          "Titre": "ProgeCAD V. 17",
          "Contenu": "ProgeCAD has come a long ways since I bought my first version. The latest, version 17, is designed for 64 bit processors and it's startup time shows it. It is faster than ever.It still has some problems working with 3D drawings but it is better than it used to be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Hansen - OPES Consulting Engineers Inc",
          "Nb_Reviews": 1,
          "Date": "2016-03-18T13:46:01.000Z",
          "Titre": "OPERATION",
          "Contenu": "I like ProgeCAD and the transition from AutoCAD to ProgeCAD was relatively seamless. Overall I the program serves my purposes in a full production environment as good if not better than AutoCAD and of course in a competitive world where you are chasing the buck price is hard to beat."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T09:38:35.000Z",
          "Titre": "Support",
          "Contenu": "Got the support I needed but I hate having to get up at 4am my time to get it.  Be nice if support had different support time windows. 4pm Italy is 10am here for instance... that would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Hoelzer",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:20:13.000Z",
          "Titre": "It is pretty intuitive",
          "Contenu": "It is pretty intuitive.  I have used AutoCAD for years and it is pretty much the same at a fraction of the cost"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Ruban",
          "Nb_Reviews": 1,
          "Date": "2015-12-28T15:52:00.471Z",
          "Titre": "Newbie",
          "Contenu": "I just purchased the software, but so far so good. quick responses to my concerns/questions during the trial period lead me to buy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Young",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T20:58:33.000Z",
          "Titre": "Smooth Process",
          "Contenu": "The purchase and downloading process for progeCAD was smooth. Active code code received quickly. It was a pleasant experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Marc-André",
          "Nb_Reviews": 1,
          "Date": "2016-11-24T22:33:51.000Z",
          "Titre": "Very very good replacement software",
          "Contenu": "I didn't have a chance to explore all the functionalities. I have been using it for a month now and I find it incredibly similar to his \"big brother\"."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Indrajit Ghosh",
          "Nb_Reviews": 2,
          "Date": "2016-06-02T06:06:25.000Z",
          "Titre": "On progeCAD",
          "Contenu": "I recently purchased progeCAD 2017, and tried it.  It seemed to be easy to use, much easier than AutoCAD perhaps.  I am enjoying it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T21:03:39.000Z",
          "Titre": "I have been using progeCAD since 2005…",
          "Contenu": "I have been using progeCAD since 2005 and I have always had a good experience with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Newt Edwards",
          "Nb_Reviews": 1,
          "Date": "2016-05-04T19:22:06.000Z",
          "Titre": "Just like Autocad",
          "Contenu": "This software acts just like Autocad.  If you are a veteran Autocad user you will feel right at home with Progecad. You can't beat the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2016-02-12T05:45:13.400Z",
          "Titre": "Satisfied",
          "Contenu": "I've have had a couple of crashes where everything locks up, but otherwise very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T21:00:22.000Z",
          "Titre": "Not great",
          "Contenu": "Not great, don’t like instantly being asked to buy add ons"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sorin",
          "Nb_Reviews": 1,
          "Date": "2016-06-03T00:28:46.000Z",
          "Titre": "Small problems.",
          "Contenu": "I keep encountering problems with hatching and also when I print PDF.So far, the rest is ok Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2016-06-23T22:59:20.000Z",
          "Titre": "Many issues unsolved",
          "Contenu": "I has lots of new features but also many bugs..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2015-11-27T13:58:02.512Z",
          "Titre": "A serviceable alternative to autocad",
          "Contenu": "Works as it is supposed to"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T21:53:27.000Z",
          "Titre": "Very good experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurt",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T18:03:43.000Z",
          "Titre": "We recently purchased ProgeCAD 2024 and ProgeEARTH",
          "Contenu": "We recently purchased ProgeCAD 2024.  This software does everything AutoCAD does at a small fraction of the cost (and you actually own the software).  I am sooooo tired of software subscriptions.  Our company has taken a stance to not support companies that have subscription models.  ProgeEARTH is also a great package for site design and roadway work.  Operates very similarly to Land Development Desktop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:25:04.000Z",
          "Titre": "Better than Autocad",
          "Contenu": "By offering a 30 free trail this made all the decisions in buying I have about 350 AutoCAD files gathered for the last 15 years on work projects all created by different ver. and every one of them loaded up without a problem. Plus, I notice that when I go to run it, it loads up faster than AutoCAD. All the extras are just bonus that I don't see in AutoCAD."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GreggG",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T23:21:54.000Z",
          "Titre": "I ordered USB dongle but was on a trip…",
          "Contenu": "I ordered USB dongle but was on a trip and needed my trial extended. You all were very accommodating!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monday Uyigue",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T02:19:01.000Z",
          "Titre": "Awesome CAD software.",
          "Contenu": "I recently bought the progeCAD pro 2024 after toying with it for a few weeks, and I have come to know it as a well setup Cad software at a bargain price. Was able to create a 2D drawings with relative easy, because I am famliar with Autodesk product. The 3D requires some learning. Lines are cleans and not broken. Features are abundant. I use it for engineering drawings. Great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Old Gamer",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T04:58:02.000Z",
          "Titre": "Improved Realtime 3D Visualization",
          "Contenu": "I really appreciate the added features of ProgeCAD 2024, with the ease of arbitrary real-time view rotation (and more).  This capability is a huge help for 3D modeling.  Also, the customer support is awesome!  I couldn't be happier!  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Chambers",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T20:46:55.000Z",
          "Titre": "Love It!",
          "Contenu": "I used ProgeCAD for almost the entire 30-day preview period before buying it, and really liked it.  I'm self-taught in AutoCAD and used it for many years designing tooling for screw machines, customer products, and progressive dies for the stamping industry, but now that I'm semi-retired I don't have access to that platform anymore.  I've tried many other low cost supposedly AutoCAD-similar softwares before finding out about ProgeCAD, and they were all woefully inadequate and disappointing.  I can barely tell ProgeCAD from AutoCAD.  It looks and works pretty much the same, and I am absolutely delighted with this software.  It is very much well worth the price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Masi",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T06:14:50.000Z",
          "Titre": "Great customer service and amazing software",
          "Contenu": "Amazing software for a fraction of the price of other CAD Software. Great customer service and extremely responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ACSGeoff",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:57:27.000Z",
          "Titre": "Great CAD with an affordable cost",
          "Contenu": "ProgeCAD was easy to order, install, and works as expected.  Their perpetual license options are great for someone who needs some CAD capability, and a program that is of quality, but can't afford the cost of CAD subscriptions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javier Acevedo",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:52:48.000Z",
          "Titre": "ProgeCad is made for professionals who need an alternative solution to expensive cad software.",
          "Contenu": "Price is very attractive, they are willing to let you try it for 30 days full features, no limitations. If you have used cad in the past, this program will help you succeed and feel at home. Plus they added a small % discount after my free trial."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:23:01.000Z",
          "Titre": "Extremely happy with my recent purchase…",
          "Contenu": "Extremely happy with my recent purchase of progeCAD!  Affordable and you get the full copy with no renewal fees like AutoCAD…so easy to use! thank you, thank you, thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Messina",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T08:42:59.000Z",
          "Titre": "To quick to judge",
          "Contenu": "Listen I was to quick to judge the new Progecad only because of my age and not being a tech guy. Progecad is the best program I have ever used and a lot of the problems I was having was actually my computer not the program. This program has been a God send to me and it goes beyond Autocad in its capabilities. So I give this program Progecad a 5 star + rating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Scala",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T23:31:49.000Z",
          "Titre": "Great AutoCAD alternative!",
          "Contenu": "Very cost effective compared to AutoCAD.  I used to use AutoCAD quite extensively for designing race car parts (personal), but no longer have access to the program.  ProgeCAD allows me to do this again, and more.  Some commands take some figuring out.  I would love to see an actual command by command manual from the company.  The ones online from other people are ok, but sometimes a little bit confusing.  If I could purchase a user manual that’d be wonderful.  Overall I’d rate the program A+."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:11:35.000Z",
          "Titre": "Super",
          "Contenu": "The price, price, and the price.  I have been an Autocaduser since 1995 and every year the annual subscriptiongoes up, and up.  It would be scary to think how much beyond the original purchase price I have paid, yearly, and over so many years for this software..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T23:28:44.000Z",
          "Titre": "Very similar to Acad many useful tools, great value",
          "Contenu": "Very well built program, will get the job done nicely. Have been using progeCAD for years, just needed another seat and there was no question about going with progeCAD again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jim Keating Str & Arch Tech",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T19:49:18.000Z",
          "Titre": "Great service, familiar operation & look to software, ownership, low cost...",
          "Contenu": "My contact, Scott, was patient, got me through some issues at the beginning when I purchased the software. Made me aware that a more current release was available and answered my questions quickly. Got up and going almost instantly without any troubles! Been an AutoCAD and Revit user for many years and I am absolutely blown away by progeCAD. The cost of ownership, the familiar look, and not losing it after a year. I became a sole proprietor after being laid off by a large Engineering firm during Covid. I spent a fortune on AutoDesk software in the first year of operation ... wish I knew about ProgeCAD then. Haven't tried the 3D but I expect it not to disappoint. So happy I can access all my files now, even those back decades ago!! Way to go!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan E.",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T04:35:09.000Z",
          "Titre": "I started using AutoCad in 1988",
          "Contenu": "I started using AutoCad in 1988. Still using an old version on an old computer.   But having progeCAD provides my business with continued use of familiar software. And can make use of 50+ Lisp programs I have written in the past. The affordable price allows me stay in business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R.Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T00:55:13.000Z",
          "Titre": "Best CAD deal around",
          "Contenu": "Great product, great deal!If I didn't have 20 years experience with AutoCAD, probably wouldn't know the difference.slight differences in icons settings. help searches seem pretty comprehensive,Installs quickly and runs smoothly on Win 11.PDF to CAD works well. Even opened a 20 year old AutoCad file. Not sure AutoCAD will do that!2D,3D Architecture , it does it all at a 10th of the cost.An e-mailed tech question with \"normal\" urgency took 2 days for a reply. I imagine a critical request would have been addressed more quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Levi",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T21:59:11.000Z",
          "Titre": "Amazing deal for the occasional user",
          "Contenu": "It's been a while since I've used Autocad and I was an off and on user when I had a license so I may not know some of the finer details but ProgeCAD seems to be a direct replacement for a fraction of the cost. From what I've used of it it is an amazing deal. Made it buying a cad program for occasional use on personal projects feasible. Usability wise it seems to work as good as AutoCAD."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T16:21:21.000Z",
          "Titre": "Very close to the user experience of AutoCad…",
          "Contenu": "Very close to the user experience of AutoCad with a few cool enhancements. Files loaded seamlessly into VCarve Pro for CNC setup. Definitely more cost effective than AutoCad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Lunte",
          "Nb_Reviews": 1,
          "Date": "2016-05-24T15:10:11.000Z",
          "Titre": "Homebrew",
          "Contenu": "Download of trial version went very well, no problems. I have been an Autocad user since the beginning, when it ran on slow computers and the worst thing you could see on the screen was \"Regenerating\", which I think means \"Get coffee. no rush\". Purchase was easy, entering key caused no problems and software runs just like Autocad. I only used 2D Cadd and since I retired I needed Cadd for home projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T17:46:18.000Z",
          "Titre": "I have had ProgeCAD before",
          "Contenu": "I have had ProgeCAD before. And it is great, easy to use, and it’s compatibility  with other CAD programs is fantastic"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T02:24:16.000Z",
          "Titre": "AutoCAD user for over 30 years",
          "Contenu": "I have been using AutoCAD and/or AutoCAD Architecture for over 30 years (all the way back to version 12 for DOS) and have been searching for a solution as I prepare for retirement. Sketchup didn't cut it, LibreCAD was not intuitive enough, other products I've tried were just not comfortable, I needed something that wouldn't make this old dog learn new tricks! ProgeCAD was the answer. Being an AutoCAD user from versions that far back in time a lot of my command initiation are keyboard typing shortcuts, rather than trying to find a command on a toolbar or ribbon. I have yet to find a command shortcut I type that doesn't work! Kudos to you for such an excellent product! My learning curve was...non existent. Thanks for a superb product for a 10th of the cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwayne",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T18:11:30.000Z",
          "Titre": "I've been using progeCAD for years",
          "Contenu": "I've been using progeCAD for years.  Great product and a very reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Teddy Erskine",
          "Nb_Reviews": 3,
          "Date": "2023-03-15T23:09:00.000Z",
          "Titre": "Having used Autocad for over 20 years",
          "Contenu": "Having used AutoCAD for over 20 years, I was skeptical about compatibility and the subsequent purchase of progecad. I decided to take the bait. I am unbelievably glad I did. Most of my drawing is in 2D; there are a few things I have to superimpose and then transfer to 3-D drawing. Things like headers, wall brackets, etc. Being a small contractor, having the capacity to draw up a rendering and present it to the architects and engineers saves us thousands of dollars. The purchase of progecad has been a nearly seamless transition from Autocad. And, for what it’s worth, the follow up and obvious availability for support from Progecad is a welcome surprise, in this hurry up, sell it, get their money, and then act like you fell off the face of the earth, business world in which we live."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GH",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T22:16:59.000Z",
          "Titre": "Great product that meets my needs.",
          "Contenu": "I have 30 years of experience working with AutoCAD. I felt right at home with progeCAD. Great product that meets my needs, and far outstrips the hassle and cost of a subscription based application."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dominic",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T15:18:34.000Z",
          "Titre": "After 30 days of trying it out I bought…",
          "Contenu": "After 30 days of trying it out I bought progeCAD a few weeks ago. Since then I use it almost every day, it works great so far, and feels like AutoCAD. The PDF to CAD function is specially useful for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Gilstrap",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T14:10:19.000Z",
          "Titre": "Great Product!",
          "Contenu": "After loosing all my data, when my computer drive crashed, I was lost without having AutoCAD (as AutoDesk was no longer supporting the older version I was using and was being \"forced\" to purchase a new version) I decided to check out other 3D drafting programs.  I was somewhat skeptical when I found ProgeCAD, but downloaded the trial copy and became very impressed with how intuitive the program operated; and I was able to use it with ease since it simulated (perfectly) the format and functions which I had become very familiar with through AutoCAD.  Old drawing files are imported with ease.  To be honest I was very tentative about moving to a new drafting program, but after using the program, I just cannot thank you enough for providing such a high quality product at a fair and reasonable price.  I am genuinely looking forward to using the program for many years to come.  Great Job progeCAD team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al N...",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T18:26:42.000Z",
          "Titre": "Easy to access",
          "Contenu": "Easy to access, easy to find the new features of the latest 2024 program. Great having a full time spell checker. Easy and secure payment. Still checking it out but so far easy transition from 2021. Seems to take a little more video memory on large drawings do after a longtime of editing you may have to save the drawing. Close and reopen drawing. I am using a Dell i7 Laptop. Probably won't have that warning on a desktop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paid",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T01:11:17.000Z",
          "Titre": "Formerly trained in autocad 2d/3d",
          "Contenu": "2024 VersionFormerly trained in autocad 2d/3d, civil, and architectural. I have been out of design position for a time and I have found Progecad a reasonably efficient re-introduction. At a price that is not ludicrous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TWP",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T02:04:42.000Z",
          "Titre": "The truth written in the product…",
          "Contenu": "The truth written in the product description. ProgeCAD is very easy to change existing drawings which I do a lot. I am excited to try drawing 3D and drawing electrical schematics. Scott H helped to with his notes."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Nutkao USA",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T18:49:03.000Z",
          "Titre": "Using ProgeCAD for several years",
          "Contenu": "I have been using ProgeCAD for several years and I have convinced my company to switch from AutoCAD. The service is much better as well. Quick response everytime from ProgeCAD"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:55:54.000Z",
          "Titre": "Easy transition from AutoCAD to progeCAD",
          "Contenu": "I have been using AutoCAD for over 25 years and switching to progeCAD was very easy. Within five minutes of opening the program, I was using progeCAD like a pro! Great software to use at a fraction of the cost of AutoCAD. Great for 3d modeling and printing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fredderick",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T06:46:44.000Z",
          "Titre": "Switching from AutoCAD to ProgeCAD",
          "Contenu": "It is almost the same as AutoCAD with one difference. It can read AutoCAD drawings from 2002 to the present version of AutoCAD. I have been using AutoCAD for 23 years and have now made the decision that ProgeCAD is a viable and less expensive software for any type of Drafting whether it be Civil, Mechanical, Architectural, or surveying and preparing legal descriptions of land. Very Fnatastic Software and well worth the investment."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:57:33.000Z",
          "Titre": "Seamless transition from Autocad",
          "Contenu": "Seamless transition from Autocad. was 100% productive right from the start. still discovering the standard productivity tools."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Steinke",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T00:49:41.000Z",
          "Titre": "Great software at great price",
          "Contenu": "Was able to load a trial version on my older computer that I couldn't do with Auto CAD. After reviewing the software I felt it was very much like the Auto CAD that I have been using at work. I am retired now but wanted CAD to draw up projects and Proge is just what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bojar",
          "Nb_Reviews": 2,
          "Date": "2016-07-05T16:30:49.000Z",
          "Titre": "Love my new ProgeCad",
          "Contenu": "Seems to be the best deal of all the Intellicad products, the light architectural package included in the ProgeCad along with the 8.1 IC engine @ a sale price cinched it for me. Good Bye AutoCad!!!Thanks, a very experienced (33 years) user!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene Bittinger",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:11:05.000Z",
          "Titre": "Progecad use after 4 years retired from using Autocad",
          "Contenu": "I have been retired for 4 years from using Civil 3d/Autocad at teh engineering firm I worked for and was able to use Progecad immediately as if nothing had changed. Am looking forward  to evaluating the trial version of ProgeEarth Civil/Survey for various projects around the house."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike Smithson",
          "Nb_Reviews": 1,
          "Date": "2016-12-01T19:58:18.000Z",
          "Titre": "Does what it is advertised to do",
          "Contenu": "I have used AutoCad substitutes for several years. Progecad is the first one that seems to be robust and not hangup on large drawings. I say \"seems to be robust\" because it is a complex package with many functions, I have \"exercised\" the majority and none have shown any instability. The user interface is slightly different than AutoCad but not so different as to require a completely new learning curve. I have not experienced an inability to draw something due to slightly different or missing functions.I am very happy with the package and the diligence of the support staff who have answered my initial requests for help swiftly and completely, very refreshing.Mike"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Hymack",
          "Nb_Reviews": 1,
          "Date": "2016-01-11T21:43:32.727Z",
          "Titre": "ProgeCad 2016",
          "Contenu": "I have been using AutoCad since Version 14 it was a great program but it grew into a massive overweight program full of features that most people don't need or use. The straw that broke the Camels back was AutoCad's decision to end the stand alone license. I started looking for a work a like program that I could affort now that I am retired and discovered ProgeCad 2016. It was an easy transition and all the features that I was accustomed to using in AutoCad was there in ProgeCad. Any questions that I had about the program were answered the same day via email. Try that with AC. Try the free trial and you will be surprised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Darden",
          "Nb_Reviews": 1,
          "Date": "2016-04-23T02:33:34.000Z",
          "Titre": "Enjoying the addition so far.",
          "Contenu": "Thank You for an affordable cad software solution. This gives a smaller company an opportunity to work with a full functioning CAD software. I look forward to working with progeCad for many years.\rThank You Again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff H at A.C.E.S.",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T01:02:08.000Z",
          "Titre": "Seamless transition from Autocad.",
          "Contenu": "Seamless transition from Autocad.Didnt cost an arm. Or anywhere close to it.Went right to work. No issues with older files that I suddenly needed to reference.Love the PDF converter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T00:59:02.000Z",
          "Titre": "Very Happy",
          "Contenu": "The 30 day trial was very beneficial. It allowed me to assure myself that I would be happy with the product. Also the emails with product manual links and hints were/are useful. The price of the product for what one gets is amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Casalegno",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T13:25:26.000Z",
          "Titre": "Apricated the information sent by email…",
          "Contenu": "Apricated the information sent by email from sales. The software is everything I was hoping for and more. I've used AutoCad for years but now that I'm retired your progeCad fits my needs just perfectly. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T08:02:40.000Z",
          "Titre": "this is basically autocad such a great alternative",
          "Contenu": "this is basically autocad such a great alternative for a fractionof the cost !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heartstone",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T19:23:46.000Z",
          "Titre": "progeCAD vs Intellicad",
          "Contenu": "progeCAD is better in several ways to Intellicad. The drawing space is visually improved, it seems to run more reliably on my small laptop and I appreciate the quick response from customer service. It is worth the extra money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernard R. Wenzig, ASLA",
          "Nb_Reviews": 1,
          "Date": "2015-12-04T17:12:06.452Z",
          "Titre": "Great CAD product for commercial design purposes!",
          "Contenu": "As a landscape architectural consultant for both private and public developments, our firm has been using progeCAD since 2007 and can recommend the 2016 version without hesitation.  It meets all of our design and construction documentation needs. All drawings are in .dwg format and can be used by anyone using AutoCAD etc...no conversions necessary.  Great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kath Bracisco",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T23:57:32.000Z",
          "Titre": "ProgeCAD is synonymous with excellence in software and service.",
          "Contenu": "Scott at ProgeCAD has offered EXCELLENT customer service!  That is the first step toward an excellent experience.The ability to use my AutoCAD skills with a relatively smooth transition to ProgeCAD also makes my experience a very pleasant one.I truly appreciate the cost savings over AutoCAD because the frequency in which I use the design software meant a painful financial decision.  I would have to spend thousands of dollars for occasional use.I can use this software with complete confidence and flexibility.Thank you for your software and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitchel Farr",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T20:29:09.000Z",
          "Titre": "The performance is highly improved over 2021.…",
          "Contenu": "The performance is highly improved over 2021. I have tried to overload or cause 2022 to fail or shutdown with no success. 2021 did shutdown once in a while.  I see improvements in almost every thing I use. I still have a lot to look at and hope to have some time to try other commands, just to see what you have added. I wonder how much time i am saving, I know it is a lot!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T21:19:46.000Z",
          "Titre": "Would have been nice if you would have…",
          "Contenu": "Would have been nice if you would have sent promo code before purchase instead of afterwards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Jones",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T20:56:20.000Z",
          "Titre": "Similar to AutoCAD and less expensive",
          "Contenu": "Similar to AutoCAD and less expensive. I have minimum experience but working in ProgeCAD looks like and sometimes mistaken for AutoCAD. Learning curve is very short when transfering from AutoCAD and much better than AutoCAD LT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John  C",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T00:38:01.000Z",
          "Titre": "JohnC",
          "Contenu": "The purchase was simple, I received the registration code the same day, I copied it to clip board, opened the application and it automatically loaded the code and ran."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T00:09:50.000Z",
          "Titre": "Great Software to Replace Autodesk…",
          "Contenu": "Great Software to Replace Autodesk AutoCAD.The software works great and has many of the same keyboard shortcuts as AutoCAD so it's very intuitive to use and the price is excellent for full-service CAD software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay W.",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T00:21:15.000Z",
          "Titre": "Adding Materials",
          "Contenu": "I had a couple of questions - isometric dimensioning and adding materials - and they were answered quickly. So far, so good. Salvatore Pagani Answered my question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wes Bishop",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T16:02:46.000Z",
          "Titre": "I've used AutoCAD for many years and it…",
          "Contenu": "I've used AutoCAD for many years and it got so expensive I had to give it up. Enter progeCAD; it looks, feels and delivers for a fraction of the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T02:10:21.000Z",
          "Titre": "I will not pay for a program that you…",
          "Contenu": "I will not pay for a program that you have to go to the cloud. I want it on my computer not some one else’s computer. Every time I use your program the more I like it. I have had AutoCAD since 1982 version 1. I will no longer use it.Thank you for making progeCAD so affordable for the retired and hobbyists..Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Marinelli",
          "Nb_Reviews": 1,
          "Date": "2017-02-08T18:38:08.000Z",
          "Titre": "Outstanding",
          "Contenu": "Great replacement for Auto-Cad.  ProgeCad is Easy to use and straightforward.  I am a consulting engineer and likely only use about 1% of ProgeCad's power; however, it suits my needs quite well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NordVPN Customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T18:15:12.000Z",
          "Titre": "ProgeCAD works just like AutoCAD at a fraction of the cost.",
          "Contenu": "ProgeCAD and AutoCAD operate almost identical.  Easy to customize program to your needs and the price can't be beat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T14:35:08.000Z",
          "Titre": "The product is just like AutoCAD",
          "Contenu": "The product is just like AutoCAD and, since I am familiar with Autocad's structure, this product was easy to use. And of course the cost is phenomenal compared to the aforementioned."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Justiniano",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T15:56:24.000Z",
          "Titre": "BEST AUTOCAD SUBSTITUTE",
          "Contenu": "Awesome program, great price.  Just like working on Autocad without the ridiculous price and yearly subscriptions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricky Johnston",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T01:18:01.000Z",
          "Titre": "Awesome!",
          "Contenu": "With thirty years experience in CAD, I must say I love ProgeCAD and it performs better than expected.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 5,
          "Date": "2022-12-16T02:38:01.000Z",
          "Titre": "Great software and service",
          "Contenu": "The software has been great. I've always used Autocad and the transition was simple. I had to reach out to customer service and Scott replied immediately and helped out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mik Hamada",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T01:46:45.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good.  Getting used to the different icons and commands, but it does the same as autocad with much more.  Just have to keep working with it.  Even with the learning curve I have been able to produce about 4 grading plan sheets in a week of work.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne from N.J.",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T21:39:22.000Z",
          "Titre": "It perfoms well & stable",
          "Contenu": "What I like about Progecad Pro its perpetual license,its many capabilities,the price is reasonable many help information, video tutorials,its variety interface selections.I have refer it to one of my colleagues and he is considering on purchase,It cohabitants with W10,W11. End user will be pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff K",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T16:20:35.000Z",
          "Titre": "Ease of Use",
          "Contenu": "As a retired ex AutoCad user I found the transition to ProgeCAD to be very easy.  I was not a advanced user so most of the commands I use are already available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2018-05-10T12:15:53.000Z",
          "Titre": "Great company! Great Product!",
          "Contenu": "Our company switched to Progecad from Autocad LT. Wow, great product. We've found the same functionality, at a more than reasonable price. Additionally, after interacting with their customer service, I can say they have wonderful employees in addition to a wonderful product."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Klaus Pollmann",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T23:08:51.000Z",
          "Titre": "A great software",
          "Contenu": "A great software, especially if you used AutoCAD before. During my 30 trial, I had some questions, and the response was quick and good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Barrett - Wittbrodt and Associates LLC",
          "Nb_Reviews": 1,
          "Date": "2017-01-19T13:52:08.000Z",
          "Titre": "ProgeCAD fills our needs.",
          "Contenu": "Progecad has been our main CAD software since 2011 and has done everything we've needed.ProgeCAD support is very helpful and they respond in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T17:26:05.000Z",
          "Titre": "What was surprising was the very quick…",
          "Contenu": "What was surprising was the very quick response to all my questions, before and after receiving the program, it was much appreciated!  Bob Hearder."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Blaha",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T02:08:44.000Z",
          "Titre": "This program works exactly as…",
          "Contenu": "This program works exactly as advertised. I am able to read in & change AutoCad files just as well as using AutoCad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Moss",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T22:40:32.000Z",
          "Titre": "Ease of progeCAD installation",
          "Contenu": "The software was easy enough to download and install.  Took a minimum of time to get the CAD sistem up and running."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "ΓΙΑΝΝΗΣ ΓΙΑΝΝΕΛΗΣ",
          "Nb_Reviews": 2,
          "Date": "2017-01-15T11:34:32.000Z",
          "Titre": "The best value for money ever",
          "Contenu": "Since 1999 in cad, at least free of the big brother . Proge 2017x64 (with arch,r2v,pdf,georef image files) is the best alternative I have ever seen! I love my progecad..."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "CARLOS DE LEON",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T16:09:55.000Z",
          "Titre": "keep an eye on customer satisfaction",
          "Contenu": "Your company was always interested in ensuring that the product offered met my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ira Boleyn",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T19:57:02.000Z",
          "Titre": "excellent people",
          "Contenu": "The value of a company is measured by how they manage difficulty these People do very well"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T19:10:21.000Z",
          "Titre": "A good Autocad alternative",
          "Contenu": "Progecad costs a fraction of Autocad, you don't have to pay a monthly fee (the license is perpetual) and still it offers the same features as Autocad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan Davis",
          "Nb_Reviews": 2,
          "Date": "2016-02-09T04:51:42.244Z",
          "Titre": "Great CAD program.",
          "Contenu": "I was faced with the purchase of a CAD program. Just being home based I couldn't afford auto CAD. I searched and found ProgeCAD 2016. It was priced affordably so I tried the 30 day free trial.  After just the second day I knew it was for me. Not only was it comparable with autocad, I found it easier to use. Its layed out very nicely. I'm proud that I purchased it and will tell everyone about it.s"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TMD Architects",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T23:06:43.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great customer service (sales and technical support) and a great product. Seamless transition from ACAD."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T03:45:52.000Z",
          "Titre": "Installation instructions were very…",
          "Contenu": "Installation instructions were very easy to follow. ProgeCAD is very impressive software, no problems reading my legacy AutoCad dwg files going back 25 years!! Seamlessly transparent with AutoCAD, great implementation, great value!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T22:37:13.000Z",
          "Titre": "The trial to let me figure out if I…",
          "Contenu": "The trial to let me figure out if I wanted to purchase was extremely good.    And the purchase process was easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T18:55:33.000Z",
          "Titre": "Easy download and a reasonable cost for…",
          "Contenu": "Easy download and a reasonable cost for a small business to use. All of the functions of the CAD software I was using in the past."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francisco",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T21:51:11.000Z",
          "Titre": "The software is pretty much as using auto-cad…",
          "Contenu": "The software i pretty much as auto-cad which is my previous experience, so the learning process to progecad has been easy and faster."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2016-01-16T04:46:11.259Z",
          "Titre": "Works Great!",
          "Contenu": "I have used autoCAD and GenCAD and I feel progeCAD is every bit as good for the general user"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Beerens",
          "Nb_Reviews": 3,
          "Date": "2016-03-26T20:34:49.000Z",
          "Titre": "high marks",
          "Contenu": "you guys helped when thing got confusing, and were immediately responsive.   The support was very personal, and I felt like I was dealing with individuals, not a corporation."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rui M Pires",
          "Nb_Reviews": 5,
          "Date": "2023-01-24T19:16:09.000Z",
          "Titre": "Great transfer from Acad!",
          "Contenu": "Straight forward definition of capabilities, ease of downloading trial version and easy upgrade to purchase. And the price is truly honest!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2016-01-18T21:23:39.637Z",
          "Titre": "Good Stuff",
          "Contenu": "So far, so good. I have only used ProgeCad on a dozen HVAC design jobs, 2-D and isometric, but it does everything you said it would. I am very pleased with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Guglielmo",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T15:48:37.000Z",
          "Titre": "It works very well",
          "Contenu": "It works very well: it's the perfect replacement for AutoCAD"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Keever",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T23:46:39.000Z",
          "Titre": "Started using it right away",
          "Contenu": "Started using it right away. I am a ACAD user of many decades."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T19:21:50.000Z",
          "Titre": "Quick, Easy & Affordable",
          "Contenu": "Quick and easy purchase and much cheaper than AutoCAD"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T19:53:21.000Z",
          "Titre": "Everything I need and more",
          "Contenu": "Everything I need and more.  So far would recommend. Not sure about the 220.00 per year for support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Gilreath",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T04:17:26.000Z",
          "Titre": "It has lived up to its claims so far",
          "Contenu": "It has lived up to its claims so far.  I am a 30+ year user of autocad and I am very pleased with progeCAD."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2016-11-14T22:10:30.000Z",
          "Titre": "excellent product",
          "Contenu": "excellent products so far very happy with previous version"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave S",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T00:40:45.000Z",
          "Titre": "Lack of leaning curve if you have used…",
          "Contenu": "Lack of leaning curve if you have used AutoCAD and price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 3,
          "Date": "2023-02-07T00:20:57.000Z",
          "Titre": "Transfer to ProgeCad was very easy",
          "Contenu": "Transfer to ProgeCad was very easy.  VEry powerful sofware for the price.Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Herforth",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:20:36.000Z",
          "Titre": "Prompt curtious service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Edward Dampor",
          "Nb_Reviews": 3,
          "Date": "2023-01-12T01:42:25.000Z",
          "Titre": "Just like autocad but cheaper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob K",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T22:18:32.000Z",
          "Titre": "seamless experience",
          "Contenu": "seamless experience, and some better feature implementation than Autodesk. Would recommend to anyone in the business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2015-11-17T19:15:08.931Z",
          "Titre": "Very cost effective solution",
          "Contenu": "Great product, delivers everything it claims"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A New Customer",
          "Nb_Reviews": 3,
          "Date": "2016-02-29T22:27:13.522Z",
          "Titre": "A really Good Product",
          "Contenu": "In my view progeCAD is in the same league as products 10 times the price"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike - B&M Automation",
          "Nb_Reviews": 1,
          "Date": "2016-07-06T01:29:18.000Z",
          "Titre": "Excellent product and reasonably priced",
          "Contenu": "I highly recommend this product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "All Steamed Up",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T20:05:14.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, an excellent product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-01-12T16:35:11.000Z",
          "Titre": "GREAT",
          "Contenu": "STILL TRYING IT OUT."
        }
      ]
    }
  ]
}