{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.wingspan.app",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Meisinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:31:18.000Z",
          "Titre": "They are holding my Money hostage",
          "Contenu": "I’ve never dealt with more frustrating customer service.  This company is unprofessional and has seemingly no knowledge of their own services.  I had a deposit from an invoice that was being held because they claimed I didn’t submit my ID.  Nowhere in the set up of my account was I asked to submit an ID.  Even when I asked someone in customer services they just pointed me in the direction of their FAQs (which had nothing about it).  This was concerning so I decided to cancel my account and requested my money be deposited to my bank account.  They told me it would take 10 days, then on the 10th day they decided they were sending me a check instead.  Pleas keep in mind I had been communicating(or attempting to) with customer services about where my money was, everyone continued to give me vague answers and then finally blame me for “not verifying my identity” (which was not true, I gave these dumb dumbs my social security, bank account, etc.).  It’s been an entire friggin month!!!! They still have not sent my check for A LOT of money that I NEED!!! This is insane borderline scam behavior from an accredited financial institution.  They are holding my money hostage and at this point it almost seems out of spite.  For the love of god please don’t use these morons until they fire their CEO and change their entire organization from the top down.Update:  Its December 1st and I have not received my check. I have contacted customer service again and it's been 5 hours with no response.  Rent is due today, so having that money would be great for me..."
        },
        {
          "Note": 3,
          "Lieu": "BA",
          "Pseudo": "Aida K",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T09:19:00.000Z",
          "Titre": "Issues with international wire transfer",
          "Contenu": "Original review: As an international contractor (non-US based) I do not recommend using Wingspan to get paid. I am currently experiencing an international payment delay of 11 days and counting.First, the intermediary bank put the transfer on hold to run additional checks. This has never happened to me during the many years I've been freelancing and getting paid via other platforms such as Upwork, Deel, and Payoneer. In fact, payments were always transferred to my account within a couple of hours.After my payment made it through the checks, it was ultimately rejected by the intermediary bank. This is the first time anything like this ever happened to me. Now I must contact the intermediary bank to understand what went wrong and no one knows how long this will take.While the Wingspan team tried to help and did respond to my emails in a timely manner, this is a mess of epic proportions that has caused me tremendous amounts of stress. If you get paid via wire transfer and don’t have an account with a US bank, you’re better off using Deel if possible.Update: I finally received the payment after I changed the withdrawal method to my other bank account. (Luckily I had a backup. I don't know what the solution would've otherwise been as the intermediary bank was emphatic they did not receive or reject a wire transfer to my account from Wingspan.) Changing my rating to 3 stars as the transfer to my other bank account went through in 1 business day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marie Hasty",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T12:23:12.000Z",
          "Titre": "I like how simple your program is",
          "Contenu": "I like how simple your program is, and how easy it is to learn. I'd like to be able to break up invoices into payment plans in the future, and I'm having some trouble linking my cc to track expenses alongside my income and transfers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beatrice Land",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T19:51:22.000Z",
          "Titre": "Early platform",
          "Contenu": "It's a great base of a platform, but does not yet offer everything I was looking for. I could find other ways of invoicing but I really am interested in 401k support and more advanced tax features"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike C.",
          "Nb_Reviews": 3,
          "Date": "2023-10-28T09:56:46.000Z",
          "Titre": "As a contractor wingspan simply does…",
          "Contenu": "As a contractor wingspan simply does everything for me. Wingspan makes my life easier from getting paid to doing my taxes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Wright",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T21:14:20.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "I’m a big fan of the Wingspan platform. As a freelancer the included financial tools are a huge help in particular the tax related tools are super useful and easy to understand. Wingspan can automatically set aside tax withholdings and mark items as business expenses to help you get an idea of what your tax burden will be.I’m also a big fan of the invoicing system which is very easy to use and gives your clients many ways to pay the invoices making it easier on both sides.Speaking with Wingspan customer support was the first positive support experience I’ve had in a while. Their support staff are knowledgeable, friendly and don’t waste your time. In a world full of awful outsourced support this was a big positive for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Paquette",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T19:56:28.000Z",
          "Titre": "They Cover Everything",
          "Contenu": "Wingspan is incredible. I’m still relatively new to the platform but they have so much to offer. They even offer business expense tracking and helping with your business taxes. I definitely recommend, 10 out of 10!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Gandara",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T18:21:53.000Z",
          "Titre": "Awesome invoicing company!",
          "Contenu": "I have no issues with monitoring my invoices. This company is great at speedy payouts and the site is user friendly. Wingspan is also price friendly for the quick deposit fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Kepple",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:23:01.000Z",
          "Titre": "I used to have to submit my hand made…",
          "Contenu": "I used to have to submit my hand made invoice, which I had to attach to email to my employer.  Sometimes I would wait and send a group mailing.  Now, all I have to do is submit my reports and wait.  Much quicker and easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paulette Kennamer",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T18:49:37.000Z",
          "Titre": "It was easier to set up than online…",
          "Contenu": "It was easier to set up than online banking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Danner",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T23:38:10.000Z",
          "Titre": "I have always been frustrated that I…",
          "Contenu": "I have always been frustrated that I could not put gas in my car at the pump with my Payquicker card.  It was so awesome to be able to do that.  Love also that there is not a fee for every single transaction that you do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Didier Valencia",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:54:28.000Z",
          "Titre": "Great turnaround on pay day....thxs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Bradley",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T22:51:24.000Z",
          "Titre": "Take the stress out of freelance invoicing",
          "Contenu": "Wingspan takes all the stress out of getting paid as a freelancer. I know exactly where my invoice is in the system and that I can count on getting paid on time. The deposit itself works flawlessly and the payment shows up when I expect, so I know what to count on. I haven't used the other financial services yet, but now that I see how reliable the system it, I'll definitely be taking advantage of more of the services available to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobbie",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T14:50:41.000Z",
          "Titre": "Pay - Bi-monthly",
          "Contenu": "Pay was delivered on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Warren",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T21:41:07.000Z",
          "Titre": "Easier payments to consultants and freelancers",
          "Contenu": "I'm a Product Design manager at a fintech company. For big projects on short timelines, I work with other freelancers to get a project done (e.g researchers, visual designers). Before Wingspan, I would send checks or sometimes wire payments. Which is a hassle for both me and the consultant. Wingspan makes payments to contractors easier and cheaper. The consultants are also happy to get paid faster (2 days vs. 2 months sometimes). Wingspan could be easier to use on mobile, but I'd recommend it to anyone working with freelancers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jenny villeda",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T18:22:01.000Z",
          "Titre": "I love how user friendly Wingspan is!",
          "Contenu": "I love how user friendly Wingspan is. They have video tutorials for the visual learners and many options for independent contractors. I was able to easily integrate my bank account and love that they offer an insurance program if you want it. Super helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephania Serena",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T19:18:12.000Z",
          "Titre": "Paying contractors for interior design studio",
          "Contenu": "I founded a small interior design studio based out of San Francisco: UNdesign(dot)me. On a project, we have many contractors: designers, photographers, artists, etc. Before Wingspan, we were collecting their info over email address. When it came to tax season, we'd spend a fortune on accountants to submit 1099s to the IRS.Since we've switched to Wingspan, it's gotten so much easier to pay our contractors. I send them a payment to their email, they create an account and enter their bank information, and they're paid next-day. 1099s are filed automatically which has cut down our spend on accounting.We want to focus on what's important: designing generative homes for our clients, not taxes and payments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Clark",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T22:34:53.000Z",
          "Titre": "Great experience so far with wingspan…",
          "Contenu": "Great experience so far with wingspan and a very smooth experience getting paid. The website is very easy to use. Would highly recommend this app to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAUL TRUSS",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T01:52:52.000Z",
          "Titre": "Easy and convenient"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brent Woodbridge",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:01:50.000Z",
          "Titre": "Dependable",
          "Contenu": "What I most value is dependability.  I receive notification of my deposits in advance and they reliably appear in my bank account soon afterwards.  My original deposit instructions to Wingspan were followed with no complications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey Wessels",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:15:12.000Z",
          "Titre": "Wingspan Helps with Quarterlies",
          "Contenu": "Wingspan has made it simple for me to save for my quarterly taxes. I no longer have to worry about having enough set aside to pay each quarter. It's right there in Wingspan waiting for me and is probably more than enough. I think this year, for the first time in 5 years, I might actually get money back at tax time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T01:28:31.000Z",
          "Titre": "Very Helpful & Easy to Navigate",
          "Contenu": "I started using Wingspan a few months ago, and their easy-to-use services have definitely been a helpful upgrade! My favorite feature is the automatic tax withholding and seamless system for making quarterly payments to the IRS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T21:00:06.000Z",
          "Titre": "Why I made the switch to Wingspan",
          "Contenu": "I recently switched to Wingspan from QuickBooks to pay the ~30 contractors my startup Arka uses on a monthly basis. Long story short, Wingspan has been an absolute game changer. 1099s are automatically generated, payments are sent out in a few days or less (rather than 10 weeks), and their reporting is top notch.Wingspan’s customer service has also been great. I had a couple of questions about how to send checks to contractors and they responded within minutes via email and even followed up with me a few days later to make sure that everything was sorted out.Wingspan has improved my contractor retention. By paying our contractors through Wingspan, they get access to tax withholding, accounting, benefits like Telemedicine, and their own invoicing system. I hear from our contractors that tax filing season is stressful because, more often than not, they haven't set aside enough for taxes over the year. When I pay them through Wingspan, they have the option to automatically set aside for taxes & make estimated tax payments. They feel like they have the full time (W-2) experience, without any of the hassle and financial burden on our agency.Wingspan has a 1099 management system that's easy to use and is incredibly helpful. We've been able to reduce our time spent 1099 filing from 10+ hours per week, down to about an hour every other week when we send out 1099s in bulk.TL;DR Wingspan has made my life less of a pain-in-the-ass."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmel Al fakry",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T19:47:56.000Z",
          "Titre": "Accurately",
          "Contenu": "Accurately, detailed description, honesty and care about customers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike Stawski",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T16:12:31.000Z",
          "Titre": "I am a big advocate of constant…",
          "Contenu": "I am a big advocate of constant communication on the job or otherwise. Wingspan exceeds my expectation. The reminder emails are very helpful for my bookkeeping files."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Wolfe, Growco Lab",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T22:53:04.000Z",
          "Titre": "Wingspan: The Ultimate Business Solution with Seamless Collaboration and Outstanding Customer Service",
          "Contenu": "I found Wingspan though a well-targeted Instagram ad in early 2020 and it has been an absolute PILLAR to the success and infrastructure to my business. As if the integrated invoicing, expense tracking, and *shouts from the rooftops* TAX withholding and quarterly filing with the IRS at two smooth clicks of a button weren’t enough… If you have 1099 contractors, this has been a seamless solution to getting more done as a team. Collaboration is the very essence of my business—and part of that is paying collaborators. Being able to add my team that way and divide up invoices as needed where they are paid directly, all while tracking my contractors’ W9s and 1099 distribution was a huge game-changer, headache eraser, and time saver.But probably the BIGGEST way Wingspan has earned and kept my trust and business over time… The customer service. When I needed someone with prior *bigger* platforms, it was SO difficult to get a hold of someone for help. It just felt like I was a very small dot in a large customer base. Wingspan’s team have been top notch: personal emails to troubleshoot or answer questions, relatively MUCH faster responses and resolutions, and over the last 3 years I have seen them implement feedback, fix glitches, address roadbumps, and truly constantly improve. They are ever-growing and relatively newer to the scene of business solutions, but I have built up such a confidence in the team behind the scenes. I can’t recommend Wingspan enough if you are an independent contractor, a business that works with independent contractors, or need a more intuitive, thoughtful home base that feels like your business is supported from all sides."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne H.",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:14:58.000Z",
          "Titre": "I have had a great experience with…",
          "Contenu": "I have had a great experience with Wingspan. Very easy to use and navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Picano",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T13:55:11.000Z",
          "Titre": "Very simple setup and they delivered on…",
          "Contenu": "Very simple setup and they delivered on what they advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Sommers",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T20:08:14.000Z",
          "Titre": "As a new member of Wingspan I'm very…",
          "Contenu": "As a new member of Wingspan I'm very happy with the way I get my checks on time every time!Barbara S. Sommers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Priya Patel",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:17:49.000Z",
          "Titre": "Effortless and Reliable Invoice Payments with Excellent Features",
          "Contenu": "I have been using the services of Wingspan for quite some time now, and I must say it has been an incredibly positive experience. Their platform is exceptionally easy to use and offers a straightforward approach to managing and paying invoices. As a busy professional, I value efficiency and convenience, and Wingspan delivers on both fronts.One of the most significant advantages of using Wingspan is their consistent and timely payment of invoices. I can always rely on them to process my payments promptly, ensuring that I receive my funds when I need them. This reliability has been a breath of fresh air compared to previous experiences I've had with other invoice payment services.A standout feature of Wingspan is the comprehensive invoice history it provides. Having all my invoice records in one place is a game-changer. It eliminates the hassle of searching through emails or paper trails to find specific invoices or payment details. I can easily access my entire invoice history with just a few clicks, making my record-keeping much more organized and efficient.Another aspect that impressed me was the training they offered on submitting end-of-month invoices. The company provided informative training sessions that walked me through the process step by step. It was seamless and incredibly beneficial, especially considering the transition from my previous invoice payment service provider. The training ensured I had a smooth and stress-free experience, and I greatly appreciate the effort they put into supporting their customers.Overall, I highly recommend Wingspan to anyone seeking an effortless and reliable invoice payment solution. Their user-friendly platform, timely payment processing, comprehensive invoice history, and exceptional training make them a standout choice. Thanks to Wingspan, I can focus on my work without worrying about the complexities of invoice management and enjoy the seamless transition from invoice submission to receiving my paychecks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T13:07:55.000Z",
          "Titre": "it was a good eperience with wade…",
          "Contenu": "it was a good eperience with wade warren very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Castro",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T13:21:42.000Z",
          "Titre": "Great service and fast deposit 💵"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Smith",
          "Nb_Reviews": 3,
          "Date": "2023-05-14T22:55:29.000Z",
          "Titre": "Great platform",
          "Contenu": "Payments are accurate, timely and have good record keeping capability."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T19:47:33.000Z",
          "Titre": "Pay is on time evertime"
        }
      ]
    }
  ]
}