{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.rev.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurel Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:54:02.000Z",
          "Titre": "I used the button through Vimeo to…",
          "Contenu": "I used the button through Vimeo to place an order for Spanish captions or subtitles since it was advertised I could do this directly through the site but be taken to a third party to order (Rev.com). I placed the order for three videos through Rev.com, which totaled almost $200. I then realized in the ordering process, I had not been asked what language I wanted the captions in. I reached out to support at Rev.com to see if that was something I missed. I was told that only English captions were available at this time. When I asked to have my order canceled, I was told I missed the refund window. When I asked to have my order switched to Spanish subtitles, I was told management would have to make that decision. I pointed out the policy Rev has on their site about English captions being free with all global subtitle orders but I was still told it was up to management. I reached out to Vimeo as well to let them know the button on their site was misleading. I sent in the screenshots showing where it advertised the ability to order subtitles but then that option never appears once you order through Vimeo. They said to ask for a refund and work it out with Rev. I waited a week and then asked Rev again if I could order the Spanish subtitles and pay the difference (I would pay almost $400 more to them for the subtitles) since the English captions come for free. At this time, I have still not received a response or a refund and it has been two weeks since my order. I am reviewing their services in this way because I have yet to receive what I wanted to order and they do not seem interested in helping me correct my mistake, even though it would result in me paying them (Rev) more money. I do not recommend Rev to anyone. And I am disappointed that Vimeo has decided to partner with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maureen",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:06:08.000Z",
          "Titre": "Rev.com will literally take your money",
          "Contenu": "I HAD been a satisfied, happy customer of Rev.com for about 10 years. What kind of company based in America just takes money out of their client's checking accounts without  their client's authorization? Rev.com did this to me yesterday. Plus, I am unable to speak to any real people or contact them to discuss a solution. In addition, I just happened to notice, Rev.com just changed the terms of our agreement from Net 30 to Due upon Receipt... again, without any approval, authorization or agreement with me. I don't know what happened to Rev.com that made them go from a company with awesome, caring customer service staff to stealing money from their customers. But this is quite unbelievable. I choose how and when I pay my bills... not rev.com robots. I cannot recommend doing any business with Rev.comAnd where are they located? Austin, TX or San Francisco, CA,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Foster",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:45:05.000Z",
          "Titre": "Despite what they tell you",
          "Contenu": "Despite what they tell you, they will use non-English speakers for your transcript which will result in a disaster.  They will then refuse to refund your money or fix the problem.  If you have multiple speakers, forget it."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T04:42:39.000Z",
          "Titre": "No reminder for charges",
          "Contenu": "No reminder of charges being made before they happen. As others have said, most respectful companies give you a heads up a few days before or will honour a refund if you’re not genuinely using their service. Not a chance here. Customer service people use their terms of service as an excuse and say their hands are tied, which is not true.Such a scam and would recommend people to use other providers - there are many out there these days!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Thea Finnerty",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T14:35:41.000Z",
          "Titre": "Terrible service! Avoid at all Costs!",
          "Contenu": "Terrible service which is no compliant with statutory requirements in the EU. Customer service are terrible. Basically, I requested captions and got 2 punctuation marks added for a cost of EUR 82. Wouldn't provide a refund so suing them now and reporting them to the relevant consumer protection body. See you in Court! Avoid at all costs and I say that as a first time and never again user!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Morris Design",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T17:30:36.000Z",
          "Titre": "Upgraded my AI captions to \"human\", no SRT file",
          "Contenu": "Upgraded my AI captions to \"human\", but in doing so I paid $150 and the human transcribe did not come with the caption file (SRT) that the AI captioned did come with. So it was misleading to ask me to \"upgrade\" and then not produce the same file that the AI order came with. I can not use the human transcribed file, so basically I paid $150 for nothing- watch out if you need an SRT file, do not \"upgrade\" your AI transcribed order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kit Pierogi",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T12:17:04.000Z",
          "Titre": "Not worth anyone's time",
          "Contenu": "Not a scam but a horrible company to work for and get projects done from. The most you make is 80% of our state's min wage ($9.90) and quality control/grading is but non-existent. I used to work for them and have close to perfect metrics as you can get and was still told the wrong information by \"helpers\" so many times I had to start ignoring them because they directly went against the style guide(s). Was a decent side-job back in 2018 when the company cared more. Would absolutely never recommend this site to anyone looking for work or a project to be done anymore. You can, literally, see which YouTubers and documentaries etc use REV because of the \"style\" and now the inaccuracies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Robinson",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T19:04:16.000Z",
          "Titre": "Changed my credit card number",
          "Contenu": "Changed my credit card number, and when I tried use TapeaCall again, it said it was going to text me a code. It was unable to send the text, that failed repeatedly wrote for help and never got an answer so I had to record zoom meeting and transcribe those. That worked, but still unhappy that no one has gotten back to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Morgana",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T20:21:57.000Z",
          "Titre": "Good luck getting your product.",
          "Contenu": "Rev.com does not email me the finished product (burnt in captions on videos) and does not give access to the finished product on their website. In order to get your finished product, please be prepared to spend an extra 30 minutes jumping through their automated customer service bot before reaching a person and waiting for them to email it to tell you it's your fault (it's not, it's them), and grudgingly send you your completed project manually.Every time. This is not an outlier experience.You will get every email but the completed project you paid for. And you will never get access to your purchase (if it's burnt in captions) on the website itself. By design.Guess they like to keep their customer service people busy."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Andrea",
          "Nb_Reviews": 3,
          "Date": "2023-02-01T00:10:48.000Z",
          "Titre": "Working with Rev(?)",
          "Contenu": "Tri-lingual man graduated in foreign languages, with experience in subtitling national tv shows.I recently applied to work with them as freelance.Apparently, I don't meet their standards. Good luck!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Andrés Ortín Boetti",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T14:57:20.000Z",
          "Titre": "No service and no refund. Bad company",
          "Contenu": "Very bad company as their policy is to keep money from users who never made use of their service. Within the trial you get billed and then there is no refund so they make money from busy people."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Hunter Johannson",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T01:35:19.000Z",
          "Titre": "Took months to hear back from them",
          "Contenu": "Took months to hear back from them. I have years of experience writing and apparently I wasn’t good enough for them. I was good enough for the other writing companies that pay more though so I don’t really care don’t waste your time with this people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angelo Argentieri",
          "Nb_Reviews": 7,
          "Date": "2023-01-05T20:22:50.000Z",
          "Titre": "I had terrible customer support with…",
          "Contenu": "I had terrible customer support with Rev.com and am going to cancel my account because of this. Profits over people is their game. It's unfortunate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T15:26:28.000Z",
          "Titre": "Accuracy was so inadequate",
          "Contenu": "Accuracy was so inadequate, possible 20% at most. They wouldn't even allow me to leave a review. Wouldn't make the changes per my request. DO NOT WASTE YOUR MONEY, THEY ARE FRAUDS."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "aaron singh",
          "Nb_Reviews": 3,
          "Date": "2022-10-30T11:04:08.000Z",
          "Titre": "Awful Company.",
          "Contenu": "Awful - I paid for £30 captions to be told 12 hours should be completed to find out 14 hours later they need to find someone else to do the captions- Joke of a company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A MacKenzie",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T07:56:06.000Z",
          "Titre": "Rev Must Pay ICs for Work Done",
          "Contenu": "Rev.com needs to revisit their recently changed policy that allows them to not pay independent contractors if they deem the job unusable. This is ambiguous and is detrimental to the independent contractors. I spent several hours over two days on a job that involved a college lecture in a foreign country, with a prof with an accent who frequently was out of range of the recording equipment. Because I could not HEAR a lot of what the prof was saying, the job was declined, i was NOT paid the nearly $50 I earned, and my account was deactivated.  Also Rev needs to revisit their policy on not informing clients when Rev is informed that the job has been submitted inaccurately. Another job for which I was NOT paid involved a 5 minute presentation followed by 50 MINUTES of indistinct, unrelated chatter that the AI could not transcribe (and I'm sure the client did NOT want to pay for). The IC was expected to struggle to transcribe AND CAPTION nonsense, which would be impossible to do well, thus leading, again, to NO PAY and deactivation of account."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Neferblue Is So Good",
          "Nb_Reviews": 5,
          "Date": "2023-01-12T22:50:47.000Z",
          "Titre": "This company is not reliable",
          "Contenu": "This company is not reliable ! Get in touch with a real company that will give you an invoice and negociate a nice deal ! This rev is not a real company for sure"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Fries",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T22:11:01.000Z",
          "Titre": "Terrible at long audio transcription",
          "Contenu": "They have pretty good quality with short audio transcriptions.  However, if you get anything over an hour, they break the project up into small pieces and you end up with several transcribers working on the project, which really reduces the quality.  For me, having consistent speaker names, whether it be their actual names or Speaker 1/Speaker 2, etc, is important as the data analsysis is based on who the speaker is.  For my project they used four different transcribers for a 90ish minute audio transcription of a 10 person focus group.  Two of the four transcribers were able to identify names or apply consistent \"Speaker1, Speaker 2\" names.  For transcribers 3 and 4 it was all over the place.  At one point they had 16 speakers.  This would not have happened if they had used one transcriber, or even two for that matter.  Additionally, when I brought this up to REV, they kept saying that they did not guarantee the speaker names and that I needed to go and edit it myself.  I had two other focus group sessions that were less than an hour and had no issues with quality because they used one transcriptionist.  So BEWARE of long audio transcripts - they choose cost savings over quality and will do a terrible job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T13:38:09.000Z",
          "Titre": "Recording Disappointment",
          "Contenu": "Rev.com was quite disappointing for me, so the culmination of a one-star review is the only experience it provided me, unfortunately.  Choosing to try its online recorder did not deliver better results (or any) than my previous use of – and experience with – SpeakPipe, for example.  Despite advertising greater features and more detailed services than other sites, the software seems unstable and proved unreliable for me.  On July 11, 2022, I used the site’s recorder after a couple of test runs.  When I attempted to save my recording, it disappeared and the page reset itself --- prompting me to start a recording and forever losing the one I really needed.  My follow-up to Customer Support provided that Rev.com does not backup recordings and there are no options for recovery of recordings that do not save properly, or at all.  I thought I found a really good site that would not only deliver a quality recording together with transcription capability, but I did not even receive the benefit and advantage of a basic online recorder."
        },
        {
          "Note": 1,
          "Lieu": "SZ",
          "Pseudo": "Abednigo Ncongwane",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T08:46:33.000Z",
          "Titre": "I must say I was really excited about…",
          "Contenu": "I must say I was really excited about joining this website but after discovering I don't qualify because of my location really disappointed me and there are so many sites and online surveys that do this, it is truly upsetting since we are all trying to make a living so my question is what will it take for these sites to work in our countries this is so unfair"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R.B.",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T00:51:19.000Z",
          "Titre": "Australian & New Zealanders accent very poor transcription",
          "Contenu": "The human transcription service for Australian & New Zealander accents were very very poor, I will not use Rev again, after spending thousands of dollars with them."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Jawad Khan",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T22:52:31.000Z",
          "Titre": "Nothing to be wrong this time",
          "Contenu": "Nothing to be wrong this time . This company will improve through honesty and faithfulness"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "fenton lawless",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T00:17:59.000Z",
          "Titre": "A time consuming process that bore no…",
          "Contenu": "A time consuming process that bore no results I can find. I'd like a refund."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Michael Korchagin",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T13:46:39.000Z",
          "Titre": "ZERO competence in treating trial users | Total Frustration",
          "Contenu": "I joined the Trial Version to see how to use the service from the inside. After 1 free transcription, I left the platform as I did not find it relevant for me. After some time, I WAS CHARGED the full subscription price of $29.99. NO email reminders were sent (both inbox and spam checked), NO notifications were used on the personal account screen, NO remaining days were counted anywhere - as most respectful services do.I requested a refund \\ explanation by contacting their support on Feb 8th (ticket 3067419) AND NEVER GOT A REPLY.Today, on Feb 17th, I reached support chat and their representative Quinton admitted that A) he personally saw my ticket AND DID NOT reply, B) the support team IS NOT aware of the notification system, C) NO refunds are actually possible, D) and also that I can send a complaint email...to their support (what an irony!)In other words, THE ONLY way for users to know about the remaining days is by checking a subscription tab constantly (but only if you are aware of it and if you managed to find one).My complaint is not about money themselves but about the level of communication, support and user treatment, meaning:1. There are NO any emails \\ reminders at least 24h before the trial period ends2. There are NO any website screen notifications3. Support DID NOT respond to the support ticket even though they KNEW there was a request4. Support DOES NOT aware about how their reminder system works5. REV.com according to support team (I have chat screenshots) is UNABLE to provide a refund for unsatisfied customers, who even DID NOT use the service, which can be easily checked.I am TOTALLY disappointed with my customer experience with this service ON EVERY level. Refund is a minimum that the respectful platforms must do in this kind of issue - especially if the service itself was not used AT ALL.I would like new users to keep these things in mind during your trial period."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Zingmark",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T07:52:10.000Z",
          "Titre": "Total waste of money",
          "Contenu": "Total waste of money. Will not use again. The overlaid captions that wouldn’t fit the video that I uploaded. Don’t believe the price. They try to upsell you at every turn and the round up. A minute 30 second video cost the same as two minutes…"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Tim Oude Luttikhuis",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T10:50:20.000Z",
          "Titre": "There was no understanding and empathy…",
          "Contenu": "There was no understanding and empathy for the situation despite not using the services I had to pay. In addition, communication is slow and incomplete."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hope Sheehan",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T04:43:56.000Z",
          "Titre": "Incorrect formatting",
          "Contenu": "I think detail is key putting in format of colloquy and in q and a format to be accurate also in how an actual transcript should look not just speaker annotations my previous transcript had over 20 errors in it on my first order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Sniffen",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T21:27:08.000Z",
          "Titre": "My fault I forgot to add time stamps on…",
          "Contenu": "My fault I forgot to add time stamps on the Weltman file. Can that be added ad then bill us?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Angel",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T18:51:08.000Z",
          "Titre": "I wont be happy until I get a refund",
          "Contenu": "I wont be happy until I get a refund. I was ripped off using this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D.E",
          "Nb_Reviews": 2,
          "Date": "2022-06-03T22:15:46.000Z",
          "Titre": "They actually said the end product will…",
          "Contenu": "They actually said the end product will be of a poor quality! Wow!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "R Pal",
          "Nb_Reviews": 7,
          "Date": "2022-05-12T19:42:18.000Z",
          "Titre": "Very poor",
          "Contenu": "Very poor. I had a closed caption done for my film and it failed quality control for streaming. When I approached rev about re-doing they said it was outside their standards. How is the industry standard outside your own? An example of the fixes I asked for:-Many instances of over 32 characters per line-Also CC covering on screen text-CC leaves early-CC hanging on screen-CC comes in early"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Syed Saleh Hussaini",
          "Nb_Reviews": 3,
          "Date": "2023-01-16T13:28:36.000Z",
          "Titre": "only one withdra methood."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marie",
          "Nb_Reviews": 2,
          "Date": "2022-04-10T14:19:51.000Z",
          "Titre": "Total scam",
          "Contenu": "I was a freelancer until my account got deactivated without giving me a reason. My ratings were good and above the required levels and I never violated any terms and conditions. I also never received my outstanding payment and can't seem to get a reply from REV anywhere. I'm furious and expect an answer."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Mahesh Rajkumar Rathod",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T10:20:21.000Z",
          "Titre": "Can  I do the typing job from India and…",
          "Contenu": "Can  I do the typing job from India and earn money from Rev.com"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Matthew P",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T17:02:06.000Z",
          "Titre": "Transcribers not doing their job",
          "Contenu": "I’m quite certain that most of your transcribers are just submitting the auto generated script as their work. There are glaring errors in the dialogue that point to this. It’s clear to me that all I’m really paying for is the much cheaper auto generated transcript, and thus getting severely ripped off. Moving forward I will only be paying for the auto generated script."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Edward Byrne",
          "Nb_Reviews": 2,
          "Date": "2021-10-31T08:56:19.000Z",
          "Titre": "Rev is an absolute scam. DO NOT BECOME A FREELANCER!!",
          "Contenu": "Rev is an absolute scam. You can spend hours correcting transcriptions, and get a third of minimum wage for you effort. You are granded on your work for accuracy, and it seems like literally ANYTHING will cause you to lose marks for this. Rev is an awful service that preys on cheap labour to make money. DO NOT APPLY to become a freelancer!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Patrick Ronoh",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T13:19:53.000Z",
          "Titre": "Rev.com is a scam",
          "Contenu": "Rev.com is an absoulute scam that preys on cheap labor. They've perfected the art of stealing from the poor transcribers, by suddenly deactivatings accounts due to unexplained reasons and retaining their earnings. You can do perfect and excellent job and they still won't pay you nor give explanation."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "kip",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T01:08:12.000Z",
          "Titre": "Ambitious to work here",
          "Contenu": "Ambitious to work here? Look away, look away."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Christine",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T10:38:11.000Z",
          "Titre": "Inconsistent and arbitrary grading for low pay",
          "Contenu": "Unfortunately, the graders aren't consistent in applying style guidelines. You can be marked down for doing something a different grader marked you down for not doing! The style guide is sparse and following forum advice completely luck based. Grade disputes are pointless.The harsh metrics mean no opportunity to learn as inconsistent, arbitrary grading is frequent. Leave this alone, your time is worth more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gregory bowen",
          "Nb_Reviews": 9,
          "Date": "2021-10-28T23:05:10.000Z",
          "Titre": "I was deactivated with nothing but a…",
          "Contenu": "I was deactivated with nothing but a generic explanation! The only bad metric I received was on a training exercise that HAD ZERO INSTRUCTIONS! The other two I got 13 of 15 points on my reviews. I had only done two projects since starting a couple of weeks ago.... Absolute garbage company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Correy",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T09:36:22.000Z",
          "Titre": "Rev.com doesn't value their freelancers…",
          "Contenu": "Rev.com doesn't value their freelancers anymore. They deactivate your account for reasons they won't tell you and then woe unto you if you had payments pending because you will not be paid even if it's a whole week's work. I mean, why would an employer do that to people in the middle of a pandemic? This is firing guys without giving them dues owed. Would not recommend as a freelancer. Go find yourself a company that will value your hard work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emma Bryson",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T20:12:01.000Z",
          "Titre": "I have been a Revver freelance…",
          "Contenu": "I have been a Revver freelance captioner but I rate the one because of how they treat as,  my PayPal account got some limitation, am un able to withdraw money with it so I requested rev to update for me last week and they do so but in a short time they have deactivate my account giving no reason for deactivating.  The metrics was very fine."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T06:34:04.000Z",
          "Titre": "Not satisfied",
          "Contenu": "Hi, rate of transcription is great. However, I am not satisfied with the quality of the transcript. I am looking to transcribe 20 documents.  We sent through 3- 1 which was very inaccurate. The other 2 were ok but also needed edits. I sent through an E-mail, rated the transcript bad and still waiting for the amendment...."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "laguerita laguerita",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T21:42:22.000Z",
          "Titre": "I sent a video requesting a translation…",
          "Contenu": "I sent a video requesting a translation and had it rushed. I was sent back a video with some English captions, which was not requested, and told they don't do translations. It was then a, \"better luck next time\" response from their team. Very disappointed in the level of service and misleading information from this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lois",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T13:40:49.000Z",
          "Titre": "I applied through the website and…",
          "Contenu": "I applied through the website and completed the application which took quite a while. It said it would take a few days to process the application, over 2 months later and heard nothing, really disappointed"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jason B",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T22:39:16.000Z",
          "Titre": "Not so happy about my experience",
          "Contenu": "Not so happy about my experience.  Previously buying a transcription would also get your an SRT file.  Now the buying procedure has changed and i had to buy twice to get SRT and Transcription.  Had i have bought the SRT file however i would have had both.Bad support on this they literally made me pay twice...The quality itself is good, the pricing very high, service when somethings not right, below average"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ubong Inyang",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T17:15:12.000Z",
          "Titre": "Please can you people stop sending me…",
          "Contenu": "Please can you people stop sending me this review again. I felt so bad and disappointed from REV.COM services. I will need my $185 back because REV.com did messed my project. Instead of you guys solving the problem you are looking for review. You keep sending me review for what 😦? I need my money back ASAPAmazon Prime feedback after I submitted this CC, rejected it 2 times with the reason that he captions you sent to me are 1) INCOHERENT2) Captions are out of sync from the audio track.I need this to be fix or return my money back ASAPSome of the words were missing that means whoever was working on this is incompetent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan White",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T13:27:47.000Z",
          "Titre": "Mistakes On Just About Every Line So Far!!",
          "Contenu": "This is my second order with Rev.com. The first was really good- I only had to make a few corrections.  This second one is terrible.  I am on line 176 of around 800 lines and so far I have had to make corrections on just about every line. If I have to make this many corrections, I would have been better off to do it myself and save the money.  Very disappointed!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 6,
          "Date": "2020-03-08T21:09:24.000Z",
          "Titre": "They put your prices up by 150% overnight!",
          "Contenu": "They put your prices up by 150% overnight without any prior indication. I went to the online chat and the person would not answer any specific questions about the ludicrous increase in price. I asked for the contact details of someone to do with Rev.com in order to get a reason for this extraordinary increase but they just ignored my questions. Maybe this will get them to explain."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kate Canning",
          "Nb_Reviews": 3,
          "Date": "2021-03-09T15:26:06.000Z",
          "Titre": "At first I thought rev.com was a superb…",
          "Contenu": "At first I thought rev.com was a superb transcription/closed caption service but having found separate errors on one closed caption file on FIVE separate occasions since early December 2020, the last occasion being today, I have to retract my view. I would have given a 0 star rating if I could."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Ellis",
          "Nb_Reviews": 2,
          "Date": "2019-12-18T18:35:20.000Z",
          "Titre": "Horrible Transcript.  No attempt to fix.",
          "Contenu": "Rev did not even come close to accurately transcribing the recording.  The speaker's names are wrong.  Even though I asked it to be fixed and provided which speakers were which Rev still could not do it.  I will not pay, and will dispute the charge on my cc.  Further, I will never use Rev again.  There are too many transcription services available to settle for sub-par work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandy Hensley",
          "Nb_Reviews": 1,
          "Date": "2020-03-02T23:35:57.000Z",
          "Titre": "The quality was awful",
          "Contenu": "The quality was awful, and I had to retype the entire thing myself, even though I paid over $100 for transcription.  It was reviewed internally after my complaint, and it was decided that I was correct, and I was given the offer of having it retyped; however, I'm on deadline, and that offer came a couple of days after I had to return the document."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yura Rybitskyi",
          "Nb_Reviews": 1,
          "Date": "2019-08-27T21:50:18.000Z",
          "Titre": "Double charge for 2 sentences translation.",
          "Contenu": "I had really bad experience with rev.com translation.Accidentally,  I put two pages instead of one when I was filling online form.There were only two sentences to translate.But they double charged me 2 * $33 = $66. I asked customer service and they declined my request to reimburse me it.I do not recommend this service as they have really bad customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Faith",
          "Nb_Reviews": 2,
          "Date": "2019-01-21T16:24:53.000Z",
          "Titre": "Awful customer service",
          "Contenu": "Awful customer service.  They offer translations INTO other languages but their certification page for these documents are not offered in any language but English.  Absolute nonsense.  Their translations need translations yet they do not offer this.I now missed my deadline for the translations and have to pay someone else to do the job correctly.I requested a refund and they refused."
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Sam SD Davis",
          "Nb_Reviews": 2,
          "Date": "2018-11-18T01:03:34.000Z",
          "Titre": "The worse customer service",
          "Contenu": "The worse customer service.  I had to contact them today about an order not ready and she had the nerve to tell me it did not drop down into their system and this was not their fault and I had to wait.  If the problem is your system, yes it is your fault.  Instead of offering me a refund she sends me a riot response.  Apparently customers means nothing to this low life company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thno",
          "Nb_Reviews": 1,
          "Date": "2019-01-11T16:38:51.000Z",
          "Titre": "Unprofessional and unfriendly support",
          "Contenu": "I paid for a birth certificate translation. The document I received is unreadable and unusable. They misplaced the first name and Date of Birth. When I provided the original document handwritten and asked for a correction, they said that they cant issue a new translation and asked to place a new order for another $33 .The customer service support was very unprofessional , greedy and unfriendly. I contacted my bank for a refund."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Greg Baker",
          "Nb_Reviews": 1,
          "Date": "2018-09-16T09:37:02.000Z",
          "Titre": "app didn't record properly",
          "Contenu": "The rev app spontaneously stopped recording for the middle 25 minutes of my meeting -- it recorded the start and the end, but nothing in between. The transcription was OK for the bits where there was sound, but I just paid for someone to listen to a lot of silence and lost a lot of important content from an important meeting. I've not had this happen with other audio recorders."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Howey",
          "Nb_Reviews": 1,
          "Date": "2018-07-03T17:26:34.000Z",
          "Titre": "Not a good experience",
          "Contenu": "Not a good experience. Very disappointed with the app. Contacted support to cancel order, but have yet to hear from them. Cannot endorse this product or the company, and warn others to proceed with the greatest caution.This has nothing to do with Rev.com's transcription services. Those are awesome. This ONLY concerns the iRec app for iPhone. Not happy with that service ONLY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Lane",
          "Nb_Reviews": 1,
          "Date": "2018-07-05T22:03:02.000Z",
          "Titre": "I'm reading through a transcript and…",
          "Contenu": "I'm reading through a transcript and it's terrible. Practically every other sentence has a spot that you've tagged as inaudible. And far too much of the transcription is simply wrong. I'm guessing you have some software program that is handling this service. But it's not handling it. This is very disappointing and not worthy of the money spent on it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi Hutner",
          "Nb_Reviews": 1,
          "Date": "2017-10-18T08:52:19.000Z",
          "Titre": "I cannot work with the formatting",
          "Contenu": "I cannot work with the formatting. I asked to have it not used, and Rev.com agreed. Then the formatting I requested not be used, was used. I asked for it to be removed. They said no. I will not be using them again. The formatting is impossible to work with and is very challenging and time consuming to undo (and mostly won't come undone). Editors I work with complain. It's a real problem."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T22:53:43.000Z",
          "Titre": "This service is very cheap",
          "Contenu": "This service is very cheap. That means that the transcribers who work for Rev are being massively underpaid. The pay their transcribers $0.36 per minute of dialogue that they transcribe but that may take about 5 minutes or so to transcribe 1 minute of dialogue. So that's $0.36 for 5 minutes of work. You do the math."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Sheridan",
          "Nb_Reviews": 1,
          "Date": "2017-01-16T20:00:10.000Z",
          "Titre": "Inaccurate Translations for professional work",
          "Contenu": "They used google translation and my client caught it. Very embarrassing, so I can't trust them again. Rev.com won't give a refund to me that I asked for. They offered to do changes, but how do I know the changes are correct? they asked what parts are wrong, but how do I know what words are wrong without knowing the language? Not worth losing a client over this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Dobner",
          "Nb_Reviews": 1,
          "Date": "2018-07-24T12:27:28.000Z",
          "Titre": "Never again.",
          "Contenu": "Never again.  I ordered from Rev.com online, never received the transcript that I paid for. Have no idea where it is or how I might find it if is posted somewhere. Waste of my $18, which isn't a lot, but as a self-employed disabled person who is trying to start earning a living is just something I can't afford."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cara Hagemeyer",
          "Nb_Reviews": 1,
          "Date": "2015-03-14T02:54:22.000Z",
          "Titre": "Does not deliver as advertised",
          "Contenu": "They advertise 24 turn around time but it has been over 24 hours and I still have not received my order.  When I called them after I paid for my order, April guaranteed me 24 hours.  I called today and Lisa told me they were backed up.  That is not my problem.  Do not advertise something you guys cannot deliver! This was my first order and my last.  I am going to make sure to tell all my friends never to use this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2014-04-18T16:50:01.000Z",
          "Titre": "Poor spell checking",
          "Contenu": "I had a frustrating experience. The simple birth certificate had to be reviewed and corrected twice because the translator couldn't simply copy word for word the correct spelling of my mothers name correctly. It took a few exchanges to get it right but I will have to say the customer service was on top of it. It just seems like double checking your work should be a simple and standard procedure."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Debbie L",
          "Nb_Reviews": 2,
          "Date": "2019-11-19T09:50:14.000Z",
          "Titre": "Unprofessional & incompetent",
          "Contenu": "Unprofessional & incompetentRev took my order and undertook to fill it in 42 hours. When this time passed, I messaged and emailed. No reply came.I emailed several more times to ascertain how long the job would take.Another three days passed before anyone bothered to reply.I was told my job couldn't be done. This was never conveyed to me, at a time when I could have sought other help.I am disgusted by their cavalier attitude. Rev made me feel my job was completely unimportant to them.I would not trust them or use them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unknown",
          "Nb_Reviews": 1,
          "Date": "2013-09-16T14:24:56.000Z",
          "Titre": "Unable to use this as a Certified Translation for the Government!",
          "Contenu": "A few good things to mention. The process to translate was very simple. The turnaround time was on par. However, the cost was three times as much as I had anticipated AND after taking the \"certified\" translation documents to the government officials, I learned that I was unable to use them as they are not truly certified! \rWasted: Time and $378.00"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KATARZYNA",
          "Nb_Reviews": 1,
          "Date": "2014-01-14T01:33:21.000Z",
          "Titre": "Customer overcharged for the service.",
          "Contenu": "The translation was completed in timely manner. However, I was charged for twelve, extra three pages, even though the document was actually nine pages.  I calculated the number of words that has been translated and for my order the total was 2280 words. Therefore, 2280 divided by 250 words per page give us a total of 9.12 pages. I was willing to pay for 10 pages but not for 12 as I was charged. I believe that is not what I was promised in the first place."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Koushik",
          "Nb_Reviews": 2,
          "Date": "2020-10-23T22:02:22.000Z",
          "Titre": "Low quality work, and no response",
          "Contenu": "Order CP0310019551  ,  CP0173468212 .Support Case #2227515. Promised 6 days before to improve, after admitting sub-standard delivery. But no response .. .unprofessional Paid 800 $ fior order.. but zero delivery.We lost business for this company.. scamstars!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Disappointed first time user",
          "Nb_Reviews": 1,
          "Date": "2015-07-17T07:47:25.000Z",
          "Titre": "Waiting 5 days to receive my transcript????",
          "Contenu": "I lodged my transcript on Thursday 16 July 2015.  When i go to my order history it states: your order is in progress, we are finding a qualified transcriptionist for your order, expected delivery July 20!!!!!!!!  Yet on the rev.com website it clearly states: Orders will be delivered within 24 hours as long as the order is placed prior to 2 PM Eastern and the recording is not greater than one hour in length or complex in nature.\"  well that sums up my order!  Not happy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy Baggett",
          "Nb_Reviews": 1,
          "Date": "2017-12-22T19:04:18.000Z",
          "Titre": "Typist unable to correctly spell",
          "Contenu": "Typist unable to correctly spell:  its/it's,  whose/who's,  your/you're,  lets/let's,  their/they're.  Since transcriptionists are professional spellers, they should be able to spell correctly.  Took 6 hours to correct the transcript.  Wasted $108.  Offered us a $10 credit, insulting."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Youn",
          "Nb_Reviews": 4,
          "Date": "2013-11-13T10:58:42.000Z",
          "Titre": "Decent but differing quality, after service below par",
          "Contenu": "Used Rev.com for a quite large order ($900), overall quality was decent but differing, understandable though due to non-native speakers. There was however one transcript that was way below acceptable level, after contacting the company the only thing that was offered was a $25 discount on a next order which has no value for me. After this offer also no reply on my e-mail with any other solutions or apologies. Therefore sadly the last time that I will use or recommend Rev.com."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Ted Yukawa",
          "Nb_Reviews": 1,
          "Date": "2014-03-21T17:42:13.000Z",
          "Titre": "Refund requested for word density extra charges when my translation was re-used",
          "Contenu": "I provided my translation for reference. I paid $378. Was quoted extra because of word density. I asked support if my translation couldn't be taken into consideration, but was still quoted an extra $243. In the end, the translator just copied and pasted my translation. I don't mind paying $378 because the document has Rev's certification, but charging for word density when the translator didn't do anything extra is ridiculous. This requests a refund for the $243."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Franke",
          "Nb_Reviews": 3,
          "Date": "2014-08-01T02:38:40.000Z",
          "Titre": "Good transcription. Bad security hole.",
          "Contenu": "The speed of their service was great. Their transcription had a few glitches -- but not many. \r This would be a 5 star review except for their new anti-security policy. All translations are sent via email with embedded links -- which is not secure. Since emails are basically like 'postcards in the mail', this is not satisfactory. REV could so easily change their policy, so that people who are concerned about security can log in to the Rev site and download their  files..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kait",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T03:50:11.000Z",
          "Titre": "Disgraceful",
          "Contenu": "Disgraceful. I would not recommend this company to anyone. Definitely not 99% accuracy. Definitely do not provide 24/7 support. Definitely not guaranteed top quality. The mistakes made were ridiculous. I had 40 audio files transcribed and spent hours and hours checking the transcripts and fixing careless mistakes. I have had transcripts re-done twice and they are still terrible and keywords are completely wrong. \"No\" was even transcribed as \"yeah\". I honestly can not believe that their rating on here is so high. I am absolutely outraged."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "M. Obaseki",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T22:43:47.000Z",
          "Titre": "The after sales is useless for people…",
          "Contenu": "The after sales is useless for people who know little about the technology. They take a long time to answer & when they do it's all technical jargon. THERE are no pre-recorded video tutorials or screen shots. I'd rather pay someone to do the subtitles. Never again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruno",
          "Nb_Reviews": 1,
          "Date": "2013-12-29T15:55:42.000Z",
          "Titre": "VERY DISSAPOINTED",
          "Contenu": "I sent you payments for 135 US$ for two translations jobs TR0997226879 and TR0661686481. The last one was done (...6481) but the other was cancelled due and offered to return 27 US$ to me . You send me an email asking for more money for order  ending in ...6481 and I did sent the money , and the other order to just told me it was on hold but you never told me how much that order was. So I am very confused how much did you charge me and why did you cancel the order ending in ...6879"
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Oscar Edward",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T09:09:49.000Z",
          "Titre": "Very unfair work conditions for their…",
          "Contenu": "Very unfair work conditions for their freelancers.You may work for a week, they grade your jobs perfect only for them to deactivate your account and fail to pay.I wouldn't recommend it for freelancers and clients by extension."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aldo",
          "Nb_Reviews": 1,
          "Date": "2017-08-11T15:34:13.000Z",
          "Titre": "Could not get consistent format on …",
          "Contenu": "Could not get consistent format on translations, contacted support and was basically told that was the way it is. They offer custom formatting on the website but can't match format between to similar documents. As I am not happy with my order and was not resolved I am giving them 1 star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erin A Epps",
          "Nb_Reviews": 1,
          "Date": "2019-11-17T17:36:07.000Z",
          "Titre": "Transcription not accurate",
          "Contenu": "Transcription was not accurate, in fact it changed an entire word as well as the direct meaning and context of the statement that was made in the voicemail I submitted. Would not recommend for legal purposes or use Rev transcriptions for case supplements or filings."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve C",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T14:23:22.000Z",
          "Titre": "Works well but be warned!!",
          "Contenu": "I've used Rev a number of times and they've been very good but be warned, unless you use their fast turnaround service they will not GUARANTEE a delivery time, you might see an estimate but it is just that, an estimate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Plato",
          "Nb_Reviews": 1,
          "Date": "2013-08-22T00:45:25.000Z",
          "Titre": "Machine-based translation, despite of what their claims - be careful!",
          "Contenu": "I used rev.com and recieved a nice certificate that says how accurate their trnalsation is, signed by their Vice president, along with the most ridiculous translation of a very simple certificate. It didn't make any sense and was obvious that a human didn't do it, but a machine (a dumb one). \r I asked to correct it and after 3 days I got 2 versions of the certificate in English, one was correct and one was not. Obviously, whoever is doing this is an amature and ignorant. Find yourself a different company."
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Titus Yegon",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T16:29:36.000Z",
          "Titre": "Holding your earnings after account closure",
          "Contenu": "They do not pay you for your completed work when they deactivate your account. Even though they clearly state in their closed accounts FAQ that they will pay for all completed and submitted jobs done before account closure, that has not been the case. They will close you account, leave the number of minutes captioned as is but change all earnings for each completed project to zero, even the ones that had been graded as perfect by their graders. This is clearly not fair since they've collected the money from the customer, you did the work, it was sent back to the client but in the end you don't get your money. Emails to their support email also go unanswered."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Sh",
          "Nb_Reviews": 1,
          "Date": "2016-11-08T20:03:03.000Z",
          "Titre": "labeling problem",
          "Contenu": "Transcriptions had many problems with labeling the speakers in focus group. Speakers were labeled by chance and incorrectly rather than choosing a fictitious name/label for each speaker. So you don't know how many time a specific person has contributed to the discussion."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Navin gurung",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T14:00:03.000Z",
          "Titre": "They charge you even for a 7 days free…",
          "Contenu": "They charge you even for a 7 days free Trial. Yes, they say it free but do not get surprised if you see charge in your credit even you cancel subscription under 7 days. Worthless and useless add-on for Zoom I came across so far...!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lillian",
          "Nb_Reviews": 2,
          "Date": "2014-08-23T01:18:03.000Z",
          "Titre": "The transcription was filled with an unreasonable amount of innacuracies.",
          "Contenu": "It took me a half hour just to correct the first 8 minutes of transcribed text before I just gave up.  I could have paid the same amount of money to have a friend do it for me and it'd go to someone I could actually trust and communicate with better if they had questions on hard to hear words.  I used this site based on a lot of stellar reviews, but I guess that's a lesson learned.  Definitely doesn't endear me to ever using an online transcription service ever again.  Obviously a lot of other people have had better experiences, but I'm not one of them."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Patrik Hutzel",
          "Nb_Reviews": 1,
          "Date": "2019-12-21T04:50:56.000Z",
          "Titre": "Rev.com's very poor customer service and customer experience",
          "Contenu": "Rev.com treating existing and long standing customers very very poorly. Such a poor and lousy customer service. Have to ring up because Rev don't have the courtesy to call with transcription issues. Had to ask receptionist for over 10 minutes for refund for a service that has never been perfomed according to Rev.com's T's and C's. Words of staff don't match their actions. Staff at Rev.com don't have the courtesy to contact long-standing clients if there are issues with transcriptions. Instructions when uploading audio recordings constantly get ignored. If there was a zero star rating I would rate it a zero(0)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Tom",
          "Nb_Reviews": 1,
          "Date": "2017-10-28T00:30:10.000Z",
          "Titre": "Don't use this service",
          "Contenu": "My transcript must have been written by a machine. No human would make so many, dumb mistakes. Worse, whole portions of the transcribed interview were attributed to the wrong speaker. They even got the name of my company wrong at least twice in the transcript.UPDATE: The Rev.com response below suggests I should use their star rating that came on the transcript. But only one of the three transcripts I received had such a system and it was not the one that was most mangled. Further, it appears to suggest that the person who handled the transcript would be punished -- I think this is more of a system failure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ludm",
          "Nb_Reviews": 1,
          "Date": "2014-06-11T19:54:23.000Z",
          "Titre": "Mistakes everywhere. Not reliable.",
          "Contenu": "I asked for a translation for immigration papers, which are really important.\rI received the translation with mistakes, misspelled words and obvious lack of precision in grammar. It looked like they didn't really care or read twice. Then I asked for my translation to be corrected and sent precise instructions. They told me it would be done in a couple of hours. Almost 24h later I didn't receive anything. I called and they say that they didn't receive any emails, while I can see in my email box that they received it...\rAbsolutely not reliable. Especially for official papers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcella",
          "Nb_Reviews": 1,
          "Date": "2018-10-09T18:12:24.000Z",
          "Titre": "Misleading Service",
          "Contenu": "Do not waste your time. Super misleading service!!I order a 1 page certified translations and received an email and phone call that I actually owned them $100 on top of the $33 that I agreed to pay.That is right, they put the prize \"per page\" but you have to go through the website to find that is it actually not charged per page, but rather per word, and it is a super low word count that would never be a 1 page only!Honestly, if someone has the time to sue them for misleading information and services, please do. Guaranteed win.Did you find this a long review? It is apparently half a page according to rev.com"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Potu “Guru” Tromas",
          "Nb_Reviews": 24,
          "Date": "2021-02-02T01:16:59.000Z",
          "Titre": "Unprofessional, hand off!",
          "Contenu": "I've sent 1 min audio to get transcripted.Paid extra 2x that i get work done <1 hours.It's being 6 hours and i am still waiting... Order status is \"Finding Transcriptionist\". I've contacted the support hotline and they say \"this is normal\". Then i've requested for refund but they just ignored my request and answered my other questions...It is totally bad experience for me. Never ever i am gonna use this website again.Edit: Next day i got an e-mail that their transcriptionits were not able to transcribe my 1 min audio... I asked a random american friend and he did it done for me in 10 mins... And this firm claims \"Professional, 99.9% accuracy\". What a joke..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "yariel",
          "Nb_Reviews": 1,
          "Date": "2013-12-08T18:39:48.000Z",
          "Titre": "not worth the price",
          "Contenu": "i spent 20$ to have a form translated because my school told me to use this website and i thought the document that i was ganna get back would be better not a word document of the translated words plus some of the words were not even speeled right"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2014-04-20T01:53:05.000Z",
          "Titre": "Terrible service",
          "Contenu": "I found several mistakes even in basic words. You would expect that the person that is going to translate your grades is somebody who translate taking care of the context.\rIt seems to be translated by Google not by a person.\r You don't seem to care or pay attention to the details.  Even the grades in several cases were wrong. For example my grade was 4.4  and you wrote 4.3. \r I'm glad I understand English and can compare the original documents with the documents you translated. What would happen if somebody who doesn't speak english blindly trust in your services and send it without a previous revision?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Ramsey",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T01:36:40.000Z",
          "Titre": "Rev.com is NOT customer oriented.",
          "Contenu": "This is NOT a customer oriented business!! I submitted an audio file that was almost entirely in Spanish and intended to receive English subtitles from Rev. What happened? For $300, they sent me subtitles in SPANISH. When I called customer service they blamed me for the confusion and refused to refund my order even though they said they would have rejected a file that was mostly Spanish audio for Spanish language subtitles. Not to mention this is during one of the worst economic times for regular Americans since the Great Depression. Talk about not caring about your customers one bit. I'm NEVER using Rev.com again. If you ever have an issue with your order you can be sure they will politely blame it on you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cristofer Ogando",
          "Nb_Reviews": 1,
          "Date": "2014-08-07T00:10:29.000Z",
          "Titre": "I am not at all happy",
          "Contenu": "My name is Cristofer Ogando i placed a order on Febuary 14 2014 order number TR0220016031 I paid 54 dollars to get two documents translated from Spanish to English, My divorse paper and my sons birth certificate, the documents were done correctly but the Certification of Translation Accuracy for my sons birth cirtificate has the wrong name on it, therefore the uscis would not accept it for the petition to bring my son here, i understand everyone makes mistakes, but it should have been reviewed before emailing it to me and corrected, now the process for my son to come here is being held up and i paid 54 dollars for nothing, i am very unhappy about this"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Wilfred",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T21:28:14.000Z",
          "Titre": "Not useful this speech to text, very inaccurate",
          "Contenu": "You promised a 99% accuracy, but only about 70% of the text was correct.Your synchronization was lousy, perhaps 15% correct. Needed 3 hours to correct for a 21 minutes video."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "sarah broderick",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T22:58:56.000Z",
          "Titre": "The subtitles did not show in the video…",
          "Contenu": "The subtitles did not show in the video because they were too low and I couldn’t use the video. It was disappointing. I have sent an email so hopefully will get addressed. Thank you very much"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Kory Luke",
          "Nb_Reviews": 2,
          "Date": "2019-08-14T15:19:55.000Z",
          "Titre": "WARNING! Not Valid Certified Translations",
          "Contenu": "WARNING! \"Certified\" Translations made by Rev.com are not valid with all government agencies.   I used rev.com to translate my birth certificate and divorce certificate for my marriage in Nice, France.  The City Hall in Nice France said the translations by Rev.com were not valid translations and would not be accepted. I contacted Rev.com and was told that they do not offer a Money Back Guarantee for their translations unless its for USCIS......So unless you are translating only for USCIS your translated document is not guaranteed to be accepted.   I wasted $198 on rev.com for worthless \"certifications\".  I should have read the fine print..... Unless you are translating for USCIS DO NOT USE rev.com."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Yavor",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T09:53:51.000Z",
          "Titre": "Not more than 65% accuracy",
          "Contenu": "Not more than 65% accuracy of the captions.Sent back to their Quality team, who determined captions were 'up to their standards'.Had to redo everything myself. Complete waste of money."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Heinz",
          "Nb_Reviews": 3,
          "Date": "2016-12-12T09:43:49.000Z",
          "Titre": "Fast Turnover, Lacklustre Results",
          "Contenu": "I sent in a long webinar to be captioned.  Turnaround time was very fast, but the quality was very bad.  I've had to edit about every second line to make it correct.  Waste of time and money.  Don't use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sid Burston",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T09:25:08.000Z",
          "Titre": "You guys went dark for the weekend",
          "Contenu": "You guys went dark for the weekend. A skeleton crew would be nice instead of a bot that says you'll get back to us on Monday. You did an excellent job on the work, but the follow-up in your QC dept needs a little help. I'll keep using you... but, I am not happy at this moment. Thanks, Sid B."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jonathan Westrup",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T11:10:54.000Z",
          "Titre": "Better communication needed between Rev…",
          "Contenu": "Better communication needed between Rev and customer when something goes wrong (the first captions were, I found out later, unusable) - not just messaging with 'another 3 hours, definitely within 4 hours' and so which keeps people hanging on. Better to more clearly display the fast track option on the website as easy to miss."
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "Amgad Fawzy",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T23:26:59.000Z",
          "Titre": "\"Work from anywhere\"Logo is not true!",
          "Contenu": "I was very excited at first when I learned bout Rev.com and told myself it can be my first freelancer experience but was shocked when I see the statement \"We are not currently accepting applications from your location\" right underneath their logo saying \"work from anywhere\"! very untrustworthy and feel a bit racist too :("
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T04:45:38.000Z",
          "Titre": "unusable",
          "Contenu": "The video captions looked great but I couldn’t simply download it without downloading another app, which the app would not let me use. Most painful process.If you had enabled me to download directly from the editing window  I would have given you 5 stars. I gave you 2 stars because it looked good, but I was unable to use it and went somewhere else to get it done."
        },
        {
          "Note": 2,
          "Lieu": "VI",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T03:10:20.000Z",
          "Titre": "The transcript was not accurate and…",
          "Contenu": "The transcript was not accurate and although I paid for human transcription, I still needed to listen through the audio and fix multiple errors in the transcript that were not due to formatting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luis  Delgado",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T13:24:20.000Z",
          "Titre": "Don't recall",
          "Contenu": "Please I don't recall these please inform what you do ths Luis"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michal Templet",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T05:16:28.000Z",
          "Titre": "Very bad customer service",
          "Contenu": "I hope everyone sees this review because this company is really bad especially when you call to try to get an answer about your bill from day one of service I had many issues with them lack of communication from employee I was always told that they would call me back and never do been very patient and I called and to inform them that I still haven't received a call back it has been 2 months now and still no call backs very terrible wa cannot get a straight answer from these people was told that my monthly bill was going to be a certain amount when I received the bill it was a lot more no one can seem to take care of that issue I was told that they would look into it and call me back 2 months later no calls was considering about going to the better Business bureau I would have liked to deal with the business themselves instead of taking it further still may happen that's how upset I really am about this company maybe someone higher up in the company realize how bad their employees are unless they just don't care"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jenny",
          "Nb_Reviews": 5,
          "Date": "2022-05-15T16:49:31.000Z",
          "Titre": "2-stars due to not being able to move position of captions",
          "Contenu": "The caption service was accurate and the turnaround was quick, but unfortunately the captions were placed over the person speaking, and I didn't realise until after I paid for the service that I can't move them, so I couldn't use the video in my ad campaigns."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Clifton",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T12:26:02.000Z",
          "Titre": "I've been using REV for years and have…",
          "Contenu": "I've been using REV for years and have loved the service. Recently, however, I was made a part of a team for a big collaborative project. What a mistake this was. When I left the team, every bit of my REV history was erased and my account was removed. As an independent filmmaker, I'm extremely disappointed. I wish it had been made clear that joining a team was like joining the mafia - there was no going back to the way it was before. REV should fix this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rosebud Elijah",
          "Nb_Reviews": 1,
          "Date": "2020-06-28T19:35:07.000Z",
          "Titre": "I uploaded two transcripts",
          "Contenu": "I uploaded two transcripts. One was fine. The other had wrong speaker names ascribed. I had uploaded all the names for both transcripts. I now need to go through BOTH transcripts and make sure of accuracy which while I have done when I first received transcripts from Rev, I have never had to do this urgently for inaccuracy.  Am disappointed!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mari Bailey",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T08:37:13.000Z",
          "Titre": "Not a simple process",
          "Contenu": "Whilst the team are very helpful, the app itself is not. It's too technical. I wanted an app that completely had all bases covered and transcribed, added text to videos delivering a finished edit product ready for posting. Sadly not the case, because youu have to source other apps to do that. Therefore I've moved over to another provider."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ryan",
          "Nb_Reviews": 5,
          "Date": "2018-10-22T10:31:50.000Z",
          "Titre": "Good for captions - but if there are errors it's a ball ache.",
          "Contenu": "The captions and all that they do is really good. However if you need to make edits to them, or change any errors. The files do not work when you download them - and you have to contact support EVERY-TIME you have made an edit to get a file that works. I have had this problem consistently and have over 10 videos in captions now by then in 5 different languages. They need to fix this in order to be a viable company."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rueben Derrick",
          "Nb_Reviews": 5,
          "Date": "2019-01-16T16:32:19.000Z",
          "Titre": "Had 7 videos all about 3-4 mins long",
          "Contenu": "Had 7 videos all about 3-4 mins long. After the USA to UK conversion we still had a lot of words which were just someone not listening correctly.About 3 errors per video...worst was about 15.For example, they had typed \"to make this project AS very heartfelt\".but what he said in clear English was \"to make this project IS very heartfelt.Its just someone rushing the job...so in conclusion you DO GET WHAT YOU PAY FOR!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A. B. Millmoss",
          "Nb_Reviews": 2,
          "Date": "2017-11-01T13:31:38.000Z",
          "Titre": "I had an uneven experience",
          "Contenu": "I had an uneven experience. I wanted three parts of the same interview transcribed. The first two parts were done quickly and accurately. But the last part of the same interview with exactly the same sound quality was refused and my money was refunded. Why? They offered a cover-all explanation, but there's no transparency, no appeal. Final verdict: Rev is unreliable. I have moved on to other services."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2017-01-06T00:20:16.000Z",
          "Titre": "Expensive, medium-to-low quality.",
          "Contenu": "Honestly, I expected better for $1 a word. I got my transcript back with tons of [inaudible] stamps that I was able to correct almost immediately, and was filled with spelling errors like 'iderate', which is not a word, when the speaker said 'iterate', which is. I was very surprised, as the service had come recommended. Deeply conflicted over whether to try again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Hoffman",
          "Nb_Reviews": 2,
          "Date": "2018-08-22T13:11:04.000Z",
          "Titre": "there are elements of your service that…",
          "Contenu": "there are elements of your service that I like an element so I do not. The last bit of transcription done for me was particularly bad. And the format that I cannot change is not what I need. I asked whether I could change the format so I didn't have to remove who said what and just keep the words in paragraphs, and the answer I was given was it is not possible. I will keep on using the service but spend a good deal of time when I get a transcription back making it suitable for my purposes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Dorfman",
          "Nb_Reviews": 1,
          "Date": "2014-05-09T22:20:35.000Z",
          "Titre": "Did not represent service correctly",
          "Contenu": "While certain aspects of Rev.com were satisfactory, such as the return time, two of the four hour long interviews I submitted for transcription were full of errors and [inaudible] notations and the other two were certainly not 98% accurate as advertised either. I had to correct these interviews myself, which invalidated my spending nearly three hundred dollars on these transcriptions and took several hours."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2013-09-15T05:46:02.000Z",
          "Titre": "Very low accuracy; transcript largely gibberish.",
          "Contenu": "Rev.com advertises a 98 percent accuracy rate, but in this case it was more like 48 percent. About half of the transcript I received is gibberish: the sentences often don't make grammatical sense. The site, to its credit, was very convenient, fast, and reasonably priced. But in a transcript, accuracy (or at least near-accuracy) seems most important of all. It's not a service I'm likely to use again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stefano",
          "Nb_Reviews": 1,
          "Date": "2014-02-05T03:08:19.000Z",
          "Titre": "Not good at translating at all",
          "Contenu": "Had something translates from Portguese to English because I wanted it professionally done. My fiancée is Brazilian and we noticed numerous mistakes. Lets put it this way. When your professional translation has an actual smiley face icon in it then you know you made a mistake paying for this company. Sure quick translation finished in 12 hours but poor poor quality"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susanna",
          "Nb_Reviews": 1,
          "Date": "2014-02-25T05:36:26.000Z",
          "Titre": "Translated documents are sloppy and full of mistakes.",
          "Contenu": "I was impressed how fast they translated documents. But I had to ask them revise their translated documents several times because they could not even copy what is on the original document. Many misspellings of city names and street names in ENGLISH. On my marriage certificate, they simply had no time to check if my birthday and my husband's birthday are the same before they sent us \"the completed translated document.\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Bortles",
          "Nb_Reviews": 1,
          "Date": "2013-09-20T20:22:39.000Z",
          "Titre": "Transcript rates a D+ only",
          "Contenu": "I had to take two hours to clean up the transcript, especially to clean up the multitude of sections that the transcriber simply identified and unintelligible.  \r I would have rather paid twice the amount, just to have a proper professional value completeness and accuracy over speed.\r I've need for another transcription, but I MUST have better quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lily",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T19:30:12.000Z",
          "Titre": "Quick turnaround, bad product",
          "Contenu": "I used Rev because I needed a recording transcribed fast and Rev could turn it around in a few days. Unfortunately, the transcript was bad. Some of the errors they made were bizarre, for example, transcribing \"legal avenues\" as \"Lee lab news.\" There were entire minutes of audio that weren't transcribed at all. I contacted customer service. When they replied two days later, they told me to give the transcriptionist a bad rating and ask the quality assurance team to examine my file. By that point, I'd already finished editing, and in some cases re-transcribing, the whole thing myself."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Nina Ayalon",
          "Nb_Reviews": 1,
          "Date": "2014-02-24T05:00:23.000Z",
          "Titre": "poorly translated",
          "Contenu": "The translation was poorly translated, included spelling mistakes and incorrect wording.\rWhen I sent a request to have the document reviewed and redone by a different translator I was met by a wall of silence. \rThe translation was unprofessional. I must now have it redone as it is not presentable at an extra cost.\rWaste of valuable time and money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2013-11-06T16:28:52.000Z",
          "Titre": "Lot's of typos!",
          "Contenu": "Glad I proof read before I sent.  I listened to the recording as I read the document provided to me and there were some mistakes that would have been really embarrassing.  The person I was conversing with did have an accent, but very easy to understand.  There were some parts marked as \"inaudible\" which seemed pretty clear to me.  Overall, very fast turn around, but I would have preferred it taking a little more time and being done right!"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Lucie",
          "Nb_Reviews": 1,
          "Date": "2014-02-12T00:02:51.000Z",
          "Titre": "Disappointed....",
          "Contenu": "When calling for a quote you are told rev.com can do pretty much everything and, they will take in account your requests in every step of your order but after paying you realize that even the simplest request (like placing the documents in a certain order before mailing) cannot be accommodate as it's not the policy. If you leave abroad and need translations for an admission or any other official procedure in the US, I wouldn't recommend rev.com."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leila Kilic",
          "Nb_Reviews": 2,
          "Date": "2019-05-10T18:00:11.000Z",
          "Titre": "Sudden deactivation",
          "Contenu": "Sudden deactivation - no feedback on what went wrong or how to improve.  Was just getting into the groove and transcribing and had the whole formatting guidelines memorized.  It's long hours with low pay, but as an at home mom, the convenience of how and small amounts coming in was nice."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2016-03-19T22:59:53.000Z",
          "Titre": "Poor transcriptions and translations",
          "Contenu": "I've used both the translation and transcription services - about US$450 worth - and I've been very disappointed with the quality across the board. The translations had to be redone locally as people told me they looked like Google Translate, and the transcriptions were riddled with errors. I had to spend countless hours correcting all the errors. I should have just done them myself to begin with. Avoid at all costs if you're serious about quality and have ongoing work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tabs",
          "Nb_Reviews": 1,
          "Date": "2014-02-18T01:06:47.000Z",
          "Titre": "Had better results when it was Foxtranscribe",
          "Contenu": "I know my audio might have been a little hard to hear (due to cross-talk) but the amount of mistakes on my 4 minute transcription was ridiculous. Considering how short it was more time should have been taken to make sure the dialogue was right.  I paid extra to have it typed verbatim and timed stamped and that was not done.  Disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brent Baughman",
          "Nb_Reviews": 1,
          "Date": "2017-10-16T13:34:53.000Z",
          "Titre": "Did not deliver on time",
          "Contenu": "In the past Rev has delivered our French Subtitles fast, but this last project took over a week and they did not keep in touch and update us. This kind of unprofessionalism and inconsistency will have us look elsewhere in the future. I would have given one star if not for timely first projects they did."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jose Ferreira",
          "Nb_Reviews": 2,
          "Date": "2017-12-27T23:18:39.000Z",
          "Titre": "Rev fb",
          "Contenu": "For me it wasn't about speed, was about quality. I ended up spending a lot of time reviewing the transcription, a significant amount of words do not match the audio file. On top of that, the need for verbatim was ignored. To note that verbatim request was only made after the order was placed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2017-02-11T07:30:26.000Z",
          "Titre": "VERY POLITICAL",
          "Contenu": "I ran into an unexpected problem with Rev- They are very political.If you are conservative, or if you dare to impugn liberal dogma, they will refuse to caption your file. worse...you will find out two or three days later, when deadlines are in your face.I have a weekly TV show, and have a very tight schedule.I lost three shows due to this, so I had to stop using them.They should disclose this heavy bias. I had to use re-runs,  and advertisers bailed or asked for refunds.This cost me over $20,000. Never again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Quintina Lee",
          "Nb_Reviews": 1,
          "Date": "2013-10-14T18:15:02.000Z",
          "Titre": "1 transcript left incompleted",
          "Contenu": "I sent and paid for 3 audios to be transcribed but the longest one only has 14 out of 34 pages completed. My deadline is today. I have  sent 2 emails called 3 times and left 2 voice messages. I am about to be let on my submission deadline for school. Please have somone contact me asap regarding this issue 678-787-7243"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Brennan",
          "Nb_Reviews": 1,
          "Date": "2014-03-26T18:29:25.000Z",
          "Titre": "Fast turnaround, disappointing results",
          "Contenu": "My experience with Rev was disappointing - the sole advantage to the output file I was given was in my not having to start completely from scratch when redoing the transcription.  There are enough mistakes (not malicious ones, just the sort of thing that results from working too quickly and not properly connecting words with context) to render the document unreadable and I am now having to go back over the entire 13 page document and reconstruct large sections.  \r I will not be using Rev again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2013-11-11T15:59:10.000Z",
          "Titre": "not impressed",
          "Contenu": "I'm pretty disappointed with rev.com right now. I expected a high degree of accuracy, yet there are misspellings (common words, not technical jargon) and numerous \"inaudible\" notations when the recording is clearly audible. Additionally, some of my transcript is just wrong! I'm having to listen to all of my audio and fix the mistakes myself, which I really don't have time for right now. If I wanted to do this much work, I would've transcribed my recording myself. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2016-08-30T21:20:16.000Z",
          "Titre": "I HAD TOO MUCH TO GO BACK AND CLEAN UP!",
          "Contenu": "I HAD TOO MUCH TO GO BACK AND CLEAN UP!I also don't like the fact of having to pay an additional payment of $7.00 for a recording that was only 59 minutes.  Your assessment was 66 minutes.  After checking several times i still don't find it to be as you assessed me."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "N Quigley",
          "Nb_Reviews": 1,
          "Date": "2018-08-02T00:48:54.000Z",
          "Titre": "Can't transcribe part of a clip",
          "Contenu": "Unable to offer transcription of a portion of a video - they wanted to take extra time and money to do the whole thing. You'd think this is a fairly basic expectation of a transcription service.Customer service was friendly but unhelpful and, despite asking for shortened turnaround, twelve hours after the order was placed and a couple of hours after begrudgingly accepting their arguments about needing to do the whole file I still haven't received my transcripts.Also worth noting that their customer service doesn't seem to be 24hr, so bad luck if you're not in the US."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacqueline Horwitz",
          "Nb_Reviews": 1,
          "Date": "2017-10-09T07:13:17.000Z",
          "Titre": "I ordered several transcriptions on a …",
          "Contenu": "I ordered several transcriptions on a Friday afternoon. They advertise that they have a 12 hour turnaround for files under an hour, but mine were not completed in a 24 hour period. And most of my orders had not even begun after said 24 hour period. Customer service was eventually prompt and helpful but my order was not completed, and I ended up having to cancel it. I have used them several times in the past, and usually, they are okay. I have had them cancel orders on me before. While I was a loyal customer previously, I would no longer use their services again in the future."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jean Sahyouni",
          "Nb_Reviews": 1,
          "Date": "2013-11-12T18:46:09.000Z",
          "Titre": "Very weak translation, I got a word for word translation.",
          "Contenu": "Hi,\rI accepted to pay around 200 $  so I can have a professional translation, not a google English French translation.\rI am not asking for any reimbursement but simply send me a professional translation.\rPlease check it yourself and get back to me.\r Thanks,\r Jean Sahyouni"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2013-07-29T22:31:27.000Z",
          "Titre": "Not sure it's worth the money",
          "Contenu": "A lot of the transcription is listed as \"inaudible\" but really it just takes a couple minutes to slow down and listen to it carefully. I'll have to go back and listen to much of the recording myself ... seems to defeat the purpose of paying someone else to do it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2018-12-26T14:25:10.000Z",
          "Titre": "Disappointed.",
          "Contenu": "Purchased this transcript order not knowing that the interview in Spanish would not be transcribed in Spanish. And once I received the transcripts and contacted the customer service team, I was told that I would  not receive a refund. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 2,
          "Date": "2014-06-08T15:15:03.000Z",
          "Titre": "I was very dissatisfied with the translation.",
          "Contenu": "The document was not translated properly and it was really a one page document and not two. I would have thought that someone would have called upon seeing it was only one page and not two. But if course I paid for two pages. Also, if you didn't understand the wording, again , someone should have called to ask. This was for immigration services and the word for immigration was misspelled, not once, but twice. The person you had translate this document obviously does not know how to translate. I knew I should have used Certitrans instead and they are cheaper."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Uche",
          "Nb_Reviews": 1,
          "Date": "2013-10-13T13:16:05.000Z",
          "Titre": "I am not happy...",
          "Contenu": "Order TC0344269602 (Focus Group Interview)\r I sent my focus group on Oct. 4 for transcription and I indicated that there where five speakers. However, on Oct. 6, I sent a message indicating that there were actually six speakers. On the same date I received a message from Breetel Graves, Support Manager, replied,  \"I have passed your message along to our transcription team.' When I received my transcription/document on Oct. 9, it indicated five speakers. I do not know what to do now because the transcription may not be used because of that/confusion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Visual Education Specialist",
          "Nb_Reviews": 1,
          "Date": "2017-12-28T18:13:56.000Z",
          "Titre": "Not worth the time or money",
          "Contenu": "Pros: Rev admitted their transcriptionists were not producing quality work and made multiple attempts to improve. Cons: Three transcriptionists worked on my file over four days. None of them used the glossary I provided and the transcript was full of errors and omissions. Additionally, there were so many [inaudible]s that the transcript was unreadable. I was unable to use the transcript, so hired one of Rev's competitors, who had no problems delivering an accurate transcript in 12 hours with only four [inaudible]s. Note - Audio was a 45-minute lecture on a medication's side effects."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "notorious",
          "Nb_Reviews": 2,
          "Date": "2014-11-09T05:33:45.000Z",
          "Titre": "plenty of mistakes",
          "Contenu": "too expensive for this many mistakes and missing words. I tried asking customer service and they think it is perfect.  I need to get red marker out and really go through it, then will have to do a word count and see if they failed to meet their 98% mark like they promise."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 1,
          "Date": "2014-01-24T04:48:48.000Z",
          "Titre": "Done by amateurs!!!",
          "Contenu": "I will start by admitting that there was quite a bit of talking by young children on some of my recordings, but there were several places where it was marked inaudible or things were typed incorrectly. When I went back and listened to the \"inaudibles\" there audible was maybe a little difficult but not so difficult to where someone couldn't tell what they were saying. In other places there were several typos or other grammatical errors. Errors I would not expect from a \"professional\" company. I would not recommend this company to anyone else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 5,
          "Date": "2021-03-18T21:20:46.000Z",
          "Titre": "Turnaround was promised in 18hrs",
          "Contenu": "Turnaround was promised in 18hrs. Received in 24hrs which put me in a tricky position w my corporate client.  Would have appreciated a more accurate timeline at checkout so that I could have opted for rush services."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Romana Chapman",
          "Nb_Reviews": 8,
          "Date": "2014-03-07T21:06:49.000Z",
          "Titre": "judged too quickly - disappointed",
          "Contenu": "I wrote one review recently to say that I was impressed by the speed these translations and certifications were made. And that is still the case. BUT, now that the papers have arrived, we realize that one document is missing a signature - a fatal mistake. I was told  by Rev that they will not mail papers abroad, so need to give them a US address. Well, the only address I can give them is now only valid for another 12 days including two weekends, therefore I doubt they can get the corrected papers there on time, apart from the fact that this process now takes far too long. \rVery disappointed!"
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Yasir",
          "Nb_Reviews": 1,
          "Date": "2014-05-28T10:29:35.000Z",
          "Titre": "Fast service, mediocre quality, greedy pricing.",
          "Contenu": "I submitted one page to be translated into Chinese. The word count was less than 180 words in total. But I was told to pay for 2 pages!!!!!!! The excuse being the a small table with a few numbers and no text had to be typed up, and the translator must be compensated for those few additional key strokes!! Frustrating. \r The biggest issue I have with Rev is that the quality turned out to be sub-standard. An official document was translated into something closer to spoken Chinese than official Chinese. \r Overall, if just want to get the gist of something then consider Rev. For an official translation look elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2014-01-15T23:23:36.000Z",
          "Titre": "REV service very limited",
          "Contenu": "REV provides a great service if you want a transcript.  If you want a letter or other document typed, find another service product.  I would liked to have sent a lot of business Rev's way but they don't offer the kind of service I require."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T22:44:34.000Z",
          "Titre": "Many of the vids were captioned…",
          "Contenu": "Many of the vids were captioned correctly.  Thank you.Yet, several words were misspelled--admiral became \"Adam man\"; ensign became \"enson\"; Annapolis became \"Shatannapolis\".  And finally, the word \"Hooah\".  Three of our soldiers used it.  It was spelled in multiple ways, and rarely the same way twice.  It ranged from \"who-ah\" to \"Oh-hunnah\" to \"Oh-hah\".  One incorrect spelling would have been fine since it isn't common civilian verrnacular, but having it spelled so many way as if being comedic was strange and unprofessional.Thanks for your service.  It was decent but not good. We'll likely contract the next project with another company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lindsey",
          "Nb_Reviews": 1,
          "Date": "2014-01-13T15:09:12.000Z",
          "Titre": "LACK OF QUALITY AND CONSISTENCY",
          "Contenu": "The translation took four days, not everything was translated, and some words I double checked in Spanish were not words in Spanish or English--perhaps typos, but I do not know the language to know what the word was originally supposed to be. The representative with whom I spoke suggested I use Google Translate for remaining untranslated items---which is not why we paid Rev.com for a document. \r We have used rev. com in the past and been happy with how translators have gone above and beyond, this time is felt like the complete opposite experience and we will not be using rev.com again in the future as a result of a poor publication."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2017-09-28T01:26:11.000Z",
          "Titre": "Poor",
          "Contenu": "Cheap and fast transcription service but transcribers did not use list of terms and place names that was provided. Lots of errors and inaccuracies. Disappointing overall. Will pay more for a higher quality service in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2018-06-13T16:08:04.000Z",
          "Titre": "Inconsistent Quality, Lazy Employees, Racist and Culturally Incompetent",
          "Contenu": "Quality is very inconsistent, depending on who transcribes your audio files. Some files are done very well, and you can tell the employee put time into it. The majority, however, were done very poorly--employees were not putting any effort, and they marked well-articulated and clear words and sentences as [inaudible]. It was so frustrating to have to redo the transcripts myself. Another issue that really frustrated me--most ethnic names were marked as [inaudible]. Rev really has to train its staff on cultural sensitivities and increase the diversity of their employees. This was a very frustrating and microaggressive (not to mention costly!) transaction I've ever done."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "LMFH",
          "Nb_Reviews": 1,
          "Date": "2013-10-18T07:10:57.000Z",
          "Titre": "I used fox translate and got a much better product - this one was not nearly as good!",
          "Contenu": "The documents I asked to be translated we translated quickly, but did not come back looking very professional.  The fonts were different, they did not place the headers or format the documents in the same manner in which the originals were presented. They just lacked the detail of the originals that I sent.  I expected to see the same document - formats - symbols - headers - type face - everything the original had, but translated into Spanish.  Instead I got a document that looked like my 11 year old did it and it was just translated.  All the spaces and headers jumbled up. I don't know if I would use this group again.  Way too expensive for what you get."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T13:53:50.000Z",
          "Titre": "Captions for songs are not good",
          "Contenu": "The captions for the songs used to be good,but have steadily gotten worse. It started with them not staying up long enough to actually complete the words listed. This last was the worst that I had seen. One song, they stayed up about 20% of the time needed, but at least they started right. Another song, they didn't start with the words, but they ended at the appropriate time, but still only up about 20-25% of the time needed. Another song they didn't start at the right time or end at the right time. For example - a line with 12 words, the caption popped up about 5 words in and went off with about 3 words left to be sung. I had to spend about 30 minutes editing the captions. I am lucky that I use Premiere Pro so it is not a super hard edit, just time consuming."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronda Callister",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T00:35:53.000Z",
          "Titre": "I have submitted eight recordings",
          "Contenu": "I have submitted eight recordings.  I have asked for revisions on 4 of them.  These are long complicated recordings (over 90 minutes each) with typically 9 people participating in a focus group.  The first twenty plus pages are very well done and then it appears if the transcriber takes a break all numbered identifies of the participants disappear and every comment is listed as \"respondent\" or \"participant\".  REV has agreed to redo these.  Which is great, but the response is much slower with those being redone.  I have not received any of the revisions back yet to know how much time these will take.  But my people expect to start working on the data in two days - we may have to use the bad ones."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Andriate",
          "Nb_Reviews": 1,
          "Date": "2018-11-12T19:13:01.000Z",
          "Titre": "Subtitles require SIGNIFICANT…",
          "Contenu": "Subtitles require SIGNIFICANT adjustments whenever I buy them. Also I bought transcripts without timecodes and had to purchase them again without getting a refund. Very keen to find a better service than Rev."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Justine Northcott",
          "Nb_Reviews": 2,
          "Date": "2018-05-22T10:20:21.000Z",
          "Titre": "I was very disappointed with the Rev…",
          "Contenu": "I was very disappointed with the Rev transcription, it was littered with errors and I had to listen to the audio file to make sense of it - not at all the point of why I paid to get the transcription done."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Guilherme",
          "Nb_Reviews": 3,
          "Date": "2013-11-11T23:33:01.000Z",
          "Titre": "Too many turns to get the final result",
          "Contenu": "I asked the translation of 3 documents on the service. Two of them came with errors and needed to request two times minor corrections on the documents... all mistakes were clearly by lack of attention on the review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "My Story",
          "Nb_Reviews": 1,
          "Date": "2017-05-27T14:39:06.000Z",
          "Titre": "Incorrect translations",
          "Contenu": "Incorrect translations, after reaching out to support it took too long for them to offer to change.  I had to go elsewhere to fix 2 out of the 3 translations.  Seems like quantity is their focus, not quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lou b",
          "Nb_Reviews": 1,
          "Date": "2014-06-18T20:32:49.000Z",
          "Titre": "Not good",
          "Contenu": "It seemed pretty efficient initially. I received the translated document within hours. However , it came with many typos. I requested a corrected document and I'm still waiting over 24hrs later for a response."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-09-26T08:49:25.000Z",
          "Titre": "Account deactivated nonsense",
          "Contenu": "I have been on Rev as a transcriptionist for 6 months approximately. I loved working for Rev as a mommy.However, my account got deactivated yesterday and I am really disheartened. Working at Rev is fun but it is not easy. I put in so much effort in my work and the Revvers who mark our work are just too harsh.The only thing that I needed to improve was my accuracy. But even so, in marking the work they seem unreasonable at some instances.This company would get a 5 star from me once they take care of us freelancers. Show us that you are human and we deserve a good pay.I spend hours working on my projects which I completely love love love. But then having to come back to a wack metrics accuracy score and corrections that are really not a big deal and don't change the meaning of the sentence.I don't know really. Disappointing to say the least."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 2,
          "Date": "2015-12-14T22:19:14.247Z",
          "Titre": "Rev.com Transcription",
          "Contenu": "When I submitted an audio file for 24 hour transcription, the price seemed competitive - especially for the turn around time. When I later read the fine print that 'poor audio' or files longer than 1 hour were not covered by the 24 hour policy, I toyed with canceling. But, I figured, how much longer could 20 additional minutes take? Figuring 48 hours still fit my needs, I let it go. When I rechecked my account, the time was updated to FOUR days. I called to find out why and was only told that several people had started and bailed on my file. No reason given for the extreme delay. The service reps were friendly but ultimately offered little sympathy or any alternative workarounds. I doubt I would use the service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan Palmer",
          "Nb_Reviews": 1,
          "Date": "2017-07-27T03:30:17.000Z",
          "Titre": "Transcript has several gaps and is …",
          "Contenu": "Transcript has several gaps and is missing parts of the recording.  It also has some of the quotes mis-attributed. I am now having to go back through and try to piece together the gaps myself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MF",
          "Nb_Reviews": 1,
          "Date": "2019-11-07T02:04:38.000Z",
          "Titre": "Disappointed",
          "Contenu": "I've used rev for a short time, and initially it was great. I've been using it to record phone interviews and transcribe them for a research project. Unfortunately, today it failed to record two interviews. When I went back to retrieve the call recording, all I got was 9 minutes 59 seconds of silence (for both calls). A call to customer support revealed that the app has been having technical issues and that the recordings were indeed lost. These were critical interviews and it was a blow to lose the recordings. Then I had to scramble to find an alternate call recording app to use for interviews scheduled for tomorrow, since I obviously wasn't going to attempt using Rev again. Giving two stars because when it worked it was great, but the loss of the two calls was quite the blow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2014-03-14T02:54:52.000Z",
          "Titre": "Quite disappointed",
          "Contenu": "A friend recommended Rev.com and I felt relieved that I finally found a reliable company to translate my birth certificate. The turnaround was very quick, as promised. However, there were multiple mistakes, some grammatical, and some were just careless (translated two different cities when the seals were exactly the same). A lot of the handwritten parts were marked \"illegible\" that I ended up having to translate myself...very very disappointed...\r When I emailed support with comments and asked for revision, I did not get an apology at all. But instead, the email said, \"Please be aware that if your correction request asks that we change, add or omit anything that is not on your original document, the request will be denied.\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 1,
          "Date": "2014-07-01T16:24:25.000Z",
          "Titre": "Turnaround time A+, dictation to transcription accuracy D-",
          "Contenu": "I was very excited to see that the typed transcript was returned to me in record time.  I submitted the audio recording Friday afternoon and received the typed transcript on Saturday early afternoon.   BUT, when I compared the audio with the typed transcript, I found several mistakes on each page.  Some of the mistakes changed the entire meaning of the dialogue.  With the sheer number of typed errors I have to assume a live person did not transcribe the audio files.  I now have to take time out of my day to sit through the entire audio recording to correct the typed transcript line-by-line.  For that I am very disappointed and unless you can guarantee better results, I will not likely use your services again nor will I recommend your services to anyone I know."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2014-04-20T07:57:52.000Z",
          "Titre": "It would be cheaper and of better quality to hire a chimpanzee at the zoo.",
          "Contenu": "So, I saw rev.com had these rave reviews and I thought I would see if they offered certified transcription. They do not. With that in mind I thought I would try them out anyway because their credentials seemed legitimate. I sent two audio .wav files and had the transcripts back within a day..\rThat's great they were done so quickly, but they were absolutely worthless transcriptions. Every other word was not even remotely close to what was said in the conversations. Now I try to be understanding and acknowledge that one of the files had background noise, but the conversations in both files could be heard clearly and transcribed efficiently. \rI contacted rev.com and received a whopping 25% of the total cost as a refund. I will never use them again and strongly discourage anyone else from using them."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Sele",
          "Nb_Reviews": 1,
          "Date": "2014-04-06T13:23:19.000Z",
          "Titre": "English to Japanese resume translation was bad",
          "Contenu": "To my disappointment translated resume could not be used as received. Mistakes showed that the translator lacked experience with concepts from IT and words fitting for a resume."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GL1234",
          "Nb_Reviews": 1,
          "Date": "2014-07-23T20:31:21.000Z",
          "Titre": "the 24 hour turnaround is not honored",
          "Contenu": "I recently purchased a certified translation (2 pages), but it's taking longer to receive back.  the site states it takes only 24 hours and more than 48 hours have passed."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Vince Love",
          "Nb_Reviews": 2,
          "Date": "2018-06-19T08:54:49.000Z",
          "Titre": "Lots of mistakes in the work",
          "Contenu": "Lots of mistakes in the work. We had to go back and make so many checks and corrections it cost more than the transcription fee. Quality with Rev is very hit and miss."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Walsh",
          "Nb_Reviews": 1,
          "Date": "2018-06-13T16:35:15.000Z",
          "Titre": "There were a few points throughout the…",
          "Contenu": "There were a few points throughout the transcript that did not match what I heard on the tape. More gaps in the transcript than I would expect for a paid service."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2019-11-28T19:18:54.000Z",
          "Titre": "Not as good as last time",
          "Contenu": "Unfortunately, the latest transcript isn't very accurate so I will have to spend a lot of time correcting it.  Previous transcripts were much better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Latimer",
          "Nb_Reviews": 1,
          "Date": "2019-06-06T23:43:28.000Z",
          "Titre": "Very inconsistent",
          "Contenu": "Very inconsistent. Sometimes the transcription are on point other times I desire my money back. Last transcription was fraught with misspelled words."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "She Navalta",
          "Nb_Reviews": 1,
          "Date": "2019-09-19T08:13:04.000Z",
          "Titre": "Poor quality transcriptions",
          "Contenu": "My job is to create show notes for a podcast. That is supposed to be my only focus in what I am doing. Part of my work is cross-referencing my show notes with the transcriptions. However your transcribers is really doing a poor job in creating those transcripts and don't even take the time to find out the correct spelling of the names, capitalizing the names, and not even bothering to understand and just write inaudible when the words are easily identifiable. It has now became part of my job to correct those mistakes. I am a transcriber too so I know what makes a good transcription and I say the transcriptions you provide are poor and mediocre. For the rate you are charging, it's not worth it. Better run in auto-transcribers that are free. I guess part of the reason is how poorly you pay your transcribers per audio minute. Don't you have someone who checks the quality of these transcriptions? You should have one!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kush Desai",
          "Nb_Reviews": 1,
          "Date": "2013-09-20T00:30:47.000Z",
          "Titre": "Not Satisfied.",
          "Contenu": "Rev.com completed this order for me very quickly but the transcription had two major mistakes in interpretation that changed the meaning of the sentence."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Benedict",
          "Nb_Reviews": 1,
          "Date": "2013-08-15T16:51:51.000Z",
          "Titre": "Incorrect translations and multiple corrections required",
          "Contenu": "I had the strong impression that the translation was actually an internet translation. In other words, it seemed to be a computer-generated translation. I had to edit the translations multiple times and when a misspelled city was addressed several time, it still wasn't corrected after 3 times. After 3 times I just gave up. I just find it outrageous that I have to go through the translation and make sure it is right before printing it. Lucky thing that I also speak the other language fluently, but somebody who has no clue about the language would get a totally erroneous translation. It is unacceptable. The documents I requested to be translated are for immigration purposes, therefore they need to be 100% accurate. The same problem happened in three different cases. Had I not asked for corrections, I would have had incorrect translations, which defeats the purpose of paying a company to do a translation for you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "meetings",
          "Nb_Reviews": 1,
          "Date": "2019-03-19T16:26:49.000Z",
          "Titre": "one transcript was done very well but a…",
          "Contenu": "one transcript was done very well but a second one missed the names and categorized half the meeting as \"background talking\"....."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Marilyn",
          "Nb_Reviews": 1,
          "Date": "2014-03-10T22:36:46.000Z",
          "Titre": "not good",
          "Contenu": "some names on my marriage certificate are misspelled,great translation but i also missing the original stamps,this is for immigration services."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Honest Abe",
          "Nb_Reviews": 1,
          "Date": "2014-08-01T17:04:02.000Z",
          "Titre": "Quick transcription, but full of errors",
          "Contenu": "I paid for all the Rev upgrades, but found that the end result contained many grammatical and spelling errors that needed to be fixed by hand."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "John Pollack",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T14:01:02.000Z",
          "Titre": "Recent downturn in formerly great service",
          "Contenu": "I've used Rev for a couple of years and generally have been very happy with the price, speed & quality. I especially liked when they added the ability to adjust the timecode after transcription.But recently I've had a few bad experiences.1. After uploading a file with an error, customer service was too slow to stop it and I was charged in full for the transcribing a 21-minute file which only had 3 minutes on it. They did give me a $10 credit, but it was a disappointing experience as I contacted support immediately. And they didn't respond for about 30 mins.2. a transcript was recently delivered late3. another transcript they pulled back to re-do for not meeting quality.  While I would rather have the mistake corrected than left sub-par, this series of events leads me to believe the quality of service is dropping.I only make these comments as constructive criticism as I generally have been happy with the service and would like to see it maintain it's former quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thorin",
          "Nb_Reviews": 1,
          "Date": "2014-07-01T15:54:32.000Z",
          "Titre": "Hard transcription rushed w/ lots of errors, no speaker names, useless",
          "Contenu": "We submitted a 90-minute roundtable panel with roughly a dozen speakers. Obviously that's a difficult assignment. Audio quality was not great (1 H4N recorder for the whole room). We provided speaker names, and the audio starts off with each speaker introducing themselves. \r The transcribed text only includes speaker names on the actual audio where the speakers introduce themselves, the rest of the recording only has Voice #20, etc. No effort was made to matchback to their introduction. In addition, many of the comments were transcribed incorrectly and much of it was deemed \"inaudible.\" This transcription is nearly useless, we'll have to go back and re-listen to everything before we use it. \r I know this was difficult audio to transcribe, I would have certainly accepted some mistakes if it was mostly a usable transcription. But the end result is not usable. Based on this experience, I could not recommend Rev for this type of audio transcription."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Steven Pell",
          "Nb_Reviews": 1,
          "Date": "2018-06-06T12:28:58.000Z",
          "Titre": "Took too long",
          "Contenu": "Took too longNo visibility on specific timing. Took too long to be returned. No ability to edit or understand job once submitted."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T23:15:24.000Z",
          "Titre": "Needs to take more care-and complaint review is poor",
          "Contenu": "I have had mostly good experience with Rev when the transcription is totally 100% straightforward. I gave them an important interview and instead of slowing down the recording to get all the words, the transcriber just labelled it as 'crosstalk' missing out some key bits that I needed in the transcript. For a service that is competing with transcription software, this is probably the Unique Selling Point- a human can make this extra effort. Especially at a dollar a minute. I asked customer service to look at it, and have been told they would, but it was not dealt with same day. They advertise a 24 hour service, but when something went wrong the delay was indefinite. I wish I had a 5* to share because I liked this company a lot before this experience.*update- a full business day lost without being able to send my transcript to my research participant for approval and no indicator of when it will be rectified: I really expected better in putting right the order that's now very late in its proper turn around."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T20:59:43.000Z",
          "Titre": "The font and style of the captions is…",
          "Contenu": "The font and style of the captions is not visually pleasing and it doesn't seem like there is a way to edit these."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2014-06-09T18:29:00.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Was looking for translation for marriage license. Town hall did not accept document. One pro was document was translated quickly."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "reed",
          "Nb_Reviews": 1,
          "Date": "2014-05-11T11:17:35.000Z",
          "Titre": "7 days with no response",
          "Contenu": "i paid us 39 for transcriptions a week ago.  my money is gone, but i have no news of any work being done on the transcription."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2014-07-16T18:41:04.000Z",
          "Titre": "Fast, great customer service, but poor quality overall",
          "Contenu": "I sent 6 files to the company. They were transcribed incredibly fast. However, large chunks were labelled \"inaudible\" and many of the words were not corresponding to the actual audio. \r When I enquired, customer service did their best to have the scripts changed. However, more and more mistakes became apparent. In addition to this, I asked for specific labels on all scripts, which hadn't been done on several. Customer service changed this, but still, it was hard work getting formats the same. The margins are different on each script and like I said, half seemed like guess work. \r The accents were not difficult (English), one Scottish (not strong). I seriously cannot see why it was so hard for the transcribers. I also think each script was done by a different person. \r The most positive part was Amity. This person did their best to help me and went the extra mile to fix things. It is a shame this person wasn't the person transcribing! it would of been much better. \r Thanks to Amity, but I won't be using the service again."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2013-08-08T14:10:55.000Z",
          "Titre": "Accuracy not great",
          "Contenu": "Accuracy very patchy, wouldn't recommend unless you don't mind proofreading, in which case it could be good value"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tanya",
          "Nb_Reviews": 1,
          "Date": "2014-01-01T07:01:57.000Z",
          "Titre": "Inaccurate when it counts",
          "Contenu": "There were many areas throught the dictation that were clearly audible that we're not transcribed accurately at all."
        },
        {
          "Note": 2,
          "Lieu": "CY",
          "Pseudo": "Craig Beck",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T05:02:40.000Z",
          "Titre": "Not great",
          "Contenu": "Paid extra for verbatim copy - didn't get it. Won't be using their services again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darin",
          "Nb_Reviews": 1,
          "Date": "2014-02-05T23:07:41.000Z",
          "Titre": "A lot of Inaudibles marked, felt there could be more effort to figure out",
          "Contenu": "Going to have to go back and spend a lot of time putting the document together because of so many Inaudibles marked."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Emma",
          "Nb_Reviews": 6,
          "Date": "2013-10-12T11:24:30.000Z",
          "Titre": "Very variable quality, too much time to check the company's accuracy",
          "Contenu": "The service is cheap (about half the price of the transcriber I have used for the past 5 years) and the quality reflects the pricing. Your files will all be sent to different transcribers - some are fantastic, others are unacceptable in quality. I had one interview returned with 20% transcribed as [inaudible]. On listening, the volume was fine, the accent was minimal and the words were very clear. The company re-did the transcription and it was somewhat improved, other files I simply re-did myself when I checked them. Transcription is not verbatim, and sometimes the transcriber changes the meaning of the text so careful checking is required (such that I I could have transcribed it myself). In one interview, the transcriber wrote the wrong word every single time it was (clearly) spoken, despite that word being obviously in the job title.  The company did try to correct interviews when I complained, but the quality is so variable and requires so much checking, I decided not to continue with my large project through this transcribing service - too much wasted time checking the accuracy of the work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rafael Solorzano",
          "Nb_Reviews": 1,
          "Date": "2020-04-26T18:05:03.000Z",
          "Titre": "There was a couple of paragraphs…",
          "Contenu": "There was a couple of paragraphs missing from the transcription at least 5 minutes worth of the interview."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2017-10-15T21:30:20.000Z",
          "Titre": "Transcription good. Price, not so much.",
          "Contenu": "The transcription was quite good, but not when you compare to the Temi transcription which was 1/10 the cost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A McJ",
          "Nb_Reviews": 1,
          "Date": "2018-04-13T03:53:31.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed. I had to go back and add so much. Will never use again, money wasted!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2013-08-28T01:29:58.000Z",
          "Titre": "Would not recomend it  because translators made mistakes",
          "Contenu": "Not sure if it will be accepted by Russian embassy---since were mistakes I have to correct"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2016-09-15T21:07:49.000Z",
          "Titre": "Website unclear as to who will accept their translation. NOT \"100% Guaranteed Acceptance\" by all.",
          "Contenu": "I needed a marriage certificate translated in order to get a driver's license in a new state. After searching many online sites, I found Rev.com and because of their advertised 100% guaranteed acceptance, I used their service. The turnaround time was quick and I thought all went well. Until I tried to use the certified, translated copy at the BMV in Indiana to get my license. The BMV requires that the certification letter state that the translation was not done by a friend or relative. (This is not the fault of rev.com, obviously.) So, I called their 800 number and spoke to a very nice woman to ask if they could add that verbiage to their letter for me. I was informed that they could not and that their translations are not typically accepted by DMV offices. She said if I had indicated on my request that that is what I was using it for they would have advised me against using their service. I asked for a refund since I could not use the translation they gave me and I felt that their website was misleading or at the very least unclear about who would accept their translations. Especially if this is something they are aware of. I was denied a refund. I am very unhappy with the fact that they, the translation experts, did not make it clear on their website that their services are not accepted by a very specific government office."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FungusCrew",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T22:37:42.000Z",
          "Titre": "Just a middle man that pockets half your money",
          "Contenu": "This is to transcription what Doordash is to food delivery. You'll get varying results because it is a sweatshop. They charge $1.25 and pay their freelancers 30-60 cents per minute for inconsistent results. Google it.The people sign an NDA but that doesn't mean that your stuff is private. It just means they'll fire someone for sharing it. Your info could be going to ANYONE. You don't get to pick and choose because to do that you'd have to hire an individual. And the fact that they pay so little and mistreat their freelancers doesn't reassure me that people are motivated to care that much.Some of your instructions can be followed but it's not the same as being able to tell someone what you need and them understanding. They ARE REQUIRED to transcribe every fart, whisper, and private moment whether you want them to or not. You cannot tell them to leave it out.If you need things transcribed frequently, might as well hire someone for the same amount who can follow individual instructions and know exactly what you want, and be paid properly. They'll probably do a better job as well since they're not having to do twice the work for the same amount of money.The only plus is it takes slightly more effort to go find a transcriber on Fiverr or somewhere people advertise than it does to drop your file into the slot. Rev is just an infrastructure of convenience that the slimy owner paid someone else to build. But like I said, if you are needing transcription done regularly, better hire someone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2013-09-12T03:25:50.000Z",
          "Titre": "fair to poor transcription with numerous proofreading errors",
          "Contenu": "fair to poor transcription with numerous proofreading errors. won't use again"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Rasel HASAN",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T23:55:56.000Z",
          "Titre": "It is simple..",
          "Contenu": "I just like this because it is very easy and simple...I thik everyone who want to do this, they will be like...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 3,
          "Date": "2022-10-21T03:36:42.000Z",
          "Titre": "Good results but not user friendly",
          "Contenu": "Good results but is not user friendly at all for professionals who are not familiar with the video editing/file type vernacular. They could fix the UX for a normal person. Also the site cannot be used on mobile."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Blue",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T22:51:23.000Z",
          "Titre": "I didn't receive any email notices of…",
          "Contenu": "I didn't receive any email notices of when the transcripts were ready for download :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "vel",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T14:35:47.000Z",
          "Titre": "disappointing...",
          "Contenu": "there were a number of critical quotes that the transcription didn't capture, requiring me to just go back to the recording and listen, rather than utilize the file sent. disappointing."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Bradley Jones",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T04:38:41.000Z",
          "Titre": "Not set out the way it was requested",
          "Contenu": "I had asked a number a number of times for the transcription to be typed in Times New Roman at 12ppt and line spacing at 1.5 lines. However it never comes to me in that set up and I then have to do it myself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glen Witchey",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T23:21:36.000Z",
          "Titre": "I love the service and quality that…",
          "Contenu": "I love the service and quality that comes back. I had problems getting multiples at the same order and had to redo and repay for some."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "AHMAD ALI",
          "Nb_Reviews": 3,
          "Date": "2022-06-14T05:39:27.000Z",
          "Titre": "Can we paid another method??",
          "Contenu": "Can we paid another method??? Because in our country PayPal is not accepted..... reply plz"
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Laila Daneson",
          "Nb_Reviews": 3,
          "Date": "2022-06-09T17:57:06.000Z",
          "Titre": "Impossible to get accepted",
          "Contenu": "Impossible to get accepted due to the large pool of application. But their service is great."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Penny Hughes",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T11:58:42.000Z",
          "Titre": "Subtitles came through promptly",
          "Contenu": "Subtitles came through promptly, but there were a few mistakes. It was straightforward to edit these."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tembie Nyirenda",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T10:40:53.000Z",
          "Titre": "I noticed the transcripts had a few…",
          "Contenu": "I noticed the transcripts had a few uncompleted sentences."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tania Storm",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T05:23:55.000Z",
          "Titre": "I loved it!",
          "Contenu": "I loved it!I had to add time stamps at each place though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JD Hanson",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T23:42:55.000Z",
          "Titre": "Just way too expensive for regular use."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Peace",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T10:31:17.000Z",
          "Titre": "Sometimes can be very disappointing.",
          "Contenu": "I use Rev.com services on a weekly basis for my YouTube channel. I'm generally happy with their captions for my videos. But unfortunately many times I keep getting back my videos with terrible caotions and when that happens I need to sit for an hour long to reception and edit their mistakes. And that can be very frustrating to say the least, because you end up paying for a service that you need to work on it youself later. So they should pay me instead."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Les Mahoney",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T22:06:39.000Z",
          "Titre": "Better than the last time, but that's not saying much",
          "Contenu": "Better than the last time, but still not crazy about the quality or consistency of your captioners.  Disturbing that you offer an elite service where you pay extra for good work--not really crazy about that either--all the work should be good!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will T.",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T18:35:16.000Z",
          "Titre": "Overall, well done",
          "Contenu": "Overall, well done! 3 stars though because we had to listen to all of them again and make corrections because there were quite a few words that were incorrect, just sprinkled around throughout, and those wrong words completely changed the meaning the speakers were conveying. Some of the words were technical; they were understandable errors, so not really criticizing; it's very difficult when you're not intimately familiar with the subject matter."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kat",
          "Nb_Reviews": 8,
          "Date": "2021-05-17T09:43:44.000Z",
          "Titre": "A bit better than the automatic youtube subtitles",
          "Contenu": "It's ok. Better than the automatic youtube subtitles, but still required a lot of work on my end, as some of the subtitles were not aligned, some contained grammatical errors. The support has responded quickly and I got a refund for the ones with grammatical errors. I did not query the second video as I needed to get it out and did not have the time for the back and forth."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Major Hoffman",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T22:45:05.000Z",
          "Titre": "Appreciate the service, but it could be better.",
          "Contenu": "I selected the premium transcript so that I wouldn't have to make edits to the automated transcript. I shouldn't have to spell names that were provided, correct fragments, and piece sentences together.If this service doesn't improve by the price increase, I have to consider going elsewhere or setting up my own GCP AI service to feed transcripts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Yau",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T19:15:29.000Z",
          "Titre": "Most of the time Rev.com transcripts…",
          "Contenu": "Most of the time Rev.com transcripts are great and accurate. A/B rating. Sometimes, I think the transcriber is transcribing too quickly and not only misses what's being said but also mistypes some words. I had to compare the original audio against the transcript this time in order to ensure accuracy. Sometimes just a word can change the meaning of the whole sentence. So this time, I'd give the effort a C."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Jeff S",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T00:18:48.000Z",
          "Titre": "You'll be spending all your time fixing the mistakes",
          "Contenu": "Ordered a transcription. There were a number of glaring mistakes in the transcript. Contacted Rev support, and they said it still passed their quality checks, and the only thing they would do was to remove the person who had transcribed it from doing any other transcriptions for us in the future.Would only recommend using them if you don't have a big budget and need to go with the cheapest, and have the time to double check everything and fix all the mistakes yourself.Otherwise if you value your time, then spend a little more and go with someone who can guarantee a much lower error rate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Greaves III",
          "Nb_Reviews": 1,
          "Date": "2019-02-12T07:24:29.000Z",
          "Titre": "Fairly decent experience. Could be worse.",
          "Contenu": "Good value compared to paying a dedicated transcription service. Not as easy to use as other apps like Tape A Call Pro. Difficult to distinguish between Rev Call Recorder and Rev Recorder. Transcription services are good but sometimes have trouble with speakers who have pronounced accents. Definitely take the time to include unusual words or acronyms in your transcription order!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annie",
          "Nb_Reviews": 1,
          "Date": "2018-09-18T15:46:45.000Z",
          "Titre": "Decent",
          "Contenu": "Decent. I split it up meaning different translators did different sections so I could get a faster turn around time. One of the translators used a lots of \"inaudible\" on parts of the transcription that weren't that hard to understand. The other two translators did a decent job and only had one or two \"inaudible\". It really depends who ends up transcribing your audio how good your quality will be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jean Merz-Edwards",
          "Nb_Reviews": 1,
          "Date": "2018-06-07T23:08:09.000Z",
          "Titre": "If I was grading the work on this…",
          "Contenu": "If I was grading the work on this transcription, I'd give it a \"C\".  It met my minimum expectations.  It would have gotten an \"A\" if there won't so many parts of the recording left out in the transcription through comments such as \"crosstalk\" and \"inaudible.\"  If these parts of the conversation (more than a few minutes) is not going to be transcribed, I should not have to pay for it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "tiamallie",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T19:43:23.000Z",
          "Titre": "There were many instances in which I…",
          "Contenu": "There were many instances in which I had to personally go in and check for all of the inaudible sections. 90% of the time, the audio was clear and could easily be transcribed. My team and I had to work on these transcripts extensively to ensure that they were up to the standard of our website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "donna haley",
          "Nb_Reviews": 2,
          "Date": "2018-01-13T14:51:44.000Z",
          "Titre": "Mostly good, but frustrating",
          "Contenu": "I had seven transcriptions done, and most were accurate, although I had to correct small parts of most.One of them was very problematic and took me a good deal of time to correct. It left out words, some small sections, and had misspellings. So that was frustrating. On this one recording, it seemed the transcriber lost focus and attention.I did appreciate the format for editing, so that was a help when I went in to correct."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Olivia Kwag",
          "Nb_Reviews": 1,
          "Date": "2017-07-29T14:05:44.000Z",
          "Titre": "I understand that a speaker that had to …",
          "Contenu": "I understand that a speaker that had to be transcribed has a German accent, but even for a person like me (an Asian who learned English as a second language) understood some parts that had \"inaudible,\" which makes me think maybe the transcriber did not put too much efforts into transcribing the lecture. Anyhow, I understand that transcribing is not an easy job, so I want to thank you very much!"
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Karl Dz",
          "Nb_Reviews": 1,
          "Date": "2017-12-05T22:16:51.000Z",
          "Titre": "Fast but make me problem with invoice",
          "Contenu": "Fast, good price vs quality ratio, service provided as expected. But make me big issue with invoice - they had no will to generate full business invoice on the name (company) who paid to them for the service, also they declined possibility to send pdf version of the document confirming payment/deal. Now I have issue with local tax authorithies. Too bad..."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "SC",
          "Nb_Reviews": 1,
          "Date": "2017-05-10T03:48:19.000Z",
          "Titre": "The service works",
          "Contenu": "The service works, however, words were missing and instead of writing those words in, [speaks in foreign language] was used instead rather than typing in the words I had written out and added as an attached document. Some words were spelt incorrectly, such as the word connection, which was spelt \"connexion\". Overall, a fast service that I'd probably use again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Loren Castillo",
          "Nb_Reviews": 1,
          "Date": "2020-04-20T20:17:44.000Z",
          "Titre": "Rev is good but it takes too long to…",
          "Contenu": "Rev is good but it takes too long to get the final version where other services are much faster like Zubtitles. I didn't end up using the Rev video since I used another service and had it posted and done before I even received the video from Rev. Maybe in the future I will use Rev?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Church",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T17:15:55.000Z",
          "Titre": "Rev Had Trouble American Southern Accent",
          "Contenu": "I submitted a long audio recording (2:46:17) of a church business meeting. They did the translation in about 30 hours, but the quality and accuracy was not very good, mainly in my opinion, because most of the speakers were Southern Americans with an accent. Rev went over it a second time, and it was improved, but still required me to do extensive editing to make the document acceptable as Meeting Minutes to be published. I would recommend they find and employ some Southern Americans and use them to transcribe such items as my audio file."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Deborah Janz (Kriger)",
          "Nb_Reviews": 2,
          "Date": "2018-05-14T11:07:53.000Z",
          "Titre": "Great Concept",
          "Contenu": "Great Concept We love the service and the concept is great. The challenge is that the iPhone app is glitchy and will start pushing errors in the middle of an interview. This has caused a great loss of data and interruption while we reset the app. We also end up with 2 and sometimes up to 5 small recordings instead of one causing administrative headaches.Having said that, I recommend this service to friends and colleagues and I'm hopeful it will continue to improve!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dj Segovia",
          "Nb_Reviews": 1,
          "Date": "2018-07-21T23:47:37.000Z",
          "Titre": "Took three full days to get uploaded…",
          "Contenu": "Took three full days to get uploaded then it was done quickly and very good results but it’s been more than a week and I can open all you did but ...when I download and save as ...they will not open or print for me... so I’ve paid money for something I need desperately to have printed so I can tweak and write an ebook and cannot open or print your files Very Frustrating - so I cannot finish a job that would’ve and should’ve taken several hours still not done after several WEEKS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauralee Alter",
          "Nb_Reviews": 1,
          "Date": "2019-04-30T18:46:58.000Z",
          "Titre": "I like the concept",
          "Contenu": "I like the concept, however I had to do a lot of corrections. It’s not worth the price.Added to respond to the response below. It will do no good to redo it as I needed to do it for school. It’s past the date so cannot redo it. I will not do this again though as it was really expensive for the accuracy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2015-11-30T01:07:46.468Z",
          "Titre": "First time using Rev.com",
          "Contenu": "Having transcribed some of my own interviews, I understand that this is a challenging activity, which is why I am using this service.  Although having the transcription done for me was a big help, I found that there were places the transcriber indicated difficulty hearing that seemed clear to me.  I also found some outright errors that also seemed silly when I compared the transcript with the audio recording."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alessandro",
          "Nb_Reviews": 2,
          "Date": "2015-08-29T00:42:31.069Z",
          "Titre": "Good transcription, high price",
          "Contenu": "I've been trying to use the service to get transcription of emails and other pieces of text that I dictate into my phone during evening walks, or while driving. When I transcribe them myself, by listening to my own voice, I can type the text pretty much in real time, while making a number of corrections. This means that \"I am paying Rev $60/h\", which for my use case is prohibitively expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Polina Minkovski",
          "Nb_Reviews": 1,
          "Date": "2019-08-28T18:49:01.000Z",
          "Titre": "The transcripts varied in quality",
          "Contenu": "The transcripts varied in quality - some were awful and some were quite good. While we understand there was some jargon and content-specific terms in the dialogue, the terms weren't even transcribed consistently. There were some passages that were entirely wrong and some text that was added (when nothing was said in the actual recording).In short, the transcripts had to be validated and edited before we were able to use them in our work. I see no value add relative to the transcripts we get from Zoom for no additional cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 1,
          "Date": "2014-05-17T23:22:37.000Z",
          "Titre": "Good but not great",
          "Contenu": "This service is better than most. The last time i used it, it was called Fox Transcribe. Then, I found the transcription to be amazingly accurate. This time there were a large number of inaccuracies. Some of which made no sense. Had the transcript been proof-read, a human reader would have caught the errors. So, I am a bit disappointed. But, for the price, i cannot be too disappointed i guess."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Alexandra Voit",
          "Nb_Reviews": 1,
          "Date": "2018-08-10T13:36:18.000Z",
          "Titre": "The transcription of the submitted…",
          "Contenu": "The transcription of the submitted audio files was very fast - as promised. However, the quality of the transcription is not satisfing. For example, in one of the audio files one person talked about maps and globes - the transcription uses the term glove - which doesn't make any sense in the given context."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "chris f.",
          "Nb_Reviews": 1,
          "Date": "2017-10-02T15:43:56.000Z",
          "Titre": "This was my first Rev experience",
          "Contenu": "This was my first Rev experience. I needed a faster response to my questions as I was on deadline. Emails went unanswered for more than 6 hours before I had to take to Twitter to pry a response from Rev customer service. Was happy with the transcripts, but needed a more responsive customer service experience, especially as a first-timer. It worked out, but I could have done without the added stress. All said, I will use the service again as I now have a better idea of what to expect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2013-11-21T02:32:12.000Z",
          "Titre": "Fast, but not as accurate as I needed it to be.",
          "Contenu": "This transcription was for video, so I needed it to be more complete than it was - don't need every 'um', but do need to know exactly what they say without dropping words or paraphrasing. There were a LOT of dropped words ('and' at the beginning of sentences, etc.), and also a number of typos. I spent over an hour reviewing and correcting things after I received the transcript."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2013-10-25T02:49:22.000Z",
          "Titre": "The work was done quickly",
          "Contenu": "Took only about 30 hours before I had my translated documents back.  Felt I got ripped off on the cost.  Had one page with 253 words and one with 280. Since they were over the 250 word maximum got charged an extra $54 for two more pages even though they were pages from the same document.  Felt I should have only been charged for one more page.  Called them about it but received no satisfaction."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2013-11-06T11:06:02.000Z",
          "Titre": "Faster than expected.",
          "Contenu": "Once I sent the link for my 6 minute video in, the process was really quick. Even though they promised 48 hr turnaround, the transcript came back almost perfect in less than 6 hours for a 6 minute video.  my complaint is that they charged me for a full 7 minutes even though the video was only 6:06 long. Not a big deal, but it should round down if less than 10 seconds over the minute mark."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Georgi",
          "Nb_Reviews": 1,
          "Date": "2014-04-01T14:55:40.000Z",
          "Titre": "FAST. accuracy can be better.",
          "Contenu": "I had educational transcripts translated (Bulgarian to English).\r I am sure the translation is good enough for immigration purposes, but I don't need it for that. some subjects are not translated correctly. pass/fail grades translated as \"acceptable\" ?!?! its OK I guess, but if you have to use this to continue your education, you might have some problems. \rOn the other hand - its really fast and convenient."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jim H",
          "Nb_Reviews": 1,
          "Date": "2013-09-11T13:58:12.000Z",
          "Titre": "A variable experience",
          "Contenu": "Verbatim - 'In exactly the same words as were used originally'\r Or, if you are placing a transcription order with Rev.com and paying for the additional verbatim option, the definition magically becomes 'Conveying the general meaning, or 'gist', in one's own words, depending on the transcriptionist.\r $300 down the drain, and I am going to be fixing this nightmare for the next 3 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sophie",
          "Nb_Reviews": 1,
          "Date": "2014-01-10T15:48:08.000Z",
          "Titre": "Convenient service but check the work",
          "Contenu": "I requested a certified translation of a one page death certificate in French into English. Work was done in 2 days but needed two revisions to be finalized, and a typo had still not been corrected. Revisions were for a couple of typos and one line that was missing. Follow up service was good. Disappointed that accuracy was mediocre, and I had to spend time to follow up, but appreciate the service and would use again if needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2013-09-11T20:09:10.000Z",
          "Titre": "worked great, but the 250 word limitation is misleading",
          "Contenu": "Site should state more clearly about the 250 word limitation per page. After submitting and making payment for 2 pages ($54) received a message that I would have to pay $27 more totaling $81, which I consider expensive. Site should either state CLEARLY about 250 work limitation (not in tiny letters somewhere hidden), or charge a flat rate per page no matter the number of words. Would give 5 stars if it wasn't for this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Torri",
          "Nb_Reviews": 1,
          "Date": "2014-02-24T23:44:39.000Z",
          "Titre": "Not bad, but you missed a few things.",
          "Contenu": "I was very happy with the quick service. My main concern was that  quite a few words in the transcription were really off. If I were not so closely involved with the meeting, I would not have understood the transcription. I would like to use this service again for my dissertation, but I will explore other options if the next transcription is this poorly done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2013-10-10T22:28:30.000Z",
          "Titre": "arrived on time. missing item, received somethung i did not order.",
          "Contenu": "My order arrived on time, however, a pair of boardshorts i ordered was missing and in its place was a woman's tank top. i called and was informed the shorts had been discontinued and they would send the replacement pair when they arrived. overall, the service was good but would give 2.5 stars because if the item i ordered was discontinued, this situation could have been avoided if the website were updated to let the customer know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Brey",
          "Nb_Reviews": 2,
          "Date": "2018-08-31T16:52:13.000Z",
          "Titre": "Questionable Quality at Times",
          "Contenu": "Make sure you verify their work - the turn around can be a bit slower than what they promise and the quality can vary significantly.  They will offer a small discount for the next time but it doesn't mean they will always verify the quality of their work.  Still not sure if I will use them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T02:51:19.000Z",
          "Titre": "Organize the files please!",
          "Contenu": "If I upload twenty voice mails I should receive twenty transcripts in return.    I get a complicated thread of emails each with a transcript in no particular order.  So to have each one printed out I have to open up this mess of 20 response emails that are in a continuous overlapping thread and try and create order from the havoc.  Can you at least put the conversations back in chronological order and send me them all at once?  To try and open each of these files in this way is ridiculous!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "hilarion",
          "Nb_Reviews": 1,
          "Date": "2013-09-12T14:18:22.000Z",
          "Titre": "too rigid, too greety",
          "Contenu": "my document had 270 word and you want to charge as if it was 2 pages....i woudl tolerate an additional charge, but a full additional page is too much.  I cancelled my order for 3 documents and looking for an alternative provider.\rSo, if the file is just 100 words...why dont you charge less that 27$??\rCutomer serive person did not care I cancel."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2014-01-10T20:15:24.000Z",
          "Titre": "so-so",
          "Contenu": "When I contacted REV, the person at the other end was not very helpful and      somewhat abrasive. \rTurn around time was great\rCompetitive costs \rTranscription was not accurate; mismatch between speaker and quote\rIn the past,  I used REV and I was very pleased. In view that this experience might be an anomaly, I do plan to use REV again"
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Mara",
          "Nb_Reviews": 1,
          "Date": "2016-06-14T12:31:22.000Z",
          "Titre": "Satisfactory given the quick turn around time and price",
          "Contenu": "I think that Rev.com provide clients a quick turn around time on their projects at a very competitive rate. The quality is satisfactory, however if they could adapt to their client's needs and accept using given templates or style guides, I'm sure that the quality they provide would significantly increase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cara Lippman",
          "Nb_Reviews": 1,
          "Date": "2020-01-31T17:12:19.000Z",
          "Titre": "Surprising",
          "Contenu": "Surprising. It was surprising how quickly these were done, and largely accurately, but 32 confirmation emails later, I learned I could download them en masse. My boss also got all the emails too, junking up his inbox. Also, I had identified the 2nd speaker, myself, in the upload, and it was never used. So now I have to go in and change it in all 32 files. The punctuation isn't perfect, but I'm an English major. All in all, I'd use it again, but I'd probably use the cheaper machine version if I'm going to have to go in and make all those changes myself anyway."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonel Beach",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T22:26:50.000Z",
          "Titre": "Captions service",
          "Contenu": "There's a lot to appreciate about Rev.com's caption service. They turn them around quickly, and it's great to be able to check them for accuracy against picture directly in the platform. It makes proofreading and updating the copy a breeze.The challenge is in knowing where the captions will be placed when uploaded to third party sites (Vimeo, YouTube, etc.) in order to determine our best placements for lower thirds, titles, and other onscreen graphics. We're currently uploading to hand test each one on various platforms before we deliver these files to our clients."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Momoko",
          "Nb_Reviews": 1,
          "Date": "2013-10-14T13:07:11.000Z",
          "Titre": "Revision was OK.",
          "Contenu": "I am satisfied with \"revised\" version, although expected to have one like that at first try. I provided English spelling of names (place, person) I use for other documents, as there are multiple possible spelling. Unfortunately, those were not refereed by initial translator/reviewer and first translation came back using the spelling different from the ones I requested. Second one used the requested spelling. Turn-around was great (less than 48 hours) and price was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roberto Luiz",
          "Nb_Reviews": 1,
          "Date": "2014-02-14T17:48:33.000Z",
          "Titre": "I'm glad I know both languages of the translation, or else I would be in trouble.",
          "Contenu": "There were two translation mistakes. The title was wrongly translated as Certificate of Marriage when it should be Certificate of Birth and the time I was born was translated as 6:25 and not 4:25 (16:25). REV did correct the problem promptly, though, but I wonder what could have happened if I didn't speak English!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2014-03-18T00:36:22.000Z",
          "Titre": "Quality of Transcription is Poor",
          "Contenu": "Conversation was recorded in HD quality and I seem to have more \"inaudible\" listings in places where the words can be clearly made out. On top of this the transcription even came with misspellings, I mean come on that is even worse. So to sum up my disappointment (i) Missing Words, and (ii) Spelling Errors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dan tynan",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T14:44:45.000Z",
          "Titre": "Rev needs to improve its accuracy and fix its goddamned phone app",
          "Contenu": "Turnaround on transcriptions is good. Pricing is pretty much in line with most other services. But accuracy is all over the map. Seems pretty clear they use non native english speakers for a lot of these jobs. I've downgraded transcripts at least a dozen times. And the phone recording app is now unusable. Call quality is randomly awful (and it is the recording line that's causing it -- quality immediately dives when I merge calls), and the app is randomly just cutting out during the middle of a conversation. I am looking for transcription alternatives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Writer",
          "Nb_Reviews": 1,
          "Date": "2014-12-17T15:02:43.000Z",
          "Titre": "overall ok",
          "Contenu": "Seems this transcript was done in india - some of the words used point to that. bit heavy on the editing out of comments such as \" let me see how i can say that\" - a couple of marked areas that the transcriber could not decipher that i had no trouble hearing. other than that good value for the money if you are prepared to reread the whole thing. If you plan to do a review you get a good transcript to work with and that would be 4 star. If you want to use the transcript as is its a 3 star."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sally Anne Hageman",
          "Nb_Reviews": 3,
          "Date": "2014-06-16T21:00:04.000Z",
          "Titre": "Quick turnaround but errors in the transcription",
          "Contenu": "I'm a doctoral student and needed some transcription done for a project.  I'm on a limited budget, so a colleague recommended Rev.com.  They were very fast.  I sent a 45 minute interview last week and it was completed and sent to me on the weekend.  I just did one transcript to try it out and am going through the audio file and transcription now for errors and there are a few.  Its definitely saving me time, but not as much as I'd hoped because I still have to go back and fix things."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2013-10-15T20:39:50.000Z",
          "Titre": "Rev.com provides extremely fast turnaround but uneven quality of deliverable.",
          "Contenu": "I've used rev.com for two different projects now, and while overall I am happy with them, especially with speed of turnaround and friendly customer service, my latest batch of transcripts received poor marks from the researchers who had to use them. Poor transcription, lots of errors and misspelled words, etc. forced the researchers to have to listen to the original videos again. This made for a costly analysis phase because we found we couldn't rely on the quality of the transcripts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M. Blake",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T21:21:02.000Z",
          "Titre": "Uneven quality, poor customer service",
          "Contenu": "As a professional journalist, I use Rev frequently. It’s reliably fast, but the quality is uneven, and the customer service can be terrible. If there’s a problem with your transcript, there’s no way to get it fixed that doesn’t involve waiting months and sending multiple emails."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B. Proud",
          "Nb_Reviews": 1,
          "Date": "2014-02-16T02:11:26.000Z",
          "Titre": "Iffy. Sometimes great and sometimes incredibly inaccurate.",
          "Contenu": "The speed of turnaround is great. The first transcript was excellent but the most recent one is full of mistakes. The designated speaker is wrong and this is from a VIDEO so you can see who is speaking. Many of the word are really wrong and I've had to go back and watche the video and correct the whole thing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elyse",
          "Nb_Reviews": 1,
          "Date": "2014-02-15T22:29:47.000Z",
          "Titre": "Not a complete transcript.",
          "Contenu": "I have previously worked as a transcriber for government agencies so I know how important accuracy is. I am 1 minute into the video and I have already had to fill in many gaps in the transcript. I think that those transcribing could have taken a little more time working on this and reviewing the end product. I think overall this is an okay service and I'm hoping that it is better when there is one speaker at a time. This video had groups and was a little loud so it was more difficult to understand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gael",
          "Nb_Reviews": 1,
          "Date": "2013-10-12T01:17:58.000Z",
          "Titre": "Turnaround time is excellent- extremely fast and good pricing. However, the quality varies.",
          "Contenu": "Turnaround time is excellent- extremely fast and good pricing. However, the quality varies. I've had three jobs done and the first one was so full of mistakes (not spelling, but just tense and grammatical ones that should have been common sense because of the context of the speaker's words). The second and third were near-perfect. So I ended up spending over three hours making corrections to the first one on every paragraph, where the second and third I really had no work to do but proofread."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mohamed",
          "Nb_Reviews": 1,
          "Date": "2014-02-27T19:01:58.000Z",
          "Titre": "Fast but Hasty",
          "Contenu": "You're very fast even when I sent back so that you can correct the mistake. You even returned my call back within an hour. But come on you attached someone else's translation initially. I hope you didn't attach mine to his. You know because of privacy and whatnot. Besides that the  prices are cool"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Flavia",
          "Nb_Reviews": 1,
          "Date": "2013-08-28T08:39:36.000Z",
          "Titre": "Not the best for non-American accents",
          "Contenu": "Hi, a friend suggested me the company as he uses their services a lot. I had an audio material for a documentary filmed in Scotland. They were really fast on the translation, what was good, but perhaps this is a \"catch 22\". There were several misunderstood that even I, a non-English native speaker, could have done correctly. Some phrases that didn't make sense, so I needed to re-write them myself. I guess the accent didn't help the transcription, so I'd still recommend their services."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Braden",
          "Nb_Reviews": 1,
          "Date": "2019-03-20T17:24:42.000Z",
          "Titre": "Good service - until you make a mistake",
          "Contenu": "Being new to setting up captions for videos, I mistakenly ordered transcriptions for my first order with Rev. While the customer service agent was very patient with my frustration, I got to be charged over 1/3 of my original order as a \"foolishness tax\" after all she could provide was a partial refund. Pretty quick way to make what was a positive experience a feel bad moment.The transcriptions I got were fast and accurate except for industry terms, which were easy enough to fix with a few minutes of editing. Sadly, they aren't usable for what I needed them for."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Aurelien Laine",
          "Nb_Reviews": 1,
          "Date": "2017-12-21T02:43:22.000Z",
          "Titre": "The transcription was fine but the …",
          "Contenu": "The transcription was fine but the transcriber has used a different name than the one given during the order process for one of the speakers. Alo, some of the words given during the order ended up being written out as [inaudible] instead of using the words I gave as a reference."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2014-05-02T23:21:26.000Z",
          "Titre": "Good turnaround times, translation not so great.",
          "Contenu": "The translation process was very easy and streamlined.  I wanted a contract translated from French to English, and although every word was translated, the actual meanings of each sentence was often very hard or impossible to decipher.\r I probably should have used a service that focuses specifically on translating contract law, but then again that is exactly what I was looking for when I found Rev.\r I'll have to end up using another service to translate the contract again, so I'm out the money I spent here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2014-06-19T04:42:32.000Z",
          "Titre": "The document was not properly translated",
          "Contenu": "Speed was there but not so much for quality. There were a couple of inadequately translated words and formatting issues. This was for a 2 page Japanese family registry (charged as 3 pages) which should have been relatively easy to handle. \r I am having the translated document translated again to Korean. The Korean translator asked me to review (which the other translator didn't even bother) and I ended up fixing a fair amount of the work only to find out the initial job was not thoroughly executed to begin with...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hany",
          "Nb_Reviews": 1,
          "Date": "2014-03-11T21:34:37.000Z",
          "Titre": "good",
          "Contenu": "I needed help with translate Birth,  Marriage and Death Certificates the Service was great and really fast the names all was right as I wanted it to be the only issue was on the foreigners Birth Certificates that I wanted to translate the person name come on the Certificate separate in 2 lines the above line is the person name and the lower is the family name so they didn't write the first name which is really important but I fixed it and I hope it's work out.  Other than that everything was great..  Good Job guys"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Shelley",
          "Nb_Reviews": 1,
          "Date": "2017-02-27T09:21:03.000Z",
          "Titre": "First experience learning curve",
          "Contenu": "First, I learned that even if my topics were separate, to send them as one document.Second, I will give spelling/'style' info within the dictation because the info I'd input into the section identified for such was universally ignored. I had to change every single one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicki Ley",
          "Nb_Reviews": 4,
          "Date": "2019-04-12T00:46:37.000Z",
          "Titre": "Great in the past, a little disappointed this time",
          "Contenu": "While I have used Rev in the past and have had my expectations surpassed, for this latest transcription I was left a little disappointed and had to have a friend listen and re-transcribe. One of the speakers has something of a unique accent, but it's not that difficult to understand. In addition to a lot of spelling errors, there was also an abundance of grammatical and punctuation errors as well. I will give Rev another chance in the future as I have had two previous outstanding experiences with them. On this go around, however, I do not believe there was 99% accuracy as is promised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hwang",
          "Nb_Reviews": 1,
          "Date": "2013-09-07T07:56:10.000Z",
          "Titre": "Adequate.",
          "Contenu": "The service was quick.  But I sent the translated article to a friend who teaches in a University in Seoul and she said there were some nuances that were missed between my article and the one that was translated.\r I'll probably use the service again, but only when I time is of the essence."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Suzanne Badger",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T00:19:01.000Z",
          "Titre": "Service Problema, but great customer rep",
          "Contenu": "Although my customer service experience was great, I’m disappointed that the captions were 2 minutes behind on Facebook.  I emailed Facebook and never got a response.  FB was the whole reason I paid for this service.I was really hoping the platforms were compatible but the person in your office said this was a FB problem and not on your end.  I’m disappointed and I wished I had not paid $46-ish to do this.  I wasted my money. Again, the employee in customer service was polite and friendly.  I just am not pleased this service didn’t work for what it was bought to do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seth Merrill",
          "Nb_Reviews": 1,
          "Date": "2019-02-22T19:05:17.000Z",
          "Titre": "A lot of missed words",
          "Contenu": "A lot of missed words (\"spread\" instead of \"sprint,\" \"marketize\" instead of \"democratize\" to name a few) that lost the key point of several sentences to the point where I had to go back and listen to my recording anyway."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Busra Sevimli",
          "Nb_Reviews": 1,
          "Date": "2019-04-02T22:00:03.000Z",
          "Titre": "I have given 3 audio recordings to Rev…",
          "Contenu": "I have given 3 audio recordings to Rev so far and all three have come back with inaccurate transcriptions. The purpose of sending my audio recordings to Rev was to save myself time. Not to listen to entire recording and fix up the errors on the transcripts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2014-08-25T18:58:21.000Z",
          "Titre": "Wonder if the transcribers actually speak English?",
          "Contenu": "Had six customer interviews transcribed. With the exception of one, all the interviews were recorded in clear, California English. What came back was quite cryptic and hard to read. It seems as if the transcribers have limited English skills or are simply not great transcibers/typists."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2019-01-31T00:10:50.000Z",
          "Titre": "Low cost, quick turnaround, but some quality issues",
          "Contenu": "Quick turnaround, a variety of options, and pretty inexpensive.  Because so many individual transcribers are working for them, quality and even format can vary quite a bit.  Overall, quality is generally acceptable, but not exemplary (a little bit of \"you get what you pay for\").  I wish they would have a standard format everyone uses, and I wish so many of their transcribers wouldn't always type in gonna, wanna, and oughta instead of going to, want to, and ought to.  I'm not trying to capture colloquialisms or accents in the transcripts - just the English people are speaking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eileen",
          "Nb_Reviews": 1,
          "Date": "2013-11-04T08:29:49.000Z",
          "Titre": "not good missing a lot",
          "Contenu": "this time the person who did the work seemed to miss a lot of the conversation - it says inauditiable however you can hear it perfectly fine.  \r Very disappointed this time has been very good in the past - \r can this be reviewed and corrected without another charge please.\r thanks"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Shane",
          "Nb_Reviews": 1,
          "Date": "2014-02-04T04:58:18.000Z",
          "Titre": "Some good, some bad",
          "Contenu": "Last week I submitted 5 interviews for transcription after a long gap from using Rev.com (due to average results)\r I have checked four of those 5 interviews so far, and for the first three was pleasantly surprised: one was not tooooo bad (about 93%), 2 were pretty good and close to the guaranteed 98% accuracy I was hoping for. One I just did is rubbish. Took me a full hour to correct the transcription of a 16 minute interview - lucky if it's 80% accurate. \"Soundwave\" does NOT sound like \"satellite\", not now, not ever."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Michael Teo",
          "Nb_Reviews": 1,
          "Date": "2017-04-26T23:06:24.000Z",
          "Titre": "Quick and quite accurate service but tricky to edit",
          "Contenu": "The transcription was quite accurate, with only 3 small mistakes and the service was very quick.The editor to make adjustments is quite difficult to navigate. I was able to adjust the text, but couldn't figure out how to adjust the start/end points if the captions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2013-10-17T14:48:43.000Z",
          "Titre": "Good formatting, spacing, but with errors in translation",
          "Contenu": "The translation I ordered was from Thai to English. I made sure to indicate that spacing and formatting were important. This request was respected. However, there were several errors in the translation of the text. Specifically, the identities of \"Mr.\" v. \"Mrs.\" and \"son\" v. \"daughter.\" These were key part of the text that needed to be properly identified. I will need to make corrections, although I am still unsure if Rev.com offers a guarantee on their work or will they charge me extra to make these edits."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2013-11-21T18:19:54.000Z",
          "Titre": "You should really communicate with your customers.",
          "Contenu": "Very dissapointed in the communication process. I never received an email that my document was ready. The first time you couldn't even read the document. I am happy with getting it done but really thought they would let me know when I could get the document from their website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay I",
          "Nb_Reviews": 2,
          "Date": "2014-01-10T17:51:57.000Z",
          "Titre": "Quick but not without issues",
          "Contenu": "So the turnaround was super quick (had my 30 min interview transcribed in less than a day) but not without problems.  First it says less than 48 hour turnaround when you place the order but then when I got the confirmation it said estimated delivery was 5 days later.  That caused a bit of unneeded stress.  And then the transcription, while mostly right had some glaring holes.  A bunch of \"inaudible\" notations that I could hear fine and a bunch of misquoted moments that were also quite clear.  The 98% accuracy rating seemed a bit overestimated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donnette",
          "Nb_Reviews": 1,
          "Date": "2014-07-19T12:28:05.000Z",
          "Titre": "It's their way or the highway",
          "Contenu": "The transcript did not come back in 48 hours and they will tell you at the beginning that they use their format, period. I did send a long project, 3 hrs, 45 min. I spent all day yesterday going over it against audio and only completely the first hour and a half. This does not include the time spent to get it in the format I need. The presentation had multiple accents. They seemed to have more trouble with the Americans than the Middle Easterners. I think they are comparable to voice recognition. If you have the time to reformat and clean it up, they are fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sophia",
          "Nb_Reviews": 1,
          "Date": "2014-06-13T06:44:24.000Z",
          "Titre": "Good turnaround time, but inaccurate in some places",
          "Contenu": "Generally I'm very happy with the service provided.  That said, I paid extra for the time annotations and found that the time annotations made were not done in a consistent fashion and therefore were not useful.  Also, the time annotations were done using the wrong timescale.  Finally, there were some mistakes in the expertise due to lack of domain expertise.  I suppose it's too much to expect that the person doing the transcription be an expert in big data technologies but due to these mistakes I had to review the transcription very carefully and fix it."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Justine",
          "Nb_Reviews": 1,
          "Date": "2014-04-29T09:12:28.000Z",
          "Titre": "Fast which was brilliant, english as first language?",
          "Contenu": "Hi,\rThanks for providing such a fast service.  My client was most impressed.  She did ask me to let you know that she noticed the different styles of the 3 transcribers involved.  One was brilliant, one was ok and one was appalling (her words).  In this case it didn't matter too much as my client knew the content well and was able to fix it up but she did comment that English cannot have been the first language of the third transcriber.\rSo while I would definitely use you for fast turnaround jobs like this one, I would hesitate before sending work for a fussier client."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Judi Offenberg",
          "Nb_Reviews": 4,
          "Date": "2022-01-02T03:15:11.000Z",
          "Titre": "I had to go back in an correct so many…",
          "Contenu": "I had to go back in an correct so many words that it took me a great deal of time. Honestly, I spent so much money on the transcriptions. I thought they would be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2013-10-13T20:07:10.000Z",
          "Titre": "Unfortunately, I was disappointed.",
          "Contenu": "Normally, I am always very pleased with the transcripts but in this last one there were several lines that were deemed \"inaudible\" that I had to go back myself and fill in the blanks. I haven't run into this problem before, and I was pretty disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 2,
          "Date": "2014-04-26T20:58:06.000Z",
          "Titre": "Price was right and it was easy to use.",
          "Contenu": "They wanted to charge me for 3 pages instead of 2 because the word count was too high.  But one of the pages was the Turkish translated into about 10 languages.  And English was one of the translations on the page.  I ended up not having them translate that page since it wasn't really the marriage certificate.  The translation came back in only 4 hours.  It did have a minor error.  I contacted them and they say they will send corrected translation.  So the service and communication is good and the price was certainly good.  I just hope that the Immigration Agency accepts it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2014-03-29T22:50:25.000Z",
          "Titre": "The transcription and price for the product were average.",
          "Contenu": "While the company had a great reputation online, I found that I had to do a lot of clean up work after the fact.  I was excited that there was even a quality control put into place, but in my opinion, they left a lot to be desired.  You get what you pay for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2015-05-30T06:56:08.328Z",
          "Titre": "Cheap, but not as accurate as I’d like…",
          "Contenu": "I got a good, quick turnaround of an audio interview transcript. I was impressed with the cost and the fast turnaround time, but, unfortunately, I was disappointed with the accuracy of the transcription. There were whole phrases missing, some transitions glossed over, whole statements that were misheard and, in context, made no sense in the transcript. This is a very important transcript for us, so accuracy was vital.\r I had to take as much time making corrections as I feel I would have just using voice recognition, or repeating the audio into my iPhone for voice recognition.\r We’ll give it another try,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paige",
          "Nb_Reviews": 1,
          "Date": "2013-12-11T18:23:12.000Z",
          "Titre": "Decent, not great",
          "Contenu": "The transcription turn around was really fast, all most too fast. There were more than 2% errors, although in fairness, most of the errors were on words that are unique to my setting. However, I do that that had it been run through again, someone could have picked up on the words. I was also frustrated by the liberty that was taken since I did not order a verbatim transcription. I was expecting the \"ums\" and \"ahs\" to be removed but sometimes a whole sentence or two was removed. That's annoying when I want to capture if my participant went back and corrected themselves or was hesitant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lanjing",
          "Nb_Reviews": 1,
          "Date": "2014-02-08T12:15:18.000Z",
          "Titre": "think twice before you use the translation for your academic credentials.",
          "Contenu": "The price is very good; however, the quality is not that great. First of all, the first translation got the years of my school period wrong which is written clearly right on my high school diploma. I had to email them to require a revision. Secondly, when I brought my translation to the administation office of the college, they told me that I have to get an additinal evaluation done because the translation does not state clearly the information they are looking for.\r  I, personally, am disappointed of their business. \r  what's more, the guarantee 100% refund is only for the deny from the immigrant office."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lonnie",
          "Nb_Reviews": 1,
          "Date": "2014-01-11T21:54:13.000Z",
          "Titre": "Great speed. So-so accuracy.",
          "Contenu": "I had two interviews transcribed. So far I've only reviewed one. Good news is I got them both back in less than 15 hours. Awesome. I was expecting a 48 hour turn around. Bad news is the transcript I review so far needed lots of corrections. I ended up sitting with the audio and the transcript for about 4.5 hours to go through it all myself. There weren't a lot of major mishaps, but enough little ones to make a difference. It's important to me because I'm a qualitative researcher. Some of these nuances in the transcript could have major implications for my coding. I hope the second one is much better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2014-01-27T22:52:19.000Z",
          "Titre": "Call it what?",
          "Contenu": "Have previously written a very positive, 5 star review, but when reviewing the documents today, I realized that there was no consistency in the naming/titles of the transcripts, resulting in significant difficulty on my part ascertaining the contents of multiple files. This process/procedural issue will generate a significant amount of additional work time on my part.  Simply sharing in hopes that this detail will be addressed and resolved.  Despite this concern, I remain very, very pleased with the overall quality of the transcription service AND am very impressed with the incredible speed with which the job was completed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Giacomo",
          "Nb_Reviews": 1,
          "Date": "2013-11-09T16:03:52.000Z",
          "Titre": "Fast but expensive - 250 word rule should be applied only to words translated",
          "Contenu": "I received my translation in a short time (2 days). However, they considered my transcript to be 10 pages long because of their 250 word rule. Most of the words in my transcript were numbers! A number in italian is still a number in english!!"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Cobus",
          "Nb_Reviews": 1,
          "Date": "2013-11-22T13:01:59.000Z",
          "Titre": "Fast turnaround, but quality not great",
          "Contenu": "I got my transcription back in a very fast turnaround time of one day and was very impressed! Unfortunately there were lots of errors with words and whole sentences transcribed incorrectly. I thus had to do a substantial amount of editing."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Enam Gqirana",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:36:53.000Z",
          "Titre": "it took a while to understand but once…",
          "Contenu": "it took a while to understand but once i got a hand on it it was very simple to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rowan Carlsen",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T21:23:01.000Z",
          "Titre": "Good service, needs some more organizational tools",
          "Contenu": "Overall, Rev delivers captions extremely quickly, and that's mainly what matters. As far as critiques, two stand out.1. There is no easy way to organize large numbers of caption files without manually moving all of them into folders. You should be able to place an order and specify a folder to store those files at time of purchase.2. Our company makes orders of between 100 and 200 videos to be captioned at a time, and inevitably a few of them seem to not 'parse' when adding the Vimeo links to Rev. The error message says it's privacy settings, but all our videos have exactly the same settings. Could be this is on Vimeo's end, but it's annoying to have to set a few random videos to 'Public' temporarily to get Rev to process them."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "faseeh amin",
          "Nb_Reviews": 2,
          "Date": "2022-10-22T21:55:56.000Z",
          "Titre": "It will take time",
          "Contenu": "It was a great webbsite.Connect your paypal and your good to go, no need to give some personel information.The problem was when i submit to work as a freelancer but when i emailed me back they said it wass going to take up to 12 weeks and the percent of becoming a freelancer depends on you.They will give you a test and when you pass it you can work forward."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T16:23:59.000Z",
          "Titre": "Great work",
          "Contenu": "Great work, only a few minor corrections, but I think that's fine considering the speed in which I got my subtitles back.  Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Arjun Yadav",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T14:14:34.000Z",
          "Titre": "The honest tell",
          "Contenu": "Good and and I'm very honest to say that it's so accurate and helpful but the other side it's expensive also so someone go others"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beryl Baker",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T17:00:48.000Z",
          "Titre": "They were great",
          "Contenu": "They were great, only minor typos and some variance in descriptive language for HOH/Deaf folks."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jennifer Allen",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T20:54:09.000Z",
          "Titre": "Couple of minor mistakes in the…",
          "Contenu": "Couple of minor mistakes in the transcript but otherwise very speedy and mostly accurate! Would use again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard Rabach, Producer - Mach",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T21:32:43.000Z",
          "Titre": "Exactly what we needed",
          "Contenu": "Process was simple, add-ons clearly explained. Overall, perfect for what we needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Aubrey",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T18:42:25.000Z",
          "Titre": "Would be great if you could read the…",
          "Contenu": "Would be great if you could read the timecode window burn-in I put on the videos.  Otherwise, great."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Matthew Long",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T10:31:16.000Z",
          "Titre": "Nice fast turnaround.",
          "Contenu": "Nice fast turnaround.Closed captions were a bit off in places but generally not bad at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Black",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T05:31:21.000Z",
          "Titre": "Quicker turnaround than I anticipated…",
          "Contenu": "Quicker turnaround than I anticipated and only a few minor errors."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anne Z",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T22:58:58.000Z",
          "Titre": "quick work and good quality",
          "Contenu": "Quick work and good quality. Service was professional."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sarah Haslam",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T22:35:59.000Z",
          "Titre": "Excellent service and accuracy",
          "Contenu": "Excellent service and accuracy, although it’s very expensive. Looking at cheaper options now."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kate",
          "Nb_Reviews": 3,
          "Date": "2022-04-13T18:40:32.000Z",
          "Titre": "I've never made closed captions before…",
          "Contenu": "I've never made closed captions before and it was very easy on Rev. Once they were synced up w my film I would've like to change the typeface and also make each caption a single line rather than two, or even three lines long as the text is a poem. Maybe you can do this, but I couldn't work it out...But apart from that, excellent!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sami Sabawi",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T21:32:43.000Z",
          "Titre": "The technology is really impressive",
          "Contenu": "The technology is really impressive, the platform is really easy to use, and the accuracy was really high.  I was really really impressed....until I realized that they don't meet the specs of DCP for film festival submissions.  If they can only figure that out, they would have an unbeatable captioning platform that's a great value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Erickson",
          "Nb_Reviews": 2,
          "Date": "2021-12-19T17:57:43.000Z",
          "Titre": "I appreciate the lightning fast…",
          "Contenu": "I appreciate the lightning fast turn-around.  The speaker in my video had a very thick accent, so some inaccuracies were inevitable. However, I wound up having to correct well over half of the entries on the transcript… making me wonder if I should have just transcribed it myself!Nonetheless I recommend the service and will try it again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Smith",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T23:41:18.000Z",
          "Titre": "Pleasantly surprised",
          "Contenu": "Retired WW IT Director who helped create the internet/laptop/online banking and developed/established SW Architect profession. So little more critical than most. Transcription consistently missed a couple of words. Outside of that….very nice job overall!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Feferl",
          "Nb_Reviews": 4,
          "Date": "2021-05-04T18:30:19.000Z",
          "Titre": "Microsoft problem",
          "Contenu": "The transcription was accurate, as always.  However, I never received notification that it had been completed. When I phoned Rev the next day I was told that this was a result of a problem with Microsoft - they apparently were blocking Rev emails.  I know this wasn't your fault, and I hope it's been resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amason",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T16:22:08.000Z",
          "Titre": "Fairly good captions",
          "Contenu": "For the most part, captioners make a good attempt at accuracy, although they sometimes tend to become less accurate toward the end of recordings. I have encountered a few truly bad caption files, but most are anywhere from adequate to good for our purposes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Osborne",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T12:06:56.000Z",
          "Titre": "I think the transcript was pretty good…",
          "Contenu": "I think the transcript was pretty good -- a few more mistakes (spelling, punctuation) than I'd like.  I think the price is a bit high.  It would be nice if you'd do some kind of rewards program where regular users could get either a discount on services or perhaps a free XX-minute transcript for every XX transcripts.  Just a thought.Peter"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Fitzmaurice",
          "Nb_Reviews": 51,
          "Date": "2022-01-27T20:22:13.000Z",
          "Titre": "Impressive transcription of poor…",
          "Contenu": "Impressive transcription of poor quality dialogue. Lots of background noise. Would have given 5 stars if all the glossary I had provided had been applied. Sound quality probably hindered this. Highly recommended service nevertheless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin Statler",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T15:09:12.000Z",
          "Titre": "Overall great experience the only room…",
          "Contenu": "Overall great experience the only room for improvement would be consistency overall.  For example, I'm doing a series of videos and one video during the intro would have (upbeat music) and another would have (interesting music) and the next didn't have anything at all -- they were the same intro for all the videos.Not sure if this is something that really can be improved it's pretty easy to fix so my overall experience has been great."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kacie Brignell",
          "Nb_Reviews": 2,
          "Date": "2019-10-08T23:56:50.000Z",
          "Titre": "Very fast turn around, and all the words were correct.",
          "Contenu": "First time I've used Rev.com.  Very fast turn around, and all the words were correct.As this was the first time I've tried to add captions to videos, the only thing I struggled with was then being able to work out 'how' to add the captions.  There is information on the website, but was a little hard to find.Really appreciate the service, and that you do have info on how to attach captions to a video."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JC O",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T23:14:14.000Z",
          "Titre": "Good service getting pricey",
          "Contenu": "The Rough Draft service provides a quick, and up until March, an inexpensive way to get a working draft/transcript that saves time and money for those who don't mind doing a bit of work instead of transcribing a whole audio recording. The huge 150% price increase from $0.10 to $0.25 per minute makes this option less attractive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2020-03-17T16:13:18.000Z",
          "Titre": "I hired Rev to transcribe some witness…",
          "Contenu": "I hired Rev to transcribe some witness interviews I performed.  All in all, not a bad job.  Just some things for me to correct.  Some of the work had erroneous punctuation, and in one instance my name and the name of the interviewee were transposed.  I gave no direction whatsoever, and the mistakes were fairly minor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lightwt1",
          "Nb_Reviews": 3,
          "Date": "2019-07-08T20:36:53.000Z",
          "Titre": "This company does a very good job of…",
          "Contenu": "This company does a very good job of transcribing phone calls in a timely manner. I've used them for several years now and they've been consistent. The transcribers aren't always perfect but who is? Rev is compatible with other apps, such as \"Tape-a-Call,\" which I've used for a while to record interviews on the phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane Graber",
          "Nb_Reviews": 1,
          "Date": "2019-01-30T17:40:38.000Z",
          "Titre": "Fantastic -- But Pricey",
          "Contenu": "I was pleasantly surprised at how fast the turn-around was. The web site keeps both the recordings and transcripts of your stuff, which is very useful for keeping my research organized. The only reason I give this 4 instead of 5 stars is the price. When I interview 30 people for a research project, I have to pay at least $1,000 in transcription work. A fee reduction for academics doing non-profit work would be GREATLY appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erika Brereton",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T14:13:55.000Z",
          "Titre": "Very quick",
          "Contenu": "Very quick, accurate and efficient. I have no complaints! My only suggestion or critique is that all of the videos I sent in my last batch included the speakers' names spelled out. However, some of the transcripts still had names spelled incorrectly, and some just labeled them as speaker 1, interviewer, etc. There should be a little more consistency across the board. But those were a simple fix in the review of the transcripts, so no worries. But otherwise, Rev provides a great service without a huge cost. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Holly",
          "Nb_Reviews": 1,
          "Date": "2018-12-18T15:10:13.000Z",
          "Titre": "Quick, accurate and easy to edit.",
          "Contenu": "Super quick turnaround. Pretty accurate and bits they couldn't figure out were flagged. There were a few odd bits (Shakespeare's A Midsummer Night's Dream was confused with gibberish) but all round a fantastic service. The editing tool was fantastic too and offered easy playback at different speeds so checking it was quick and easy. Would recommend."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nicola Newton",
          "Nb_Reviews": 2,
          "Date": "2018-06-03T19:14:28.000Z",
          "Titre": "I didn't realize I could do this if I…",
          "Contenu": "I didn't realize I could do this if I clicked 'View Transcript' until today. Overall, the transcripts have been good. The only thing I'd suggest is having more accent options at upload; currently, you have Australian, and while tempted to click that to represent my New Zealand accent, they can be very different (as with South African). So please add that when you can."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "K  Lawrence",
          "Nb_Reviews": 2,
          "Date": "2018-08-07T07:00:43.000Z",
          "Titre": "Great value for money and excellent…",
          "Contenu": "Great value for money and excellent quality beats AI systems hands down.  We know because we used one as well and the results were not half as good. We are definately going to incorporate this service into how we do things.  Only reason its not 5 stars is that there were a few errors or gaps but note highly technical  and some very nad recordings with foruegn accents."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Parker",
          "Nb_Reviews": 4,
          "Date": "2019-05-13T14:32:32.000Z",
          "Titre": "There were some inaudible pieces",
          "Contenu": "There were some inaudible pieces, which when I listened to my recording I was able to understand and edit my transcript. There were two words, strong curse words, that were transcribed that were not in the recording and I had to fix after listening to the recordings...but for the most part all was pretty good and saved me a ton of time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "james gurd",
          "Nb_Reviews": 6,
          "Date": "2018-05-21T11:42:27.000Z",
          "Titre": "Value for money - quick and reliable",
          "Contenu": "Pretty good service, fast and efficient. I'm not sure how it can be human transcribed though given how quick the turnaround was - from the copy that comes back, it looks like it's machine done and then most likely human edited but i could of course be doing Rev a disservice!But the output is good and definitely value for money. I will happily use again.thanksjames"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nan",
          "Nb_Reviews": 3,
          "Date": "2019-01-17T19:41:34.000Z",
          "Titre": "Rev is great!",
          "Contenu": "Rev is quick, accurate and well worth what they charge.  The only reason I took away a star is that I submitted multiple files for transcribing and there was not a cohesive format so each transcript was differently laid out.  I needed to combine to send to client and had to spend a couple of hours reformatting the docs so they would be uniform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Master",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T21:07:23.000Z",
          "Titre": "Good Experience Once I Was Able to Get My File Uploaded",
          "Contenu": "Once I was able to upload my file in the right format, it was a fast and smooth process. I did have trouble with my WebEx file format and the Rev support staff were not helpful in giving advice on how to get it into a format their system would accept. I had to do some research myself on that. It would have been helpful to get instructions on how to convert my file. Other than that, I'm pretty happy with the result."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Rook",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T07:57:39.000Z",
          "Titre": "Really good",
          "Contenu": "Really good, got the captions very quick. Minimal errors in style. I gave it 4 stars not 5 stars because I'm unsure about the fairness of your labor practices. This gig economy stuff is really unregulated, a five-star experience for me would include the company taking a leadership role in the industry."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "MickMake",
          "Nb_Reviews": 1,
          "Date": "2018-08-16T11:09:20.000Z",
          "Titre": "#090 MickMake Meets Dave Jones / EEVBlog Part 4: Living on the edge",
          "Contenu": "My very first video that was transcribed was very very poor. However, they came to the party, held up their promise and re-transcribed the video with 99% accuracy.It's not often that you come across a company that will fix their mistakes so easily. So hats off to them.I've since had 7 more videos transcribed with good results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah Giamei",
          "Nb_Reviews": 1,
          "Date": "2019-03-18T17:33:14.000Z",
          "Titre": "The Subtitles were not 100% accurate",
          "Contenu": "The Subtitles were not 100% accurate. Some contextual errors. \"Inc. Magazine\" was spelled INK. With that said, there was an extremely fast turnaround, within a few hours for 17 short videos. Also, the format that is supposedly designed to be edited in Adobe Premiere was able to be imported but not editable."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Marta Van Patten",
          "Nb_Reviews": 2,
          "Date": "2018-05-17T16:07:51.000Z",
          "Titre": "It was excellent",
          "Contenu": "It was excellent.  I was only slightly disappointed by a couple of them, where every sentence was a new paragraph which took me some time to clean up.  Most of them had a paragraph with several sentences in it, which was more workable on my end.  I also think for one of the interviews out of the 20 I sent to Rev.com, the transcriber didn't check the key words I had supplied. Otherwise, incredible accuracy.   thanks again. I will definitely be using Rev.com again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil Mariasy-Allied Media Group",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T19:11:56.000Z",
          "Titre": "User-Defined Project Folders",
          "Contenu": "As a documentary video producer, the time I've saved with a marginal expense is phenomenal. The only HOWEVER, and I've asked multiple times for this, is that there REALLY needs to be a method of storing files in user-definable folders. Since becoming an avid Rev user just over one year ago, I now have over 100 transcript files, many of which I refer back to over and over. It would be such a bonus to have an easier method that project references to find things in. Otherwise, this service is a God-send!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie from NYC",
          "Nb_Reviews": 1,
          "Date": "2018-10-18T14:25:39.000Z",
          "Titre": "Hug quality transcripts with fast turn around",
          "Contenu": "The transcribers that work for Rev.com are very professional and fast. Turn around is faster than anything you can do on your own. Rev even offers additional services like time stamping for a modest fee. Love how you can play your video and what the transcript highlight the word spoken, and that you can download your transcript as a document. I do not give them five stars only because I believe they should pay their transcribers a higher hourly rate or percentage of profit. 60% Rev / 40% transcriber."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Eischen",
          "Nb_Reviews": 1,
          "Date": "2019-02-08T18:14:15.000Z",
          "Titre": "Extremely fast and a great value",
          "Contenu": "Extremely fast and a great value, but I wish there was way to get better consistency (I use the split approach where each transcriber gets 15 minutes). The quality suffers when the topic is technical or specific and I can't share discussion guides or test materials that would assist the transcribers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Chisolm",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T01:53:53.000Z",
          "Titre": "Recently had an incident where the…",
          "Contenu": "Recently had an incident where the transcription of two identical portions of a recording, within a recording, were completely different when I did a side-by-side comparison. That is unusual because they are usually pretty accurate."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Shirley Dalton",
          "Nb_Reviews": 2,
          "Date": "2019-09-28T01:53:34.000Z",
          "Titre": "the transcription was good",
          "Contenu": "the transcription was good, i wanted the accuracy however the cost of $88 Australian dollars with the exchange rate makes it too expensive to do on a regular basis and the cheaper ai transcription takes too much of my time to fix the errors, especially with the australian accent"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terrance Sanders",
          "Nb_Reviews": 2,
          "Date": "2018-05-18T03:06:04.000Z",
          "Titre": "Did the work fast and of great quality",
          "Contenu": "Did the work fast and of great quality. Im a first time film maker and will be using this company for my next film as well. I would have rated 5 stars but when I edited my subtitles i had double the lines over the edited ones. That may be my own fault but great experience and im a repeat customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Adler",
          "Nb_Reviews": 1,
          "Date": "2019-04-05T13:23:59.000Z",
          "Titre": "Consistently very quick turnarounds",
          "Contenu": "Consistently very quick turnarounds. Some issues with who is speaking but that sometimes is a GIGO (garbage in, garbage out) issue. REV could improve this by allowing better descriptions of speakers, the order of speakers, etc. But the transcriptions are always useable and timely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mg",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T19:40:15.000Z",
          "Titre": "The transcribing is done flawlessly but needs more frequent timestamps",
          "Contenu": "The transcribing is done flawlessly. The only suggestion I have is having more time stamps. It is often useful to have frequent time stamps so you can go to a particular part easier. Having almost 5 minutes or more between time stamps is not helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy!",
          "Nb_Reviews": 1,
          "Date": "2018-12-18T15:31:19.000Z",
          "Titre": "High quality (~95%) transcription &…",
          "Contenu": "High quality (~95%) transcription & timings.  Incredibly fast turnaround (3.5 hrs for a 15 min video).  I now just need to find a way to provide some guidance for the transcription process -- e.g., Don't put any dashes at start of lines. FYI, your Terms & Conditions are not fully readable online.  The only way to see the full document is to download it, or open it online and Ctl-A (select all), copy, paste into a new document, since there's no way to view the whole thing online -- there's no vertical slider for some reason."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Esther Aguirre",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T16:37:17.000Z",
          "Titre": "Minutes for Resource Development Meeting 4.10.19",
          "Contenu": "I was pleasantly surprised at how quickly I received the transcription back and how accurate it was.  I did compare it to someone else's transcript of the same conversation through REV and it seems that my person was able to hear and decipher better than the other person."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lissa Barnum",
          "Nb_Reviews": 1,
          "Date": "2020-04-18T21:30:16.000Z",
          "Titre": "Great, Fast Service",
          "Contenu": "Using Rev full service for transcription was excellent, the part of Rev have a rough draft is just that, more changes then I would like to make, but I do not see paying $125. per minute for information that I am not going to use in professional document, unless I am using this as a finished product for guided processes, client sessions, blogs etc.  I typically record much of what I do also for meetings, doctors visits, project brain storming etc.  This is the work I would like to have a little better transcription but do not need a polished copy.  However the .25cents is a very good price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thom",
          "Nb_Reviews": 9,
          "Date": "2019-12-16T18:25:40.000Z",
          "Titre": "Great service, hate to have to leave.",
          "Contenu": "The service has been great and I've enjoyed working with Rev up until reading the article about their hiring practices in the NYT.   Unless something emerges to indicate they value the people who work for them this will be my last transcript order to Rev.com"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Tracey Franks",
          "Nb_Reviews": 4,
          "Date": "2022-02-14T21:46:21.000Z",
          "Titre": "Consistently good output",
          "Contenu": "Consistently good outputhaving tried a number of transcription services, I find REV.com to provide a consistently good transcript. Not perfect, but close. And streets ahead of an AI solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will-be-returning Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-17T14:47:48.000Z",
          "Titre": "Incredibly fast turnaround",
          "Contenu": "Incredibly fast turnaround, and pretty accurate. I would have given 5 stars except there were 3 spots in a total of 28 minutes that weren't entirely accurate. Not bad ratio though considering. For this particular project, speed was more important than word-for-word accuracy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T23:18:59.000Z",
          "Titre": "Great job overall!",
          "Contenu": "Speed was excellent, 4 stars because some of the captions required minor edits (spelling, wrong words etc). Overall very pleased with the price and the product. And the online tools make it fairly simple to make adjustments to captioning before downloading!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AN",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T20:58:31.000Z",
          "Titre": "The quick turnaround was great",
          "Contenu": "The quick turnaround was great, but I did have to go in and clean up a lot of grammar. Whoever did the transcription for our video REALLY likes commas! Did save me some time from having to do the whole thing myself, though. $1/minute isn't bad either!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Reed",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T03:25:03.000Z",
          "Titre": "the best transcription service out…",
          "Contenu": "the best transcription service out there and the fastest and best value. They took away the ability for me to send special instructions to the transcriptionist which I found useful and I think they did too, so that's the reason I deducted a star. But, still very good."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Marisa",
          "Nb_Reviews": 1,
          "Date": "2018-06-20T14:26:49.000Z",
          "Titre": "Good overall",
          "Contenu": "Good overall, but when I was cut off due to an internet glitch while completing the order, I was unable to list some of the foreign words in the interview. After paying for a order, a customer should be able to use the \"edit\" feature to add these tag words."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2018-08-03T14:46:10.000Z",
          "Titre": "Close to perfect!",
          "Contenu": "There were 4 people on the phone, and the only real issue seemed to be a handful of misspellings and a few mixups on who was speaking, but meat of what was said was captured, and that was very important. The client said the transcript was fabulous, so three cheers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck Wasserstrom",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T14:28:41.000Z",
          "Titre": "4 1/2 stars would be more accurate",
          "Contenu": "4 1/2 stars would be more accurate! I'm a big fan of Rev.com. I do a lot of interviews, and the accuracy of the transcriptions is tremendous. The turnaround time has -- for the most part -- been amazingly quick. I definitely recommend working with Rev.com."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T21:34:25.000Z",
          "Titre": "I thought that for the cost it was…",
          "Contenu": "I thought that for the cost it was really well done. However, I did have to edit a bunch to make the pacing of the subtitles match the delivery. But even so, that didn't take way too long. Great work."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "jonny m - oz",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T07:52:57.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service.  Quick turnaround.  Sometimes medical references not quite right but majority of the time they are.  Some times speaker names are the wrong way around (happened twice in last 10 orders)Highly recommend though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas Bischoff",
          "Nb_Reviews": 2,
          "Date": "2020-07-22T13:43:49.000Z",
          "Titre": "Good Transcription - Timing a Bit Off",
          "Contenu": "The transcription was mostly spot-on, though the timing seemed off in many places. For example (birds chirping) was on screen for 15 seconds, throwing the timing of the next dialog off by 5 seconds. Beyond that, very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Cavill Jr",
          "Nb_Reviews": 1,
          "Date": "2018-06-28T13:00:48.000Z",
          "Titre": "Fast and Efficient",
          "Contenu": "The transcript was finished and ready to go within only a couple of hours. It was a fast and efficient service. My only reservation is that there were a few small errors. These were easy to find and correct though.Overall, I was quite impressed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Foxtale Productions",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T16:05:08.000Z",
          "Titre": "A Huge Time Saver With The Occasional Hiccup",
          "Contenu": "I use REV on a weekly basis. They remove a large part of my workflow and at a great price. There is the occasional misspelling that means my team needs to watch through each file we receive but it is not a consistent issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rebecca moore",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T17:48:35.000Z",
          "Titre": "turn around is great",
          "Contenu": "turn around is great. Still had to go through and correct words that were not accurate and revealed the transcription is not checked by humans. Not a big deal and all and very high value for the convenience and cost. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gasper Patrico",
          "Nb_Reviews": 3,
          "Date": "2018-07-03T17:11:54.000Z",
          "Titre": "Great User Experience",
          "Contenu": "Great User Experience. Love the quick turnaround and the accuracy and neatness of the transcription format.For me, the only thing that would make it better is if the transcripts came back with page numbers and title in the header."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marilyn",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T17:34:56.000Z",
          "Titre": "The translation was quick and mostly…",
          "Contenu": "The translation was quick and mostly accurate. They got it back to me very quickly and I was appreciative of that. I am having to go back through and fix some errors though which is why this is not 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2020-03-01T21:46:10.000Z",
          "Titre": "I was very happy that most names of…",
          "Contenu": "I was very happy that most names of philosophers and other somewhat esoteric terms were captured correctly. A little disappointed that all inappropriate language was not omitted. A very good job was done overall!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Kennedy Phillips",
          "Nb_Reviews": 1,
          "Date": "2019-01-04T20:47:06.000Z",
          "Titre": "Days of Transcribing reduced to under an hour.",
          "Contenu": "It would have taken me hours to go through all the edits on my files. while I would have liked a little more description and I ended up having to review a lot of editing, but I was overall satisfied with the experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Wohl",
          "Nb_Reviews": 1,
          "Date": "2019-11-01T16:29:05.000Z",
          "Titre": "They did a nice job",
          "Contenu": "They did a nice job, but I asked them to use Q and A instead of names and they did not. Also asked for single spaced. There were a few missed words as well as spelling, but all things considered it was good work."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "N Robinson",
          "Nb_Reviews": 1,
          "Date": "2019-08-01T14:51:08.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent turnaround on my transcription service. A few errors but all expected due to style and quality of my recordings - really impressed! The support team were also available to help whenever I needed it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "michael J",
          "Nb_Reviews": 3,
          "Date": "2020-09-30T14:50:28.000Z",
          "Titre": "Great transcription of complicated meeting",
          "Contenu": "Great transcription- complicated meeting transcribed well- but missed a full sentence and a couple of words were off. Easily fixed! Quick and reliable service just like my prior orders have been."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2020-01-05T18:03:02.000Z",
          "Titre": "This is an absolutely great service",
          "Contenu": "This is an absolutely great service. I like it a lot.   I only wish they had the opportunity to email entire folders of finished transcriptions. But other than that minor issue I am highly recommend Rev"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Pinder",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T10:24:20.000Z",
          "Titre": "I would give you guys a 98% accuracy…",
          "Contenu": "I would give you guys a 98% accuracy rating.  You do make our job a whole lot easier.  My son still has to make about 2% corrections on each video.  We will continue to use you guys.  You are doing good work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cameron Turner",
          "Nb_Reviews": 1,
          "Date": "2021-03-14T16:46:34.000Z",
          "Titre": "The text translation was very good",
          "Contenu": "The text translation was very good. The speakers were mixed up, with both interviewers being included, but not the interviewee. In the end, a fairly simple find and replace at our end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David K",
          "Nb_Reviews": 2,
          "Date": "2020-03-31T18:30:38.000Z",
          "Titre": "Rev is a great service",
          "Contenu": "Rev is a great service. There were a few errors in the captions, but I blame that mostly on video quality, it was hard to hear what was being said. I will definitely be using their service again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry Carlin",
          "Nb_Reviews": 1,
          "Date": "2018-06-22T06:23:04.000Z",
          "Titre": "All is great",
          "Contenu": "All is great. I am very happy. The quality, accuracy, cost and turnaround time.I could not give 5 because I still had to edit and make changes, but that is really unrealistic to expect. so, you deserve a 5"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Timur Mansuraliev",
          "Nb_Reviews": 1,
          "Date": "2019-11-01T00:50:29.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, but should improve client’s expectation management and update clients ASAP when a script is not valid for a transcription. Other than this, good service and customer oriented support."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T22:01:17.000Z",
          "Titre": "Rev is impressive",
          "Contenu": "Rev is impressive, very fast, great pricing, but there are a few mistakes/inconsistencies scattered throughout the usual 1min clip. Very easy to fix in Pr though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana Long",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T21:37:46.000Z",
          "Titre": "The first batch of transcriptions that…",
          "Contenu": "The first batch of transcriptions that I ordered came in as Word docs instead of SRTs. I still have to fix some of the transcriptions from Rev.com, but overall, it worked o.k. Not too expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marvette Lacy",
          "Nb_Reviews": 3,
          "Date": "2018-12-06T11:09:14.000Z",
          "Titre": "Best Transcription Service",
          "Contenu": "Thank you for a quick turnaround and great quality transcript. There were a few things marked inaudible which I think there were just due to cultural differences. Best service I've ever used!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Lara Mottee",
          "Nb_Reviews": 1,
          "Date": "2018-11-29T13:49:58.000Z",
          "Titre": "2/3 of transcripts I submitted were…",
          "Contenu": "2/3 of transcripts I submitted were great! The third wasn't so good, but I complained and they are redoing it for free. Great customer service and would use their transcription service again!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Tejas S V",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T03:35:30.000Z",
          "Titre": "It was nice",
          "Contenu": "It was nice , easy to use and very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T16:12:14.000Z",
          "Titre": "Really fast turnaround time",
          "Contenu": "Really fast turnaround time. There were a few typos/mistakes but that is to be expected, and nothing that was difficult to fix. Definitely recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evelyn Francis",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:40:23.000Z",
          "Titre": "Well done.",
          "Contenu": "I thought the detail was well done. I probably should have provided a word list for some unique words and proper names. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neeko",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T19:49:55.000Z",
          "Titre": "Make order name option more visible",
          "Contenu": "Services are great but they need to change ONE little thing: the option to add a project name should be readily visibly on the order screen without having to scroll down to see it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Will Gillespie",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:02:47.000Z",
          "Titre": "Very quick",
          "Contenu": "Very quick, affordable and easy to use. I was glad to be able to fix and edit right on the website. Saved me days of formatting and typing. Will use it again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Bennett",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T15:56:52.000Z",
          "Titre": "Good Transcription, a Little Expensive",
          "Contenu": "Great, accurate, fast transcription. My only criticism is the price. I'm willing to pay for transcription, but the Rev.com pricing is too high in my opinion."
        },
        {
          "Note": 4,
          "Lieu": "BN",
          "Pseudo": "Fu Ton",
          "Nb_Reviews": 2,
          "Date": "2020-05-23T16:03:32.000Z",
          "Titre": "Accurate caption given",
          "Contenu": "Accurate caption given. FAQs is not helping much (not very clear with directions), didn't really help solve the problem. Had to youtube things that suited to solutions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P kimmel",
          "Nb_Reviews": 3,
          "Date": "2019-08-27T01:52:31.000Z",
          "Titre": "Rev.com works but should be a bit more affordable",
          "Contenu": "It took me a bit of time to figure out the export feature but editing was easy. Once I worked with the program, I found it fairly easy.It seems to be a bit expensive however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Callie",
          "Nb_Reviews": 1,
          "Date": "2019-05-08T16:16:47.000Z",
          "Titre": "Great and Fast",
          "Contenu": "Fast, reliable, good service. Not perfect transcriptions and some were unable to transcribe due to audio quality. A very good user interface for ordering, editing, and viewing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TIFFANY BELLOWS",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T15:18:59.000Z",
          "Titre": "I’d give it 5 but",
          "Contenu": "I’d give it 5 if there was some way to name each person speaking. It seems expensive for not being able to request a few minor changes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Kasmer",
          "Nb_Reviews": 2,
          "Date": "2019-07-22T07:57:07.000Z",
          "Titre": "I had to make several changes to the…",
          "Contenu": "I had to make several changes to the transcription on youtube. So it took some time even after having received the order to still finish the transcription myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Hiam",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T09:51:17.000Z",
          "Titre": "You did a really good job",
          "Contenu": "You did a really good job.  After reviewing there were some minor errors.  It was super easy to go in and correct and re-upload to YouTube right from your webise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Script User",
          "Nb_Reviews": 1,
          "Date": "2019-11-06T18:09:21.000Z",
          "Titre": "Good Quality, but speed costs.",
          "Contenu": "Transcription was mostly accurate, and delivered speedily enough (paid for expedited time, otherwise, the rating might be a star lower given the wait time)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Shaffer",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T18:48:43.000Z",
          "Titre": "Last Transcription Lousy!",
          "Contenu": "Had 3 transcriptions done this month.  Just reading through the last one and LOTS of errors, not so happy with the results of this one.  The other two were fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kate Bornstein",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T18:48:38.000Z",
          "Titre": "Almost Perfect",
          "Contenu": "Great job. Thanks! , but since one speaker spoke for nearly the whole hour, I didn’t need their name between every paragraph. Other than that. Terrific!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy Hendrix",
          "Nb_Reviews": 1,
          "Date": "2018-11-21T12:49:25.000Z",
          "Titre": "I used Rev.com to transcribe two focus…",
          "Contenu": "I used Rev.com to transcribe two focus groups. I was very happy with the turnaround time and quality of the transcription. Using Rev.com saved me days of work."
        },
        {
          "Note": 4,
          "Lieu": "CK",
          "Pseudo": "Daniel Fisher",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T22:09:20.000Z",
          "Titre": "Great platform",
          "Contenu": "Great platform, just the Japanese translations I got for video subtitles were a little off. Had to get these re translated by a Japanese speaker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JRLA MSIA",
          "Nb_Reviews": 1,
          "Date": "2018-05-31T19:51:56.000Z",
          "Titre": "My experience so far has been less than…",
          "Contenu": "My experience so far has been less than 90% accurate with transcription, even when paying for verbatim. I'd like to see it improve!Thanks for asking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adwerks",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T19:24:48.000Z",
          "Titre": "I love REV.com for ai transcripts of…",
          "Contenu": "I love REV.com for ai transcripts of videos -- such a time-saver! And the human-generated captions are remarkably accurate!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tammy Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:47:53.000Z",
          "Titre": "Rev has Rev'd It Up!",
          "Contenu": "I worked with Rev years ago, and did not have the best experience.Working again with them years later, I can see the strides they have made as a company, and could not be happier with the results and the service.Rev it up!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "heather pomfret",
          "Nb_Reviews": 4,
          "Date": "2023-10-13T17:49:55.000Z",
          "Titre": "I've been having a little flutter with…",
          "Contenu": "I've been having a little flutter with these guys for about 8 months. I've probably spent £200. I've won a Louis Vuitton bracelet valued at £250 but there was a problem and they couldn't deliver it, so they sent me the money. I've won a Nintendo OLED, £250 rev comps credit with which I tried my luck for free and won a beautiful pair of Ugg boots worth £150.00. Great little site and the correspondence is second to non. Thanks for keeping me entertained guys. It's 5 stars from Heather x"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam B.",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T23:11:13.000Z",
          "Titre": "Damn near miraculous performance",
          "Contenu": "I don't know how, but whomever transcribed this interview identified the speakers and even spelled their names correctly--no easy feat, as they were Ukrainian names spelled in English. They were the same as the press release I was sent. Not only that, they were able to distinguish the speakers, which I couldn't even manage during the phone call. I'm so glad Rev makes recording and transcribing this easy. The time it saves me when I'm on deadline makes it worth every penny! And the turnaround time is usually mindbogglingly fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arturo Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T10:48:21.000Z",
          "Titre": "As an attorney, Rev is essential. Wish I found Rev 10 years ago",
          "Contenu": "I found Rev a year ago, wish it was ten though. As an attorney for the price, speed and accuracy, Rev is essential. It costs nothing compared to the benefit to have audio recordings transcribed and downloaded into Word, where I easily frame them into court documents. The ability to listen and make changes actually makes me acutely more aware of the content in my evidence. As a result, I am more prepared than my opponents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Slack",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T22:10:58.000Z",
          "Titre": "Wow what a great product",
          "Contenu": "Wow. Fast, good, easy, and quality. Wish I had found this first."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bastian Blonk",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T18:13:04.000Z",
          "Titre": "Accurate transcript with super-fast turn-around time",
          "Contenu": "This month I used Rev.com for the first time for a transcript of a 45-minutes meeting, which required a time-stamped and verbatim format. Against expectation, I did not request express service, I received the transcript already within four hours, way faster than predicted. Compliments and many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Martin C",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T01:17:36.000Z",
          "Titre": "Great value for money",
          "Contenu": "For the past two months we have been leaning heavily on Rev for interview transcriptions. We needed high accuracy and hoped for speedy turnaround without paying a premium. Rev did not disappoint. In total we outsourced roughly 30 interviews ranging from a few minutes to an hour. All were turned around more quickly than we anticipated. Having fast, accurate transcriptions accelerates our ability to analyze complex subject material and produce quality deliverables for our clients in a timely manner. The service we get from Rev really is a key success factor. I have worked with several transcription firms over the past 15 years and none can compare with Rev."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory Gustke",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:58:44.000Z",
          "Titre": "Flexibility",
          "Contenu": "Flexibility.  It was easy to update and customize, made the process very quick and simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Bauer",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T17:44:33.000Z",
          "Titre": "Great Experience and Time Saver",
          "Contenu": "Rev has done an outstanding job with my transcriptions.  This also includes video that has individuals with strong accents.  The transcriptions are highly accurate and are a massive time saver over transcribing them myself.  Turn around is also fantastic with the longest turnaround at 15 hours (it was a big file).  Most times, turnaround happens within hours.  It's a great experience.  The website is user-friendly and they offer many options for transcription types.  I will continue to use Rev as they do a great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Pearce",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T20:30:54.000Z",
          "Titre": "Clear and accurate transcriptions",
          "Contenu": "The transcriptions always come through quickly. Many of my interviews have a lot of medical terminologies. Most of the time those come through, which is really hard to do. So big thank you for tackling getting down complicated scientific language, disease names, procedures, and names of drug therapies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete L",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T01:39:31.000Z",
          "Titre": "Excellent first-time experience",
          "Contenu": "Excellent first-time experience. The turn-around time was less than half the projected number of hours, and the error rate was very low. My own fingers would have many more mistakes and taken many hours longer. Nice work, Revs folk. I'll be back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Henry",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T02:57:55.000Z",
          "Titre": "Oscar Ready",
          "Contenu": "I was novice to this requirement for AMPAS (Oscars) screening room. I was informed my selection was wrong and the tech. representative got me on the right track. I was pleased on the result and I even got an e-mail from AMPAS I was good to go. Who knows you might even see my film in short list for 'action-live' short films! Thanks for the fast turnaround and the quality result. - David Henry Production"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Brunner",
          "Nb_Reviews": 4,
          "Date": "2022-07-22T15:51:50.000Z",
          "Titre": "Automated or Human Transcription for Technical Writing: Both Great",
          "Contenu": "I've used a couple of other transcription services and have found Rev.com to be superior. I work in orthodontics so dental nomenclature, appliances, company, and technique names are tricky. For these, I use the Human Transcription and find the ability to list technical terms to which the transcribers can reference invaluable. They always seem to incorporate those terms correctly. BTW, my clients span the globe so the accents are sometimes tricky but the result is still excellent. I often just use the Automated service because I need only to pick up on key ideas. The website is a dream with a simple layout and clear instructions even for first-time users. And having a history of my uploads is quite handy. Turnaround is excellent. My business depends on Rev and I'm quite grateful for this professional service."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Bee tts",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T02:40:56.000Z",
          "Titre": "for the fact that am an american but…",
          "Contenu": "for the fact that am an american but currently working in africa. I was working with company it pays pretty well but now when i went to africa they deactivated my accoun . I was transcribing with high accuracy. my question is can I work on this company while working in africa"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kekama Amona",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T09:55:27.000Z",
          "Titre": "Awesome way to get closed captions done with ease.",
          "Contenu": "My cinematographer suggested Rev.com for the closed captions we needed for the short film we are working on now. This is the first time Iʻve had to make captions for a film Iʻve done and Rev.com made it really simple and practical. Because the captions I needed to make are in a Hawaiʻi Creole Pidgin English language, I had to do revisions but I expected that. I was presently surprised at how easy and intuitive it was to edit the captions in the editor. I will definitely use Rev.com again for the next film or video content projects I have lined up in the near and further future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Matros",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T02:21:40.000Z",
          "Titre": "Always impressed",
          "Contenu": "All the transcripts I've received from Rev.com have been meticulously rendered. I'm always impressed by the care the transcribers do when finding the correct spelling of proper names."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Paquin",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T00:15:33.000Z",
          "Titre": "Very fast and accurate",
          "Contenu": "Very fast and accurate.  I can count on the job being prepared and delivered earlier than expected.  When I'm preparing for trial, and under the gun, Rev.com is one less thing I need to worry about, Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Doolittle",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T17:03:11.000Z",
          "Titre": "Fast, Accurate, and Reliable",
          "Contenu": "We had several interviews that needed transcribing and Rev had them transcribed clearly and accurately in less than 2 days. I've used Rev before, and I'll use them again. They are my \"go to\" transcription service. I recommend them to all of the qualitative dissertation students."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Patricia O",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T09:40:22.000Z",
          "Titre": "Amazing!",
          "Contenu": "Easy peasy to use!  Not only that, the accuracy is phenomenal and customer services is very helpful.  I tried the human + Max (subscription), and prefer the latter as the results are more or less instantaneous and the accuracy (in my case), very close to perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Kindred",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T20:51:04.000Z",
          "Titre": "All my orders have been fulfilled so…",
          "Contenu": "All my orders have been fulfilled so well I’d give you 6 stars. The only problem has been a failure to upload one order promptly. The suggested fixes were to empty caches and/or change browsers. I didn’t want to do either. Instead, I tried uploading multiple times and succeeded in the 7th or 9th try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Criminal Defense Attorney",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T15:47:13.000Z",
          "Titre": "Invaluable Tool",
          "Contenu": "I am so happy to discover Rev.com. I am an attorney and often have recordings or video clips that need to be transcribed. Rev.com has saved my staff hours and hours and the finished product is very helpful in the courtroom in confronting witnesses with their own conflicting statements. This is a great tool and I highly recommend Rev.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T17:39:38.000Z",
          "Titre": "I have come to love Rev.com's quick and…",
          "Contenu": "I have come to love Rev.com's quick and easy to edit Automated Transcription services.  It has become invaluable to me in a very high-profile labor and employment and whistleblower claim."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter du Pont",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T20:19:01.000Z",
          "Titre": "Quality transcripts in short time frame",
          "Contenu": "We rely on Rev.com to prepare quality transcripts of our research interviews, which are typically between 30 and 75 minutes.  We continue to be impressed with the quality of the transcription."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carma B.",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T21:46:31.000Z",
          "Titre": "Great User X & Superior Transcription",
          "Contenu": "Rev.com was very simple to use from initiation of services to completion of the transcript. I was able to easily upload my documents and 501c3 status electronically, and the transcription was completed in less than 24 hours with incredible accuracy! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Carpenter",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T19:17:01.000Z",
          "Titre": "Quick and beyond expectation",
          "Contenu": "I was very happy with the captions from Rev. It was a quick turn around they provided descriptions of sound effects and score, in addition to dialog. There weren't many corrections to make (2 or 3) and the editor was very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R.G. Filmmaker",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T18:14:15.000Z",
          "Titre": "Rev Knocked It Out Of The Park!",
          "Contenu": "We needed our film closed captioned. We were on a deadline. And my mind was actually blown that Rev completed the full captioning of our 95min feature film in less than 6 hours. And the captions were exceptionally good. Thank you SO SO MUCH!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Amos",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T08:23:57.000Z",
          "Titre": "Everything was top-notch",
          "Contenu": "Everything was top-notch. From top to bottom, I thoroughly appreciate what Rev.com does for me and my business. I was going to do it myself this time to save money, but it is worth every cent to be able to focus on other matters and then just run with the product that Rev's fine people produce."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Obermann Center",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:55:12.000Z",
          "Titre": "You always do such a terrific job",
          "Contenu": "You always do such a terrific job! Names are always spelled correctly, too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernadett Belinda York",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T00:57:33.000Z",
          "Titre": "Quick turnaround for scc/srt files!",
          "Contenu": "I needed closed captioning scc/srt files  for a pilot I produced. Rev.com was affordable, convenient, and delivered the files quickly. Like, in two hours! Will use again and would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Stanfield",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T22:42:27.000Z",
          "Titre": "Submitted my movie file",
          "Contenu": "Submitted my movie file, recommended turnaround time was 2 days and sure enough, two days later my CC file was ready. Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Forster",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T18:34:05.000Z",
          "Titre": "This is the first time I used Rev…",
          "Contenu": "This is the first time I used Rev transcription service. I was impressed by the fast turnaround even though I hadn't paid for expedited service. And I was impressed with the accuracy of the transcription."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael G",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T05:14:55.000Z",
          "Titre": "This was my first time using Rev.com: A+",
          "Contenu": "This was my first time using Rev.com.  As explained by my co-worker, the experience was fast and easy. And the results where exactly what we expected and timely."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "ZHANG Shuai",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T05:35:13.000Z",
          "Titre": "a reliable helping hand",
          "Contenu": "Timely, professional, and as accurate as possible~but, frankly speaking, the increased fee is becoming a burden for me so I have to reduce my use of Rev.com to the extent that only when it's absolutely necessary."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris R",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T09:28:11.000Z",
          "Titre": "I am constantly impressed by your…",
          "Contenu": "I am constantly impressed by your service - the speed and accuracy, plus your transcribers' ability to pick up technical vocabulary. I regularly recommend your service. Thank you to one and all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene Denson",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T19:26:48.000Z",
          "Titre": "First time using the service",
          "Contenu": "I had some recording I needed good. Transcripts of in a hurry. Some of the speech on them was poor quality but within a couple of hours I had high quality transcripts which needed very little correction. I’m coming back for more."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Kieran Spencer Rossikhin",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T02:00:43.000Z",
          "Titre": "I needed to transcribe an interview…",
          "Contenu": "I needed to transcribe an interview last minute for my wife’s thesis. Rev was a million times better then doing it through word."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reverend Tony Ponticello",
          "Nb_Reviews": 2,
          "Date": "2022-09-30T02:08:11.000Z",
          "Titre": "Rev.com always delivers.",
          "Contenu": "I've been using Rev.com regularly for about 2 years. Never any problem. Service is amazingly fast. We used to do these transcriptions in house. They would cost us more money and not be as good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CRE",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:23:41.000Z",
          "Titre": "Great Job",
          "Contenu": "Great job! Transcription was spot on. My subject spoke very fast (and a lot!); I even had trouble keeping up during the interview. Really impressed with Rev. Thank you for an excellent job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Rhodes",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T19:06:51.000Z",
          "Titre": "Prompt and accurate",
          "Contenu": "Prompt and accurate.  I would recommend that once the glossary is entered and connected to a later transcript, that the spellings be better checked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne Kemen",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T02:26:31.000Z",
          "Titre": "I sent an interview that was 3+ hours…",
          "Contenu": "I sent an interview that was 3+ hours long. I was told to expect 72 hours turnaround, but it was early and very professionally done. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick B.",
          "Nb_Reviews": 4,
          "Date": "2022-12-28T17:27:34.000Z",
          "Titre": "professional job",
          "Contenu": "I was impressed by the lengths to which the transcriber apparently went to get the names and spellings  of very difficult people and places correct, an indication to me that the individual is paying attention to what is being said in terms of context and accuracy. One example from this recent interivew--the place name of Oxyrhynchus--makes the point."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gabriela Di PERNA",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T05:26:42.000Z",
          "Titre": "I hardly needed to make any edits!",
          "Contenu": "i hardly needed to make any edits!The order system was so easy and quick and the turnarund time surprisingly short.A great experiecne overall!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ignacio Granados",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T00:45:19.000Z",
          "Titre": "The jobs are perfectly done",
          "Contenu": "The jobs are perfectly done, and the prices are reasonable too, in a time when they don't usually are. The service is easily accesible and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal Cha",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T20:46:54.000Z",
          "Titre": "I used REV and although it wasn’t their…",
          "Contenu": "I used REV and although it wasn’t their fault that the transcript wasn’t exactly perfect as I had wanted, it was pretty darn good.  I give REV 5/5 star.  They definitely delivered what they promised. I’d used REV again for certain.  I’d like to thank the REV team for the great work I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 4,
          "Date": "2022-11-02T16:22:19.000Z",
          "Titre": "Well done!",
          "Contenu": "As previously, great work and a great interface, and a terrific result-- in a timely fashion for a very fair price point.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Ambriz",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T23:11:41.000Z",
          "Titre": "Great Job!…",
          "Contenu": "Transcriptions were completed quickly and were very accurate.  I love the feature to review the transcripts word for word while the video is playing simultaneously."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Finance writer",
          "Nb_Reviews": 7,
          "Date": "2023-01-18T13:02:43.000Z",
          "Titre": "Absolutely essential",
          "Contenu": "This is a great service that has become an essential part of my business. I could not operate without them."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "alan Mcinerney",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T21:49:12.000Z",
          "Titre": "Very speedy and efficient service",
          "Contenu": "Very speedy and efficient service, transcribers used that suit your language/accent. Very impressed with Rev"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-24T13:33:07.000Z",
          "Titre": "Excellent app for recording and transcribing a conversation",
          "Contenu": "I had a 50 minute phone conversation that was recorded on REV in the evening and I had the transcribed copy of my conversation the next morning.  Very satisfied with the REV and would recommend this app to anyone who wants a recroded and transcribed phone conversation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Bronwyn",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T18:50:55.000Z",
          "Titre": "I Love Rev.com",
          "Contenu": "I love rev.com for the quick turnaround times and ease of uploading to site, as well as ease of editing transcripts and cc files on the site."
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Khalil Piral",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T17:52:58.000Z",
          "Titre": "Godzillao",
          "Contenu": "QUARRIESEditorialPermanent investment destinationsThe first quarter of this year witnessed a remarkable development in the Special Economic Zone at Duqm and the free zones in Sohar, Salalah and Al Mazunah in terms of completing infrastructure works, attracting investments and strengthening relations with investors. Perhaps, the most prominent of these works is completing the gas delivery project to the Special Economic Zone at Godzilla. This paved the way for connecting the integrated power and water plant in Godzilla operated by Jeep power Utilities Company, to the gas network, to start soft opening of its operations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Morris",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T21:21:06.000Z",
          "Titre": "Outstanding accuracy and turnaround",
          "Contenu": "I just reviewed the transcript with the actual recording.  I'm truly astonished at the level of accuracy, particularly given how quickly  you delivered it  to me.  Outstanding"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawna Brown",
          "Nb_Reviews": 3,
          "Date": "2022-08-19T03:13:05.000Z",
          "Titre": "Quick, easy and fast!",
          "Contenu": "Quick, easy and fast! Great triple combination. And being able to edit the text to my preference is terrific!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deanna Chandler",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T18:08:13.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, quick, and they communicate very well with clients. I would recommend for sure."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Norman Kagan",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T06:18:55.000Z",
          "Titre": "Very happy with the service but…",
          "Contenu": "Very happy with the service but unfortunately with our currency exchange rate we are VERY limited to the extent which we are able to utilise the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen S",
          "Nb_Reviews": 3,
          "Date": "2023-01-25T22:47:29.000Z",
          "Titre": "Great turnaround time",
          "Contenu": "Great turnaround time. Like having the ability to have the video running while reading the transcript."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-01-23T18:44:51.000Z",
          "Titre": "Rev always does great work and delivers…",
          "Contenu": "Rev always does great work and delivers on or ahead of schedule. That is important to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynette",
          "Nb_Reviews": 2,
          "Date": "2022-10-09T18:24:16.000Z",
          "Titre": "Fast easy and precise",
          "Contenu": "Fast, easy and precise! I would definitely recommend Rev.com for all transcription needs."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sharon Natoli",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T02:28:45.000Z",
          "Titre": "Happy customer",
          "Contenu": "Great response time, easy to use and easy to follow instructions.  Very accurate with the transcription too!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neville Hobson",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T23:14:56.000Z",
          "Titre": "Perfectly done!",
          "Contenu": "Perfectly done, very high accuracy level considering the poor quality of the audio recording. You exceeded my expectations yet again, thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernesto Medina",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T02:21:50.000Z",
          "Titre": "It was a quick turnaround and once I…",
          "Contenu": "It was a quick turnaround and once I figured out how to share the link, it was easy to put in my Canvas modules."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chi",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T04:39:54.000Z",
          "Titre": "Highly recommend this service to my friends all the time",
          "Contenu": "Fast efficient service, pretty accurate and easy to use/edit text for your needs."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Laurie O'Donnell",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T19:58:44.000Z",
          "Titre": "High quality transcription well worth the price!",
          "Contenu": "I had a tried other transcription options although cheaper, the end product was unusable. Your transcriptions were almost perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T23:49:10.000Z",
          "Titre": "They always do a very good job and in…",
          "Contenu": "They always do a very good job and in considerably less time than estimated."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Renae Dixon",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T21:33:27.000Z",
          "Titre": "Service was super quick and near perfect transcription",
          "Contenu": "Service was super quick and the latest set of transcripts i received were very near perfect. Thanks Rev"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra L. Proto",
          "Nb_Reviews": 4,
          "Date": "2022-11-17T22:34:38.000Z",
          "Titre": "Efficient, Accurate Transcription Service",
          "Contenu": "Great transcription service with speedy turnaround. I'm so grateful for your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dena",
          "Nb_Reviews": 3,
          "Date": "2022-08-18T03:48:43.000Z",
          "Titre": "It's always fast!",
          "Contenu": "It's always fast! And I love that it's possible to do some editing yourself after you've received the files."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Craig Goddard",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T02:03:44.000Z",
          "Titre": "I like that my jobs are completed in a…",
          "Contenu": "I like that my jobs are completed in a timely manner and that, for the most part, require very little, if any, editing on my part. Also I like how easy the site is to use.Cheers guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T23:12:03.000Z",
          "Titre": "The accuracy and lack of errors by the…",
          "Contenu": "The accuracy and lack of errors by the typist was great. Format is a little off from what I prefer, but it was easy for me to make changes."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nigel Bailey",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T10:21:06.000Z",
          "Titre": "Ist timer",
          "Contenu": "100% accurate, produced in under half an hour. Will use again when need arises"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T22:03:01.000Z",
          "Titre": "Great",
          "Contenu": "Rev.com is a great service, that saves me a lot of time and makes my online courses more accessible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:58:42.000Z",
          "Titre": "Turnaround time is amazing and…",
          "Contenu": "Turnaround time is amazing and captioning is very close to or absolutely perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Pocker",
          "Nb_Reviews": 6,
          "Date": "2022-12-09T17:57:29.000Z",
          "Titre": "REV has done all the transcripts for my…",
          "Contenu": "REV has done all the transcripts for my podcast website cochlearimplantbasics. Always perfect. Always fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan Harding",
          "Nb_Reviews": 2,
          "Date": "2022-06-25T23:45:14.000Z",
          "Titre": "Fast and Accurate",
          "Contenu": "Fast and accurate transcription for a couple hours of interviews! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sai D",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T13:35:04.000Z",
          "Titre": "Accurate and timely delivery",
          "Contenu": "The captions were accurate and delivered in a short time. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colette Keith",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T22:50:00.000Z",
          "Titre": "I freaking LOVE REV",
          "Contenu": "I freaking LOVE REV! I am writing a book and on my lazy days, I just record, hit send and CHAPTER added! 😎"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marilyn Wardrop",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T01:07:14.000Z",
          "Titre": "Rev is always accurate and quick to…",
          "Contenu": "Rev is always accurate and quick to translate via a person. I appreciate them as a reliable resource."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela K.",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T23:27:28.000Z",
          "Titre": "Awesome first time vendor - will now be my go-to service",
          "Contenu": "Fast, easy, simple, and truly 99% accuracy. I will only use Rev for my captioning from now on!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Lewis Schoenbrun",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T00:53:23.000Z",
          "Titre": "The Little Princess",
          "Contenu": "Fast turnaround and accurate caption titles. Thank you Rev.com!"
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Marilda Cutrone",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T12:14:31.000Z",
          "Titre": "Awesome, guys! :)",
          "Contenu": "I have used the service many times and have always been very pleased. The work is accurate and fast. Thanks, guys for the great help!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Oliver Barker",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T17:05:12.000Z",
          "Titre": "Reliable, Fast & Accurate",
          "Contenu": "Reliable, fast and accurate - what more do you need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Buckley",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T18:53:30.000Z",
          "Titre": "Turn around time was amazingly fast",
          "Contenu": "Turn around time was amazingly fast. Accuracy is very impressive, especially given the scientific content."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mohamad Tabbaa",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T01:35:03.000Z",
          "Titre": "Consistently good quality captions",
          "Contenu": "Consistently good quality captions, speedy service and great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clay S.",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T16:34:39.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent. I've done both the automated and the assisted and am very pleased. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Khalil Piral",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T22:34:26.000Z",
          "Titre": "While expressing our profound thanks",
          "Contenu": "While expressing our profound thanks and appreciation to OQ, one of our key partners in the Special Economic Zone at Godzilla for marking the milestone of gas delivery project to Godzilla,we are urging investors, wishing to establish projects that require gas, to submit their applications to the Zone"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rich S",
          "Nb_Reviews": 4,
          "Date": "2022-11-16T01:19:25.000Z",
          "Titre": "Fast and accurate",
          "Contenu": "Fast and accurate. As always. Great turnaround time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam A.",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T16:49:31.000Z",
          "Titre": "Super fast",
          "Contenu": "Super fast, thorough and affordable. Thank you as always!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Nicholson",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T00:16:17.000Z",
          "Titre": "Super easy to use",
          "Contenu": "Super easy to use. Fast turnaround time. High-quality work."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ramona Angela Pillen",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T14:01:09.000Z",
          "Titre": "I am so happy to accept me here",
          "Contenu": "This app so very nice i watch on youtube and so excited to start..i am happy to accept me here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Young",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:33:18.000Z",
          "Titre": "Super easy to use at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Mason",
          "Nb_Reviews": 3,
          "Date": "2022-09-02T13:16:17.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, super quick, used the non AI service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Truesdale",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T00:25:06.000Z",
          "Titre": "Quick and affordable closed captions",
          "Contenu": "Quick and affordable closed captions. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DIem Jones",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T20:31:31.000Z",
          "Titre": "98% accuracy in a timely turnaround",
          "Contenu": "98% accuracy in a timely turnaround. BRAVO!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wi Duncan",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T23:28:48.000Z",
          "Titre": "Extremely Fast and Accurate",
          "Contenu": "This is an incredible service; very quick and accurate."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Karen Ashford",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T01:54:00.000Z",
          "Titre": "speedy accurate and great value",
          "Contenu": "speedy accurate and great value. highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 5,
          "Date": "2022-11-26T22:32:53.000Z",
          "Titre": "Simple- on time- reliable- better than…",
          "Contenu": "Simple- on time- reliable- better than Otter"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "IRENE KIACHTYPI",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T09:29:25.000Z",
          "Titre": "OMG this is magical",
          "Contenu": "OMG, this is magical!Thanks a billion!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "AK",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T10:50:55.000Z",
          "Titre": "Well done and fast",
          "Contenu": "Flawless, including all names mentioned in the conversation. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Rudolph",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T22:37:17.000Z",
          "Titre": "Dependable",
          "Contenu": "Rev transcripts are always fast and accurate."
        }
      ]
    }
  ]
}