{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.hotspotshield.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Alfred Saad",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T08:41:49.000Z",
          "Titre": "Subscription Price sneaked up x9",
          "Contenu": "Subscription sneaked up on me from 12.99 to 95.99 very quietly with literally little improvement in fact the connection quality is worse.  I am outraged by their unethical business practices.  Avoid at all cost.  Customer service only replies with passive aggressive not very usefull answers.  I am still trying to get confirmation my subscription has indeed been cancelled."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T22:27:05.000Z",
          "Titre": "Even though I cancelled subscription…",
          "Contenu": "Even though I cancelled subscription you’re still taking money from me each month and it’s not possible to cancel it anyhow!!!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:06:40.000Z",
          "Titre": "The program is not working"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "MBD",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T15:45:32.000Z",
          "Titre": "I tried to cancel by subscription but technically can’t",
          "Contenu": "I subscribed one month but can’t cancel the subscription because no way to enter to the website Now 3 months I payed without benefits Cant enter to my account and can’t unsubscribe"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "brain less",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T14:30:28.000Z",
          "Titre": "Was charged 99$ for no reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:53:26.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible, I've tried to cancel many times but they keep taking money from my bank account."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T07:04:03.000Z",
          "Titre": "I subscribed to Hotspot and and the…",
          "Contenu": "I subscribed to Hotspot and and the payment is already deducted but have not received any email with regards to the package yet."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NK",
          "Nb_Reviews": 5,
          "Date": "2023-07-25T12:58:26.000Z",
          "Titre": "Bad Customer Service and automatic bots",
          "Contenu": "If the vpn service and the locations works then it is fine, if you ever have to contact customer service after you take the premium to get help on some locations, you will not get a response from them. I have send emails and also through automatic chat bots , it will take your email and name to contact back by an agent which never happens. it is been two week and more and i havent got a single response from the customer service or any agent for that matter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T20:53:04.000Z",
          "Titre": "I cancelled my order",
          "Contenu": "I cancelled my orderYour service messed up my  internet service- I want my money back"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Heath Else",
          "Nb_Reviews": 3,
          "Date": "2023-06-14T13:33:01.000Z",
          "Titre": "After signing up initially",
          "Contenu": "After signing up initially, the company proceed to take funds out of your account, with no warning or notification to ask if you want to carry on with the service . After emails or communication stops and I am sure they hope you go away , not acceptable"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T14:39:57.000Z",
          "Titre": "It took to long for support to listen what I was saying",
          "Contenu": "It took to long for support to understand that issue was not my devices but the actual virtual location in Colombia. Even though I explained clearly in first emails that I have tried in several devices even outside of home and still gave me the wrong around answer to check tour device version . Re installed all that pre-populated typical  answers from an IT support department."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Piotr",
          "Nb_Reviews": 2,
          "Date": "2022-05-25T13:31:00.000Z",
          "Titre": "After one year of using hotspot shield…",
          "Contenu": "After one year of using hotspot shield I was happy, until last two weeks where I paid by accident 2 times for subscription. I sent a refund request so the take away my premium account but I never get the money back. In the meantime I paid for another premium and I get it for exactly 1 week. Today they turn it off. So they stole from me over 30 pounds and I get one week of a premium service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.C.",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:09:00.000Z",
          "Titre": "Hotspot shield: ok product but tech support, billing and account documentation is terrible.   Do not use!",
          "Contenu": "I had been using hotspot shield for some time.   Right around the end of the year, I realized that I was at the basic service and not at the premium service I had paid for.   I tried to log in to my account to see what happened and I couldn’t get in.   I called support and they said that they would not deal with me until I could prove that I had paid for the service.  I tried to find the documentation but no luck.  A few days ago I received a notice from Apple that I was going to be charged for another year from them.  The reason I had no credit card documentation was that it was done through the Apple Store.  I found the documentation and sent it to them canceling the extension and asking for a refund for the previous 4 months where they did not provide the service.   They responded with instructions on how to reinstate the software without able to log in.   The product is ok but the technical support, billing and attitude are terrible."
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T14:58:12.000Z",
          "Titre": "Payments",
          "Contenu": "The payment was taken automatically when I have tried to cancel"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T09:54:45.000Z",
          "Titre": "I request for unsubscribe",
          "Contenu": "I request for unsubscribe, however you’re deducting every month the subscription fee, therefore, I kindly request you to deactivate my subscription."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel D.",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:55:34.000Z",
          "Titre": "I can't change the location it shows"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T08:53:49.000Z",
          "Titre": "Not what was expected"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:00:27.000Z",
          "Titre": "Is not work",
          "Contenu": "Is not work I need my refund"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Aleks Gollu",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T08:27:56.000Z",
          "Titre": "I bought a lifetime license - they broke their promise",
          "Contenu": "I bought a lifetime license, initially it worked fine.The company changed the lifetime license capabilities. They limited data/speed/countries on the lifetime license. If the company breaks their promise to their early customers, they cannot be trust. How can I trust them with my security. They do not even allow me to contact them.==> Also, I have no problem logging in. It is the deprecated functionality that has rendered the lifetime license useless, downright an nuisance, where I am better off getting rid of it altogether or pay. E.g. limited download speed, cap on daily data, elimination of international servers..."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "L W",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T04:41:43.000Z",
          "Titre": "Customer support of a paying customer",
          "Contenu": "My personal experience of this service has been poor. A new app or update seemed to make it unworkable in my region, an area where you need a VPN. Did use the customer support and to be honest support was terrible. The support seemed to follow a script so stiffly that it was clear my discretion of the issue where simple being ignored."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Adam Kemp",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T04:15:59.000Z",
          "Titre": "Problem with free version",
          "Contenu": "I got the free version and tried to connect to Canadian netflix with it. Not only did netflix pick up on it and prevent me from watching anything, but I was also blocked out from every website other than outlook web app. It came up with \"(website name) unexpectedly closed the connection.\" The issue was immediately resolved when I removed and uninstalled Hotspot Shield"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "ozan aral",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T15:25:00.000Z",
          "Titre": "Can't cancel my subscription",
          "Contenu": "When they send a receipt there is link for cancelling your subscription but it will never work. After I click that, as if hotspot shield has blocked me, I somehow cannot reach to their website to sign in or whatever. I used my cell phone to get over that obstacle, it gives me sign in errors even though I enter my password right. I hit forgot my password tried to reset it, I receive an email to reset it but again the link would never open neither it is on my phone nor my computer. My only option left is to let the bank to block these shameless disgusting scammers"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Sievertsen",
          "Nb_Reviews": 2,
          "Date": "2019-12-03T22:08:54.000Z",
          "Titre": "Untrustworthy Company!",
          "Contenu": "Untrustworthy Company!I just discovered by chance that Hotspot Shield has been billing my credit card for months. I didnt even know that this company exists!  The company is refusing to refund me the sums charged, although they can not provide any proof of the legality of the debit or the existence of a subscription. I warn of any association with this company!"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Danni Christensen",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T17:20:23.000Z",
          "Titre": "Might damage hardware",
          "Contenu": "I got a message that i was running out of disk space, so i investigatedJust saw, that a log file in this app was over 170 GB.When i tried deleting it, it would just recreate itself constantly writing massive amounts of data to my SSD each second (possibly damaging it).I'm sure this is not intended, but never downloading again."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Washing Lady",
          "Nb_Reviews": 2,
          "Date": "2021-03-08T23:29:57.000Z",
          "Titre": "Terribleprogram",
          "Contenu": "Hotspot shield is by far, BY FAR, the worst hotspot program out there. Every time my computer turns on this stupid little piece of software opens up and turns on. Want to play a game? Lag because of hotspotshield. Need to check the news? Can't, you have to disable hotspot shield. I didnt even download it, and now i cant delete it either. There are so many better programs out there for you to use. This is one of the only reviews i have ever written, and probably will be the last for a while. Thats how much this program pisses me off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OneDirtyHarry 72",
          "Nb_Reviews": 2,
          "Date": "2019-03-08T22:28:20.000Z",
          "Titre": "I am disgusted with this company!",
          "Contenu": "I am disgusted with these people.  The software worked for a week and then the auto update loaded 8.0.0 version and it failed to work.  I have contacted them 3 times and still nothing!  I was even in the 45 day window for a refund and they are avoiding dealing with me.  They literally stole my money and are proud of their business practice.  Shame on them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asster",
          "Nb_Reviews": 15,
          "Date": "2019-05-05T22:06:32.000Z",
          "Titre": "Only a 30 minute limit for free?",
          "Contenu": "I installed on my Android phone and then I turned the hotspot shield VPN on and showed me that I only can get 30 minute usage, why they would not increase that to like 2 hours and watch an ad for 30 seconds and then get more hours, I AM NEVER INSTALLING THIS GARAGE EVER AGAIN, Stay away from hotspot shield, they old let you use 30 minutes per day"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hannah",
          "Nb_Reviews": 4,
          "Date": "2020-02-07T09:20:22.000Z",
          "Titre": "Software Doesn't Run",
          "Contenu": "I checked these reviews before buying this premium service and everything looked good. Everything worked fine for 1 day. The next day I opened the app and it said 'Something went wrong, we are working to fix this' no matter how long this is left it never works. The only way to use the software is to delete and redownload every day, which is ridiculous. I even tried to talk to customer service who asked non-relevant questions, They don't know how to fix it the software is simply broken."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "VPN den",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T20:34:51.000Z",
          "Titre": "Sorry to say that but one of the worst…",
          "Contenu": "Sorry to say that but one of the worst support, they simply ignoring me.- My account manager email does not exist.- First level support contacted at the end of Jan and got a generic reply (27 Jan) \"Moving forward your case will be handled by an escalation team and they will get this email sent to the right department. They will get back to you directly as soon as possible.\"- No response since then! Even though I emailed them several times politely asking about the status. Request number - 5327596"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Seany",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T23:16:46.000Z",
          "Titre": "Do not sign up for this hotspot Vpn",
          "Contenu": "Do not sign up for this hotspot Vpn! There is no unsubscribe button or to remove your credit card payment. They saved in their system and there is no way you can unlink it! And they auto renew without u knowing and none email were received! Went to the live chat twice! To tell them I have unsubscribe. But they just keep charging u everytime on your renewal date! And give no solution on subscribing and unlink a payment method! Think twice before choosing this service! They do refund. But if u did not check your credit card. They will just charge it without u knowing! Beware!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "RN82",
          "Nb_Reviews": 11,
          "Date": "2020-07-22T10:24:23.000Z",
          "Titre": "Stay away from the free trial",
          "Contenu": "Decided to give it a try since it was free... Big mistake. Once it's on your PC, it ain't leaving. Basically a virus that gives you a really weak VPN connection. Wasn't impressed with it TBH and was really annoyed that I'm now stuck with this thing forever. Thanks."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Hassan Iqbal",
          "Nb_Reviews": 13,
          "Date": "2019-04-04T08:21:35.000Z",
          "Titre": "Fraudulent company -Stay away",
          "Contenu": "Fraudulent company -Stay awayI cancelled my while I was in the trial period however a few days later  , they try to charge my card for the subscrption.Also I asked them to delete my account and data but no one replied.Never ever trust them with your card details. Better to report them to the authorities."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Filip Kiil",
          "Nb_Reviews": 1,
          "Date": "2019-11-25T14:35:52.000Z",
          "Titre": "They have made several withdrawals from…",
          "Contenu": "They have made several withdrawals from my account without my authorization. It is seems impossible to unsubscribe. Cannot access my account to cancel auto-renewal of my 'premium' membership, which I never, ever wanted to have. I am p*ssed and feel completely and utterly f*cked over"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Studerende",
          "Nb_Reviews": 27,
          "Date": "2020-06-07T05:53:53.000Z",
          "Titre": "Malicious Chrome extension",
          "Contenu": "After using the Chrome extension for a couple of weeks, I suddenly got a pop-up warning from Chrome, saying: \"this extension has taken control of your proxy settings, which means it can change, break, or eavesdrop on anything you do online\". Uninstalled immediately."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Peter Campbell",
          "Nb_Reviews": 1,
          "Date": "2019-02-04T07:37:07.000Z",
          "Titre": "Almost forced to buy this, never asked for it.",
          "Contenu": "Somehow this software got on my new Dell Laptop, and then I ran into some browsing limit and all my internet access was blocked, butI could have deblocked it by paying for a monthly plan.I have now uninstalled it.  Extremely bad experience, probably notethical business practice as well.  AVOID !"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Benjamin C. Uldall",
          "Nb_Reviews": 17,
          "Date": "2016-08-20T18:36:50.682Z",
          "Titre": "Just bad",
          "Contenu": "The \"free\" vpn software is not free at all! A purchase is required if you want to use this service, not that this information is on their website, so you will have to install their service in the good faith that it´s free, and the only disadvantage is the ads - WRONG!! You cannot use this unless you pay."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T23:03:04.000Z",
          "Titre": "Can’t stream any thing"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Michael KCN",
          "Nb_Reviews": 4,
          "Date": "2021-07-09T02:38:47.000Z",
          "Titre": "overpriced & leaked my IPV6. but its decent.",
          "Contenu": "Got an email from my internet provider saying I've been downloading.. how would they know when I use a VPN? Well! Hotspot Shield doesn't always cover your IPV6; sometimes it does and sometimes it doesn't.. I have to go into the Wi-Fi properties and disable the IPV6.. And its funny, when I cancelled my membership is when I got the email from my provider lol I mean $16.99USD for a Canadian comes up to like $23 a month.. Thats half my phone bill.. Ridonkiculous I would pay $9.99 - if its priced because of the features, well - not everyone wants the features. Consider making multiple products for your customers instead of forcing one with options they might not even need."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deke",
          "Nb_Reviews": 2,
          "Date": "2019-11-26T00:10:48.000Z",
          "Titre": "I bought the Premium few days ago and…",
          "Contenu": "I bought the Premium few days ago and have started using it, but my friend is a professional coder and it was a problem with pictures loading on busmanity.com charter bus & limo USA booking website. We've checked the console in developer mode of the browser and found the SSL error. As a result, it turned out that it substitutes root certificates and transfers all traffic in unencrypted form, which means that all my data and passwords have been compromised. I highly recommend this VPN service. This review is the result of an investigation by a professional millionaire programmer with 18 years of experience."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Tobias",
          "Nb_Reviews": 7,
          "Date": "2019-04-06T14:39:40.000Z",
          "Titre": "Do not use, scam",
          "Contenu": "Average VPN, however, the trial is not a trial - it is meant to scam people into auto-renew subscriptions when the trial cannot be easily (or at all - waiting for support) ended. DO NOT USE THIS SOFTWARE as it intentionally misleads/scams people."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "freedom alkovits",
          "Nb_Reviews": 5,
          "Date": "2017-08-07T20:53:06.000Z",
          "Titre": "I never liked this VPN provider and …",
          "Contenu": "I never liked this VPN provider and after this news, i hope they will lose more and more customers! FTC Complaint Alleges Hotspot Shield Collects User Data! The VPN was also found to inject JavaScript codes using iframes for advertising and tracking purposes"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T23:03:50.000Z",
          "Titre": "Can't open the site 😕"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "André Alves",
          "Nb_Reviews": 3,
          "Date": "2018-10-31T10:05:00.000Z",
          "Titre": "you cant delete your account,",
          "Contenu": "you cant delete your account,there is no info on the website regarding this mater, and if contact them they say you don't have a premium account so they don't answer.overall shady company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Kopp",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T02:18:10.000Z",
          "Titre": "can't cancel your account",
          "Contenu": "hotspot leads you to believe that you can cancel your subscription at any time but if you want to cancel your credit card windows subscription I have yet to discover a way after a 3hr online search ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T17:09:00.000Z",
          "Titre": "I had a lifetime account for years…",
          "Contenu": "I had a lifetime account for years purchased through the actual company website, they have since merged with pango.co and now my lifetime account is gone. They are asking me to pay again for the same service just months prior I had full access to. I can still log into my account no problems. Soon as I try to use my paid for lifetime account it states I need to purchase a \"basic\" plan. I had a premium plan that was good and used for years. I was logged in and changed my password within the last six months and now since the merge they stripped my premium account status with lifetime benefits. Guess \"lifetime\" of the company\" applies. Oh and I asked them to update my email address on file and they will not even communicate with me. All of my troubleshooting request are ignored."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:43:19.000Z",
          "Titre": "Horrible customer service"
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Mohammed Touzaini",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T15:40:55.000Z",
          "Titre": "You are the thifs"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 27,
          "Date": "2020-08-12T16:57:25.000Z",
          "Titre": "Paid for premium cannot connect to most…",
          "Contenu": "Paid for premium cannot connect to most servers only some and keeps crashing with errors on windows pc Look elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Danvers Baillieu",
          "Nb_Reviews": 10,
          "Date": "2014-10-31T16:16:10.000Z",
          "Titre": "Poor selection of servers and too slow",
          "Contenu": "This service is not that good as you only get a small selection of servers and they don't work with a lot of video sites."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Johnny kurcaba sørensen",
          "Nb_Reviews": 4,
          "Date": "2020-03-22T08:33:02.000Z",
          "Titre": "F.u.c.k.i.n.g bad.",
          "Contenu": "F.u.c.k.i.n.g. bad.Try to get out from this scam.Can not stop my payment to this.DONT EVER TRY THIS SO BIG SCAM."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "McM Michael",
          "Nb_Reviews": 4,
          "Date": "2021-09-10T21:26:51.000Z",
          "Titre": "Don't BUY this VPN!!",
          "Contenu": "VPN is poorly built. I've tried over 7 VPN's and this is defo the worst i've tried"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dom",
          "Nb_Reviews": 7,
          "Date": "2018-02-16T12:56:13.000Z",
          "Titre": "Disappointing",
          "Contenu": "For me, using the service from Chumphon, Thailand, is a joke. The speeds for any and all VPN locations is too slow to stream anything. Sure, if you want to read a text website, it would work. But since when are text websites using geolocation to block viewership? Since never. The real service is video streaming, and hotspotshield is just too slow to provide this. I always know when Hotspotshield accidentally turns itself on, because none of my websites load. It's pathetic really. I paid for 1 year, and can't use this 'service'. I mainly wanted to use it to watch TV while abroad (abc.com etc)It also does work ok with torrents, where the slowdown is not as noticeable, though I barely use torrents myself.I have a great wired Internet, 50 Mbs download, 20 upload, and it is exactly that when I test my speed. Doing a speed test when hotspot shield is on is a joke (again), the speedtest reports way lower speeds than even shown on hotspotshield interface (which are dismal at best). Don't buy it, unless all you need is to browse the web with no video/audio, or for torrenting. Plus, if you get a yearly subscription you'll still be getting ads, namely their advertisements for a 'lifetime subscription'. Thanx, I'll pass."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MrBlackHalo1",
          "Nb_Reviews": 14,
          "Date": "2021-05-29T13:53:58.000Z",
          "Titre": "Not good",
          "Contenu": "Not good. Somehow it says I used 500MB in seconds when nothing was open or in use"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Tucker",
          "Nb_Reviews": 1,
          "Date": "2020-09-20T20:24:08.000Z",
          "Titre": "waste of time...cant choose contry of…",
          "Contenu": "waste of time...cant choose contry of vpn unless you pay....very NOT FREE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hanze",
          "Nb_Reviews": 3,
          "Date": "2017-07-20T12:55:21.000Z",
          "Titre": "How you could trust VPN provider which …",
          "Contenu": "How you could trust VPN provider which sells your activities to advertisers"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Nafees",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T03:17:17.336Z",
          "Titre": "It is not working at all",
          "Contenu": "It is not working at all. Disappointing"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "BigShopper",
          "Nb_Reviews": 3,
          "Date": "2019-06-26T10:20:49.000Z",
          "Titre": "crappy technical support",
          "Contenu": "awful experience ...they just want to take your money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denny Chiu",
          "Nb_Reviews": 10,
          "Date": "2020-03-13T17:02:09.000Z",
          "Titre": "Worked for 2 months, then totally useless",
          "Contenu": "After a couple of months, the app disappeared all of a sudden from my PC after I went on vacation for two weeks.  I have uninstalled and reinstalled different versions of it, depending on whoever is answering my requests for service/help, and nothing works.  The servers get stuck in one location, when it did work about 10 days for one day.  All of a sudden Pango is asking for my login credentials; it never did before.  Now I am totally locked out of my account and Pango Pango has three years subscription that I paid--for no VPN service for the remaining 2 years 9 months.DO NOT SUBSCRIBE TO PANGO HOTSPOT.   iT LOOKS GOOD ON THE SURFACE.  I think it contracts out to Third World countries for customer service, the reps have no idea what they are saying.I was lured into thinking it would be good by the aggressive customer chat.  It might work for a few weeks or even a couple of months but after that it falls apart and none of their updates does anything but cause havoc with your working life.I've only connected to it once in the past three weeks.After that I got the message that \"it can't connect to the VPN adapter.  Uninstall app.\"The app is nowhere anymore on PC so I can't uninstall it (or re-install it with any of the updated versions).It has simply stopped working despite my tinkering it for hours, with \"the help\" of half a dozen of their staff.I slapped down $110 for this.  It took a dozen or so emails finally for them to refund this.  It was hardly worth the hours of frustration trying to tweek this thing, send & read emails back and forth, trying to make sense of all the different new instructions.I can't believe this thing happens.  No one would purchase VPN service is this were the norm.There has got to be a trustworthy VPN but this is NOT it.  Do your homework."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Captain",
          "Nb_Reviews": 5,
          "Date": "2015-10-24T05:49:03.353Z",
          "Titre": "Totally full with malware",
          "Contenu": "Be carefull!!!\rProblematic software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joesmo Hacks",
          "Nb_Reviews": 1,
          "Date": "2016-06-26T03:03:56.000Z",
          "Titre": "ITS NOT FREE",
          "Contenu": "NOT WORTH IT CYBER GHOST IS BETTER"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T03:25:24.000Z",
          "Titre": "Free daily data is too less"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "freedom",
          "Nb_Reviews": 24,
          "Date": "2017-02-14T22:53:14.000Z",
          "Titre": "The Hotspotshield users trust in the protection of foreigners' privacy by US authorities",
          "Contenu": "We have tested a VPN vendor, which has a special relationship with US authorities and secret services: HotspotShield.There were of course many questions, why one offer a VPN service as anonymization, but which is quite openly supported by US secret service circles. This requires understanding the logic. Many citizens in the US continue to think that the authorities want to do good things for them, and undoubtedly this is true. Whether we as Europeans want to trust this after all the information we have since Edward Snowdens documents about this also a service, is another question!\"The Hotspotshield users trust in the protection of foreigners' privacy by US authorities.\"This is why this review differs a little from our usual format. We have also received no technical answers to our written inquiries to Hotspotshield. Much of what we could discover has confirmed our assumptions. There are clear connections to US intelligence NSA and the FBI! And in the end, every user should be aware of the potential of \"monitoring\"Looking at the responsible managers of HotspotShield, the proximity and connections with the US authorities reveals:    Alec Ross    He was a technological advisor to Hillary Clinton when she was a member of the US government and at that time also supported the attempt and start of international surveillance on the Internet by the NSA directly with the US government.    Reed E. Hundt    He was chairman of the United States Federal Communications Commission under Bill Clinton as President of the US and thus presumably significantly involved in the expansion of the NSA surveillance measures at that time.    Dr. Peter Hoag    He was also a co-founder of a CIA subsidiary, Cardinal Technologies , which sought technological unification of data transmissions in the US networks. Cardinal Technologies was also a consultant to some US-friendly governments in Europe and is probably still working for US-based intelligence services.    Kevin Cook    He is still in the management of the Barracuda Network , which became known through their \"backdoors\" on the hard drives and firewall ingloriously.    Rick Roth    Is known as a national adviser to the US authorities for corporate networks in the USA and is regarded as a liaison between national interests and corporate interests in the USA.    Doug Maine    He worked for IBM as a financial manager. IBM itself is known for the cooperation with US authorities also became international espionage and was banished from China among other things.    Greg Coleman    He has worked in a number of US-based corporations in senior editorial offices such as AOL, Huffington Post, and some online media houses, all of which provide US government-friendly reporting, as well as public opinion, as well as circumvention of government encryption.    Reference : All persons are also listed as managers and managers of the operating company \" AnchorFree.com - Team \" of HotSpotShield.The list of allegedly \"US government delegates\" to Hotspotshield could be extended even further. It is rather unlikely to assume that all of these people have suddenly committed themselves to protecting the privacy and anonymity of international users. A public stand for \"freedom and democracy\" does not necessarily mean a respectful approach to the privacy of non-US citizens. What is meant by freedom, whether this is only for US citizens or for each user is to use the hotspotshield, remains unclear. Even if many of these people state this as the main argument for your commitment yourself!The \"Goldman Sachs Group\" finances the company!Anyone who installs HotspotShield may also become part of the \"US strategy for international surveillance on the Internet\".Hotspotshield can also be called\"Trojans with voluntary self-installation of the users!\"understand.What sounds ironic at first sight, however, has a serious background. Because the technical components of the service allow it to monitor the users much better than without the use of the case. With allegedly 400 million installations on PC`s worldwide, Hotspotshield can be a quite interesting factor in the strategy to monitor the entire world on the Internet!Technical conditions also allow targeted monitoring.In our test, we have installed the application on a specially prepared Windows PC. In addition to the usual VPN connection certificates, access certificates were also installed. In this case it would be technically possible to connect to the user's PC without warning or to send different data to decoded servers without being requested. The data transmission would be encrypted as well, and the user can hardly provide any proof of this.The communication of the company suggests protection of one's privacy, anonymity and security! It is important, however, that potential users are also aware of the dangers that may arise.Freedom and protection for Turkish oppositionists! But turns out to be a Trojan horse with US support! Possibly to consciously undermine freedom of expression!Particularly bad in our view, it is also, since Hotspotshield in the last years also massively and specifically in Turkey was advertised. This should obviously lead to government-critical activists to trust this service. As a Turkish journalist recently reported on Twitter, he was charged with government criticism and he had always used Hotspotshield.    \"Turkish authorities detain VOA & BBC reporters, adding to 145 journalists already in jails in Turkey -world's largest prison for journalists Twitter \"Meanwhile, however, the use of Hotspotshield within Turkey has been blocked."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Boonu",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T16:32:49.000Z",
          "Titre": "Fast Speeds, But Only If You're Lucky",
          "Contenu": "Have Been A Premium Subscriber For Quite A While Now, And There Has Never Been A Day Where There Isn't An Issue With The Absolutely Awful App.\"Can't connect\" Should Be Their New Tagline, As That's The Only Thing Frequent About The UX.As A Paid Subscriber, I Expect Full Connectivity 24 Hours A Day, But The Technical Issues Are Inexcusable. I'd Say It Works About 40% Of The Time.Even Though I'm A Premium Subscriber Through Another Service (Dashlane), This Level Of Incompetency Is Wild.Sincerely,Boonu"
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "Alex K",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T12:23:58.000Z",
          "Titre": "Can't cancel subscription",
          "Contenu": "Hey guys, I used the service for a few months but then found a better alternative.My last month of subscription expired and I have absolutely no way to cancel it, don't see any option in my account. Yes, because my subscription has ended I now can't cancel it and the service continues to bill my credit card (it now doesn't have enough funds, so the payment doesn't get through).Honestly, this is pretty ridiculous you have to pay and have an active sub in order to cancel your subscription, will never recommend this service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T22:03:51.000Z",
          "Titre": "Chat didn’t work"
        },
        {
          "Note": 2,
          "Lieu": "SK",
          "Pseudo": "emerex 5",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T22:13:34.000Z",
          "Titre": "Pretty annoying",
          "Contenu": "This app is very annoying, it automatically connects to the super slow network, collects lots of data, and is pretty bad compared to other free VPN services.The only situation i would reccomend the free version of Hotspot Shield is when you need a VPN to do something with low internet usage and quickly on a public network, though other free VPN services are better in other categories while also being good at this"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jack C",
          "Nb_Reviews": 3,
          "Date": "2015-10-14T20:14:34.612Z",
          "Titre": "No longer works with BBC",
          "Contenu": "As of one week ago, BBC is no longer available using Hotspotshield. I have tried all the usual strategies such as clearing my history and rebooting, etc., but nothing works.\rAny suggestions?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mikayia Monday",
          "Nb_Reviews": 11,
          "Date": "2020-10-20T13:24:25.000Z",
          "Titre": "It seems that this VPN SOMEHOW makes my…",
          "Contenu": "It seems that this VPN SOMEHOW makes my internet way slower. It doesn’t speed it up at all. Disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessie W",
          "Nb_Reviews": 2,
          "Date": "2017-08-17T16:54:27.000Z",
          "Titre": "pretty appalled at the news",
          "Contenu": "pretty appalled at the news, but not particularly surprised. Free vpns are known for sharing user info."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jimmy Gao (Jimmy.)",
          "Nb_Reviews": 1,
          "Date": "2020-04-18T09:18:01.000Z",
          "Titre": "Edge and Chrome extension doesn't work at all in China.",
          "Contenu": "The PC client works well, but the Edge and Chrome extension doesn't work at all in China."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vinay Gulani",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T17:46:58.000Z",
          "Titre": "Don't remember any subscription with them but they refunded",
          "Contenu": "Don't remember of any subscription with them and they charge my credit card each month. No email or any confirmation for this. Never use this service\"Gervie M\" - Their customer representative (Technical Support Team). He tells me they don't have any means to call. Waste your time via chatting/email where they are very slow. No availability of Supervisor.IT LOOKS LIKE A SCAMPS:They initiated the refund - updated rating by 2 stars.They should send any email confirmation if there is any charge and should have call support."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "ToRnado_R",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:28:23.000Z",
          "Titre": "Colleagues.  Social Responsibility",
          "Contenu": "Colleagues, this is some kind of chaos.  Please stop for good, I've been trying to stop auto-debits for 3 months now.  I wrote to technical support twice to help me stop payments. I ask you to return at least part of the funds that were written off for an unused service, even if it was 13 euros that were written off several dozen hours ago, I would already be grateful for that.   I calmed down that month, because I thought that after my letter they had returned the money to my card, but no, it was delayed again.  The service still does not work in my country, no matter how many times I have visited.  You can see from the inputs that I haven’t used it for several months.   Well, as much as possible:( no matter how many times I tried to cancel this subscription.. No matter how many times I wrote to technical support. :(uselessTherefore, gentlemen, Company can write off an extra 50-60 euros in a couple of months You need to think about what contribution and message, what responsibility you bear as a company in this world 🌌 So far, unfortunately, this message is not being traced for the bestThank you.  All the best to you ☀️P:SThank you for the prompt response from technical support to the incident.  I am increasing my rating by 2 stars!  Until the funds have arrived due to recent non-use, I will leave a review.  Thank you for your patience.  All the best. sunshine and energy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T19:32:27.000Z",
          "Titre": "I’ve used this for several years and…",
          "Contenu": "I’ve used this for several years and have found that it interferes with other software (QuickBooks for one) and sometimes  wreaks havoc on my iPhone.Usually, if I am having any software issues, I look to disable hotspot shield."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Peter",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T17:29:47.000Z",
          "Titre": "hotspot good - but not on italy",
          "Contenu": "very quick response the problem…..but the problem couldn’t be solved….can’t watch italian tv…and this problem has been going on for years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devin F",
          "Nb_Reviews": 3,
          "Date": "2023-03-12T00:29:41.000Z",
          "Titre": "Good VPN with a MAJOR drawback",
          "Contenu": "I like this VPN as I got it in a bundle. It's pretty quick and supports good protocols. Only MAJOR problem is when it updates.I wasn't even connected to it, and when it updated it restarted my network adapter forcing my game to disconnect me in the middle of a 3 hour run.This is NOT okay behavior."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kevin Dong",
          "Nb_Reviews": 2,
          "Date": "2017-03-04T18:28:25.000Z",
          "Titre": "Might be blocked; hard to disable",
          "Contenu": "This VPN is pretty often a pain if you are on a blocked network (ex. Fortiguard) it also blocks the VPN itself.Also, turning off this VPN takes ages, since you cannot do so from your device settings, so you are forced to see an advertisement before turning off the VPN."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Møffe Olesen",
          "Nb_Reviews": 2,
          "Date": "2018-07-08T07:13:25.000Z",
          "Titre": "Cost Money",
          "Contenu": "I dont know how good of a VPN it is, but its not free as promised on the website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Ashey",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T11:34:03.000Z",
          "Titre": "Great look, works good, but you need to pay for it.",
          "Contenu": "It looks great, but is pretty expensive as for a VPN. Still, it works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Perilo",
          "Nb_Reviews": 3,
          "Date": "2018-11-17T03:46:27.000Z",
          "Titre": "Servers are a bit slow",
          "Contenu": "Servers are a bit slow. But it works when its needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "yokesh kumar",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T20:30:28.000Z",
          "Titre": "Yokeshkumar",
          "Contenu": "It's good to work using vpn sites."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:34:26.000Z",
          "Titre": "When it works it's perfect",
          "Contenu": "When it works it's perfect, but it doesn't always work....More than good enough though, and well worth the cost."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Clements",
          "Nb_Reviews": 4,
          "Date": "2023-03-26T13:31:31.000Z",
          "Titre": "Top VPN - about 3/4 to perfect",
          "Contenu": "The fastest and most effective VPN I have used so far. Not much buffering when used for streaming, and has got through about 75% of geoblocked streaming services. However, there are some services that have blocked this VPN including Virgin GO (UK), FuboTV (US, Canada). Would like some option to counteract such as regular IP address changes or more IP options for main countries."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Me",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T11:56:52.000Z",
          "Titre": "Firestick install",
          "Contenu": "Initial problem with emails being accidentally blocked but once overcome could not have been more helpful. The vpn does everything I ask of it, both W10 and Android."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Andreas",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:31:28.000Z",
          "Titre": "Very good email support",
          "Contenu": "I use Hotspot Shield on different devices to stream foreign content for about 10 years now.I sometimes have problems. I assume it’s a constant battle between websites and HSS for supremacy which is the reason for having these problems when trying to watch foreign content once in a while. Nevertheless the email-support is always eager to help and successful in solving my problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-23T17:07:03.000Z",
          "Titre": "I love this product",
          "Contenu": "I love this product.  I've used other apps like this in the past and they always slowed down my browser.  Hotspot shield is fast.  I've had some issues with my subscription, but customer service was on top of it both times.  My only complaint is that it stays active unless you turn it off, so if you don't and you shut your computer down restarting it leaves the app still on.  It isn't that bad, but I can forget that it is on."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Frank Talbot",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T18:40:23.000Z",
          "Titre": "Staff were very responsive to email…",
          "Contenu": "Staff were very responsive to email requests for technical support and more often than not responded within 24 hours until my issue was resolved. They were polite and courteous during the troubleshooting processes. Recommend. 2 thumbs up."
        },
        {
          "Note": 4,
          "Lieu": "SV",
          "Pseudo": "Julian Alvarado",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T17:36:35.000Z",
          "Titre": "Good Service",
          "Contenu": "Good ServiceThe bot was friendly and directed me right to the representative I needed, who was great at helping me cancel my account and getting what I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dyth Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T22:47:27.000Z",
          "Titre": "The speed that Hotspot Shield responded to my email and the solution that was offered was spot on!",
          "Contenu": "They responded immediately to my email and the instructions were clear and concise. The speed of response speaks volumes for me."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Betty Greene",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T13:53:55.000Z",
          "Titre": "Still happy after 9 years",
          "Contenu": "Had a major problem logging in on an android device.Problem was fixed with help from support.Premium user since 2013"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Leila Zarei",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T05:07:46.000Z",
          "Titre": "The Hotspot Shield VPN is very fast and…",
          "Contenu": "The Hotspot Shield VPN is very fast and user friendly. I can easily connect to my desire virtual destination on the web."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reg Woods",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T16:49:11.000Z",
          "Titre": "Good Chat Support",
          "Contenu": "Chat support on a Saturday morning was pretty prompt and the agent was patient and helpful.  Problem solved."
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Gómez J Eric",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T15:32:08.000Z",
          "Titre": "Although my problem was not solved",
          "Contenu": "Although my problem was not solved , The costumer support answered back really fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Mosley",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T18:04:58.000Z",
          "Titre": "Great product but \"chat-only\" customer support makes dealing with nuanced issues tricky.",
          "Contenu": "Update 1/5/2023:After submitting the review below on 12/29/2022 I was contacted by customer support at Hotspot and issued a refund for the double charged amount.  The staff was quick to respond, and more than happy to help.  The explanation given with regards to why the customer service rep initially only offered a partial refund was lack of training, but I think that more realistically the factors leading to such a discrepancy are the communication model and lack of agency for front line employees.  I had excellent service from the initial rep who tried to help me, but they were constrained by the policies of the company.  The next interaction with staff was from a management level, and it seemed like they had more agency to resolve issues that aren't spelled out in policy verbatim.  It is unfortunate that not being able to speak to someone on the phone initially forced me to leave a bad review before getting connected to someone that had the ability to fix the problem.  I do acknowledge the lack of diligence on my end toward noticing that I was being charged for a service I had already purchased.  However according to the staff:  it shouldn't be something that can happen, and they're looking into how to keep it from happening in the future.  Original reivew:The product is good, but it’s easy to be double charged.  The company lets you pay via several different auto-renew avenues (direct, via Apple subscriptions…etc) and does not prevent a customer from signing up multiple times for the same account.  There was  difficulty even confirming that I had been paying more than once for the same service.  In addition, they cite a “45-day” limit to dispute any charges.  Essentially I had initially paid for a yearly subscription, and on top of that purchase I erroneously was able to sign up for a monthly subscription for the same service.  Eventually I was able to get a credit onto my account for the double charges, but that was not initially offered…I was initially only offered 1 months refund for a double charge over the course of 12 months.  Once again, the product is good, but the communication and refund policies are not easy to navigate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norman Finlayson",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T19:07:06.000Z",
          "Titre": "I found linking Hot Shield to my…",
          "Contenu": "I found linking Hot Shield to my Dashlane account confusing.  But the customer support was excellent."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chris Luckett",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T20:58:30.000Z",
          "Titre": "Awaiting Robo Shield for Android",
          "Contenu": "I love my Hotspot Shield VPN app and am awaiting news of when the Robo Shield (included with my subscription) will be available for my Android phone. Customer Support advised me to check the ‘Notify’ box in my account to be advised when that happens. Thanks for the tip!"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Top Gun",
          "Nb_Reviews": 17,
          "Date": "2022-06-15T16:35:53.000Z",
          "Titre": "Quick and informative advice how to…",
          "Contenu": "Quick and informative advice how to solve my specific problem."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Ali Pervez",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T00:35:38.000Z",
          "Titre": "Satisfied with the service",
          "Contenu": "My issue was resolved"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T16:45:51.000Z",
          "Titre": "Great but Need Improvement",
          "Contenu": "Been using the Paid Version since 2016 when i moved to Dubai to bypass the VoIP blockade. It works fine most of the time but the annoying part is when it automatically logout my premium account on Firefox after maybe 16-18 hours and my downloads are usually disconnected.For use in China, it's marginal. It works sometimes and sometimes it does not especially while using Chinese Telco mobile data."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Beata",
          "Nb_Reviews": 27,
          "Date": "2021-04-12T14:47:20.000Z",
          "Titre": "I’m so pleasantly surprised",
          "Contenu": "I’m so pleasantly surprised Seems better than express vpn in terms of stability of my connections. The only drawback is that servers are sometimes little in non US locations like European ones . However, it seems to work anyway! I think I will stay beyond my 30 day to refund as I have 3 year subscription and it seems a reliable easy app. It just works Ad blocker could improve experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evan",
          "Nb_Reviews": 2,
          "Date": "2016-04-17T21:20:11.000Z",
          "Titre": "Pretty good",
          "Contenu": "THeir China server is located in German. But it can cross through all the China-IP-detection.(Listen, I mean it. ALL!!! ALL of them!!!)\rI used to purchase it and refund it. THe staff is very nice. \rVery good VPN!\rFree user will have advertisements, but now they have changed the method, For IOS user, you can choose to watch a 30 seconds advertisement and get 3 hours elite time...That is super awesome!\rAnd they have lots of the language version. \rit is not perfect because you can't choose city, but only the country... But the price is pretty good. now they have $100 lifetime deal. Someone need to try it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marty",
          "Nb_Reviews": 1,
          "Date": "2013-09-19T21:09:47.000Z",
          "Titre": "Does what it should",
          "Contenu": "Hotspot Shield provides a secure connection and an IP address in one of their server locations. That's all you need to access content in America while abroad.\r Sometimes, I need to reconnect a couple of times - would have given 5 stars otherwise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francis Chou",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T12:04:04.000Z",
          "Titre": "chat line is good",
          "Contenu": "the chat line worked well..Justin was very patient; email request did not work...no reply after 3 requests...Justin however had to email me instructions which worked"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Hindle",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T22:40:15.000Z",
          "Titre": "First chat with CS.…",
          "Contenu": "A bit disappointed that different protocols are not available on the android app.The customer support was first class."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 4,
          "Date": "2016-06-08T12:06:23.000Z",
          "Titre": "A useful VPN tool",
          "Contenu": "For those times where you need a VPN, this is a very useful tool, at no cost. Easy to use and always available in your tool bar. A well designed and easy to access tool."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Remy SPROELANTS",
          "Nb_Reviews": 2,
          "Date": "2022-05-12T00:32:32.000Z",
          "Titre": "Help was commandable",
          "Contenu": "Help was commandable and repeatedly offered, even when problem was alrteady solved by client"
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "mipacem",
          "Nb_Reviews": 2,
          "Date": "2020-06-17T17:08:16.000Z",
          "Titre": "it does it's job",
          "Contenu": "it does it's job. i haven't tested how well it does it but it looks like it's working."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shubham Nayak",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T19:28:59.000Z",
          "Titre": "Excellent",
          "Contenu": "No DNS leaks, strong encryption and faster downloads, Who wants more."
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "孙志行",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T07:54:44.000Z",
          "Titre": "It don't provide Japan and Korea servers",
          "Contenu": "It don't provide Japan and Korea servers,please provide  more servers to connect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anh Nguyen Xuan",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T10:00:32.000Z",
          "Titre": "speed still slow but I think with a…",
          "Contenu": "speed still slow but I think with a free version this problem can ignore. thanks"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "AADITYA",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T02:26:15.000Z",
          "Titre": "Very friendly...",
          "Contenu": "Very friendly....It should be completely free.....One of the best VPN provider..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alabi",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T12:17:42.000Z",
          "Titre": "nice VPN and user friendly"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Aquif",
          "Nb_Reviews": 9,
          "Date": "2016-06-02T12:11:50.000Z",
          "Titre": "Great for anonymity",
          "Contenu": "Slight problems while streaming videos but overall its great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billy J Houston",
          "Nb_Reviews": 2,
          "Date": "2016-06-05T22:32:52.000Z",
          "Titre": "Simple",
          "Contenu": "It is the simplest to use and setup vpn service I know"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Ana A Ana",
          "Nb_Reviews": 1,
          "Date": "2016-06-26T00:30:52.000Z",
          "Titre": "sooooo nice sooooo good",
          "Contenu": "it's nice but it takes some ime to work"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Tadd",
          "Nb_Reviews": 2,
          "Date": "2020-07-23T00:20:40.000Z",
          "Titre": "almost good",
          "Contenu": "Almost perfect so I give just 4 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Edward Shorter",
          "Nb_Reviews": 1,
          "Date": "2016-06-04T18:09:35.000Z",
          "Titre": "Great product !",
          "Contenu": "For when you need to use a good Hotspot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TonnaLynn Lott",
          "Nb_Reviews": 1,
          "Date": "2016-09-01T15:02:43.000Z",
          "Titre": "Awsome",
          "Contenu": "Thank you for a great HotSpot VPN app!"
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "anwar",
          "Nb_Reviews": 1,
          "Date": "2016-07-12T07:45:09.000Z",
          "Titre": "gooood",
          "Contenu": "is goood verey simple okay i dont now"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "nasser elshehri",
          "Nb_Reviews": 1,
          "Date": "2016-06-03T03:06:26.000Z",
          "Titre": "good",
          "Contenu": "not bad good, i can depend on it."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Alfie Tse",
          "Nb_Reviews": 1,
          "Date": "2016-06-12T09:19:13.000Z",
          "Titre": "smooth ride !",
          "Contenu": "very good app; fast and smooth!"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "City Telent",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T14:01:34.000Z",
          "Titre": "good speet ok goood goood",
          "Contenu": "weldon good goood speet"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "ALI",
          "Nb_Reviews": 1,
          "Date": "2016-08-01T21:28:02.000Z",
          "Titre": "good",
          "Contenu": "good i guese just check it out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roni Gunawan",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T04:51:40.000Z",
          "Titre": "a very delpful extension",
          "Contenu": "a very helpful extension"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew J. Day",
          "Nb_Reviews": 1,
          "Date": "2016-06-12T08:22:54.000Z",
          "Titre": "true",
          "Contenu": "its aight havent used long"
        },
        {
          "Note": 4,
          "Lieu": "IR",
          "Pseudo": "Hoseyn",
          "Nb_Reviews": 1,
          "Date": "2016-06-26T12:11:50.000Z",
          "Titre": "fast",
          "Contenu": "it's fast and comfort"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Senuka Amunugama",
          "Nb_Reviews": 1,
          "Date": "2021-10-24T13:34:20.000Z",
          "Titre": "Good hhhhhhhhh"
        },
        {
          "Note": 4,
          "Lieu": "YE",
          "Pseudo": "Akram",
          "Nb_Reviews": 1,
          "Date": "2016-08-01T03:55:30.000Z",
          "Titre": "Great App!",
          "Contenu": "Easy, Light and Fast."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Zara Khan",
          "Nb_Reviews": 1,
          "Date": "2016-06-04T17:37:57.000Z",
          "Titre": "zara",
          "Contenu": "awesome hai bht awla"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "bernz jons",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T02:17:05.000Z",
          "Titre": "pretty good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Youth Window",
          "Nb_Reviews": 1,
          "Date": "2020-10-17T19:53:06.000Z",
          "Titre": "This is so good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kevin",
          "Nb_Reviews": 1,
          "Date": "2016-07-01T21:38:31.000Z",
          "Titre": "nice app",
          "Contenu": "great stuff enjoy"
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Roman",
          "Nb_Reviews": 1,
          "Date": "2016-06-17T17:50:45.000Z",
          "Titre": "nice",
          "Contenu": "Goooooooood vpn"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "jsE",
          "Nb_Reviews": 1,
          "Date": "2016-06-04T05:38:33.000Z",
          "Titre": "good",
          "Contenu": "fast and easy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MR PERVEZ AKHTAR",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T07:21:48.000Z",
          "Titre": "I was able to access my sky go app in…",
          "Contenu": "I was able to access my sky go app in Turkey from Uk within an hour as I like watching sport  and also get the receipt via internet after payment and able to access my uk programmes in Turkey including any adult material which I wasn't able to access before so very good service and prompt...Thankyou"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Mohsin Imam",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:21:13.000Z",
          "Titre": "Very good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom King",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:04:35.000Z",
          "Titre": "Quickly and competently.",
          "Contenu": "I thought, oh know another headache and trial when I was billed for something I already had. From past experience customer support has always been a disaster in most circumstances for me. Hotspot on the other hand gave me immeadiate feedback and quickly got to the source of the problem and solved it. I have never been so happy. In a matter of a couple days rather than weeks my issue was found and corrected. Thank you so much Hotspot Shield."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alan Parsons",
          "Nb_Reviews": 31,
          "Date": "2023-11-11T17:54:54.000Z",
          "Titre": "Best VPN",
          "Contenu": "In my Opinion this is the best VPN on the market with a huge choice of virtual choices and connections are fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BB",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T09:20:06.000Z",
          "Titre": "It let me turn the schools Wi-Fi into…",
          "Contenu": "It let me turn the schools Wi-Fi into something that actually works really well thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fayez El Halabi",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T17:30:55.000Z",
          "Titre": "One of the best !",
          "Contenu": "One of the best !! Most Reliable VPNThat is an excellent application for VPN and can be used on multiple devices. Reliable, affordable, true, safe, and can be used from any place in the world. Also can be used with iPhones, Tablets, laptops, desktops, and any operating system. I am using this VPN since 2018 and still works perfect"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hermit",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T18:25:21.000Z",
          "Titre": "Great customer experience",
          "Contenu": "I lost my connection before moving last July.Eight months later I tried to reset my connection but did not have the old email address to reset my password. The Hotspot team patiently guided me through a complete reset without any issues, even by dealing with different people. They were knowledgeable about my situation and solved the issue.Happy life time subscriber."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Uren",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T02:38:30.000Z",
          "Titre": "keeping up on cyber security is hard but not with Hotspot shield",
          "Contenu": "keeping up on cyber security is hard. I'm Almost fully protected online just need to change a few things on my network and social media accounts. Dash Lane Password Manger with their partners at Hotspot Shield VPN are helpful, kind and they helped me look for exactly what I was looking for, I needed to make sure that I was felling safe. Hotspot Shield Gave me links to exactly what I was looking for. Where the Geo VPN is located distance ect If you need a VPN Hotspot shield Is the best so far."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Auldrick",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T17:59:11.000Z",
          "Titre": "Satisfied Premium User",
          "Contenu": "I've been using the premium version for over 3 years. The VPN connection is fast and efficient, multiple locations to choose from, although most times I just use the auto feature. Works great for browsing, gaming and calling (including video calling), even with multiple devices connected. I contacted customer service for an issue today over their live chat and the wait was short for a live agent, then the issue was resolved within minutes. I'm very happy with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SL Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T08:37:39.000Z",
          "Titre": "My problem was not with Hotspot Shield",
          "Contenu": "I found my problem wasn't actually with Hotspot Shield, but I wasn't sure what to do.A kind & patient associate was able to help anyway by steering me to the help I needed.  Now that's true customer service in my book!I'm not computer literate, so this kind of help was appreciated."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T07:13:16.000Z",
          "Titre": "On the ball",
          "Contenu": "Great app which is always updating to counter anything other apps do so you can't watch them ie bbc iplayer etc. Also has a massive choice of locations if you just want to stay anonymous. And when you contact them with an issue they are immediately on the case to resolve the problem. Well done hotspot shield!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Rainsford",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T02:53:05.000Z",
          "Titre": "Hot Spot Shield Help Desk 10/10…",
          "Contenu": "Hot Spot Shield Help Desk has always provided a quick response to my enquiries in regards to any issue or additional information I have needed to use this efficient VPN service over the past 7 years. It does take a little time to understand how to successfully work around to get access to blocked sites that you know are safe. A good efficient safe service. JR 7Aug2022"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Andrei Shmakov",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T23:47:36.000Z",
          "Titre": "Best support ever",
          "Contenu": "I had experienced issues with signing in different devices. The Help Desk was amazing, quick, professional, and kind. Everything resolved. I am very grateful indeed. I have tried few vpn providers. Hotspot Shield is the Best by now in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fayez El Halabi",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T00:39:32.000Z",
          "Titre": "Honestly Amazing App !",
          "Contenu": "Honestly !!! I had used this VPN since 2018 and till now it never failed me and I was able to use it with multiple devices. High speed download and smooth streaming for videos. Also clear and top notch voice calls. Can access all over the world. Used it in Lebanon, Qatar, Dubai(UAE), Germany, France, Iceland, Switzerland, Austria, Morocco, USA, and Italy. I got the life time subscription that was offered before and it is perfect."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dave Dickinson",
          "Nb_Reviews": 22,
          "Date": "2023-09-05T20:55:40.000Z",
          "Titre": "App and FireStick",
          "Contenu": "Unable to get the App downloaded from App Store to work on FireStick. Customer support response was quick and complete easy to follow, download from main site. This was successful"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Hamoon Sheikh hasani",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:15:48.000Z",
          "Titre": "Great online support",
          "Contenu": "Great online support They fixed my problem after just one emailHow they responded and cared about their customer is really comforting"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alan Robertson",
          "Nb_Reviews": 11,
          "Date": "2023-04-15T18:29:50.000Z",
          "Titre": "Very fast and efficient service",
          "Contenu": "Very fast and efficient service. Had difficulty installing my tv as one of my premium devices. 15 minutes after informing Hotspot Shield of my problem an email was sent giving step by step instructions which worked first time. Very pleased. Thanks to Louie and the team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Thorn",
          "Nb_Reviews": 2,
          "Date": "2022-09-24T23:45:45.000Z",
          "Titre": "I had a question about my Hotspot Subscription.",
          "Contenu": "I had a question about my Hotspot Shield protection subscription. When I wrote to support for help, I received an immediate, friendly and helpful response from Erniel B., a Customer Support Advocate.I am very happy and pleased with Hotspot Shield and feel much safer online with it on my computer.  Thank you so much... Kathy"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "TheCrazyStupidGamer",
          "Nb_Reviews": 5,
          "Date": "2022-07-13T19:14:06.000Z",
          "Titre": "A good VPN service, especially if bundled with Dashlane",
          "Contenu": "I got it as a part of Dashlane premium. It used to have an inbuilt VPN connectivity provided by Hotspotshield or its parent company. They recently just gave us access to Hotspotshield directly. And I haven't had any complaints. I never felt the need to opt for any other services. A few servers are hard to connect to here and there and the auto option seems to only connect to the US, but it's fine. You can always choose your location as you wish."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Porter",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T22:59:01.000Z",
          "Titre": "I'v used this product for 2 plus years",
          "Contenu": "I've used this product for a number of years and found it to be a reliable product for VPN use. Any difficulties I experienced were addressed in a reasonable amount of time and were quickly resolved and explained to me in a clear, concise manner.  I highly recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Lang",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T07:36:17.000Z",
          "Titre": "Hotspot Shield's response was fast and…",
          "Contenu": "Hotspot Shield's response was fast and constructive ...No messing around, they admitted, it was their mistake and fixed it immediately, even without further contact from me...To good, just to good, to not, recommend...The \"VPN\", well, lighting fast and KISS...Not moving, thank you guys!!..."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "arados uae",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T01:36:02.000Z",
          "Titre": "HOTSPOT SHIELD VPN",
          "Contenu": "The best way to resolve if any issues happened ! They are perfect team and company , always available (24h) for any questions from thier customers, I love this application since from 2008 till now and forever"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Krushal",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T15:12:59.000Z",
          "Titre": "Had an issue with my subscription which was promptly resolved",
          "Contenu": "Had an issue with my account not reflecting its premium status. Customer Service got back to me within a day of raising the request and were able to resolve the issue.I'm very surprised and happy to receive such prompt service in today's day and age."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Phil Walsh",
          "Nb_Reviews": 2,
          "Date": "2022-06-29T10:01:48.000Z",
          "Titre": "IP collision detected",
          "Contenu": "I am still running Windows 7 on one of my computers, and for various reason want to continue with 7.Recently Hotspot Shield refused to work and I got a message \"IP collision detected\". I contacted the help facility and got a number of steps to try.After several \"dead ends\" the problem was solved by deleting the driver \"Hotspotshield TAP-Windows Adapter V9\" and installing \"hsstap-windows-9.24.4-I601\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "General Agent",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T19:58:17.000Z",
          "Titre": "HOTSPOT SHIELD TRUST",
          "Contenu": "It takes a while to receive a response but ultimately there can be some consensus made after a while. [PLEASE ADD PHONE SUPPORT TO OPTIMIZE REVIEWS]"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WAYNE LUALLEN",
          "Nb_Reviews": 6,
          "Date": "2022-08-25T21:28:07.000Z",
          "Titre": "Months of challenges getting Hotspot Shield to work with Outlook 365",
          "Contenu": "After months of issues with Hotspot Shield conflicting with my ability to use Outlook 365, after mulitple suggestions from the techs at Hotspot Shield, after mulitiple emails back forth that just continued to show their patience through my frustration, finally they appear to have resolved the issue. Only one day has past, but it appears that the app on my PC is working now in association with Outlook, Edge, and Firefox browsers. -- Thank you tech support! It was a few months coming and mulitiple attempts to fix the issue, but it seems fine now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Brymer",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T03:02:15.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I had an issue getting one of my phones linked to my existing account. I emailed Hotspot Shield Support to get assistance. They emailed me with detailed instructions on how to get this done, and also emailed me a day or so later to make sure I was able to get it it done, or if I needed additional assistance. Great customer service you don’t see much of anymore. I have been a customer for over three years now, and will continue to use Hotspot Shield in the future. Great protection for your phone!"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Sergey Aga",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T05:12:05.000Z",
          "Titre": "I like everything about it",
          "Contenu": "I like everything about it. From fast and fast access to anywhere in the world, to teamwork in case of problems. Recently there was a problem and the app stopped working. I created a request and since then, almost every day I was written from customer support team with requests to check settings, configurations, access to different locations. And in the end we managed to fix everything!Huge thanks to the HotspotShield team for their reverent treatment of their product and users.And a huge request to the people, who use HotspotSheld products - don't ignore the support service questions about checking the settings, capable connection and other. It helps to determine the cause of the problem and fix it as fast as possible. Teamwork one love."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jerry",
          "Nb_Reviews": 36,
          "Date": "2022-07-22T14:41:44.000Z",
          "Titre": "I needed to change my account details.....",
          "Contenu": "I have been a Hotspot user for 5 yrs. I needed to change my account details, including email. Kyla, the support member, sorted the issues immediatly and professionally , whilst being both polite and helpful.Hotspot is a top notch VPN with a stack of good features. Would recommend - 5*"
        },
        {
          "Note": 5,
          "Lieu": "ME",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T11:10:17.000Z",
          "Titre": "Good, fast, reliable",
          "Contenu": "This VPN works even in the countries that block the other ones, it is fast and stable, would definitely recommend it. Also, support is responsive and helpful, they helped to resolve my issues with double subscription."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Николай Соколовский",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T15:55:29.000Z",
          "Titre": "Very nice helpdesk",
          "Contenu": "I faced a connection problem some time ago. The helpdesk shared that they have already known about similar problems and working on it. They suggested several workarounds and were reaching me several times to get to know whether the problem had solved or not in very polity and warm mannear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damian G. Finch",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T14:46:19.000Z",
          "Titre": "Hotspot Shield works as advertised, AND excellent customer service after the sale.",
          "Contenu": "Hotspot Shield works as advertised, but customer service is also very important. Today, I needed to avail myself of customer service and found them incredibly responsive. The care and attention I received were first-rate and made me feel like an important customer. This is the first time I had occasion to contact customer service in the six years I have been a client. Excellent experience, two thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T01:30:38.000Z",
          "Titre": "Great support for installation on Amazon Fire Stick",
          "Contenu": "The team at Hotspot Shield gave great help in getting this app installed on my Amazon Fire Stick. Many thanks for that good service! As mentioned over the chat, it would be perfect to get the app into the Amazon App Store. The workaround is fine, but direct access without downloader would be better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelvin Davies",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T05:12:17.000Z",
          "Titre": "Connection issue after new App",
          "Contenu": "Had a connection issue after installing a new antivirus app.  The support team were very quick to reply on email and gave me all the right answers to quickly get connected again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Goutam Bhattacharya",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T20:45:58.000Z",
          "Titre": "First a precise bot and then an efficient agent Jehoshua",
          "Contenu": "First a bot replying - very precisely on the issue and then got transferred to Jehoshua and he helped me through \"step by step\" checks and finally uninstall and reinstall guide that solved the problem. Good job Jehoshua !!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bob Gilmour",
          "Nb_Reviews": 3,
          "Date": "2023-05-25T02:47:53.000Z",
          "Titre": "Best Customer Service ever.",
          "Contenu": "My experience has been excellent.I have been with Hotspot Shield for almost a decade & have been100 percent satisfied.The customer service is second to none, with fast response & helpful staff.It's definitely a 10 out of 10 from me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "matt amos",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T05:56:43.000Z",
          "Titre": "Unrivaled Premium Speed",
          "Contenu": "I've been a premium member since 2017 and use this VPN via mobile, desktop app, and Google Chrome extension. It was an amazing deal then and still is. The speeds are unrivaled for a premium VPN experience."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil Rodgers",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T18:50:41.000Z",
          "Titre": "Great Hotspot customer support",
          "Contenu": "The option to add another device, my TV  (5 are allowed) sent me to a QR code where I needed to log in to my account. This is something that you rarely need to do and for some reason I could not log in. I raised a ticket with support which was picked up quickly and the issue was that I had 2 usernames/emails associated with the account. This was quickly resolved by getting the account in order and I was then able to add the device. The support is quick and very easy to deal with and resolve problems."
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Francis Dashwood",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T22:16:04.000Z",
          "Titre": "It does its job perfectly as a VPN",
          "Contenu": "It does its job perfectly as a VPN, the support is out of this world. Have helped me twice fix my account, which was bugged due to Dashlane not recognizing my Premium membership, fast replies, straight to the point, very polite. The VPN is easy to use too!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "María Sánchez",
          "Nb_Reviews": 3,
          "Date": "2022-08-09T20:29:59.000Z",
          "Titre": "The best VPN on the internet",
          "Contenu": "This is the best VPN I’ve ever tried. It’s worth paying every penny for it because it won’t disappoint. Unfortunately, I’m no longer able to afford it and I had to cancel it. As soon as I’m economically stable once more, I will definitely resuscribe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amru",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T03:17:23.000Z",
          "Titre": "Quick and reliable support",
          "Contenu": "I've been using Hotspotshield for close to a decade now, yes the service is great and I have at least used it from over 15 different countries across 4 different continents and the very few times I had issues is where their added value comes through. Quick and reliable support. A recent experience was with an unsupported router and tech support was on point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Snaping",
          "Nb_Reviews": 2,
          "Date": "2022-06-23T03:53:22.000Z",
          "Titre": "Helpful Customer Service & Great VPN",
          "Contenu": "Helpful Customer Service & Great VPNEven though I had an issue with activating my account correctly they were quick to solve the issue and fixed things for me. I was also surprised that they even emailed me a follow up to make sure that I had seen their response to my issue.As far as the VPN, it's been able to give me high speeds and next to no increase in ping times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Hill",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T20:10:23.000Z",
          "Titre": "To Whom It May Concern,",
          "Contenu": "To Whom It May Concern,   I have been accessing the Hot spot shield since it\"s inception on the Google Play store here in the United States of America to create knowable Data that the Developers are hopefully able to use to know the difference,when experiencing excessively \"hacking\" next door neighbors via Pakistan in in Bellevue,Wa.     I will continue to access this Application with it being a great success for me to avoid being tracked (Geo)via the social network drama created by the networks that are broadcasting rumors about me I have never been to once currently,     I hope the cyber crimes units in this country are able to pin point the MAC ID device numbers etc. to identify the perpetrators,an cause their devices to no longer function correctly or become obsolete when intentionally doing so.     I watch your commercials daily an will continue to do so to strengthen the Sevelopers knowledge base Date about what is really going on that they may not have been enlightened to via the Data.    Best regards,    Robert Hill"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr john mcglynn",
          "Nb_Reviews": 4,
          "Date": "2023-02-03T18:04:54.000Z",
          "Titre": "this product is amazing and the service is better.",
          "Contenu": "this product is amazing , i had a small issue and within minutes the customer service team had it resolved. i rarely recommend products or companies but happy to make an exception here. first class !"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Norman",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T15:09:50.000Z",
          "Titre": "Fast and stable VPN and great support",
          "Contenu": "I have been using HotspotShield's VPN since 2015 and have tested and compared several other providers in between. For me, HotspotShield has the most stable and fastest connection and now offers numerous countries. I have also had contact with the support team several times, which is simply great. The support always responded quickly and was very accommodating to my wishes. HotspotShield gives me more security and confidence, so that no other provider comes into question for me."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Wassim AL RACHINI",
          "Nb_Reviews": 8,
          "Date": "2023-02-10T12:20:17.000Z",
          "Titre": "good support",
          "Contenu": "I had a trouble with my account because I have dashlane like application to save passwords and hotspot shield is free for dashlane users. my vpn  account didn't work but the support team helpeld me with this matter"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Brayan R. Doria",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T01:08:28.000Z",
          "Titre": "I have an issue in my account",
          "Contenu": "I have an issue in my account. I cannot activate from my Dashlane account. The HS's Costumer Service replied me in 11 minutes and solved my issue. It's the fastest replied that i encountered in a Costumer Service."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Andres",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T12:42:22.000Z",
          "Titre": "Response was quicker than I ever…",
          "Contenu": "Response was quicker than I ever thought, and the solution got to me, worked in less than 20 minutes. It's a wonderful customer service. I was really impressed with the attention given to my issue, and the quick solve. I'm a proud customer <3"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy Wijaya",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:20:23.000Z",
          "Titre": "great vpn with great customer service",
          "Contenu": "been using for months, works great. has a technical issue recently and failed to troubleshoot in everyway I can think of. contacted the support and they helped me  until the issue was resolved within 15 minutes. great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Goodman",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T04:58:40.000Z",
          "Titre": "I worked with their customer service…",
          "Contenu": "I worked with their customer service team as I had some issues getting signed up and I must say that they are DILIGENT and QUICK and RESOLVED all my issues!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Apple Cherry",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T13:37:36.000Z",
          "Titre": "There is nothing better than data and…",
          "Contenu": "There is nothing better than data and connection and protecting the IP and location.  I think Hotspot shield does it.I recommend hotspot shield."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Sheba Tamakloe",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T09:49:32.000Z",
          "Titre": "Hotspot shield has been the best VPN…",
          "Contenu": "Hotspot shield has been the best VPN I've used. Not only that but the customer service is on point. The chat got disconnected but the agent followed up via email to make sure I was ok. I'll continue to use their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Apple Cherry",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T17:04:48.000Z",
          "Titre": "Hot Spot wins the battle",
          "Contenu": "The Hot Spot seems better than the others.  More financing.  More money means more service and more features.  I want to up my daily free data to 1 TB or some thing like that.I want to pay them without using a credit card by using a bank transfer.  Then I won't run out of data."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Millette",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T04:16:14.000Z",
          "Titre": "Hotspot Shield allows me to participate…",
          "Contenu": "Hotspot Shield allows me to participate in e-commerce with the confidence that my data remains safe and encrypted.  After install, Anthony in the help department, explained the system functionality and I am now off and running.Thank you Anthony and thank you Hot Spot Shield."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Михаил Зенков",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T10:14:13.000Z",
          "Titre": "Very understandung support",
          "Contenu": "Very understandung support. I could not reach the web-site without VPN (ironically) and the Support team provided me with .exe of the desktop application via e-mail. Is the best I could even wish for. Thanks to ms. Abigail for her quick response."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Swain",
          "Nb_Reviews": 10,
          "Date": "2022-11-27T17:46:36.000Z",
          "Titre": "I had trouble getting registered as…",
          "Contenu": "I had trouble getting registered as Premium after subscribing to Dashlane.  The bot soon transferred me to a real person who was knowledgeable and patient.   All was resolved efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lee Gibson",
          "Nb_Reviews": 3,
          "Date": "2022-07-03T12:10:06.000Z",
          "Titre": "Worked with Louise V and Jan D on the…",
          "Contenu": "Worked with Louise V and Jan D on the issue of buffering while playing BBC iPlayer.  They were both very helpful and quick to the resolution.  I've been with Hotspot Shield for about 6 years.  Very pleased with the few times I've needed help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene Free",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T17:51:52.000Z",
          "Titre": "One of my TVs lost Hotspot Shield",
          "Contenu": "One of my TVs lost Hotspot Shield.  Tried to reset Firestik etc. No joy, I sent email to support.  They came through immediately and I was able to reset per instructions, Great Joy ensued!  Good job tech support!!"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Артём Коченко",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T11:58:33.000Z",
          "Titre": "I’ve mentioned wrong password when…",
          "Contenu": "I’ve mentioned wrong password when register, and could not log in. So I contacted support team and they solved my problem immediately. Great job guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherman Baksh",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T02:21:38.000Z",
          "Titre": "The speed at which my matter was…",
          "Contenu": "The speed at which my matter was resolved. That is greatly appreciated. The person resolving my issue should be recognized with a reward."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Glenn",
          "Nb_Reviews": 7,
          "Date": "2022-08-16T07:39:59.000Z",
          "Titre": "Staff member knew his stuff",
          "Contenu": "Anthony knew his stuff and was very helpful. I wanted a refund due to a slow VPN connection and he was able to help me so now my connection is way faster and I no longer wish to get the refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Herndon",
          "Nb_Reviews": 2,
          "Date": "2022-10-09T16:27:53.000Z",
          "Titre": "I asked the Support what the charge…",
          "Contenu": "I asked the Support what the charge might be for this service.  They responded almost immediately that it's included with my Dashlane account, so, no charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spring Melody",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T13:09:43.000Z",
          "Titre": "My support was amazing",
          "Contenu": "My support was amazing, attentive and super patient.  This is my first experience so BRAVO to Renzzo R. and hope the rest are like this staff member!!  😀"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Hans",
          "Nb_Reviews": 7,
          "Date": "2022-07-11T16:13:04.000Z",
          "Titre": "Quick response and help",
          "Contenu": "Today I sent an email to HotspotShield support. Less then an hour later I got an answer and a solution to my question. I thought that by sending an email I have to wait for days to get a response, but was  I pleasenty surprised!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Client",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T09:36:53.000Z",
          "Titre": "Great service",
          "Contenu": "Had an issue with registration, I got a reply within 24 hours, and everything was fixed.Helpdesk is very professional and the followup went great."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Adrian Topp",
          "Nb_Reviews": 4,
          "Date": "2023-08-03T22:16:02.000Z",
          "Titre": "Excellent service from the HotSpot…",
          "Contenu": "Excellent service from the HotSpot Shield support team to resolve my issue.Now able to use my VPN"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "KayOS",
          "Nb_Reviews": 5,
          "Date": "2022-08-22T23:57:20.000Z",
          "Titre": "Excellent in all respects",
          "Contenu": "Clear, concise and patient. So that’s a five-star review from me. And quick. Went online, talking to a real person within a few minutes. Problem solved."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Yanis “Purpl Wlf” Berva",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T19:39:32.000Z",
          "Titre": "A wonderful support",
          "Contenu": "As a VPN New user, the interface is very comprehensible and it is very easy to use the different features that Hotspot Shield Premium offersI have to admit that it is the best experience I've had with an online support before. While I had technical troubles getting access to my new account the support team immediately gave me access to a temporary account in order not to penalize me"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:27:21.000Z",
          "Titre": "the connection is always fast and so…",
          "Contenu": "the connection is always fast and so easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tran Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T08:14:43.000Z",
          "Titre": "I would like to thank Ms. Hannah Faye Benitez (Hotspot Shield Help Desk) and Mr. Phil Saladar (Hotspot Shield Help Desk) for your help.",
          "Contenu": "Hotspot Shield Help DeskThe work you have done to help customers has been fantastic! Thank you for being so flexible. This is how you run customers with heart. I couldn't have done it without you.Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T01:21:32.000Z",
          "Titre": "Refund experience",
          "Contenu": "I had a wonderful experience when I asked for a refund. They fulfill their promise of having 45 days to get your money back"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reg Barrett",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T19:22:04.000Z",
          "Titre": "Chat service fast",
          "Contenu": "I had an issue with hotspot not working on my fire stick and went on chat. Was quickly given a new url to download the latest version and in a few minutes all was well again."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jeng Pascual",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T07:10:46.000Z",
          "Titre": "Super fast issue resolution!",
          "Contenu": "Yankee knew exactly what the issue was with my sign in difficulties and immediately corrected it. I was back in business in less than 5 mins."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris  OReilly",
          "Nb_Reviews": 16,
          "Date": "2022-09-02T15:24:58.000Z",
          "Titre": "Great VPN that continues to improve",
          "Contenu": "In the years since I first started using Hotspot the after-sales care has always been good but so too has the continued development of the software improved to the extent that issues with connections and the software itself are something of a rarity. Glad I chose to invest and put my trust in this technology."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jafar Iqbal",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T19:25:59.000Z",
          "Titre": "Great customer service",
          "Contenu": "Helpful, polite, patient and, crucially, managed to help me fix my problem. Cannot fault the level of service at all."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "S.K. Verma, Sonipat, India",
          "Nb_Reviews": 3,
          "Date": "2022-09-27T08:22:20.000Z",
          "Titre": "Hotspot Shield stopped working Windows…",
          "Contenu": "Hotspot Shield stopped working Windows 10, 64 bit laptop.  Un-installing the Hotspot Shield app and re-installing the same worked !"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Scott Craig",
          "Nb_Reviews": 9,
          "Date": "2022-08-02T19:17:01.000Z",
          "Titre": "Premium trouble",
          "Contenu": "I was having trouble downloading the premium account to my laptop due to a invalid captcha certificate, it would not let me complete the download.I then contacted Hotspot Shield help desk and was given advice and links to allow me to complete the download, they were helpful and knowledgeable and soon got my download complete."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Kal El",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T05:59:52.000Z",
          "Titre": "Wilson C of Hotspot Shield solved my…",
          "Contenu": "Wilson C of Hotspot Shield solved my problem in a fast and efficient wayThanks Wilson, I appreciate your help"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mike gilmore",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T11:37:56.000Z",
          "Titre": "The process was easy to understand"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Zumrad",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T02:32:30.000Z",
          "Titre": "the app helps a lot in our country and…",
          "Contenu": "the app helps a lot in our country and the organizers help a lot with the problems, I'm pretty and highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:02:28.000Z",
          "Titre": "It keeps my privacy  private",
          "Contenu": "It keeps my privacy  private,  and provides  me with support  when I need it. ... keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MrTellcan",
          "Nb_Reviews": 5,
          "Date": "2022-06-17T15:17:24.000Z",
          "Titre": "Speedy first class response.",
          "Contenu": "Speedy response with my queries answered in a fast, friendly and efficient manner. Exactly how a Help Desk should be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Concerned customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T00:01:46.000Z",
          "Titre": "This action was not taken by me and now…",
          "Contenu": "The team at hotspot was able to help reinstate my account after I was able to show receipts from my initial purchase of my premium membership when someone tried to claim they were the true owners of the account."
        },
        {
          "Note": 5,
          "Lieu": "AD",
          "Pseudo": "Oasis",
          "Nb_Reviews": 11,
          "Date": "2023-07-18T02:55:50.000Z",
          "Titre": "Fast and reliable VPN with a nice interface",
          "Contenu": "Reliable, fast and lots of locations available, I am very happy with this VPN, I like that their beautiful interface makes it very easy for me to change my location when I access streaming services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raila",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T06:34:57.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Customer service was very convenient, efficient, and helpful. Took very little time to solve an issue of mine and made the experience a breeze."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ray",
          "Nb_Reviews": 19,
          "Date": "2023-03-10T14:41:07.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Hotspot Shield is a very useful and reassuring addition to the security of your mobile communications, especially when private information is sent using public wifi.  Quick, easy and fast connection.  Their customer service are very efficient and helpful too when you need to contact them."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Nath ZOUZOU Inathazou",
          "Nb_Reviews": 2,
          "Date": "2022-09-07T07:39:48.000Z",
          "Titre": "VPN brilliant",
          "Contenu": "VPN brilliantalmost no speed lostProtect your identityWorks with Dashlane I recommend it, one of the best if not the best VPN on the market."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Gugu",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:34:31.000Z",
          "Titre": "it has made my life easier and the…",
          "Contenu": "it has made my life easier and the servers are fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Harbison",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T05:04:32.000Z",
          "Titre": "Help from the support team made easy",
          "Contenu": "Help from the support team made it possible for me to get this program up and running.  I am anything but a techy and they guided me through the process.  Very good team of support staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DONNA ANZALONE",
          "Nb_Reviews": 3,
          "Date": "2022-08-31T02:26:41.000Z",
          "Titre": "Carl was very prompt in carrying out my…",
          "Contenu": "Carl was very prompt in carrying out my request to cancel the Premier Subscription.He was also very nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "salman haider",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T07:43:32.000Z",
          "Titre": "it has helped me come out of an…",
          "Contenu": "it has helped me come out of an immensely helpless situation where i was very madly looking for an internet connection and then thanks to the hotspot shield , that it solved all my connectivity issues, and now i am enjoying fast and smooth net connection..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Nicholson",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T12:42:20.000Z",
          "Titre": "Thanks!",
          "Contenu": "Helpful, Responsive, Intuitive responses from Hotspot. I look forward to remaining a premium member not just for the high value in the app itself, but for the very high threshold of customer service that accompanies it."
        },
        {
          "Note": 5,
          "Lieu": "IR",
          "Pseudo": "Bahman Adabi",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T06:47:50.000Z",
          "Titre": "Highly Recommended",
          "Contenu": "I personally had a great experience with HotspotShield Support Team. They could not be more supportive in solving my problem and the follow-up after the problem was resolved was very professional. Highly Recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Primorske Skupnosti",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T06:24:22.000Z",
          "Titre": "Best Paid Proxy VPN Software",
          "Contenu": "Best Paid Proxy VPN Software. If you need fast VPN we strongly suggest for your business or private use HotSpot Shield !!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Dipesh Singh",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:43:57.000Z",
          "Titre": "Everything was great",
          "Contenu": "Everything was great . The communication skill is so good that My issue resolve in some minutes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "heytch",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:00:05.000Z",
          "Titre": "cant fault it",
          "Contenu": "cant fault it, good reliable connection and easy to use"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Dina Ali",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T21:54:30.000Z",
          "Titre": "Great Technical Support Team",
          "Contenu": "The technical support team were so helpful and they addressed my issue in a very short timeframe."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "neil wightman",
          "Nb_Reviews": 13,
          "Date": "2023-04-15T09:53:47.000Z",
          "Titre": "Had a problem activating my premium…",
          "Contenu": "Had a problem activating my premium account - sent a mail to the support team and had it resolved within the hour"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Taichi",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T00:48:39.000Z",
          "Titre": "Best support out there",
          "Contenu": "Everytime there was something, support would give their best to help me out. 5/5 stars kind and nice support team they have. Not like many other vpn teams that act all the same."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Gabe",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T19:14:46.000Z",
          "Titre": "Offered reasons for problem and a list…",
          "Contenu": "Offered reasons for problem and a list of solutions. Excellent, fast, and friendly!"
        }
      ]
    }
  ]
}