{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.photonlight.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "JOAQUIN TINOCO",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T01:53:34.000Z",
          "Titre": "Product is ok",
          "Contenu": "Product is ok, didn't fit my Photon Freedom+, please let me know where can I get them. Thanks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S_ N_",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T20:28:02.000Z",
          "Titre": "i ordered two Freedom Micro lights and…",
          "Contenu": "i ordered two Freedom Micro lights and did not receive the necklace clip or hands-free hat clip with either. I also want to exchange one of them for the covert version. I tried contacting Photonlight multiple times via phone, website, and email and got no response - zero response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Artur Apostolov",
          "Nb_Reviews": 2,
          "Date": "2022-03-26T18:40:30.000Z",
          "Titre": "Awful service",
          "Contenu": "Awful service! I never received my order! I called numerous times and was not able to get a hold of anybody! My order was never shipped and then in two weeks my order status showed: item not available for sale. Nobody contacted me to notify of the cancellation, nor suggest any alternative options. If I could leave 0 stars for the customer service, I would!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Kozlowski",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T21:59:29.000Z",
          "Titre": "I ordered clips that were no longer…",
          "Contenu": "I ordered clips that were no longer available and no one contacted me about it. I did not find out until I called customer service wondering why my order did not ship."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "I hate your constant nagging",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T05:40:22.000Z",
          "Titre": "Warning: review required!!!!",
          "Contenu": "Don’t buy a flashlight from these people!  They will hound you incessantly to leave them a review; to the point that you wish you’d never heard of them.  Never mind that their lights are fantastic, well throughout, well executed, reliable, and impressive lights; they will hound you for a review to the point that you will wish that you’d never paid them for a flashlight.  They will badger you for a review until you start to think to yourself that you’d be willing to pay double if they would simply LEAVE YOU ALONE!!!!They will annoy you to the point that you will consider throwing all 3 of the yet unused lights you purchased, into the trash because their constant aggressive email barrage, nagging you for a review is frustrating to the point that they make your stupid cheating lesbian ex wife seem calm and reasonable by comparison.  DO NOT SPEND YOUR MONEY ON PRODUCTS SOLD HERE UNLESS YOU ARE PREPARED TO GIVE THEM A REVIEW WITHOUT EVEN HAVING TRIED THEIR PRODUCT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MIKE B.",
          "Nb_Reviews": 3,
          "Date": "2021-11-16T03:02:21.000Z",
          "Titre": "11/15/2021",
          "Contenu": "11/15/2021 Over 1.5 week ago I placed my order and received tracking information, that it was picked up and etc. and opted to have the items tracked. Well, that's where we stand. Still en - route, click on USPS and it still shows it to be in Oregon awaiting pickup. So who knows where its at. I do know this company was quick to collect my payment.But I will reserve leaving 4 stars until I receive the items. This excuse of no workforce is available due to covid, is getting old.That's when management picks up the ball, put the disc batteries into an envelope, print out a label and call Post Office for Pick up. Pretty simple.BTW, IS THIS THE SAME USPS THAT WANTS RATE INCREASES. I THINK WE SHOULD DEFUND THEM. MY PURCHASE IS SOMEWHERE IN THE ABIS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T08:56:17.000Z",
          "Titre": "It has been over two weeks now and no…",
          "Contenu": "It has been over two weeks now and no update on my shipment... I'm not sure if this website is even legit. I'm going to wait another week and if I get nothing, I'll make a dispute with my bank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Remi Stachyra",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T21:04:56.000Z",
          "Titre": "Waited 3 weeks for my product to arrive…",
          "Contenu": "Waited 3 weeks for my product to arrive just to get an  e-mail that my purchase was canceled  because they don’t have it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "annoyed by surveys",
          "Nb_Reviews": 4,
          "Date": "2021-12-16T19:58:54.000Z",
          "Titre": "stop nagging for reviews",
          "Contenu": "the product is adequate, but the deluge of email requests for a review is annoying as f***"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle Shaw",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T12:14:05.000Z",
          "Titre": "My credit card information was stolen…",
          "Contenu": "My credit card information was stolen and was used on this website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frederick George",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T01:08:46.000Z",
          "Titre": "Where’s the light?",
          "Contenu": "I order this item on 8/28 and it still hasn’t arrived.  I’m wondering if I will ever get it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Newton",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T17:03:07.000Z",
          "Titre": "Cancelled my order and didn’t return my…",
          "Contenu": "Cancelled my order and didn’t return my phone call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KENNAN GUNDERSON",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T19:30:38.000Z",
          "Titre": "HAVE NOT RECIEVED MY ORDER WITH NO…",
          "Contenu": "HAVE NOT RECIEVED MY ORDER WITH NO UPDATES."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "XS",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T16:19:36.000Z",
          "Titre": "My order still hasn’t shipped with no…",
          "Contenu": "My order still hasn’t shipped with no word from Photonlight"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "can",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T17:56:25.000Z",
          "Titre": "order cancelled for no reason"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "wollab",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T19:05:40.000Z",
          "Titre": "Waited two weeks and THEN cancelled my…",
          "Contenu": "Waited two weeks and THEN cancelled my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Eason",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T12:46:59.000Z",
          "Titre": "I have not received my order!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carla Espinosa",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T18:19:02.000Z",
          "Titre": "Order was cancelled since the website…",
          "Contenu": "Order was cancelled since the website inventory was not according real inventory."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MGP",
          "Nb_Reviews": 2,
          "Date": "2018-09-18T14:42:19.000Z",
          "Titre": "Not a good experience this time",
          "Contenu": "I was sent a micro light II that seems to be low on battery or defective. I sent a message to the company letting them know and the person who responded stated the product is usually in this condition. I have ordered from this company in the past, same product and never was sent a micro light that performed poorly. I was not offered a replacement, but I was advised to \"exchange it\". Great! I have to go through the trouble to mail it back. Unbelievable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2018-07-09T19:00:29.000Z",
          "Titre": "We chose them as vendor due to price…",
          "Contenu": "We chose them as vendor due to price (they were not the lowest price either). They were the only one, willing to take my large volume PO for high end LED light.Order lead time was communicated inaccurately, It created procurement challenge for us.  Order was short shipped. Emailed them but it has not resulted in payment charges to be refunded. I am afraid I will have to resort to AMEX to resolve it, which mean, I will waste more energy to recover from their poor CRM.I will not be returning, and I do not recommend them for large purchase order. Thanks,AJ"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Leonhardt",
          "Nb_Reviews": 1,
          "Date": "2012-09-15T19:06:17.000Z",
          "Titre": "NO customer service, no refund, no feedback!!!",
          "Contenu": "I received the little laser flashlight and it didn't work from the start.\rI sent it back as per their instructions.  \rIt has been a month now and I have heard no response and of course no refund.  \rI would have liked to heard SOMETHING.\r I have been very busy so have not taken my valuable time to follow up on something so obvious.  They said \" just send it back and they would make it good\".  Well, I did my part.  \rI guess the next step is to file a complaint with the internet providers.\r Larry"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Highleyman",
          "Nb_Reviews": 1,
          "Date": "2012-01-21T00:31:23.000Z",
          "Titre": "I don't like your new light",
          "Contenu": "I've used Photon lights on my key chain for years and love them. I've given them as presents to many. However, I just purchased two of your newest models and don't like them at all. They have no on/off switch, but rather stay on with the first squeeze. That is fine. But they turn off automatically after ten to fifteen seconds. That drives me bats when I am trying to use it as a work light or read a menu. My next purchase will be for your original model that turns on only when squeezed or when the switch is turned on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brent Brown",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T20:02:34.000Z",
          "Titre": "Out of stock order?",
          "Contenu": "I ordered a flashlight on December 28 which showed they were in stock. 3 days after purchasing I received an email saying that they were no longer in stock and it was back ordered for a few weeks. If I had known this prior I wouldn’t have purchased since I needed it for my job ASAP. When customer service sent me a generic email stating it was now out of stock and would likely be back in stock in 1-2 weeks they offered no option to cancel/refund my order or to expedite shipping when it was finally back in stock. I’m very disappointed and still currently waiting to hear when my flashlight is back in stock and shipping hopefully expedited to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darce Stone",
          "Nb_Reviews": 2,
          "Date": "2017-09-22T14:15:00.000Z",
          "Titre": "Disappointed",
          "Contenu": "You once had a light to where the operator could control the time it stayed, not so true for this one.  I find myself constantly switching it on due to the 10 second timer, this is a really bad feature.  I've owned Photon lights in the past but this one is not even worth keeping.  I'm back to using my phone light again.  Truly disappointing.  You need to get rid of the auto turn off and make it manual again then you will have a good light.  I use this all the time but really it's useless.  I would gladly trade this one in for another in which I control the off mode.DisappointedDarce Stone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xander",
          "Nb_Reviews": 1,
          "Date": "2017-04-30T16:03:28.000Z",
          "Titre": "I ordered a flashlight two weeks ago …",
          "Contenu": "I ordered a flashlight two weeks ago and it still has not shipped. I tried to contact the company with a phone call and through email. No response from either. I guess I will have to contact my credit card company to try and cancel the order."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Waiting",
          "Nb_Reviews": 4,
          "Date": "2013-12-28T20:17:21.000Z",
          "Titre": "More than 3 weeks, and I haven't got my order.",
          "Contenu": "Our Leatherman is still out there! Somewhere, maybe in rowingboat or in donkey's saddle. The road is long. Only one thin letter.  More than 3 weeks, and still counting!!! How is this possible in year 2013?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Walden",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T04:31:01.000Z",
          "Titre": "did not receive the item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Woods",
          "Nb_Reviews": 3,
          "Date": "2015-07-07T19:39:54.908Z",
          "Titre": "What am I supposed to review?",
          "Contenu": "If you would really like my opinion on an item wouldn't it make sense to tell me what the item is that you want my review of?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bobby june",
          "Nb_Reviews": 2,
          "Date": "2013-05-09T21:26:02.000Z",
          "Titre": "your product breaks very easily.",
          "Contenu": "These light although useful and very bright  they have no durability, the on off button breaks almost immediately."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DWAYNE WEST",
          "Nb_Reviews": 1,
          "Date": "2017-07-16T17:26:12.000Z",
          "Titre": "Spammer",
          "Contenu": "Spammer. I never wanted thier email and the just send then to me. Not interested, never was."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Nguyen",
          "Nb_Reviews": 2,
          "Date": "2017-04-26T04:41:26.000Z",
          "Titre": "I ordered my light and it has been over …",
          "Contenu": "I ordered my light and it has been over 2 weeks but j have not recieved it yet"
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "can",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T07:59:35.000Z",
          "Titre": "not recommanded"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T23:17:18.000Z",
          "Titre": "The light did not come with the clip…",
          "Contenu": "The light did not come with the clip and accessories shown on box."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Filipe Camara",
          "Nb_Reviews": 1,
          "Date": "2014-02-07T17:40:43.000Z",
          "Titre": "not intend to use  anymore in future inquires",
          "Contenu": "no delivery package and no reply to e.mails sended."
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2013-04-08T18:31:48.000Z",
          "Titre": "custom taxes are nearly the same as product cost"
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "can",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T16:18:44.000Z",
          "Titre": "order canceled",
          "Contenu": "terrible experience"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Joerg Mohr",
          "Nb_Reviews": 1,
          "Date": "2017-11-20T18:52:07.000Z",
          "Titre": "not delivered",
          "Contenu": "until now, the order was not delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "russ denton",
          "Nb_Reviews": 1,
          "Date": "2017-07-25T03:36:07.000Z",
          "Titre": "Item still not received"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J K",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T03:31:12.000Z",
          "Titre": "Why haven’t it shipped yet?",
          "Contenu": "I placed my order on the 8th of this month. It’s currently the 22nd and my order is still processing and hasn’t even been shipped yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "G. Keith",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T22:30:53.000Z",
          "Titre": "Slow Customer Service",
          "Contenu": "I have returned an ir light for exchange. The customer service person Bryan Avery acknowledged that they would send me a replacement white light (which is $1 less). My return package was verified received by Photon Light on December 11. It took almost two weeks to receive status of my replacement light."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SRB",
          "Nb_Reviews": 2,
          "Date": "2021-09-27T16:41:37.000Z",
          "Titre": "Focus of red and blue light are…",
          "Contenu": "Focus of red and blue light are completely different. Red light is a focused hot spot, blue light is more diffuse. Click-to-stay-on buttons don't work at all. Very disappointed. These used to be great lights, but, profit motives indicate a far lower quality product. Will not buy again."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T19:52:36.000Z",
          "Titre": "Shipping damage to retail boxes means I’m unable to gift these as planned",
          "Contenu": "The lights themselves get 5 stars and this is my second quantity order.The shipping is what motivated 2 stars.The soft bubble-wrap envelope was possibly stepped on during transit, so each of the four boxes were badly crushed.The lights worked fine, but I couldn’t give any as gifts as I had hoped, because of the condition of the boxes.  They looked awful and not at all presentable as gifts.  Now I have four lights that I don’t really need.Shipping them in a cardboard box might have helped because I have never received a crushed box. In my opinion a bubble envelop should only be used for items that can handle some reasonable amount of weight without damage."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "James Smith",
          "Nb_Reviews": 1,
          "Date": "2021-06-14T20:26:03.000Z",
          "Titre": "The total product is not what it used…",
          "Contenu": "The total product is not what it used to be. The quality of the light itself is still high, but they used to sell it (Freedom Micro) with a hat clip and a necklace attachment. They continue to show these two items on the package (as well as inside the package the plastic molding is made to hold the two items) but they neither include them with the light nor do they have them for sale (I looked). For such an incomplete package the value is just not there compared to so many other companies now selling micro lights.I also bought some replacement covers but $2 is a bit high for a disk of plastic compared to the black clips that sell for $1.25.The black clips come standard with the II Pro, but they should rather come standard on the covert models so the clip doesn't reflect light.I own 8 Micro Freedom from the past and my recent order was for a mix of 9 lights."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edward McDonnell",
          "Nb_Reviews": 2,
          "Date": "2021-12-09T15:33:52.000Z",
          "Titre": "You should be able to check your exact…",
          "Contenu": "You should be able to check your exact inventory when people order items. I ordered a flashlight but then you discover you don’t have any. Pretty disappointing for both you and me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Shelton",
          "Nb_Reviews": 1,
          "Date": "2020-08-05T22:08:42.000Z",
          "Titre": "These lights are great, but avoid the Microlight II",
          "Contenu": "These lights are great, but the Micro II flashlight seems to have a design flaw. I have bought two and they both have the same problem. They turn themselves on when jostling around in my pocket and the battery runs down. The Micro I does not do this and I would highly recommend it over the Micro II. It is cheaper and works better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gene Hamamoto",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T04:36:03.000Z",
          "Titre": "The extra modes hardly work",
          "Contenu": "The extra modes hardly work.  Sent in a freedom light for warranty. There is no warranty.  I’m done this company went downhill."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T K Whitley",
          "Nb_Reviews": 1,
          "Date": "2013-01-11T18:44:23.000Z",
          "Titre": "Simple is better",
          "Contenu": "I own several of the older design of these lites and I have been very pleased, but this new design...   I had the uv model and after hard use I could not turn it off and after tring to replace the battery the connector/batteryholded secame to a case of metal fatuge.  Sometimes simple is better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "K.M.",
          "Nb_Reviews": 3,
          "Date": "2017-07-14T20:06:02.000Z",
          "Titre": "Not what I expected.",
          "Contenu": "I have seen other models with a light that will stay on for more than a few seconds. This does not work as I need it to. I wanted a model that would stay on or shine briefly depending on how long the button is pressed. Very disappointed in this model."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RJ",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T00:31:07.000Z",
          "Titre": "No more hat clip?",
          "Contenu": "What happened to the hat clip for the micro lights?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D. Clark",
          "Nb_Reviews": 2,
          "Date": "2012-05-01T23:50:32.000Z",
          "Titre": "Not as bright as I had hoped",
          "Contenu": "Even though I ordered a purple light, LED's are usually bright, and this one is not....and the light does not appear purple. I was disappointed, especially since I had given my bright LED light like this to someone else since I ordered this one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "hwang",
          "Nb_Reviews": 1,
          "Date": "2016-10-22T14:59:50.000Z",
          "Titre": "Too low intensity of IR flash",
          "Contenu": "I bought IR and Red flashes. Red one is very good. But, IR intensity is very low compared to Red one.In the homepage, they said that the intensity is same. But, I measured the intensity of IR and Red ones by spectrophotometers."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Roderick J. Asagra",
          "Nb_Reviews": 3,
          "Date": "2012-07-14T06:38:20.000Z",
          "Titre": "You do not respond to your customers emails.",
          "Contenu": "Last June 22  2012 I a purchased  three units photon lights through your website.\r ORDER #:  110736\rREFERENCE #:    76578. \r Unfortunately I forgot to include the House number in the address that I provided. I realized this mistake the following day (6/23/12) when I received an email from Photon lights  confirming my order and informing me that it had been shipped already. I immediately emailed photon lights through the email address they provided (custservice@photonlight.com.) Until today there has been NO RESPONSE from them. Three weeks and not a response . I think  that their customer service people don't read their messages or they simply Don't Care!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacalyn Lind",
          "Nb_Reviews": 1,
          "Date": "2013-03-01T02:53:04.000Z",
          "Titre": "disappointed",
          "Contenu": "light will mot stay on unless you hold the button and then only stays lit for 5 seconds.  Also light is supposed to blink at various speeds.  Following instructions it does not blink at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Huntsberger",
          "Nb_Reviews": 1,
          "Date": "2016-08-20T01:27:32.340Z",
          "Titre": "Photon did not read my invoice carefully.",
          "Contenu": "My billing address and delivery address are in two different states.  Photon sent my order to my billing address.  It cost me $17.00 to have it sent correctly from my billing address."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Torcaso",
          "Nb_Reviews": 1,
          "Date": "2012-07-16T20:05:03.000Z",
          "Titre": "Not as expected, but still okay.",
          "Contenu": "I used to order the X-Light Micro, and it is still my favorite.  But I find that a squeeze ON/OFF button gets energized while on my keychain, or in my backback, and the battery drains to nothing.  that is an unpleasant surprise if it happens when you -really- want the light to work.\r So I tried a Micro-Lite II, thinking that the on/off switch would protect against the accidental squeeze-on problem.\r I was wrong.  The squeeze-on works when the switch is OFF, so the light can still be drained accidentally.  The switch-ON feature is just so that you do not have to constantly squeeze the switch in order to get light.\r I'll go back to the X-Light.  And I would REALLY like to see a feature that protects against the squeeze-ON that accidentally drains the battery!  C'mon, guys - I know you can do it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tony garcia",
          "Nb_Reviews": 1,
          "Date": "2017-04-22T11:08:46.000Z",
          "Titre": "i ordered this weeks ago and still have …",
          "Contenu": "i ordered this weeks ago and still have not received it. they say its on back order.   should take down from site until you get it in!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2013-02-22T17:04:52.000Z",
          "Titre": "DId not work as intended.",
          "Contenu": "The IR photon light was very unsatisfactory when trying to use with my ATN Scout binoculars. Do not buy for night vision uses."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Michael S.",
          "Nb_Reviews": 2,
          "Date": "2014-07-18T12:31:09.000Z",
          "Titre": "Still haven't received it - 3 weeks and still waiting.",
          "Contenu": "Ordered 26th June, still have yet to receive it.  I like their lights, but this is not very reasonable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2014-12-11T12:50:02.000Z",
          "Titre": "IR light put out very little light",
          "Contenu": "I used the IR light for a night vision camera and only worked if i was super close to something."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Woodring",
          "Nb_Reviews": 1,
          "Date": "2019-06-25T15:01:15.000Z",
          "Titre": "Ordered over two weeks ago",
          "Contenu": "Ordered over two weeks ago, hasn't even shipped yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald S KirkmanCustomer",
          "Nb_Reviews": 1,
          "Date": "2015-05-23T14:33:23.849Z",
          "Titre": "Not happy",
          "Contenu": "I still have not recieved my order"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Huyck",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T19:41:44.000Z",
          "Titre": "The light is well built",
          "Contenu": "The light is well built, hell I own 3 of them. This one is a little disappointing, love the purple color but not too useful at night."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael  T.",
          "Nb_Reviews": 2,
          "Date": "2020-10-13T17:59:13.000Z",
          "Titre": "The Future",
          "Contenu": "Got this light to replace an old unit used on my archery bow sight (fiber optic segment/pin needs more than ambient light to glow brightly). This new unit works, but the light’s color is blue rather than the  purple (like the original unit) it’s advertised to be. The beam is also not as strong, but the on/off switch is working well (unlike the original) so I’ll use it till something more suitable is found. If your light need(s) is/are not as specific, this could be quite adequate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LCD",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T08:37:28.000Z",
          "Titre": "It took two weejs before the item I…",
          "Contenu": "It took two weejs before the item I ordered was shipped. Ordered on 13 Dec, but didn't receive it until 3 Jan."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "George Roth",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T13:33:54.000Z",
          "Titre": "Thre lights are fine",
          "Contenu": "Thre lights are fine. These emails are annoying. STOP!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Pakutz",
          "Nb_Reviews": 1,
          "Date": "2019-04-06T12:45:01.000Z",
          "Titre": "the order was never shipped after it…",
          "Contenu": "the order was never shipped after it was put I. I called the phone number listed for help, I kept getting recordings but no call backs until about a week later. I was told something about the order was wrong and the order was now shipped. It took what seemed like another 2 weeks before I actually got the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Railton",
          "Nb_Reviews": 1,
          "Date": "2017-02-28T23:26:26.000Z",
          "Titre": "good service, product not as advertised",
          "Contenu": "I ordered 2 keychain LED flashlights. Ordering process and delivery was excellent, however neither flashlight worked in the morse code mode that was listed on the package instructions. This mode is very useful in preventing light from turning on accidentally in one's pocket. Not really worth the trouble of returning...just disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alia Beyer",
          "Nb_Reviews": 1,
          "Date": "2014-01-31T03:50:01.000Z",
          "Titre": "Great light, didn't get service on accessory.",
          "Contenu": "I really like my photon light. I think it is an awesome product. Unfortunately, I ended up with a crap hat clip and emailed the company to let them know. I was told a replacement was on the way and I haven't seen it arrive. I'm busy, so I haven't had time to revisit this ordeal, but I'm still hoping a solution can be found."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Mar",
          "Nb_Reviews": 2,
          "Date": "2012-08-08T00:27:51.000Z",
          "Titre": "Happy with the product but not the delivery",
          "Contenu": "Delivery was to the UK as this was a present for my dad. Freight was quoted but did not account for tax and handling at the UK end. My dad ended up having to pay to get his present! I would have thought that by using a reputable courier then these things would be avoidable.\rOtherwise, the item is very good quality and delivery was quick."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Mantz-Powers",
          "Nb_Reviews": 2,
          "Date": "2014-08-28T14:12:39.000Z",
          "Titre": "Mixed Review",
          "Contenu": "I recently purchased two Photon ll lights as gifts for friends.  The service was fast and efficient.   Of course the product was fantastic.\r However,  I lost the on/off switch on my light when I changed batteries.  I have sent the company two e-mails asking if I can buy a replacement switch.  Both times they sent a  notice that my messages have been received.   I have not had any further contact.  Luckily for me the light works without the switch.  I am disappointed in this part of their sevice."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Graham Pritchard",
          "Nb_Reviews": 6,
          "Date": "2013-02-11T13:42:44.000Z",
          "Titre": "Freedom Photonlight not half as good as Photonlight 11",
          "Contenu": "A great shame that the Photonlight \"Freedom\" doesn't match up to the Photonlight 2..\r It switched on and stayed on in my pocket unknown to me, because It must have been accidently pressed, and unlike the model 2 stays on when pressed until it's pressed again to switch it off..\rIt now fails to flash properly. Great shame as I have a number of Photon twos which are really good.\rSending the \"Freedom\" back means returning it to the US from the UK. with added postage ect.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Gallagher",
          "Nb_Reviews": 1,
          "Date": "2013-01-06T23:44:35.000Z",
          "Titre": "Timed Shut-Off of Light a Surprise",
          "Contenu": "Last night I used the PhotonLight on my key case to pack the trunk. To my surprise the light went off after a short period (30 sec.?). To keep the light constant I had to keep pressing on the switch.; or, use a constant \"press\"   Did I not read the Photon web site instructions correctly? My expectation was that once the switch is activated by pressing, the light remains on until the switch is pressed again and the light goes off.\rMy previous key chain light had a switch to keep the light on continously."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeanne D",
          "Nb_Reviews": 1,
          "Date": "2012-12-08T13:56:52.000Z",
          "Titre": "Great Photos, not so great price",
          "Contenu": "Love the photos but could only purchase one because the price was way too high!  Can't you come down a little - you'd probably get more folks to buy and want to buy more than one which might make them spend more anyway!  Just a thought.  Thanks for doing a great job!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Garrett Ings",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T08:07:59.000Z",
          "Titre": "I was pleased to get both photons",
          "Contenu": "I was pleased to get both photons. My only issue was the white one I got only stays on for about 10 seconds then turns off. I think I’ll just get the photon 2 next time since it has the switch to turn on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger Dery",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T19:50:14.000Z",
          "Titre": "Use their products-with they would respond!",
          "Contenu": "Love their products, BUT, they don't respond to emails, at least not yet. And, they also don't answer their phone either.Lucky for them, they have a product that does not require much people handling!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Forrest Patton",
          "Nb_Reviews": 1,
          "Date": "2012-10-09T02:53:10.000Z",
          "Titre": "Dog Collar light does not work.",
          "Contenu": "When the light shakes, it goes out. \rThree seconds after the dog starts running, the light quits.   Try it in you hand....shake it.  It will quit.\r The collar itself is excellent.   VERY high reflectivity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LongBeachCPA",
          "Nb_Reviews": 2,
          "Date": "2018-02-12T18:32:41.000Z",
          "Titre": "The reason I purchased the Photon Light …",
          "Contenu": "The reason I purchased the Photon Light \"clicker-type\" light, is because it can be turned on with a switch, by pulling it with your nail. The other cheaper ones, the switch did not work. Keeping the plate depressed to keep the light on, while hanging on to one's key chain, was ridiculous. Also, the cheaper ones either did not allow one to change the battery, or simply fell apart in a way which was not conducive to spending the time putting it together. (I have not tried changing the battery yet. So that test is forthcoming). Expensive, but maybe worth it. I have tried the tiny flashlight type key ring lights. But the twist to turn on - again a real pain when holding on to the keychain and the other hand is otherwise holding stuff."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ph311shy",
          "Nb_Reviews": 1,
          "Date": "2013-12-07T00:29:52.000Z",
          "Titre": "Product quality is good but did not meet standards listed on website.",
          "Contenu": "First, I want to explain that my rating is based not on my experience (as I purchased it online) but the product itself and it's description and specs listed on the website. This was the first time I had ordered from this company. I was looking for a small, battery powered infrared light emitter for use in seeing in the dark via infrared surveillance cameras After thoroughly reviewing the details of the product I purchased, I felt that this would meet my needs. The product I purchased just did not have the power to allow even the highest end surveillance cameras to see me or provide me with any usable light in the dark via surveillance cameras. I also liked the ability to clip or wear the light around my neck which this product included. In closing, I need a much more powerful infrared light emitter in order to meet my needs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marilyn L. Stearns",
          "Nb_Reviews": 1,
          "Date": "2013-05-29T19:27:40.000Z",
          "Titre": "Disappointed!",
          "Contenu": "The photo is cropped too close to the top--doesn't look good in a frame--not like it was on the proof--very disappointing!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "joe owens",
          "Nb_Reviews": 1,
          "Date": "2014-03-02T16:26:18.000Z",
          "Titre": "item backordered have yet to receive it",
          "Contenu": "ordered on feb 7, have not received the item yet, march 2"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Albee",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T23:00:52.000Z",
          "Titre": "New Batteries But None Charged, Some Required Break-in Cycling",
          "Contenu": "I've used PowerEx Batteries for about ten years, have a couple chargers, including a Wizard One  MH-C9000. All these purchases have been from Photon Light.The recent purchase, # 145123, was for a dozen AA's. According to your website, they are shipped fully charged. None of the batteries received had more than 20 mAh in them, half were between 8 and 13 mAh.I put them in the Wizard One, and charged them, without analyzing them. Five held less than the 2500 mAh minimum guaranteed capacity.Of the remaining, three were at/above the stated 2700 mAh capacity. The rest were between 2550 and 2622 mAh. Voltages of all were 1.41 to 1.45.The five under performers - the ones received with less than 2500 minimum mAh capacity - were put through one Break-in session, which brought their capacities up into the 2600's. The range was 2600 to 2631 available capacity. Voltages were 1.42, 1.42, 1.43, 1.43, 1.45.Like I wrote, my first purchase of these MaHa batteries from you was about ten years ago. Never before had an issue like this. IF I was a first time buyer, I would have returned these batteries to you for a refund, and never looked back. I'm concerned and disappointed, in part because I refer folks to you all the time.Because of my past good experience with your company, and this product, I decided to try to resolve the issue on my own, but I must say, I am disappointed. In the past, your batteries always started out with capacity beyond not just the minimum, but actually at or beyond the target capacity. Only three of the twelve batteries in this order met that expectation.Please look into this. Until I believe this quality control issue has been resolved, I can't continue to recommend others to you, and will be exploring other options - in case I feel the need to make a change."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Malathy Ravi",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T10:20:53.000Z",
          "Titre": "We did not receive the consignment…",
          "Contenu": "We did not receive the consignment .Kindly refund"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SL",
          "Nb_Reviews": 3,
          "Date": "2022-12-27T21:34:26.000Z",
          "Titre": "Legitimate company",
          "Contenu": "Legitimate company. You can order from this site with confidence. Sound customer service / responsiveness."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glenn Troester",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T19:25:57.000Z",
          "Titre": "Excellent product with a serious, but surmountable, weakness.",
          "Contenu": "My extended family (kids, grandkids, spouses, and my wife and I, have approximately 28-32 Photon X-light Micro units in service from Maine to Colorado. Our two great-grandkids will each receive two of them this Christmas. We have both clear and safety orange units. We tried other Photon models and don't like them. We are mostly very happy with these units. BUT: we use them heavily for all kinds of purposes, and we have discovered that no matter how precise and careful we are, by the time you change the battery five times, the clip that holds it together, breaks and the two halves can no longer be joined.  Also, the \"bridge\" on which the ring is mounted, also breaks easily. Photon claims the lights have a lifetime warranty, but methinks that if they get a lot of returns from our family members, they will find a loophole in this warranty.  So I have designed a cheap and effective work-around that uses narrow strips of super-reinforced tape, and short pieces of stainless wire, to overcome the materials and design flaws. A number of these units have been in service in backcounty, combat, and city areas for many years, and we use so many of them we have found a source of batteries that costs ~$8 for a pack of 20 cells.  I installed new cells in two units this morning, and that reminded me to write this review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T20:50:45.000Z",
          "Titre": "Good lights",
          "Contenu": "I ordered 15 lights, so clearly I am a fan of the product.  There is no model that would fit my needs exactly (waterproof, constant on switch as well as press for momentary light, easy battery change, and a shroud to protect the bulb.  This is more a criticism of the available models, than the lights themselves.  If PhotonLight makes a model that you want, you can buy with confidence."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miles",
          "Nb_Reviews": 2,
          "Date": "2021-01-01T17:10:07.000Z",
          "Titre": "Order was delayed initially",
          "Contenu": "Order was delayed initially, owner called me personally to update me on the status. Delivered quickly. Overall, happy with my experience here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rronne",
          "Nb_Reviews": 1,
          "Date": "2020-08-09T17:21:26.000Z",
          "Titre": "I was able to get my order quickly",
          "Contenu": "I was able to get my order quickly, but was not able to pick up at the store, so had to make special arrangements, which they did, and I was still able to get on the same day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob G",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T22:57:20.000Z",
          "Titre": "Quality keychain flashlights",
          "Contenu": "Pleased with the flashlights. A solid company that truly seems to care about its products and customer satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan S.",
          "Nb_Reviews": 2,
          "Date": "2020-10-16T18:53:58.000Z",
          "Titre": "Good service and products.",
          "Contenu": "Good service! Had a slight order glitch but promptly corrected. Batteries I ordered are best price around."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Shawn Mulock",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T17:52:24.000Z",
          "Titre": "The service was great",
          "Contenu": "The service was great. The prices were good and the shipping was not cheap. I'm aware that there's nothing you can do about it,  it still stung!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Elbow",
          "Nb_Reviews": 4,
          "Date": "2021-03-01T19:50:35.000Z",
          "Titre": "The keychain lights are very useful and…",
          "Contenu": "The keychain lights are very useful and the batteries last well. `"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Bartholomew",
          "Nb_Reviews": 2,
          "Date": "2019-11-19T05:34:42.000Z",
          "Titre": "I like the Pro II",
          "Contenu": "I like the Pro II.  It is bright, and it is very small, which is good.  One thing I discovered, tho, is that when I turn it on, it automatically turns off after 14 seconds.  So, then I turn it on again, and after 14 seconds it turns off again.  I'm not the kind of person who will go to the post office to return items.  So, I will live with this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Moran",
          "Nb_Reviews": 7,
          "Date": "2019-10-22T01:55:56.000Z",
          "Titre": "Had the red Photon Freedom for a long…",
          "Contenu": "Had the red Photon Freedom for a long time now, over 5 years. It is very efficient on batteries. So, I decided to get the white and UV just for fun. I really like the size, the clip works great at all angles, and the dimming ability makes it easy to use without bothering others nearby. Well made, durable, battery efficient lights."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Ernesto Lozano",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T19:19:27.000Z",
          "Titre": "All ok!!",
          "Contenu": "All ok! the shiping was correct"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "minna rivera",
          "Nb_Reviews": 1,
          "Date": "2017-12-21T10:35:26.000Z",
          "Titre": "Handy to have",
          "Contenu": "I bought the photon light for my husband he had one a while back and lost it but he loved that light but never knew the name of it. So I searched and when I found it he was so happy I bought three ( 3 ) it shines brighter then any flashlight, I love that it glows in the dark so it’s easy to find in your purse when trying to get in the house at night. This light is just handy to have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stuart Carlson",
          "Nb_Reviews": 1,
          "Date": "2017-12-28T02:47:26.000Z",
          "Titre": "This Ohoton light  is several grades  …",
          "Contenu": "This Ohoton light  is several grades  better than one I bought nearly 20 years ago, and it was the best, most savvy light of it's kind; no batteries to replace, either!  I gave one to my 3 kidsThe new Photon is ultra bight - and that's great; the cost of replacing the two batteries adds an operating cost, why I rate this light 4 stars. The direction the Photon folks is wonderful, and if the old version would be  back on sale, I'd be grateful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Captain Ethan Lee",
          "Nb_Reviews": 1,
          "Date": "2018-05-29T12:07:09.000Z",
          "Titre": "Reliable work lights in a commercial environment.",
          "Contenu": "Great products, best in the market for over ten years now. As a superyacht Captain I rely on many different types of work lights and these are the best. Shipping could be faster, I placed an order and got a verification phone call a few days later. That's the only constructive critism I can say, the product is outstanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Pilot",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T03:51:27.000Z",
          "Titre": "4 Stars only to allow for testing",
          "Contenu": "Only 4 stars because I’m not sure of battery life. Will be testing in the upcoming months (cold months) to see what happens. Light is excellent and bright. Very well suited and better for viewing my airplane cockpit at night than a headband light. So much lighter on my headset than a 3 AAA battery powered headlamp."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Ernest Solomon",
          "Nb_Reviews": 2,
          "Date": "2014-11-03T19:24:13.000Z",
          "Titre": "High quality professional merchandise",
          "Contenu": "As I wrote I am very pleased with your high quality products. The internet order machine is very poor and it is not friendly with the customer !\rAs a foreign customer I think that the shipping fees are high and I have to wait 3 weeks to receive the order.\rIn spite my last flashlight bought 9 years ago broke down I will continue to buy your products and I am an 85% satisfied customer which is quite OK"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FDRMaine",
          "Nb_Reviews": 2,
          "Date": "2014-01-09T19:39:15.000Z",
          "Titre": "Good quality products from my experience so far.",
          "Contenu": "My most recent purchases from them were some keychain LED lights. Their brand is one of the highest quality lights I could find and had great features including good durability, protection for the LED light bulb itself, easy replacement of the battery, and the ability to vary the light intensity, and even change to some other electronic flashing modes which could come in handy in certain situations."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Daniel Martinez",
          "Nb_Reviews": 1,
          "Date": "2012-05-24T03:10:12.000Z",
          "Titre": "Good in two weeks.",
          "Contenu": "Hi I got my purchase from the website. It took 2 weeks to arrive\rin Toronto. Sorry I can't give you good or bad input because I have use only my charger once.. I would love to give an exellent info I would say in 3 months.  I can tell you it was very well packed and I'm happy for it that means that you care for the customer items.\r regards,\rDaniel Martinez\rToronto Canada"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Beaule",
          "Nb_Reviews": 1,
          "Date": "2018-11-12T01:17:43.000Z",
          "Titre": "Works great for night reading if you’re…",
          "Contenu": "Works great for night reading if you’re trying to save your night vision. Very bright, it would work well as a marker light walking at night, I use mine with the lanyard. I may purchase a green one as well. Mine has the push on/push off button. It’s worth five stars but who reads five star reviews?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy (Wyoming)",
          "Nb_Reviews": 1,
          "Date": "2014-12-22T19:11:41.000Z",
          "Titre": "small flashlights",
          "Contenu": "My son-in-law is crazy about small flashlights, he has one in every room in their home.  I do not believe he has one of yours yet.  He will get it for Christmas and I am sure he will be delighted.\rAs far as my ordering your products:  Your internet store makes it easy to find the product you are looking for, your prices are just a touch high, I received my purchase in a fair amount of time.  Very pleased with your company and will be back in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2015-01-06T20:13:18.000Z",
          "Titre": "Good service, great products",
          "Contenu": "I've used Photon Microlights for a very longtime. Very useful in many situations and offered in a very wide variety of options. Order was processed, shipped, and received in just a few days by standard shipping (USPS). By the way, that was just a handful of days before Christmas. I was impressed since it went clear across the US!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick B",
          "Nb_Reviews": 1,
          "Date": "2013-11-17T02:14:54.000Z",
          "Titre": "Awesome product when used with fresh batteries.",
          "Contenu": "I bought the \"Freedom\" and UV microlights. I probably should have ordered the \"Freedom\" with the covert attachment, because it is bright! The UV microlight is fun to play with, especially around fluorescent minerals, but the batteries died after only a couple minutes of infrequent usage (being careful about the UV wavelength). After I bought new batteries ($6) it started working again...we'll see how long. There might be a short in the circuitry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vance Ap",
          "Nb_Reviews": 3,
          "Date": "2011-12-20T16:36:09.000Z",
          "Titre": "Fantastic service, great products!",
          "Contenu": "I have given Photon lights away as gifts for years. Always happy with the product and the service provided by PhotonLight.com.\r Everyone could use a small light on their keychain, or children can use it as a zipper pull on a coat or backpack. Remember the blackout New York went through? People stuck on the subway underground, with no light?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyrone Walker",
          "Nb_Reviews": 7,
          "Date": "2018-05-25T17:06:18.000Z",
          "Titre": "Photonlight is a great place to shop, but.",
          "Contenu": "Photonlight is a great place to shop, a good spectrum of items. The problem is that most of the items are rather dated. The technologies in these items seems go back to the 90s or is out of production by the companies. Great customer support and they work quickly to solve product issues."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Arun",
          "Nb_Reviews": 2,
          "Date": "2011-09-28T20:12:59.000Z",
          "Titre": "Basically good product, stand behind their guarantee",
          "Contenu": "I have ordered many products from PhotonLight.  Service is fast and reliable. The products are very good and when there have been problems as with the rechargeable lights they have made good their guarantee to replace. The website has at times been a little difficult to use. On my last order of five on sale products, three of the  five light packages were empty when delivered. All in all I keep buying products from PhotonLight as I am attracted to their special offers and sales."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 3,
          "Date": "2013-12-20T21:55:22.000Z",
          "Titre": "Great Light But...",
          "Contenu": "This light has great illumination, but shuts off by itself after only a few seconds.\rI wish there was a way to keep it on without having to keep pressing the button over and over. Very frustrating.\rMaybe I bought the wrong  model?\r My first photon light lasted 12 years, so they are definitely made well!"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Babi",
          "Nb_Reviews": 1,
          "Date": "2015-07-14T05:37:19.099Z",
          "Titre": "Photon light",
          "Contenu": "Hi,\rLove this product, had it before and it was stolen with my backpack, took me a while to order a new one, and by mistake i only ordered 1 and not 2, plan to order another white in the future.\r For the product it self, i like better when you had the 2 options - press and hold to look for something for a brief few seconds, and 2nd option (with a push button), for fixed light.\r Also, I hope you will take it the right way, shipping price to Israel with USPS is a bit expensive, half the price of the product.\r Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pastor Michael Shortsleeves",
          "Nb_Reviews": 1,
          "Date": "2017-03-04T21:43:50.000Z",
          "Titre": "Better than expected.",
          "Contenu": "I only wanted a small light to help me lock up the church after evening service. It turns out I can see the whole parking lot with this little thing. Hoping the battery lasts. I was encouraged when I saw the little phillips screws on the back for replacing the battery.Thanks for this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evereddie",
          "Nb_Reviews": 1,
          "Date": "2014-05-15T03:34:00.000Z",
          "Titre": "You don't make the best key-chain flashlight anymore.",
          "Contenu": "At one time you sold the best key-chain flashlight. Rechargeable, dim-able, 4 LEDs in it,  the best. Now all I could find is one that is dim-able but only a single led and you have to put in a new battery when it runs down. It's good but  not the best like the other one.  Wish it would come back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2018-12-18T07:04:58.000Z",
          "Titre": "Good service, good product, good selection, will return",
          "Contenu": "Good vendor - communicates in an acceptably timely manner, makes helpful, thoughtful, and concise recommendations, shipped and arrived exactly on time. The  product is slightly pricey for what it is. I question whether all the components are actually made in the U.S.. If they are, I’m ok with paying a few dollars more for the vendor’s good customer service. Look for holiday sales and bargains when to buy. He has a pretty useful Youtube channel to check out in case you didn’t know. The black anodized finish on the quick release key ring wore off in a matter of days with normal use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Stuart",
          "Nb_Reviews": 1,
          "Date": "2014-03-16T21:53:58.000Z",
          "Titre": "But 4 a red star",
          "Contenu": "These lights are perfect; low battery draw and bright.  Ive had three of these for a few years and recently returned an old red light for repair after I damaged it replacing the battery.  I bought an additional one at the same time.  Imagine my delight when two new ones came; not repairing my damaged red lamp but instead replacing it. With a new light.\rWhy only four stars after this stellar performance?  I didn't get my red light back but instead another white light.  How can one complain after such good care, still I miss my red lamp."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer Bert",
          "Nb_Reviews": 1,
          "Date": "2013-12-26T20:42:03.000Z",
          "Titre": "Good, but not great",
          "Contenu": "After a few purchases of their products over the years, I am pleased with the items, however in trying to get a replacement cap replaced for my pro flashlight twice I have been unsuccessful. I'm not sure how committed Photon Light is to after sale support of their products.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Horchoff",
          "Nb_Reviews": 1,
          "Date": "2012-09-25T00:53:01.000Z",
          "Titre": "Quick to Fix",
          "Contenu": "I ordered 2 Photon Freedom Fusion lights and a bike mount. When I recieved the delivery it had only one light and a bike mount. I e-mailed them about the discrepency and they immeadiatly shipped out the second light - no charge. I am very happy with the lights and their service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CustomerEd",
          "Nb_Reviews": 1,
          "Date": "2012-10-18T00:21:54.000Z",
          "Titre": "Great little flashlight!",
          "Contenu": "Im happy with my photon key light so far and it doesn't take much space and I don't feel it when my keys are in my pants. Im surprised the little thing is so bright too! But it's to soon to recommend this company to anyone yet so I give it a 4 star for now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rowe M.",
          "Nb_Reviews": 1,
          "Date": "2013-01-02T07:07:27.000Z",
          "Titre": "Great experience!",
          "Contenu": "My order arrived in less than a week! And I like my flashlight mount. It's kind loose no matter how tight you wrapped it in but I added some rubber tape to it so it won't slide. Overall, it's a great purchase experience with PhotonLight. Thank you so much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan S.",
          "Nb_Reviews": 2,
          "Date": "2019-09-22T06:23:50.000Z",
          "Titre": "Very useful light.",
          "Contenu": "The Photon microlight is an excellent product and I have given a number to friends and family members. I do prefer the simpler “squeeze only” model over the sometimes less robust on/off switch versions. Service has also been reliable."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Fernand Ridel - France.",
          "Nb_Reviews": 4,
          "Date": "2014-11-06T19:17:02.000Z",
          "Titre": "WOW, that's fine !",
          "Contenu": "Hi, that item is really nice, strong and useful. I am an old customer of Photon light. However, I miss more explanation about how to change the power of the led,. Between low and strong ? I did not find a notice.  Is there an adjustment  to make, where and how ? The strobe application is a little bit difficult to obtain... I must push three times and make several tries before obtain this function. Another surprise : I did receive an American plug but I live in France.  Plugs are different. It's a pity, because it was a beautiful self compact set. But it works and I trust it. Thank you Photon light."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Gibson",
          "Nb_Reviews": 1,
          "Date": "2012-12-05T03:21:14.000Z",
          "Titre": "A great keychain light you will always have",
          "Contenu": "A great keychain light that you will always have with you. A little pricy, I think, but over the peroid of several years have bought about 7, giving several as gifts. One malfunctioned after a couple of years, but it was replaced under warranty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PaulLcn",
          "Nb_Reviews": 1,
          "Date": "2014-11-12T02:25:23.000Z",
          "Titre": "Buy their products",
          "Contenu": "I wanted a small red LED flashlight.  I initially used a Brookstone light, but could not find the same one online or in a store.  PhotonLight not only offered exactly what I wanted, but offered multiple LED colors and several models of the tiny flashlight.  All I had to do was pick the LED color and the model that suited my needs and the choice was clear.  No other company out there offered a similar product.  The price was very reasonable and the item shipped and arrived in a timely manner.  The LED is very bright and the construction is solid.  No complaints here.  I don't rate any company 5-5 stars, so don't be fooled by 4-5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott King",
          "Nb_Reviews": 1,
          "Date": "2012-07-28T00:25:24.000Z",
          "Titre": "Good product delivered fast.",
          "Contenu": "Product was exactly as discribed.  Use it everyday and would recommend it to others.  All Photon products I have purchased have met my expectations for value per dollar and rugged.  I would like to see them all Made In The USA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RW",
          "Nb_Reviews": 2,
          "Date": "2015-06-30T01:27:40.947Z",
          "Titre": "1st Purchase",
          "Contenu": "I usually shop online via Amazon. I decided to try a purchase via PhotonLight because of so many fraudulent & counterfeit vendors on Amazon (so many indicate that what they offer are OEM products, totally fraud!)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer Michael",
          "Nb_Reviews": 2,
          "Date": "2014-01-11T04:51:38.000Z",
          "Titre": "Great bright lights",
          "Contenu": "Good products I've been buying micro lights for years .Then I did a search on Web and found out other people are selling same products for a lot cheaper. Do a Web search first before you buy from protonlight.com."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2015-09-21T10:02:21.148Z",
          "Titre": "Good product, questionable warranty",
          "Contenu": "The photon light is a good keychain flashlight, however when the light fails, the lifetime replacement policy is not practical as the returm postage can be a significant percentage of just buying a new flashlight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyrone Walker",
          "Nb_Reviews": 7,
          "Date": "2017-06-08T22:55:52.000Z",
          "Titre": "So far , so good.",
          "Contenu": "So far all my purchases have great, that is until my Fusion headlamp  failed. The headlamp  is fairly week compared to name brand units. For some thing driven by 3 AA cells, it should have more output."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Adames",
          "Nb_Reviews": 1,
          "Date": "2016-12-02T09:42:41.000Z",
          "Titre": "Keychain flashlights",
          "Contenu": "I really like these tiny flashlights. They are super bright, small and lightweight. The only problem is that I find it very difficult to change batteries. I have a photon freedom and a  X-light micro. The X-light micro is a bit easier to change but I eventually break the piece that snaps the lid to the body. The freedom is just ridiculously hard to open the lid. I thought it was just me. But a few of my handy friends had the same problem. I've watched the how-to video on line, and it looks super easy. I guess it's the tool he's using. I'm usually pretty good at doing things like this. I really think they should do a slight redesign to make this a little easier, and/or less likely to be broken out of excessive use of force."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RW",
          "Nb_Reviews": 2,
          "Date": "2017-10-24T02:33:49.000Z",
          "Titre": "Everything was received in good order",
          "Contenu": "Everything was received in good order; free shipping was super fast (usually this is uncharacteristic from vendors when this is part of an offer). Will buy again, and again, and again.BWind"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Customer Light & Pyro Ltd",
          "Nb_Reviews": 1,
          "Date": "2013-05-10T07:45:25.000Z",
          "Titre": "Awesome product",
          "Contenu": "We are very pleased with our purchase, the Micro Lights are bright & robust\rWe are pyrotechnicians and need reliable lights\rThese seem to be standing up to the environment we use them in"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2015-01-02T01:20:56.000Z",
          "Titre": "as of Jan 1st, 2015, I have not received the shipment.",
          "Contenu": "I have not received the shipment.\rPost office records show it was delivered to my apartment complex office on December 06 at 2:07 PM, but the shipment has \"disappeared\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert  Catriz",
          "Nb_Reviews": 3,
          "Date": "2018-02-04T00:06:22.000Z",
          "Titre": "Product very good",
          "Contenu": "Product very good. Customer service good. I ordered 2 same items. Received 1 incorrect item. Return and replace item service very good. Customer service personnel excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Sorkin",
          "Nb_Reviews": 1,
          "Date": "2012-12-31T03:22:17.000Z",
          "Titre": "Excellent products and service.",
          "Contenu": "I had ordered from photon about 10 years ago and was pleased \rRecent order was because the batteries finally died.\rThe new models function well and have useful new features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyrone Walker",
          "Nb_Reviews": 7,
          "Date": "2017-06-23T23:49:26.000Z",
          "Titre": "Great cells, but.",
          "Contenu": "These are working out just fine, but I've got a charger optimized for them. On another note, that Photon Fusion headlamp needs to be brought into the 21st century."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 6,
          "Date": "2013-11-02T21:09:04.000Z",
          "Titre": "New Style PhotonLight Works Well",
          "Contenu": "New style with glowing button looks good and works well.  My only concern is that the switch is not momentary contact, so I could turn it on and leave it on in my pocket."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete Ryder",
          "Nb_Reviews": 1,
          "Date": "2012-10-13T18:00:29.000Z",
          "Titre": "I've had this nice little gadget for years.",
          "Contenu": "The only reason I bought a new one is that it was getting dim after some years of service and I didn't realize the battery was replaceable.  Now I happily have two."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Robert E. Coates",
          "Nb_Reviews": 2,
          "Date": "2017-01-15T19:06:23.000Z",
          "Titre": "Questionable Internals/Battery Cap Issues!",
          "Contenu": "Customer Service and Shipping was Very Good! The product itself is Very Bright and appears Outwardly Sturdy! However, in saying that, my teenage son took the battery cover off and the copper wire that holds the batteries, had snapped off its posts! Internally, it appeared to be the weak link? I don't know if it was a solder failure (although I didn't see any evidence of solder?) or is this copper wire a one piece wire that just snapped off its posts?In any event, I rigged it up to work (Mcgyver style), but trying to snap the cap back on was an exercise in patience, let me tell you! I tried everything under the sun and then my son tried it again and success was attained!So those are my two beefs: a) faulty internals,and b) finicky battery cap! Maybe we got a Monday or a Friday built light? Other than those two issues, I would have rated it 5 Stars!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Judith",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T16:50:20.000Z",
          "Titre": "Watch out for the customs tax.",
          "Contenu": "Great product...  however I was disappointed to find I had to pay a customs tax. Maybe I missed it in the small print. The product itself is awesome."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Sebastien",
          "Nb_Reviews": 1,
          "Date": "2012-08-09T09:30:47.000Z",
          "Titre": "Good",
          "Contenu": "The deal was smooth, the shipping was fast and the product is perfect.  However, the communication was poor.  \rJust a mail to confirm the shipment should be nice."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Barry",
          "Nb_Reviews": 3,
          "Date": "2014-12-23T23:33:31.000Z",
          "Titre": "Photon lights",
          "Contenu": "They perform as expected - I've been buying them for the last 6 years as gifts- they are always a hit.\r Not much to say - it just works."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Ian Webster",
          "Nb_Reviews": 1,
          "Date": "2018-08-27T19:45:49.000Z",
          "Titre": "my order was filled quickly",
          "Contenu": "my order was filled quickly, but living in Colombia where there is no post office, device took a little longer than expected.No problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Donald",
          "Nb_Reviews": 3,
          "Date": "2017-11-21T13:30:14.000Z",
          "Titre": "I have never had any problems or complaints.",
          "Contenu": "I have never had any problems ordering or navigating the site. Products I have bought are all worth the price,which has been reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Echevarria",
          "Nb_Reviews": 1,
          "Date": "2013-06-09T03:01:26.000Z",
          "Titre": "Small but efficient",
          "Contenu": "We were looking for a small device with broad range UV light. Liked the option to add our logo if needed, though it may be too small."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Wright",
          "Nb_Reviews": 1,
          "Date": "2016-09-21T21:04:06.000Z",
          "Titre": "Good customer service.",
          "Contenu": "PhotonLight was very proactive in resolving my problem with my recent order.I am quite satisfied with their service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "darrell fish",
          "Nb_Reviews": 3,
          "Date": "2018-08-14T01:59:15.000Z",
          "Titre": "Smooth ordering",
          "Contenu": "Smooth ordering, I would like to pay a little less for a basic lite.BUT lite is bright and reliable.TX Darrell"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "victor smith",
          "Nb_Reviews": 1,
          "Date": "2018-06-21T19:29:07.000Z",
          "Titre": "I Always use these brightest,best",
          "Contenu": "I Always use these brightest,best, keeps me coming back baby!  Only thing I would love a waterproof  version ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick J Fowler",
          "Nb_Reviews": 4,
          "Date": "2017-05-09T21:00:15.000Z",
          "Titre": "Thought I was getting some photons",
          "Contenu": "Thought I was getting some photons, but was just batteries, but as that is what I ordered, then all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2013-02-22T05:10:48.000Z",
          "Titre": "good light",
          "Contenu": "I have large hands so if a  light were available in a larger size i would have gone for it right away!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MANUEL ZERMENO",
          "Nb_Reviews": 2,
          "Date": "2018-08-21T17:33:53.000Z",
          "Titre": "Everything was great.",
          "Contenu": "Everything was great.Yhe only complaint I have is that shipping charges are too  expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EQ",
          "Nb_Reviews": 1,
          "Date": "2017-01-21T00:28:21.000Z",
          "Titre": "Photon micro",
          "Contenu": "Nice lights..expensive, but if they work as advertised they will be well worth it."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Daan Kooyman",
          "Nb_Reviews": 7,
          "Date": "2016-08-14T19:45:54.992Z",
          "Titre": "Great product / expensive shipping",
          "Contenu": "I love these little lights, only problem is the very expensive shipping to Europe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carrie Hawley",
          "Nb_Reviews": 7,
          "Date": "2014-12-15T16:21:13.000Z",
          "Titre": "Bright Light Little Package",
          "Contenu": "Awesome product and fast shipping. Will definitely order from this company again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Suarez",
          "Nb_Reviews": 1,
          "Date": "2018-01-02T06:19:37.000Z",
          "Titre": "Love the lights",
          "Contenu": "Love the lights! Can ypu please bring back the Rav-n rainbow photon lights?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CustomerNICK  CNOSSEN",
          "Nb_Reviews": 1,
          "Date": "2013-02-28T21:14:33.000Z",
          "Titre": "a  great  company staff very helpfull  this light works awesome",
          "Contenu": "recommend this  light to my hiking friends   led lenser the best cheers NICK"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Russell Thomas",
          "Nb_Reviews": 2,
          "Date": "2016-09-05T02:34:15.000Z",
          "Titre": "Awesome little lights",
          "Contenu": "Great little lights. Great service. Was delivered within a short time!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SachsCustomer",
          "Nb_Reviews": 1,
          "Date": "2015-05-07T03:56:01.000Z",
          "Titre": "Great company",
          "Contenu": "They put together a custom order for me,extraordinary customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Donald",
          "Nb_Reviews": 3,
          "Date": "2016-05-26T13:34:12.000Z",
          "Titre": "Light ON!",
          "Contenu": "Great products,quick delivery and works great.No bad words only good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Denton",
          "Nb_Reviews": 2,
          "Date": "2014-12-30T07:16:18.000Z",
          "Titre": "I received what I ordered when promised as requested.",
          "Contenu": "It was a good experience. I will use PhotonLight again..... probably"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bill",
          "Nb_Reviews": 2,
          "Date": "2018-12-11T23:30:07.000Z",
          "Titre": "GREAT LITTLE LIGHT FOR ALL YOUR CAR…",
          "Contenu": "GREAT LITTLE LIGHT FOR ALL YOUR CAR KEYS.SUPER BRIGHT AND HANDY."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jeremy Grose",
          "Nb_Reviews": 1,
          "Date": "2018-10-30T05:44:51.000Z",
          "Titre": "Good products and delivered to…",
          "Contenu": "Good products and delivered to Australia in a reasonable time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KSKP",
          "Nb_Reviews": 3,
          "Date": "2019-05-24T00:15:01.000Z",
          "Titre": "Good eCommerece experience.",
          "Contenu": "Good eCommerce experience, a fairly standard transaction."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Jack Lang",
          "Nb_Reviews": 2,
          "Date": "2019-01-01T12:56:25.000Z",
          "Titre": "Everything fine",
          "Contenu": "Great products as usual, very good service, fast shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2017-12-14T21:35:43.000Z",
          "Titre": "Good products",
          "Contenu": "Good products. Easy ordering. Delivered quickly. Nice job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer Michael Meacham",
          "Nb_Reviews": 1,
          "Date": "2012-10-15T00:13:35.000Z",
          "Titre": "bright light but does not stay on.",
          "Contenu": "What good is a light if it keeps turning off every 5 seconds"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edwin",
          "Nb_Reviews": 1,
          "Date": "2017-07-04T03:33:23.000Z",
          "Titre": "It does what it's supposed to",
          "Contenu": "It does what it's supposed to. No problems so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R. L. Lehmann",
          "Nb_Reviews": 1,
          "Date": "2012-07-24T21:58:05.000Z",
          "Titre": "Good deal",
          "Contenu": "Got the shipment on time and they work well.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Howard",
          "Nb_Reviews": 1,
          "Date": "2016-09-17T19:43:30.000Z",
          "Titre": "All good",
          "Contenu": "Happy with product and amount of time to get here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Boren",
          "Nb_Reviews": 1,
          "Date": "2016-10-12T01:25:38.000Z",
          "Titre": "Great product",
          "Contenu": "Great product excellent features  a bit pricey"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean Dick",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T23:13:19.000Z",
          "Titre": "very good product worth the money i paid"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "yK",
          "Nb_Reviews": 2,
          "Date": "2017-12-20T17:08:30.000Z",
          "Titre": "It worked out really well",
          "Contenu": "It worked out really well. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2013-11-28T21:35:07.000Z",
          "Titre": "Wow!",
          "Contenu": "Fantastic products and a great value!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nick",
          "Nb_Reviews": 2,
          "Date": "2019-07-27T17:58:13.000Z",
          "Titre": "nice unit",
          "Contenu": "nice unit , could be brighter"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cameron Dailey",
          "Nb_Reviews": 1,
          "Date": "2016-12-12T09:04:57.000Z",
          "Titre": "Great light",
          "Contenu": "Favorite headlamp in my arsenal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Klypchak",
          "Nb_Reviews": 4,
          "Date": "2016-07-04T22:21:43.000Z",
          "Titre": "HAPPY WITH THIS",
          "Contenu": "HAPPY WITH THE THING I BOUGFHT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyrone Walker",
          "Nb_Reviews": 7,
          "Date": "2017-09-21T01:31:22.000Z",
          "Titre": "Unit function as specified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Griffen",
          "Nb_Reviews": 1,
          "Date": "2016-07-25T19:02:32.000Z",
          "Titre": "Batteries",
          "Contenu": "Will buy from seller again"
        },
        {
          "Note": 4,
          "Lieu": "MM",
          "Pseudo": "Jennuary Su",
          "Nb_Reviews": 1,
          "Date": "2019-12-29T08:24:29.000Z",
          "Titre": "This seem good"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Thomas Hauser",
          "Nb_Reviews": 6,
          "Date": "2013-10-13T19:14:54.000Z",
          "Titre": "Reliable",
          "Contenu": "Fully satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "davies",
          "Nb_Reviews": 3,
          "Date": "2013-03-17T21:19:44.000Z",
          "Titre": "certainly",
          "Contenu": "awesome tool"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALROY OLIVER",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T19:15:26.000Z",
          "Titre": "Quick service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Keller",
          "Nb_Reviews": 7,
          "Date": "2023-04-24T22:03:17.000Z",
          "Titre": "Quick fast service/shipping",
          "Contenu": "Quick fast service/shipping. Website easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Viceroy",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T04:01:28.000Z",
          "Titre": "A Must Have Accessory",
          "Contenu": "Been replacing this light for 1-2 decades as the batteries die. Tried several colors, but the bright white is the most useful and longest lasting. It's literally saved my life when hiking along cliffs. The stay on button is essential for hands free in certain situations. Fast shipping. A must have accessory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 4,
          "Date": "2023-04-11T22:09:49.000Z",
          "Titre": "The Best in Toys and Tools",
          "Contenu": "A super organization...and customer service second to none. The best in gear quality too. JWC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-04-18T19:59:43.000Z",
          "Titre": "Fast response",
          "Contenu": "Fast responseDevice worked perfectly.No issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Morgan",
          "Nb_Reviews": 4,
          "Date": "2022-12-31T00:32:05.000Z",
          "Titre": "Excellent products, excellent servic",
          "Contenu": "Excellent products, the Freedom logic is without compare.  My favorite keychain light, but 15 years ago in 2007 I took it off my keychain and have been wearing it as a pendant ever since.  Excellent turn around time, ordered several lights and they shipped the next day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sanford shiff",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T16:26:29.000Z",
          "Titre": "The quick snap on clip is a smart…",
          "Contenu": "The quick snap on clip is a smart improvement. These were gifts and already have helped when trying to use keys to open doors after sunset and no.porch.light on. Especially when elderly have troubles with night vision"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Enestvedt",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T16:48:50.000Z",
          "Titre": "Excellent post-sale follow-up",
          "Contenu": "There was a problem with my new light, and we discussed it via email. Then they sent me a box -- with a pre-paid label inside -- containing an advance replacement part, and I mailed back the one that didn't work.No run-around, no hassle, just great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T01:49:20.000Z",
          "Titre": "Photon light.com is a stellar company…",
          "Contenu": "Photon light.com is a stellar company and have been so since I discovered them waaaaaay back in 1999!  I've reviewed many of their lighting products since then, so I dived in with no hesitation whatsoever when I found out that they were making a new and (vastly) improved Microlight 1 UV (ultraviolet) keychain photonic tool (I hesitate to call it a, \"light\" because that isn't it's primary function).Let's suffice it to say that they've got (yet) another winner on their hands!!! 🤘"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "annoyed by surveys",
          "Nb_Reviews": 4,
          "Date": "2020-10-13T23:03:07.000Z",
          "Titre": "photon lights are great for what they…",
          "Contenu": "photon lights are great for what they are. if you want a small keychain-sized light then this is probably what you're looking for. they also keeping nagging you with emails to review their products. they should at least send you some free stickers or something--definitely have not been offered any incentive or payment to leave a review for this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Jantzen",
          "Nb_Reviews": 2,
          "Date": "2020-11-26T00:49:22.000Z",
          "Titre": "I am a decades long continuing customer…",
          "Contenu": "I am a decades long continuing customer buying keychain lights for myself and friends and relatives who did not know they needed these gadgets until they were gifted to them. I usually order in bulk during sales, but this time forgot to add the code. Mr PhotonLight himself saw to my refund for the discount. What service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHARLES L JACKSON",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T02:39:04.000Z",
          "Titre": "Prompt service and great lights",
          "Contenu": "Prompt service and great lights.  I have three Proton PLUS flashlights and over the years I have bought over a dozen Micro Lights for my use and for family.  Highly recommend that you offer a wider selection of rechargeable lights."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Tice",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T18:24:19.000Z",
          "Titre": "This company was very helpful with…",
          "Contenu": "This company was very helpful with correcting my order. They did not have all of the items I requested but made extra efforts to get them for me rather than cancelling that part of my reorder. Their products are excellent quality, they work very well and are extremely useful and easy to carry too. They even make great zipper pulls! I love them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurence C.",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T01:07:04.000Z",
          "Titre": "Great product",
          "Contenu": "Great product!  I bought two different models, the original and the next gen model with the on- off switch, both with the same white LED light.  Much preferred the one with the on-off switch.  Keeping the light on for more than 10 seconds was much easier (for me) with the model having the on-off switch rather than trying to hold the button engaged.  They performed as advertised and would definitely recommend them. Make great stocking stuffers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Faith Supple",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T16:43:40.000Z",
          "Titre": "The best little light you can buy!",
          "Contenu": "Not only do I love these excellent, multiple use lights -always have had one on my keychain for years - but the customer service is beyond expectations!  They live up to the lifetime warranty without question.  AND MADE IN AMERICA!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald R.",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T02:41:09.000Z",
          "Titre": "A well organized experience",
          "Contenu": "Couldn't have been easier. Found just what I needed. Was kept 8nformwd all the way from the initial order through delivery. Would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lintz",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T17:57:28.000Z",
          "Titre": "By far best small",
          "Contenu": "By far best small - mini flashlight.  I like the covert led bulb cover on my various freedom micro lights.  Very good turn-around time on placing order to delivery at house.  Keep up the good work, everyone!Sincerely,                David A. Lintz"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Richardson:",
          "Nb_Reviews": 5,
          "Date": "2023-01-02T19:07:46.000Z",
          "Titre": "Photon lights are fantastic",
          "Contenu": "Photon lights are fantastic.  Bought the entire family some for Christmas.  They are durable and bright enough.  And batteries are easy replaceable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Nute",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T23:19:51.000Z",
          "Titre": "Everything as advertised.",
          "Contenu": "All items were received as promised and performed as advertised.  One supply problem was resolved in my favor without any effort on my part.  Can't do better than that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orson Scott Card",
          "Nb_Reviews": 10,
          "Date": "2020-12-14T21:57:15.000Z",
          "Titre": "Total Reliability and Prompt Response",
          "Contenu": "Everything I've bought from PhotonLight.com has been of the highest quality.  What I order most often are the keychain flashlights: They're amazingly bright and convenient to use everywhere I go.  I have added one to every set of keys in the house, so that we're never caught without a reliable light.Their response time and packaging are very good, so that when I need anything from them, it comes only a little after I ordered it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2021-06-23T15:46:50.000Z",
          "Titre": "Fantastic, Reliable, and Rugged Lighting!",
          "Contenu": "I have used, enjoyed and appreciated these little rugged keychain lights for years now.  They are totally reliable and provide perfect light whenever needed.  I can't recommend them enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theron Burrough",
          "Nb_Reviews": 3,
          "Date": "2021-12-30T21:37:22.000Z",
          "Titre": "PhotonLight.com is where I discovered…",
          "Contenu": "PhotonLight.com is where I discovered the Micro-Light and LEDLenser brands, now two of my favorites.  PhotonLight writes up their product specs, which I appreciate.  They ship fast, including a replacement I wasn't even sure I was entitled to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard E.",
          "Nb_Reviews": 5,
          "Date": "2020-07-11T16:15:27.000Z",
          "Titre": "Inventory issues, but GREAT service",
          "Contenu": "Although inventory issues kept the order from shipping for a LONG time, they were quick to answer queries about what the situation was, and gave me what information they had. They made up for the inconvenience of the wait (which was, as noted, out of their control) in several ways and were always polite and understanding. The product was well worth the wait."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arnold Chencinski",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T23:33:28.000Z",
          "Titre": "Pleasure ordering from PhotolLight",
          "Contenu": "It's a pleasure ordering from PhotonLight - they're always my first choice for IOT and Insteon controllers.    They are a very professional team, with excellent products.  I know I'll get exactly what I need with Fast reliable Shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa P",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T01:21:00.000Z",
          "Titre": "They were great about trouble shooting…",
          "Contenu": "They were great about trouble shooting shipping issues and making sure my items got to me. Very communicative and quick with their replies. The flashlights I bought work just as expected. Very happy with my experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T17:05:39.000Z",
          "Titre": "I really like the Photon Freedom micro…",
          "Contenu": "I really like the Photon Freedom micro light, with the hat clip.  I never use it without the clip.  Had some issues with my order, hat clips were not included, but we got it all worked out eventually.  I highly recommend this product.  Photon always ships quickly, and, after the mix-up about the clips, customer service was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Thomp",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T19:09:44.000Z",
          "Titre": "I just purchased 4 photon freedom…",
          "Contenu": "I just purchased 4 photon freedom lights.I owned them years ago and used them constantly on the job as a HVAC tech. When I received my order and it wasn't complete I sent an email. The response was fast and within 2 weeks my issues were addressed and corrected. I recommend these products strongly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina S",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T20:56:33.000Z",
          "Titre": "Still loving PhotonLights",
          "Contenu": "I’ve been using photon lights for about 20 years, and I have yet to be disappointed.  All of the colors are awesome and they make for a bright, compact flashlight.  I’m introducing them to my 7 year old nephew this summer, with his favorite color, yellow!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LIttle Liedblad",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T06:17:22.000Z",
          "Titre": "Just BUY TWO OR MORE !!!",
          "Contenu": "Don't wonder, JUST BUY SOMEanyone wondering if they should purchase a photon light...quit wondering and order TWO or more...ever been at a restaurant and forget your glasses? or drop something on the floordig into your pocket and pull out your photon light and voila you can see what you are looking forMy go to LIGHT"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T13:03:35.000Z",
          "Titre": "Excellent service and quick delivery.",
          "Contenu": "Excellent service and quick delivery.The Photon Micro IR light covert model works really well, providing a nice IR light for close proximity work with NVG without giving out too much IR light pollution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Albert",
          "Nb_Reviews": 8,
          "Date": "2021-12-02T20:31:45.000Z",
          "Titre": "Love the light!",
          "Contenu": "Love the light!  Unlike many competitive lights it survives on my keychain and never spontaneously turns on.  It's so small and light that it's not even noticeable but it's always there when I need it.  Best keychain light ever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curmudgeon",
          "Nb_Reviews": 4,
          "Date": "2021-11-28T18:12:21.000Z",
          "Titre": "Bought a number of lights from Photon…",
          "Contenu": "Bought a number of lights from Photon Light over the years; all have been outstanding in every way.  Photon Light shipped on time, the lights were all better than I expected, everything was first class.  I never needed support, so can't comment on that other than to say that it should be up to the same standards as everything else.  Great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rambod Nejad",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T13:14:27.000Z",
          "Titre": "I'm so happy that I can directly work…",
          "Contenu": "I'm so happy that I can directly work with this company, they are very responsible and knowledgeable and if there is any issue, they will resolved quickly. I'll highly recommend photonlight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent McManigal",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T01:12:47.000Z",
          "Titre": "It was time to replace the old one",
          "Contenu": "I decided I needed to replace my Photon Microlight after 21 years of use, so I went to the website and discovered they've made it even better. The purchase went smoothly and I got the light quickly. I'm a happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Essie",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T19:07:46.000Z",
          "Titre": "I Would definitely recommend…",
          "Contenu": "I Would definitely recommend Photonlights  products. I purchased several keychain flashlights over years and gave them as gift  to my family. None of them has been given any issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ra",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T09:16:03.000Z",
          "Titre": "Buy it! Buy a few & do it now.",
          "Contenu": "The photon “Freedom” micro is thee best LED, for EDC (every-day-carry), hands down. I have tons of photons, in every color.  My camp-mate ‘Chedder’ at “TTITD” (“that thing in the desert”), orders hundreds of these, every year as gifts. They are super bright, incredibly light weight, and batteries last a good while for extended use.  The ones he orders have (4) micro screws, and a sure-fire clip, that almost never fails.  They work great as body lights for festivals, work great in port-a-potties, or added rear bike lights The “freedom micro”, is superior though. I’ve had mine for over 15+ years. It is slightly more expensive, but the “squeeze-fade function” allows you to alter your lumens (brightness) and more importantly, the battery change out, is significantly easier.  Mine finally broke, so I ordered 2. After receiving it quickly, I discovered that my old one was indeed NOT broken, and simply needed an adjustment.  Now I have (3)!!! Thank you. -Ra, BSA- Eagle Scout15 year Playa vet.light junkie"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence T",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T00:29:57.000Z",
          "Titre": "Top Quality Product and Warranty",
          "Contenu": "Top Quality Product and the Best Warranty!I purchased a Photon Freedom keychain flashlight with the covert nose about 12 years ago and have used it every night to walk through a dark house and not wake up my wife or step on the cat. Recently it went back into demo mode and I could not restore normal function.I sent it back under the life-time warranty and got it fixed without charge. I was so impressed that I bought a second one. You can’t go wrong with this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2022-06-21T23:13:15.000Z",
          "Titre": "One of life's necessities.",
          "Contenu": "I have had a PhotonLight clipped to my 5.11 vest for a couple of decades, now.  I also Keep one clipped to my nightstand, for when I just need a little light, in contrast to the lumeric blast from a conventional flashlight.Likewise, I use the one on my vest in the Jeep, and to check the inside of my mailbox at night.  And then there was the time I was in the Men's room, and somebody turned off the lights on his way out... SO many uses!You make a wonderful, useful product, and I'm never without one close to hand!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T20:34:50.000Z",
          "Titre": "I have been buying photon lights since…",
          "Contenu": "I have been buying photon lights since their inception. They are durable, bright, extremely easy to use, and a great value. Bryan in customer service made my experience wonderful- highly, highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR Miller",
          "Nb_Reviews": 6,
          "Date": "2021-03-15T03:44:38.000Z",
          "Titre": "The only place to pick up everything I…",
          "Contenu": "The only place to pick up everything I needed for my Leatherman MUT EOD.  All prices were reasonable, and shipping was fast and free, cannot beat that.  From now on when I need torches or multi-tools and accessories, I'll be going to PhotonLight.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Syl Fowler",
          "Nb_Reviews": 1,
          "Date": "2020-08-02T17:10:27.000Z",
          "Titre": "2nd Order is Just as Great as 1st Order!",
          "Contenu": "This is my second order of Photon Micro-Light II.  I've had a Photon Micro-Light on my keychain for at least 20 years and it's been very useful and has come in handy many times.  I decided to order a bunch of them to give to family and friends of all ages.  They make great stocking stuffers and \"just because\" gifts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Stephen",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T18:39:38.000Z",
          "Titre": "I’ve been carrying one of these lights…",
          "Contenu": "I’ve been carrying one of these lights on me for years and just bought more for gifts. They’re awesome and the actual on/off switch verses a hold down button was a great improvement. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ole Retlev",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T16:22:41.000Z",
          "Titre": "PhotonLight offers great products and service.",
          "Contenu": "PhotonLight was easy to do business with; they represent a variety of Letterman knives and tools and after having to make some returns with a couple of my orders, service was fast and easy; I had ordered a Skeletool and after realizing it did not include the one feature I needed, I returned it for a replacement. In another order, because of my oversight, the tool was larger than I needed, and again, I had it replaced fast without any problems. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen Leslie",
          "Nb_Reviews": 3,
          "Date": "2021-06-16T01:36:21.000Z",
          "Titre": "Very pleasant experience overall.",
          "Contenu": "Their product line is of good quality, they are responsive to your questions and orders are shipped promptly. My overall experience of PhotoLight.com has been very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 4,
          "Date": "2020-07-28T16:49:42.000Z",
          "Titre": "Love your batteries and charger line!!",
          "Contenu": "Love your batteries and charger line, just the best! The knives and tools are super nice quality, not to mention your customer service people are more like neighbors and friends. It just gets better! Thanks you guys! JWC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Damm",
          "Nb_Reviews": 7,
          "Date": "2021-11-08T04:59:13.000Z",
          "Titre": "Photon Microlights have been a favorite…",
          "Contenu": "Photon Microlights have been a favorite for over 20 years.30 years?A must LED backup for all of my backpacking trips.Fantastic lumens/gram over all others I have used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARS",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T20:13:43.000Z",
          "Titre": "Good Experience",
          "Contenu": "PhotonLight shipped my order quickly.  My item was well-packed, arrived in excellent shape and was as represented in the ad.  I'd definitely do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Bisceglia",
          "Nb_Reviews": 3,
          "Date": "2022-04-09T04:24:42.000Z",
          "Titre": "Photon Micro Light is truly an awesome…",
          "Contenu": "Photon Micro Light is truly an awesome company! I had one hanging on my motorcycle key chain for many years. It finally died after years of blowing in the wind and getting knocked around and left in the freezing winter temps and rain storms while riding on my motorcycle year round in Colorado. I sent it to the factory to see if it could be repaired as it was a good friend. They sent me a bran new without hesitation! I have since purchased over a dozen more. Some for my many key chains and to give as gifts. All of them are still in service! These little lights are top quality, durable and bright! I use them every day! Can't say enough good about them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosemary",
          "Nb_Reviews": 3,
          "Date": "2021-09-11T01:16:59.000Z",
          "Titre": "Every few years",
          "Contenu": "Every few years, I get stuff from PhotonLight and the experience has always been flawless. I bought lights in quantity to give as gifts and everyone loves them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Nieman",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T20:03:17.000Z",
          "Titre": "Great light",
          "Contenu": "Been using the light for a little over a week, loving it. Have only charged it once still going strong. Needed something that would stay on my head when I am under a car or out night fishing and so far it is fitting the bill perfectly."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Mr Morten Larsen",
          "Nb_Reviews": 9,
          "Date": "2021-10-19T09:49:45.000Z",
          "Titre": "Correction. The package was cought up at the customs. Not PhotonLight's fault.",
          "Contenu": "I made an order a month ago and the money was taken from my bank accountSeptember 7th, 2021 (USD 40,15).I have however not received the two flashlights yet.Still waiting.Regrads,Morten LarsenAurehoejvej 2, 1.thDK 2900HellerupDenmarkPhone. 0045 29 46 67 62"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2020-12-25T00:01:39.000Z",
          "Titre": "Fast fast service!",
          "Contenu": "Not much to review per se. I purchased AA rechargeable batteries. However, the service was remarkable!!  The order process and the fast delivery were unexpected during this busy holiday season. So, you have a very satisfied customer here.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Reimer",
          "Nb_Reviews": 9,
          "Date": "2021-03-27T23:38:09.000Z",
          "Titre": "A quality American Built light that you…",
          "Contenu": "A quality American Built light that you can trust in emergencies and everyday life. Carried one in my 2 trips to Iraq, no fails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gibson Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T19:23:47.000Z",
          "Titre": "I have had a Photon light on my",
          "Contenu": "I have had a Photon light on my keychain for many years. I always have an X-light by my bedside table for safety when I get up in the night"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Swanson",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T23:34:09.000Z",
          "Titre": "Great little light",
          "Contenu": "Great little light.  It's a must-have key chain item. Very useful; use it often. Very reliable and the price is right.  Thanks for manufacturing this useful little light."
        },
        {
          "Note": 5,
          "Lieu": "KN",
          "Pseudo": "Portage Tap House",
          "Nb_Reviews": 3,
          "Date": "2021-02-04T22:04:00.000Z",
          "Titre": "Hard to find product",
          "Contenu": "Hard to find product, told me the date they would be in stock and delivered.  Exceeded their estimate.  Nice to know I can find products that the manufacturer seems to have trouble keeping in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "eugene m. long,jr.,m.d.",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T18:21:46.000Z",
          "Titre": "have been using PhotonII's for many…",
          "Contenu": "have been using PhotonII's for many years on many continents, it is a vital part of my kit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Wallace",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T16:10:00.000Z",
          "Titre": "I have used Photonlights for many years",
          "Contenu": "I have used Photonlights for many yearsthere are a few similar products but they just are not as good. The lights are small and reliable and have always worked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2021-12-14T22:05:19.000Z",
          "Titre": "Great product",
          "Contenu": "The device works well and fit on my keychain without any noticeable increase in bulk.  Extremely rapid service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Damm",
          "Nb_Reviews": 7,
          "Date": "2022-02-13T22:26:46.000Z",
          "Titre": "My favorite species of LED light for…",
          "Contenu": "My favorite species of LED light for well over 20 years.I go no where without a spare in my day pack and my back pack.After my 19th trip in to the Wind River Range I plan to lose the triple AAA LED headlamps and use only PhotonLight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H N",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T01:17:46.000Z",
          "Titre": "Have several products from Photon",
          "Contenu": "Have several products from Photon, all of them quality. They stand behind them if you have a problem in my experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S.P.",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T01:18:48.000Z",
          "Titre": "I originally received the wrong…",
          "Contenu": "I originally received the wrong product.   I contacted customer service and was immediately sent the correct item with a return envelope.  I am very happy with the new flashlight and the prompt response by customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Mantz-Powers",
          "Nb_Reviews": 2,
          "Date": "2020-10-14T05:07:28.000Z",
          "Titre": "Handy and Easy to Use",
          "Contenu": "Photon Light is user friendly company that provides quality produces. I carry a Photon Micro light on my key chain.  I’m amazed by how handy it is and how often I press it into service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M.L.",
          "Nb_Reviews": 4,
          "Date": "2021-07-02T14:01:28.000Z",
          "Titre": "It's a great company to deal with",
          "Contenu": "It's a great company to deal with. Good and quick communication. Products are of high quality too. Totally recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Louise Shea",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T22:07:56.000Z",
          "Titre": "Love these PhotonLights!",
          "Contenu": "Love these PhotonLights!I have given them as gifts to my sons and my husband! They love them!Thinking it is time I get one for me!Husband will be getting another one for his Birthday in August!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory R",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T03:32:16.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, robust for it's size, can install a new battery, very bright, and does SOS.Quick shipping and free! Iwould buy from them again, anytime !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T18:24:50.000Z",
          "Titre": "I ordered a replacement for my…",
          "Contenu": "I ordered a replacement for my microlight that had lasted for 10 Years! The previous one didn't break or fail, I lost it.  This is a great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Harrison",
          "Nb_Reviews": 2,
          "Date": "2020-12-05T22:57:17.000Z",
          "Titre": "I visited many web sites  before…",
          "Contenu": "I visited many web sites  before choosing photon light to make my purchase. The purchase was quick and easy for my Christmas purchase. Best price at the time for my purchase and no shipping. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M.W. Sokolowski",
          "Nb_Reviews": 2,
          "Date": "2022-03-04T06:09:45.000Z",
          "Titre": "Conversation  was most  informative",
          "Contenu": "Conversation  was most  informative  / enlightening ALL my. questions answered .Order placed . Order has been receivedWill order different products when they are sent to PhotonLight  from the manufacturer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry S.",
          "Nb_Reviews": 3,
          "Date": "2021-09-01T02:55:49.000Z",
          "Titre": "I have purchased over 50 of these…",
          "Contenu": "I have purchased over 50 of these lights over the years. Many as gifts for friends. Everyone loves them. easy to use, very reliable, bright.. I highly recommend them for you key chain, glove box in the car, clip on a jacket and a lot of other uses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T13:37:44.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "I have to say, I am impressed with the customer service! I was looking for an Insteon product that was sold out everywhere. I saw that PhotonLight was selling them. I don't remember if their website said they had stock, but I know it didn't say out of stock like everywhere else. I decided to order from PhotoLight even though I had never ordered from them in the past. The next day, I had not received any tracking info, so I called them. A REAL PERSON answered the phone and told me that they were out of stock, but that they were expecting some in in the next few days. He apologized that the website didn't show out of stock when I ordered. The part was shipped within a couple of days,  I got plenty of tracking updates and had the part in hand a couple days after that.I never would have gotten to talk to a real person and get an estimation that they should have more in a couple of days from any of the sites I have ordered from before. I wasn't really out anything since it was sold out everywhere else. Overall, I truly appreciate the personal response to my inquiries about my purchase and I will shop PhotoLight first next time I need an Insteon product.Thanks a ton!Chris"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "andrew akers",
          "Nb_Reviews": 2,
          "Date": "2021-10-09T01:24:54.000Z",
          "Titre": "The website was very easy navigate and…",
          "Contenu": "The website was very easy navigate and fast loading.  Enjoyed purchasing through the website and will do so again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Seidell",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T13:25:07.000Z",
          "Titre": "Quality",
          "Contenu": "Good quality and shipping was fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LongBeachCPA",
          "Nb_Reviews": 2,
          "Date": "2020-12-20T02:49:04.000Z",
          "Titre": "Bryan is most helpful",
          "Contenu": "Bryan is most helpful. Products, work, and work for a long time. (Other LED flashlights work for a while and are not as  bright as promised (for long.)) Live and learn.THX - Uday - 06:48 PM-Sat-Dec-19-2020"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T02:02:09.000Z",
          "Titre": "Great customer service",
          "Contenu": "They had the item I wanted and I picked it up the same day I ordered it. The representative on the phone was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CAMI",
          "Nb_Reviews": 2,
          "Date": "2020-12-16T20:27:55.000Z",
          "Titre": "Couldn’t have been more helpful",
          "Contenu": "Couldn’t have been more helpful, knowledgeable and courteous. Shipping was prompt. I would give them 10 stars if it were possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 4,
          "Date": "2021-07-14T19:13:07.000Z",
          "Titre": "Photon rules",
          "Contenu": "Photon rules! Customer Service people are like hip neighbors...and they believe in their products. And time flies: over twenty year buyer! Thanks Photon!! JWC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-01-17T01:46:53.000Z",
          "Titre": "Great product",
          "Contenu": "Got my replacement leatherman bits which are hard to find and run up a large bill on other sites."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "R. Schuhmacher",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T08:30:52.000Z",
          "Titre": "Photon Micro-Light II PRO",
          "Contenu": "Excellent service, easy and fast delivery. The best microlights there are. Robust, bright, easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorax Tribe",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T02:41:28.000Z",
          "Titre": "I always like the products at…",
          "Contenu": "I always like the products at photonlight.com and depend on the quality lights and accessories they provide."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mon",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T23:37:42.000Z",
          "Titre": "Reliable sturdy product",
          "Contenu": "Reliable sturdy product. Very happy with them. This is my second time ordering and they always shipped quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard S.",
          "Nb_Reviews": 2,
          "Date": "2020-11-23T23:17:12.000Z",
          "Titre": "I have been very happy with all the…",
          "Contenu": "I have been very happy with all the lights I have purchased.  This is my third time coming back to make purchases. You make great stuff plain and simple. Some of my gear has been lost over time and it’s time to replenish and update things.  Keep up making your fine quality gear. ThanksRick S."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Nicholson",
          "Nb_Reviews": 3,
          "Date": "2022-09-09T17:17:58.000Z",
          "Titre": "Straight forward ordering on line",
          "Contenu": "Straight forward ordering on line.  Quick shipment of order.  No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tar",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T18:02:28.000Z",
          "Titre": "Good communication and order was…",
          "Contenu": "Good communication and order was processed fast and shipping info was passed along as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2022-05-26T15:16:01.000Z",
          "Titre": "Great light",
          "Contenu": "Great light. I have five of them. They are with various kits, in my hat, etc. the best feature is the variable intensity. I Can duct tape one to the bill of my cap very easily for use at night."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "John Quarterman",
          "Nb_Reviews": 2,
          "Date": "2020-10-26T12:42:47.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Emailling me after inventory turned out top be missing, and searching and finding an alternate source for me was really a topnotch example of customer service - good to know that some companies still value their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 6,
          "Date": "2020-08-11T04:18:23.000Z",
          "Titre": "I like the Photon X light a lot",
          "Contenu": "I like the Photon X light a lot!  I honestly feel this is the best key chain or pocket light you can buy!  Worth every penny!  This light can do everything and more!  The perfect light can't say enough good things about it!  PhotonLight.com is one of the top 10 websites in my book!  They make the best high tech gadgets in the world!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Heslop",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T22:04:33.000Z",
          "Titre": "Great",
          "Contenu": "Bob BB BB njmcgy be full in vxz xxx no bc s FB hmmm HB GC hmm HB n no no no"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Victoria",
          "Nb_Reviews": 6,
          "Date": "2022-01-16T18:16:11.000Z",
          "Titre": "Easy to understand site",
          "Contenu": "Easy to understand site. Everything is ordered very quickly. Good service and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Newman",
          "Nb_Reviews": 3,
          "Date": "2021-09-20T13:07:40.000Z",
          "Titre": "I bought this as a backup for when I…",
          "Contenu": "I bought this as a backup for when I lose my current photon micro.  This will be my third (lost one) and they are small, good and very useful lights."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas E Ebert",
          "Nb_Reviews": 4,
          "Date": "2023-01-23T21:14:21.000Z",
          "Titre": "Key chain light.",
          "Contenu": "Great product that I have had for probably 20 years. Just bought 4 more. Good price and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert D",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T22:57:03.000Z",
          "Titre": "Great price and fast shipping",
          "Contenu": "Great price and fast shipping. recommend them to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Dodd",
          "Nb_Reviews": 4,
          "Date": "2021-12-15T00:45:33.000Z",
          "Titre": "Got some rechargeable LED lanterns and…",
          "Contenu": "Got some rechargeable LED lanterns and two microlights-great price, always a pleasure, thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William White",
          "Nb_Reviews": 3,
          "Date": "2021-05-27T17:40:28.000Z",
          "Titre": "Staff was very helpful and responsive…",
          "Contenu": "Staff was very helpful and responsive with finding a very hard to find item. Shipping was fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Sori",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T01:25:20.000Z",
          "Titre": "Got exactly what I ordered and promptly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert Beaumont Canada",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T15:45:43.000Z",
          "Titre": "Infrared lights fit perfectly on to my…",
          "Contenu": "Infrared lights fit perfectly on to my Remington 870 MCS forend grip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Hannsgen",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T07:58:00.000Z",
          "Titre": "PhotonLights are very strong",
          "Contenu": "PhotonLights are very strong, last longer than the cheap stuff out there, and are well made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-17T23:51:17.000Z",
          "Titre": "Excellent!",
          "Contenu": "I now have a number of PhotonLight products. I am VERY pleased with them all! Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Raymond",
          "Nb_Reviews": 5,
          "Date": "2023-01-22T16:40:29.000Z",
          "Titre": "Easy navigating the website and…",
          "Contenu": "Easy navigating the website and ordering. The product is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Legg",
          "Nb_Reviews": 2,
          "Date": "2020-12-21T23:37:49.000Z",
          "Titre": "Great lights",
          "Contenu": "Great lights, especially for Hurricane power outages. Have them in every room and the key chains."
        }
      ]
    }
  ]
}