{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.th3dstudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Adrian Lang",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T01:51:43.000Z",
          "Titre": "Very bastardized firmware"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Soullessspirit",
          "Nb_Reviews": 2,
          "Date": "2021-07-22T22:41:55.000Z",
          "Titre": "Caution",
          "Contenu": "Wanted to upgrade the company's farm so we purchased the tough extruder and hot-end from TH3D. And we lost about a month on one printer trying to diagnose it. But, they refused a return because the products were not in like-new condition with bad/miss comprehension. FYI: the extruder and hot-end they sell are clones of E3D and the extruder, we purchased, is defective. We found this out by replacing the main support cover and the extruder's pinion gear, which made it work perfectly. Sadly during the return the debating was very unprofessional and we received childish remarks from the owner (about my knowledge) which caused my team and I to no longer rely, buy, or recommend their products. If you have great success with them, then by means, continue. But as for us, we will not be doing anymore business with this company. I wouldn't be surprised if they tried to justify themselves by responding to this review. They have blocked my company from their site because we wanted to leave a caution but since they administrate their own site, our cautions would just be deleted. So we deiced on this domain for a fair hearing."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ted",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T12:25:42.000Z",
          "Titre": "Cr10s5 4.2 7 silent board firmware…",
          "Contenu": "Cr10s5 4.2 7 silent board firmware doesn't work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T00:07:49.000Z",
          "Titre": "Said it was a rainbow glow in the dark…",
          "Contenu": "Said it was a rainbow glow in the dark but it is just a standard everyday weak glowing glow in the dark color."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andy Rossiter",
          "Nb_Reviews": 13,
          "Date": "2021-02-12T15:48:04.000Z",
          "Titre": "Nice item but costly hidden snag...",
          "Contenu": "Came to this site for a accessory purchased for my 3D printer due to the great reviews etc.  What I didn’t count on was a small but costly snag.When going through the checkout I was presented with different postage costs and because I was in no hurry for it I picked the cheapest.  What I never counted for was the hidden cost that the seemed to hide in their terms and conditions which other sites do not.  It’s the customs charging that some sites actually inform you if they don’t pay.  Some sites unlike these actually include the custom charges.Th3d actually admitted in an email to me that they have it stated in their terms that all buyers are responsible for any customs charges that their own country impose on items that are delivered with their own country, which I understand but this was never pointed out within the checkout like other sites do to help their buyers.  If I had known there was going to be an extra customs charge I would never have purchased from them.How many people actually read the terms of a site for hidden charges that maybe imposed?  It’s normally within the checkouts that most companies state ‘please note when ordering outside of out Country, you are responsible for any customs and handling charges that maybe imposed on your item’ or even add the charges on to cover any customs charges that maybe imposed.It’s not very hard for a company to find out what countries charge what for different valued items.  I did suggest to ‘Tor’ who has been replying to me that it would be better to have that warning in the checkout, but he refused stating its other countries that impose the charges.  It seems that suggestion went over their head or else ‘Tor’ is virtually stating we have it running how we like and we're not going to change it.  If you don’t read the terms of all sites that’s your problem.So readers please be very aware of any hidden charges within ALL sites terms, you may even have to be a lawyer to figure them out in the future.Edit (8th Feb 2021):In reply to the feedback left from Th3d, it’s funny how other companies including those from USA can and do calculate customs fees with customs calculators that are freely available on the internet, they also pass the fees onto their customers during checkout.I am only leaving feedback for your company as you seemed to of failed to grasp the information that has been provided to you, at least you could place a warning stating ‘If you’re from outside USA, you maybe hit by customs import duty which we do NOT pay for’.02/12/2021Reply:  not everyone reads the ‘small print’, I guess you guys do when ever you’re ordering something from a site?Yes I have noticed you’re no longer going to ship to the uk due to our government introducing VAT to companies who sell and ship into the UK.  But I also see you still want our business by asking if any company wants to sell your products over here to get in touch, guess you just want to sell the items without paying our vat lol.Happy printing yourselves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Massey",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:35:00.000Z",
          "Titre": "Great Service",
          "Contenu": "Great service and prompt delivery of product. Just wish shipping cost could be a bit lower. $12 shipping is high for an item that just cost $19."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "AndyP",
          "Nb_Reviews": 8,
          "Date": "2023-12-01T17:12:44.000Z",
          "Titre": "Great For Continental USA users.",
          "Contenu": "Products are of good quality and work well. Easy to order and pay.BUT - Beware of shipping costs to EU/UK"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustan Burrell",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:34:41.000Z",
          "Titre": "Best source for 3D printing!!",
          "Contenu": "So I joined here namely to thank the firmware developers of TH3D. I have an original ender 3 which I have upgraded heavily. Well a couple weeks ago I finally decided to upgrade the board with a BTT skr mini 3.0, and what a nightmare it was I couldn't get it to do a thing with the stock firmware. After 2 weeks of pulling my hair out I came across TH3D unified and figured if $5 has a chance of solving the issue it's worth it. Well best darn $5 ever!!! I've never compiled firmware and never used visual studio and with the short TH3D videos and instructions in the firmware I was up and running in under and hour and this thing is like a whole new printer absolutely amazing. Thank you guys so much you rock!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "satisfied in MT",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:43:36.000Z",
          "Titre": "Got what i ordered",
          "Contenu": "Got what i ordered.  Never received a shipping confirmation/tracking info (yes, i checked spam) but it showed up in ~5 days from order anyway.  Easy install, exceptional documetation.  Was up and running in under an hour."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:48:23.000Z",
          "Titre": "Great customer service and documentation",
          "Contenu": "Support staff had quick turnaround time to provide me missing tracking number. Received part an had no issues installing per their documentated videos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Adams",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T14:28:53.000Z",
          "Titre": "Customer service is the best I've ever…",
          "Contenu": "Customer service is the best I've ever used.the shipping is super fast.  The knowledge they have of their products is top notch.   They make you feel like your business very important to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:24:12.000Z",
          "Titre": "Excellent service and fast responses",
          "Contenu": "Excellent service and fast responses. I will definitely be purchasing and making this shop my go to for my 3 D printing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T22:01:32.000Z",
          "Titre": "Th3D does and exceptional job on Communicating, Service and a Awesome Experience",
          "Contenu": "Th3D does and exceptional job on communicating, service that goes beyond what you might get from other companies. If you have any questions they do whatever they can to help you resolve it. Thank you for a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert R Pierce",
          "Nb_Reviews": 4,
          "Date": "2023-11-04T01:39:09.000Z",
          "Titre": "Smooth sailing",
          "Contenu": "It was easy to find what I was looking for and the order process was easy and straightforward. My order shipped promptly and arrived quickly. I have not installed it (EZABL) yet, but the three previous units worked flawlessly. I expect the same from this one and I know if I have a problem or need assistance TH3D will support their product. That’s what they do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli Turner",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T06:52:58.000Z",
          "Titre": "Wonderful company",
          "Contenu": "Overall amazing products, service, support, etc. Highly recommend checking out what this amazing company has to offer and all the hard work they put into it to ensure quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Munoz",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T20:46:49.000Z",
          "Titre": "Great experience",
          "Contenu": "Shipping was lightning fast. I ordered 6 items on a Thursday. Shipping notice said Monday, but the package actually showed up on Saturday.Product quality was very good as well, loved the color choices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rudy Weekley",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:24:26.000Z",
          "Titre": "needed firmware for an old printer with…",
          "Contenu": "needed firmware for an old printer with a new board. Ender 5 pro upgraded to 4.2.7 board. ordered the firmware and watched the installation video. works perfectly. 20 minutes from download to printing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tom shaw",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:40:55.000Z",
          "Titre": "th3d is honest website and they do what they say.",
          "Contenu": "th3d is outstanding they have everything you need for your printer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Sanfilippo",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T19:32:50.000Z",
          "Titre": "TH3D is amazing!",
          "Contenu": "Have used the TH3D solid bed mounts for over a year on my CR-10 and absolutely love them. Once I installed these, along with a BL-Touch, my CR-10 became my most reliable printer. Once my Ender 3 started having print quality issues due to the bed not being level and the BL-Touch not being able to compensate for such drastic leveling issues, I swapped out the stock springs for the solid bed mounts and instantly fixed my leveling issue.I am using the TH3D Unified firmware on both my CR-10 and Ender 3 as well and that was a good choice as well. Super easy to configure, gives more options for baby stepping and bed probing for the BL-Touch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ed",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:29:41.000Z",
          "Titre": "EZABL sensor turned my Ender Pro 2 into…",
          "Contenu": "EZABL sensor turned my Ender Pro 2 into a reliable printer. Out of the box, the printer was not reliable and destined for the trash heap, but after several TH3D upgrades and their Unified Firmware saved the printer.I would not buy Creality again, but I will search TH3D first for any of my printing needs."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Erik Tobiassen",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T09:49:25.000Z",
          "Titre": "Tim and th3d are extremely…",
          "Contenu": "Tim and th3d are extremely knowledgeable regarding all things 3D printing. I booked a call with Tim for help upgrading my firmware, and he helped me all the way. He also took the time to answer any questions.If you are looking to buy any upgrades to your printer, these guys back it up with the tech support and knowledge I don't think you'll find many other places."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt MauDib",
          "Nb_Reviews": 2,
          "Date": "2021-06-20T00:05:08.000Z",
          "Titre": "My Go-To for 3D printing parts.",
          "Contenu": "TH3D stands out among most other 3D printing companies. Their products are top of the line, staff is knowledgeable & courteous, and they stand behind their products. Aside from the quality of their parts and staff, their after-sales support is probably the best in the industry, at least in my experience. You can be assured, whether you're buying their own line of EZ products, or the things they resell, that you're getting more than your money's worth from TH3D."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey Swett",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T03:51:35.000Z",
          "Titre": "TH3D has amazing products",
          "Contenu": "TH3D has amazing products.   They are my go to for everything I need.   If I can get what I need from TH3D, they are who I will order thru.   From parts, add-on’s, filament, mods.  They’re Flex plates and magnets are legit!   Gotta say I’m impressed with the “bed cement” they just released too.   I have a print farm, so I probably use and order more than most.   I know their support is there should I ever need it.   Tim has a ton of helpful YouTube and Rumble videos out there too helping with a ton of 3D printer topics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Foster",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:52:34.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response. Knowledgeable answers. Great data base"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory Begeot",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T14:25:31.000Z",
          "Titre": "Great help and customer service",
          "Contenu": "I purchased the unified 2 firmware and customer service. Received great service and help in compiling what I needed. Thank you guys for making it a quick, easy and painless experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jordan Sime",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T23:18:31.000Z",
          "Titre": "TH3D is incredible!! I wouldn't be printing without them!!",
          "Contenu": "TH3D's unified firmware is a breeze. It makes compiling Marlin so much easier. From a noobie's perspective, stock Marlin is incredibly daunting. I spent two weeks trying to get stock Marlin to work and was ready to give up (issues with chip swapping due to shortages gave me many headaches), but even with my weird clone chip, TH3D's unified firmware worked fully, and completely on the first try. It felt like magic. To get around future headaches, I'm upgrading to TH3D's EZboards since they guarantee genuine STM chips, and have excellent customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk Holston",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T20:32:02.000Z",
          "Titre": "TH3D Studios are Da Bomb!!!",
          "Contenu": "I am fairly new to the 3D printing world (A Hobbiest) but Tim and his staff at TH3D truly seem to care about their products and their customers. They want you to succeed at this hobby and do just about anything to assist you. There are no dumb questions….(Okay yes there are!!! I’ve had a few. Lol!) but his staff offers timely help without making you feel like an idiot. They back their products and there is always someone either on staff, in chat, on Discord, or in the help section of their website offering assistance. They constantly  ask their customers what is of interest to them. You don’t usually see that from a small business. On top of that, the prices for their products are reasonably priced. I am a fan and will make every effort to patronize his company for my 3D products. Oh and shipping is super fast! With great updates for delivery times. Thank you Tim and TH3D Studios You Guys Rock!Kirk H"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Williams",
          "Nb_Reviews": 2,
          "Date": "2023-02-26T04:28:40.000Z",
          "Titre": "Oustanding customer service, high quality selection and fast shipping",
          "Contenu": "I recently purchased a power supply for my Sovol SV06 printer.  I had a couple of questions about it and used the website chat function.  I was pleasantly surprised to be answered instantly by a knowledgeable and friendly technician who answered my questions quickly and provided stellar support.  I have since bought other items from this store.  Their shipping is fast and their selection is high quality.  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 12,
          "Date": "2023-08-26T17:57:13.000Z",
          "Titre": "TH3D and Tim rock",
          "Contenu": "I'm a newbie.  So I booked tech support for my upgrade install of extruder, EZAbl, and EZBoard V2.  To my surprise and excitement, THE Tim - the owner was - my support tech. (Yes I was star struck).  Could not have been a nicer person.  Walked me through the next steps, advised me on what they use in their printer farm, great tips and tricks - more than I asked for.  I have a to-do list and will schedule another call soon. FINALLY, I may be printing!  Support TH3D.  OBTW - his puppies Remo and Comet are fun to have on the call, making sure Tim does things correctly.  No tinned wires!  Cheers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Accurso",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T04:14:03.000Z",
          "Titre": "These guys are it when it comes to 3d…",
          "Contenu": "These guys are it when it comes to 3d printing!! Helpful, knowledgeable and worked with me step hyvstronto diagnose my printer issues!! Installed two ezboards and in the process of putting in their ezbal leveler!!! Def will do biz again and most importantly made a new friend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kenneth rhoades",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T00:01:03.000Z",
          "Titre": "I tried other companies and i was…",
          "Contenu": "I tried other companies and i was steered towards the wrong purchases for my needs. I bought a EZBoard and EZPI for my ender 5 plus and now firmware for my other ender 5. Customer service is TOP Notch and the products are just as good. Looking forward to other successful purchases from this company!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Dunfee",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:58:10.000Z",
          "Titre": "The greatest support",
          "Contenu": "Tim has always been the best with quality support from the first time i purchased anything from TH3D. He is the reason i keep coming back"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brian Webster",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T15:48:21.000Z",
          "Titre": "I love how informative the videos are.",
          "Contenu": "I love how informative the videos are.For a non-technical person like me, who doesn't know anything about coding, the instructional videos have been fantastic! I also really appreciate that he goes through trouble-shooting where something may have gone wrong with my build. Thank you for being so informative and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zack",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T00:30:12.000Z",
          "Titre": "*Updated* I tried, truly.",
          "Contenu": "Update: (10/24/2023)TH3D has reached out to me regarding this issue, they have helped me through this and offered tremendous support to get this resolved.They have exceeded my expections with this level of customer service. I am very satisfied with how helpful they have been thus far. I will certainly be returning to them for additional 3d printing products.Cheers!________________________________________________I followed all of the steps on the TH3D website to upload the firmware to my CR10 V3 w/ BLTouch. After uploading to my printer it does not want to Level the bed, and keeps giving me Endstop Z errors whether the endstop is plugged in or not. Then the extruder just backs the filament out at an extremely high rate. I went over the coding multiple times, quadruple checked it, used multiple slicers, modified the G.code to what your website suggested, went through several videos on your website on what I am missing. To no avail, I've decided to reupload the previous firmware from Creality with BLTouch. It's been working great but it doesn't have several features that I desire, such as Thermal Runaway protection. I am disappointed and I tried everything I could to get it to work, but I'm left wanting to throw my printer across the room. I really, really want this to work. I'll be satisfied if it is verified to work with a CR10 V3, and that I am just an idiot. I'll try tweaking with it again in a month or two."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jt",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:43:08.000Z",
          "Titre": "Quick delivery and great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rmillz",
          "Nb_Reviews": 2,
          "Date": "2021-07-22T21:41:09.000Z",
          "Titre": "Great product offerings and descriptions",
          "Contenu": "Great product offering and fully explained descriptions. I ordered a B stock flex plate for the CR10S5, and cant really even tell its blemished (which is stated on the store page). Got an amazing discount on it, and love the smaller Magnet/flexplate I got previously and have been abusing for about a year now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan Case",
          "Nb_Reviews": 2,
          "Date": "2021-10-16T02:23:16.000Z",
          "Titre": "Excellent!",
          "Contenu": "TH3D Studio has always been an excellent resource for 3d printing parts and firmware. I have never had any issues with their products and have been satisfied since I have purchased them. Their products are fairly priced and high quality and I will be sure to return to them when I need something else for my 3d printer."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T14:17:21.000Z",
          "Titre": "Shipping costs",
          "Contenu": "Wonderfully easy web site fantastic products but the shipping charges are outrageous .Seriously US$31 for something that can not weigh more than 500g .I know Western Australia is little far away ,but please get a new shipping calculator"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Wiese",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T19:01:36.000Z",
          "Titre": "Excellent service with even better…",
          "Contenu": "Excellent service with even better products. Their products are unmatched when it comes to quality and customer care. Honestly, you won't find a better sensor or firmware for your 3D printers. Not only that, but they have a multitude of free resources available on their website and youtube channel that you can use. I highly recommend checking them out if you are interested in repairing, upgrading, or even just to learn more about 3D printing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charles Innes",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T21:44:36.000Z",
          "Titre": "came for a probe, stayed for the service",
          "Contenu": "phrasing is not my forte, i've made multiple orders over the past year, from ezabl probes, to ezboard and ezflex, quality products across the board, knowledgeable staff who are quick to respond to both live chat and email tickets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T21:14:58.000Z",
          "Titre": "Great service and fast shipping!",
          "Contenu": "I have ordered several times from TH3D and I like the products they offer and customer service I get each and every time. Shipping has been fast and they are very good at communicating to make sure everybody knows what's going on if they are running behind or delayed on shipping. I highly recommend TH3D and will continue to shop there to support small business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUSTIN DEIBEL",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T21:23:32.000Z",
          "Titre": "Great company",
          "Contenu": "Great company, great products, great support, doesn't take any BS. Growing within the 3D printing community steadily, and will not sell any products that they don't QA and use themselves."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Ross",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T16:46:49.000Z",
          "Titre": "Buy with confidence.  Eliminate the guesswork.",
          "Contenu": "Have purchased from TH3D multiple times.   Every single time the order was absolutely perfect.   Received all components as fast as USPS could be bothered to get them to me.   TH3D's store makes it very easy to make sure you get the correct parts for your printer.  It can be hard to tell one fan from another when just searching the internet in the wild.   Knowing that the TH3D staff stands behind everything they sell is reason enough to buy from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Provencher",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T06:55:25.000Z",
          "Titre": "Just Easy",
          "Contenu": "I bought your firmware. Great product, and at $5, a steal. Great tutorials on flashing the firmware. It works properly, and the UI is much more intuitive that the OE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Thomas",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T19:15:45.000Z",
          "Titre": "A GREAT 3d printing resource!!",
          "Contenu": "I've been buying from Th3d for more than 3yrs now. They have near best, if not the best customer service in the industry. They go above and beyond to test products before they sell them, they innovate new products, and they have a firmware that they provide free to the public that is super easy to use.I've had a few different small issues with their stuff over the years, and they have always been responsive to my concerns, and more than willing to make it right."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Craig Williams",
          "Nb_Reviews": 3,
          "Date": "2020-10-07T19:15:03.000Z",
          "Titre": "Purchased an EZABL Pro",
          "Contenu": "Purchased an EZABL Pro and bootloader kit for my Ender 3. Install was great because of the fantastic instructions and videos put out by TH3D.The firmware was also easy to install and my printer has never printed so well. Many thanks TH3D crew!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Poffinbarger",
          "Nb_Reviews": 2,
          "Date": "2021-08-03T20:26:23.000Z",
          "Titre": "Honestly one of the best 3D printing supply companies I have used",
          "Contenu": "I have ordered many items for my 3D printers and have been very pleased with the items I have received and their quality.  They are very prompt with their follow-up and service.  In addition they have gone the extra mile to help with me out with setting some things up where I needed assistance with configurations.  They also have an awesome help section with many how-to videos as well that make things much easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T16:30:23.000Z",
          "Titre": "I was notified when a part came back…",
          "Contenu": "I was notified when a part came back into stock that I wanted to order.  I received an email that it is now in stock which saved me from checking the th3dstudio site several times.  As usual site was easy to use and the service is excellent. There is so much information contained making support easier. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lill Wuecke",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T22:48:08.000Z",
          "Titre": "I bought an auto leveling kit for my…",
          "Contenu": "I bought an auto leveling kit for my printer. Tim and his team guided me through setup despite my mistakes. Their quick responses and quick shipping time are why I wouldn't hesitate to recommend them to everyone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T03:00:27.000Z",
          "Titre": "Best Probes In North America",
          "Contenu": "Great products, Knowledgeable staff,I had an issue getting a gift card to work, and the live staff chat was a life saver! Had that sorted in a jiff, can't wait to install all the new upgrades!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Kohagen",
          "Nb_Reviews": 2,
          "Date": "2021-07-23T00:09:50.000Z",
          "Titre": "Great support and very knowledgable…",
          "Contenu": "Great support and very knowledgable staff. I had recently double ordered and called early the net day. The staff member was able to locate my (2) orders and promptly canceled the errant second order before it was packaged up, or before it received a shipping label. The second order was refunded and the next day money was transferred back.I have ordered many parts and books from TH3D. I continue to remain a loyal customer. I have learned several times to order parts from them for my 3-D printer, when I have not I have had issues. So I keep coming back. Prices are often the same but better value because they stand behind the products and services they sell."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ed George (The Kurgan)",
          "Nb_Reviews": 2,
          "Date": "2021-07-02T13:15:25.000Z",
          "Titre": "In my opinion",
          "Contenu": "In my opinion, this is thee best source of 3d printing parts in North America.We have a few decent stores in Canada, but 75% of the time I find myself finding what I need from TH3D.Their support is, without a doubt, the absolute best! I had an issue with a product I purchased a while back, and Tim and Samantha Hoogland, made sure it got sorted out and new parts sent to me immediately... I was impressed, and instantly hooked on this store and it's amazing staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TexasLeo",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T02:02:34.000Z",
          "Titre": "Great deal and fast shipping",
          "Contenu": "Excellent deal on great filament. The colors are amazing and the price was just right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 15,
          "Date": "2023-06-01T17:44:14.000Z",
          "Titre": "Great customer and technical support",
          "Contenu": "Great customer and technical support. They listen and answer all of your questions without making you feel rushed, and are very thorough in doing it. Great products and prices too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 15,
          "Date": "2023-06-01T17:43:54.000Z",
          "Titre": "Great customer and technical support",
          "Contenu": "Great customer and technical support. They listen and answer all of your questions without making you feel rushed, and are very thorough in doing it. Great products and prices too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 15,
          "Date": "2023-06-01T17:43:22.000Z",
          "Titre": "Great customer and technical support",
          "Contenu": "Great customer and technical support. They listen and answer all of your questions without making you feel rushed, and are very thorough in doing it. Great products and prices too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Mooney",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T15:09:34.000Z",
          "Titre": "Excellent products",
          "Contenu": "Excellent products.  Fast delivery.  Fantastic support. A supplier you can trust.  Couldn't ask for more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T03:37:13.000Z",
          "Titre": "Only the best!",
          "Contenu": "My “go-to” place for all printer parts, accessories and firmware. Top notch customer service. Best quality parts around. Been ordering regularly for years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Dimitroff",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T19:07:56.000Z",
          "Titre": "Purchased from TH3D Multiple Times",
          "Contenu": "Purchased from TH3D multiple times. Shipping is fast & I usually have my orders sitting on my doorstep within 5 days. The service is what really stands out. Tim sells tested & trusted products and, when I have had issues with a couple items I purchased, they sent me replacements and some candy, free of charge."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ben Coe",
          "Nb_Reviews": 2,
          "Date": "2021-06-23T15:34:36.000Z",
          "Titre": "Fantastic company",
          "Contenu": "Fantastic company. I hear about these guys constantly in the 3D printing community. I decided to give their EZABL device a try on a printer I received from a sponsor. Kits amazing and so is their customer support. Answered all my questions quickly and with the highest of detail to make sure everything was covered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vaughan Monnes",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T03:35:33.000Z",
          "Titre": "Awesome Support",
          "Contenu": "Whether dealing with major or minor problems, Support Staff is extremely efficient in finding solutions and demonstrating a real interest in customer 3D printing success!  My issue related to the Visual Studio Code for the Unified Firmware.  The problem I encountered was my own doing, however, and Tor solved the issue quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keoni A.",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T00:19:20.000Z",
          "Titre": "Where do I begin?",
          "Contenu": "Where do I begin, I've purchased a few products from TH3D such as belts, the EZPI kit, and the EZABL and their service has been wonderful. Fast shipping and solid notifications. But where they really shine is in their customer service. Mac and Peter have been the best help I've received from a company before. They've been patient with helping me with my printer working with me well over a month now due to time zone constraints and I feel that most companies would've turned a customer away well before this point. Their troubleshooting skills are top notch and their responses are quick and very detailed. Thank you Mac and Peter for all of your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Half-Blood Prints",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T22:02:41.000Z",
          "Titre": "absolutely spot on",
          "Contenu": "products are exactly as described.  documentation for products is easy to locate and utilize. packaging and shipping is top notch.   provided you have the needed technical skillset/understanding to utilize these products, they are perfect for the job.   should your understanding be lacking, the documentation is very well put together and easy to find - with a little light reading, anyone should be able to follow the documentation with very little issue regardless of how novice or professional you are.   zero complaints w/ this business or their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Dellett",
          "Nb_Reviews": 2,
          "Date": "2021-07-22T22:30:41.000Z",
          "Titre": "TH3D has some of the best products at affordable prices",
          "Contenu": "TH3D has some of the best products you can buy for your 3D printer.Everything I have purchased has been of exceptional quality at a very reasonable price. I have ever only had one issue with one of their products and their support team went above and beyond to make things right.I'm now a lifetime customer, thanks to the staff at TH3D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T03:48:11.000Z",
          "Titre": "great sales and service",
          "Contenu": "easy to find the products You need on the site they ship fast and package well always a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K.fegley vipergtsr",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T22:29:48.000Z",
          "Titre": "great products",
          "Contenu": "i have been using th3d's products on my 3d printer..the products are GREAT and work as expected. There customer support team is very Is knowledgeable, friendly, and take the time to help you out. I personaly recomend them to my friends who also have printers. Recently i was able to assist them by sending in my printer bed to help them out. I will continue to support this company to the end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raul Raygoza",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:01:59.000Z",
          "Titre": "Tim and his crew are quick to answer…",
          "Contenu": "Tim and his crew are quick to answer questions and give great advice. Strongly recommend this company for all you 3d printing needs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Kelly",
          "Nb_Reviews": 5,
          "Date": "2023-07-26T14:44:37.000Z",
          "Titre": "Great to deal with",
          "Contenu": "They have been very helpful (and patient I should add) they have pointed me in the right direct and started to sort my problems out.  I highly recommend these people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey Grotheer",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T21:43:28.000Z",
          "Titre": "Customer service is top notch",
          "Contenu": "Customer service is top notch, answered very quickly.  Was not disappointed!  Will buy product from them again and recommend to anyone who expects the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Marcy",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T22:00:32.000Z",
          "Titre": "Excellent sale, excellent service.",
          "Contenu": "Purchased a number of items from Tim, delivered in days, exactly as ordered.  I had a technical question that I needed help with and Tim got back to me within the hour. Highly recommend this small business, he does good work and wants you to succeed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cj Dennis",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T11:25:59.000Z",
          "Titre": "Ender 5 + ez board",
          "Contenu": "Ordered a ez board for my ender 5 plus. Had some coding issues that they were able to help with pretty quick. Great customer service and products. My printer is almost silent compared to before. If you have a 5 plus you know how noisy they get. Th3d has an awesome team! Will definitely buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Elliott",
          "Nb_Reviews": 4,
          "Date": "2021-11-04T22:58:42.000Z",
          "Titre": "Everyone at TH3D is A-W-E-S-O-M-E!!",
          "Contenu": "I have relied on TH3D for about 3 years now.  They just keep getting better and better.  Customer Support is the best in the business.  Tech Support is just as awesome.  The products they make, brand, and sell are top-notch and they FULLY support them.  I have not had any other company except Prusa do this.If you are looking to upgrade your 3D printer, or just your 3d skills, this is where you should start."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Green",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T16:50:32.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, and great products.   I made a mistake when entering my order, and the sales people were able to correct it within minutes of receiving my phone call. Also, all the products I have received from TH3D have been excellent.  The EZABL is an enormous help, and the EZPI is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T14:58:24.000Z",
          "Titre": "Great product and even better people!",
          "Contenu": "Great product and even better people!Have great product and support is top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen Leszczynski",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T03:57:57.000Z",
          "Titre": "Awsome stl pack for the multi mount!!",
          "Contenu": "Awsome stl pack for the multi mount!!Perfect fit at the perfect price.  Also love smaller business!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 14,
          "Date": "2023-05-31T20:49:26.000Z",
          "Titre": "Tim was helpful and patient with me",
          "Contenu": "Tim was helpful and patient with me. Turned out I had a fault on my motherboard. I bought one of their EZBoards. Every bit of information I needed to install it and flash the firmware was on their website. Thanks,I will be back in the future."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Filippo",
          "Nb_Reviews": 7,
          "Date": "2021-03-21T08:04:56.000Z",
          "Titre": "BAD EZ Out (Pin 29) Kit for Anet",
          "Contenu": "I ordered EZ Out (Pin 29) Kit for Anet A2, A6, A8, A8 Plus, E10, E12, E16Order n. 321089 on  31/12/2020.The material never arrived.Support told me that I could choose between a refund (excluding shipping) or reshipment.I requested a new shipment and after few days was told that the material was no longer available.I pointed out that the material is currently available on the site.I was told that they do not ship to Italy.(They could tell at the first order)I accepted the refund, I lost more than half of the money (shipping costs), I lost 1 month and a half, I don't have the material.Bad service, bad experience.Absolutely not recommended.NEWS :Now the support of TH3d made a contact to me.They say they will try to resolve the issue.NEWS :TH3D has again arranged an order for me without charging me the shipping costs.I received the goods without further costs.Now i am satisfied with the customer managment of TH3D support. Thank you TH3D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David M.",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T22:33:59.000Z",
          "Titre": "Excellent support and service!",
          "Contenu": "I've been using th3d for a few years now and they have been awesome to deal with. I've bought their ezable and just got some of their filament. It's all been great. I did have one issue with an order where a package was lost but they took care of it right away. I love getting my printer parts from them. They're awesome people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Wharton Echo Tech",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T21:07:54.000Z",
          "Titre": "One of the best 3d printing companies…",
          "Contenu": "One of the best 3d printing companies in the industry. They have high quality products, great customer support, and they make my printers run to their best ability."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete Garofalo",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:00:53.000Z",
          "Titre": "I got a great deal on the plate for my…",
          "Contenu": "I got a great deal on the plate for my Sovol SV 01 3D printer. Great customer service too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T21:28:20.000Z",
          "Titre": "Awesome products and great people",
          "Contenu": "These guys make awesome products. I bought multiple big tree tech boards from Amazon and they all failed in a few months. I bought their ezboard and it's been printing for 6+ months straight with no issues. Their web firmware site is amazing. I buy everything I can from them. Their support people are super nice and the owner took care of an issue I had for me with no problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T20:13:20.000Z",
          "Titre": "Great Local Small Business",
          "Contenu": "Always a pleasure dealing with Tim and his crew.   Quick response to any emails and or  tech questions, and quick shipping on in stock products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick H",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T22:22:41.000Z",
          "Titre": "They have been more then helpful",
          "Contenu": "They have been more then helpful after the shipper ruined my stuff. It was absolutely NO fault of TH3D's packing. They were very quick to respond and followed up on every step. They were polite and courteous the whole way through. I never felt like I was being treated as a 'number'. I've tried other products of theirs in the past and have always been happy. I will be buying more for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hughes",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T11:35:23.000Z",
          "Titre": "A+++ for Th3d",
          "Contenu": "I have purchased one Ezboard and two Ezabl’s. Shipping has been quick and products well packaged. Support has been equally efficient. I needed a little help on my first Ezabl and it was quick and well explained. Th3d is my first source for parts as a result."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Paulo",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T09:48:49.000Z",
          "Titre": "custom software",
          "Contenu": "Easy to custom and compile for Creality Ender 3 Pro"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sinzin",
          "Nb_Reviews": 4,
          "Date": "2023-06-05T15:29:54.000Z",
          "Titre": "Flawless experiance",
          "Contenu": "Flawless experiance, everything shipped quickly and was the right parts. The 3D printed parts fit great and have helped with my bed leveling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Wilkinson",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T21:31:26.000Z",
          "Titre": "I have purchased over 25 orders from…",
          "Contenu": "I have purchased over 25 orders from TH3D Studio and I have always had a positive experience. The company and employees really care about the 3D printing community. Yes, you can probably find some of their products cheaper somewhere else, BUT then you will not get the excellent customer service support that they give. If you have a problem with an order they will always work with the customer to make things right. As with any business, there can be the occasional customer that has unrealistic expectations and can't be pleased (no matter what) but that is the unfortunate reality for any business. I have always found the products they sell to be of excellent quality and TH3D will always keep the customer informed about possible delays for their order should that happen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus",
          "Nb_Reviews": 2,
          "Date": "2021-07-22T21:27:08.000Z",
          "Titre": "Great company, great products, great support.",
          "Contenu": "I've made multiple purchases from TH3D over the years. Their products are top notch. I love their Tough Tube and their flex plates. I've also used their firmware multiple times over the years, across a span of 20 printers or more. I've never had an issue with any of my products and I will continue to shop with them in the future."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Don St-Amant",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T19:02:00.000Z",
          "Titre": "These guys are awesome",
          "Contenu": "These guys are awesome!  They'll take the time to walk you through whatever issue that you may have with their products!No complaints from here, very satisfied and will be my place to go to when I need parts for my 3d printer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willow Junction Apts.    Mert",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T13:21:00.000Z",
          "Titre": "What make’s this company Stand out…",
          "Contenu": "What make’s this company Stand out Above all the Rest. EVERYTHING always EXCELLENCE At it’s Best.     MMCNC.       Mert.       Thank You to Tim and Staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Stenman",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T23:01:01.000Z",
          "Titre": "These guys are the greatest",
          "Contenu": "These guys are the greatest. They have the best upgrades money can buy. There customer service is above par which is where a others are lacking. Especially China."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:05:31.000Z",
          "Titre": "Great place to buy from",
          "Contenu": "Great place to buy from! Great products at good prices and prompt shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Brown",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T02:30:35.000Z",
          "Titre": "Excellent customer service help in the…",
          "Contenu": "Excellent customer service help in the order shipped out on the same day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Lockard",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T09:15:34.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, product worked as expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerhardt Vikar",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T23:47:07.000Z",
          "Titre": "Amazing support on fixing a firmware…",
          "Contenu": "Amazing support on fixing a firmware problem. Tor did a lot working on finding the problem I had"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Dugan Author",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T22:24:00.000Z",
          "Titre": "My CR-10 up and died",
          "Contenu": "My CR-10 up and died. Luckily Tim and Peter at TH3D were there to supply the parts I needed, quickly and affordably. I can't tell you how much time and aggravation they have saved me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tanner hein",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:38:11.000Z",
          "Titre": "always quality products and fast…",
          "Contenu": "always quality products and fast shipping, my go to for printer upgrades and firmware"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mr jaysen singh",
          "Nb_Reviews": 4,
          "Date": "2020-10-07T19:26:58.000Z",
          "Titre": "Excellent service from the team at…",
          "Contenu": "Excellent service from the team at TH3D. Really helpful and quick replies. Decided to get the EZABL for my new printer build. I’ve used there firmware for along time and it super easy to use and most of all it works like a charm. Shipping is really quick too all the way to the UK in 5 days. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 4,
          "Date": "2020-10-07T19:56:00.000Z",
          "Titre": "Bought their board as well as their abl…",
          "Contenu": "Bought their board as well as their abl and filament sensor and all are great products.Do exactly what they say on the tin and they are great quality.Firmware can be very tricky. They do it for free. And it’s highly recommended. I use it on all my printers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Bayer",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T18:31:02.000Z",
          "Titre": "Great products at a reasonable price",
          "Contenu": "Great products at a reasonable pricePatiently answered my questions, even when I repeated myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Oldenburg",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T20:55:19.000Z",
          "Titre": "you MUST check out TH3D for 3d printing supplies and they even sell quality COEX filament",
          "Contenu": "great bunch of guys, always helpful, great products and support for them. highly recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alec",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T03:30:30.000Z",
          "Titre": "Wow they’re just the best",
          "Contenu": "Wow they’re just the bestShipping is always fast and furious! I don’t know how they do it but they always do do do! 10/5 stars! Maybe 11!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Oldenburg",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T01:48:13.000Z",
          "Titre": "great resource",
          "Contenu": "great bunch of guys, always helpful with their products and services. highly reccomend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold Weppler",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T00:57:54.000Z",
          "Titre": "Tim has helped me fix all my issues…",
          "Contenu": "Tim has helped me fix all my issues printer and computer related."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emerson Corder",
          "Nb_Reviews": 4,
          "Date": "2023-07-06T00:01:58.000Z",
          "Titre": "Great Products & Customer server",
          "Contenu": "The title says it all. The products are great, and the customer service is top notch. The owner is a great guy. Support small business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Dalrymple",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T00:38:28.000Z",
          "Titre": "Definitely a regular customer",
          "Contenu": "I first used you guys a few months ago. I bought filament sensors etc. Since then, I’ve ordered from you at least every 2 weeks. Bought an EZABL mini, and I thought it was the best thing ever. I still think it great but your EZ Flex 2 system is the new BEST THING EVER. I hadn’t had a single successful print on my CR-10 S5 since I bought it. Nothing would stick to it, it tried everything I could use to get prints to stick, short of concrete or welding. I’ve just taken my full size, one piece, R2D2 dome off the EZ Flex 2 on the printer. No glue, no hairspray just a naked EZ-Flex2. I’m about to order a bunch more for all my printers. Only complaint about the EXFlex is, it almost cost me my left  nipple. Strong magnet, large surface for magnet to snap down very quickly and firmly and sitting too close to the bed as I was doing it. I’m sure you can picture what happened. (You can’t make stuff like that up)🤣🤣😷😷👨🏻‍🚀👨🏻‍🚀LOVE you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marvin Ballard",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T17:37:28.000Z",
          "Titre": "Unmatched service",
          "Contenu": "Unmatched service! TH3D is my go to site for parts. Everything they sell is top notch. All of the hotends, ezabls, ezboard and other parts I’ve purchased from them have worked great on my printer."
        }
      ]
    }
  ]
}