{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.tadibrothers.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NLB",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:32:02.000Z",
          "Titre": "Inferior product",
          "Contenu": "I ordered a backup camera for my F150 Truck with the expectation of easy and quick installation, as assured by the salesman. However, upon receiving the package, the only thing that proved easy was installing the rearview mirror. Despite seeking assistance from TadiBrothers, I found minimal support. Consequently, I had to resort to a mechanic for installation, incurring additional costs of over $300, bringing the total expense to over $600.Unfortunately, the camera's performance fell short, offering a subpar view compared to any stock backup camera I've used before. Additionally, the camera malfunctioned after only about a month of use. It remains unclear whether the issue lies with the installation or the camera itself, leaving me dissatisfied and back at square one.In hindsight, I regret not opting for Ford's installation services. If you're considering a backup camera, I strongly recommend going through a dealer. I've learned from this experience and won't make the same mistake again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessie",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T00:18:50.000Z",
          "Titre": "Not worth it",
          "Contenu": "Terrible service. No follow-up after purchase, no installation instructions, paid for screen with remote and upgraded angle camera but did not receive remote and camera sent was the standard version. Made no attempt to notify me they were out of stock of the upgraded camera yet still charged me for it. Later, found same camera system on Amazon for half the price!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T00:44:34.000Z",
          "Titre": "Tadi Brothers sent me a defective rear…",
          "Contenu": "Tadi Brothers sent me a defective rear view mirror monitor.  I returned for repair or replacement, and they told me it worked fine for them and they required me to pay for return shipping.  When it came back, it was still not working.  When I called them to let them know issues still existed, I was asked to send video of the issue.  What I don't like is:  (1) they act like they don't believe you.  (2) they don't really stand behind their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Turner",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T00:56:13.000Z",
          "Titre": "I wouldn’t even give 1 star",
          "Contenu": "I wouldn’t even give 1 star. Customer service totally inept. Worst experience I’ve ever had. They lie and then try to upsell you. Very unprofessional and unscrupulous. Stay away from them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Turner",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T20:46:24.000Z",
          "Titre": "Very  helpful   easy to understand",
          "Contenu": "Worst experience in my life. After paying extra money for 2 days shipping  i find out 5 days later the order never went in. Supervisor tried to accommodate me. Kept pushing me to take down my 1 star review which would’ve been zero stars if that was an option. He told me he would send the order out overnight mail if I took down the review. Spoke to him again today and he said I would get the order Wednesday or Thursday. I said you told me overnight mail which apparently is 3-4 days for him. That’s when I asked for a refund. He then called me and offered me money to take the review down. I said no. Stay away from this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T02:15:54.000Z",
          "Titre": "Having to by antenna with extended…",
          "Contenu": "Having to by antenna with extended cable because the camera that I bought from here does not have the range promised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wesley Booth",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T11:52:37.000Z",
          "Titre": "Camera got water in it after 4 months",
          "Contenu": "Update 2/6/23 These people are the total worst. After posting the initial review they literally called me and texted me up to 4 times a day claiming they wanted to \"make me happy\". I do not agree with their claim. They dont care about making me happy, they just wanted this 1 star review taken down. The only way they were going to send me a replacement camera was if I took this review off. A camera by the way should have been replaced right away due to warranty.  Gabe with Tadi Brothers would absolutely not send a replacement camera unless I took this review off.I double down on my review. These guys sell cheap cameras you can get on amazon for 50 bucks then slap a Tadi Brothers sticker on it. On top of that they dont cover their warranty. You guys are sleezy, pushy and strong arm people for minimal amounts of money.So i still dont have a replacement camera that should be covered under warranty and doubt ill get one because this review is staying up. What a great company right?Original review: 1/18/23 Camera got water in it after 4 months. Sent it back and they claimed i tried to switch cameras. They claimed the serial numbers didnt not match from the order. There wasnt a single serial number on any of the equipment. Lying cheap company that sells chinese basic cameras with their stickers on them. Stay away unless you want to waste money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig R",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T15:37:05.000Z",
          "Titre": "I now know how they have so many great reviews.",
          "Contenu": "Update: I was again forced to change my review so it could be published. Apparently Trustpilot believes in double standards for the use of peoples names on reviews. As long as you are praising them it is ok but if you have bad review trustpilot will remove it for the company. I now know how they have so many great reviews.Got an email wanting more info. Not much more info to give it is all spelled out right here. CS Guy was extremely rude, lied and called coworkers really ugly names. It started out good but went down hill in a hurry. First CS Guy refused to ship my part they owed me period until I removed the bad review I had put here. Claims his boss made him do it. If this is the way they do business stay away. This is mafia style business. They sent me two side cameras instead of a side and rearview. First customer service guy said they couldn't replace my the camera without them first having the wrong camera in hand. So then I was put in touch with CS Guy. Boy is this guy a joke. He would climb highest tree in the land to tell you a lie before he would stand on level ground and tell the truth. Talked to him on July 3 he swore to me my package would be sent 2nd day mail on July 5. so it would be here before we left on vacation. That was a lie it wasn't shipped until July 7 standard shipping which already guarantied it would not be here for our 3000 mile trip. Then USPS sent it to Maryland and it got lost and didn't show up for 5 days after we left on vacation. Also unless you have absolute line of site the wireless is a waste of money. Had a guy that had a $50.00 camera on a 32' trailer that the wireless worked like a champ. CS Guy need not see this and call me. If anyone calls one of the owners he claims made him make me removes the review needs to all. Ohhh yeah boss he also said your useless nephew was what started all of the problems and he doesn't deserve a job. I can't repeat here all the nasty dirty names he called him"
        },
        {
          "Note": 1,
          "Pseudo": "JOE BAIR",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T21:11:05.000Z",
          "Titre": "Tired of pop up adds including this…",
          "Contenu": "Tired of pop up adds including this ratings pop up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J W",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T13:30:15.000Z",
          "Titre": "Scam artists …",
          "Contenu": "This company is basically a scam artist.  They gave me very bad info about their products size.  When I received it and called them out on it, they told me to “rig it”!  So I returned the unused product per their instructions with their return authorization number.  They refuse to issue a refund and somehow tricked my credit card company into not allowing me to dispute the charge.   I strongly recommend finding another company to buy these kind of products from.   Don’t be scammed like I was.Notice all of the positive reviews were “invited”."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T18:00:39.000Z",
          "Titre": "Customer Service - John/Update",
          "Contenu": "John assisted me with a return item and was very helpful.Update:  I was told to leave a good review so I would not be charged shipping for the returned item.  After I received the refund, I noticed they charged me anyways.BEWARE of this company!  My first shipment had a cracked screen, second shipment was missing the backup camera, third shipment was sent with a used camera in an open box which was missing the power cable.  After all of this they told me to find a Bestbuy and purchase a new power cable which could be reimbursed at a later date.  I opted to just give up and ask for my money back.  That's when I left the original review.  I really hope this review scares any further customers away.Hey John, how do you like this review??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Beaucage",
          "Nb_Reviews": 1,
          "Date": "2013-07-02T15:22:22.000Z",
          "Titre": "Do NOT buy from this seller!",
          "Contenu": "I purchased a backup camera from this seller, and it was one of the most unpleasant experiences I have had in recent memory.  The monitor and camera I purchased came with no instructions, and I had to pay someone to install.  The seller advised me that the product was wireless and would have all of the necessary components needed to install as a wireless system.  As it was, the installer told me that the wireless devices they provided were not adequate and they ended up having to install as a wired device, which added to the cost of the installation.  It appears that the sales reps at Tadi are not very well versed in their products.   In this case, buying on the internet was a very unpleasant experience.  I also had difficulty getting a list of installers from the seller (Tadi)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2011-11-02T20:20:46.000Z",
          "Titre": "Lacking Communication.",
          "Contenu": "Products received, DOA. Called customer service on several occasion and could not get a person on the phone nor e-mail response. Worse online transaction ever!!! Avoid this merchant."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DonnaM",
          "Nb_Reviews": 1,
          "Date": "2010-12-07T13:47:01.000Z",
          "Titre": "Worst online purchasing experience ever",
          "Contenu": "Bought a backup camera and there were no installation instructions. The mechanic installed it and it did not work properly. When I called Tadi for assistance, both brothers just yelled (yes, yelled) at me liked spoiled children. \rThere was something wrong with the camera. They said my mechanic must be stupid because apparently a baboon can install these cameras. I had just paid $200 to have it installed and a hole had to be drilled into the bumper to accommodate the camera so needless to say, I was incredibly disappointed with their attitude. All-in-all, a $385 kick in the head: $200 to have it installed, $80 to have it uninstalled and $40 to ship it back plus the $65. they charged me for the wire that was left in the car (otherwise it would have cost double to take that out too and apparently this is a standard wire that can be purchased for around $20) Very rude guys who blow a gasket without provocation. I hope they lose business because of this review; They deserve it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T15:00:05.000Z",
          "Titre": "Bad web site function",
          "Contenu": "Web site sucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake Mandel",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T17:02:57.000Z",
          "Titre": "Seems like Company Policy of Defrauding Refunds",
          "Contenu": "Purchased a backup camera a couple months ago. Didn't end up needing it so it was never opened and returned in original box. A few weeks later, a partial refund posts (even though they have a 100% hassle free refund policy). I chatted and called - chat person couldn't help and said to call. On the phone, they said not all the parts were returned which obviously a lie because the box was never opened. Now seeing other reviews, it's clear they've tried to defraud other customers this way. They said to email them and they will help sort it out, but they haven't responded to any emails. Had the chat -> phone -> email run around then radio silence. Had to dispute with the credit card company.Not sure how their products may be because we didn't use ours but if there's a chance you may have to return a product, either don't order from them or take pics of the items being returns and set aside 2-3 hours of your time fighting them on the partial refund they will offer at first (as it seems that's their policy of doing business).Edit: 7/14/22 1:40pm. Just received a call from them and from one of their customer service agents saying we should have been refunded the full amount. They then said they will refund it as soon as I take down this review. After telling them I wouldn't, they transferred me to another supervisor lying about the dates of delivery and return. I have all the proof and he further threatened to give me the refund only if I take down the review. I have the entire call recorded and will post the link here shortly for everyone to listen to how they do business if they do not do what is right and approve the refund by EOD today.Edit: 7/14/22 Shortly after. Tadi Brothers flagged my review and reported it a violation of Trustpilot policies (which it isn't). I email the phone recordings of them threatening me to remove the review and sent it into Trustpilot and they unblocked the review.Edit: Late Afternoon 7/14/22. After telling Tadi Brothers I was filing a complaint with the California Attorney General and them coming to their senses that they were completely in the wrong and continually lied to me, they gave me another call back and finally said they would refund the order. They said no strings attached but then said \"wouldn't the review be false now that they refunded me?\" I told them all the facts in this review occurred and it doesn't negate their previous actions but thanked them for finally issuing the refund I was owed. They asked to reconsider the review and maybe increase to 2 or 3 stars and said reviews like this hurt their business. I explained that they wouldn't receive reviews like this if they don't try to defraud their customers and treat people fairly and honestly.Overall, be very careful dealing with this company. I hope they take these actions to heart and start to operate their business in an ethical way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kr",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T18:49:33.000Z",
          "Titre": "Tadi Brothers and how my experience…",
          "Contenu": "Tadi Brothers and how my experience played out.1-11-22 Placed order with Tadi BrothersWhat I ordered:1- SKU97586 unit (this is the type that clips on the rear view mirror)1- CCD HD camera upgrade +$49.991-130 degree viewable angle on camera +$19.991-Moving grid lines +$52.99Furrion bracket & adapter +$29.99. Upgrades totaled $159.96 + 279.99 for SKU97586.  Order = $439.95. – 15% discount = 65.99.  439.95-65.99= $373.96 Final cost.1-18-22 SKU97586 Arrived.Ran a line from my car battery (used14-2 I had in the garage).What I got:1-SKU975861- The camera is NOT HD. The specifications sheet that came in the box stated it is :                               Effective pixels PAL 628x586, NTSC 510x496Horizontal resolution as 480TVLLens angle 170 degreesIP68 not 69“HD refers to cameras with a standardized resolution of 720p or 1080p. The numbers 720 and 1080 refer to the horizontal resolution. Therefore, 720p HD camera resolution provides images that are 1280 x 720 pixels that adds up to 921,600 pixels, which means a 720p HD camera is not technically a megapixel camera, and 1080p HD cameras provide 1920 x 1080-pixel resolution, or 2.1 megapixels”628 x 586 vs CCD HD I paid extra for.170 degree viewable angle vs 130 I paid extra for.Grid lines were fixed vs movable I paid extra for.Furrion bracket and adapter1-95’ transmitter vs the 70’ I was expectingBench tested and the monitor went to black & white after 3 minutes of being on. Called Tadi and find where you can talk to the sales department anytime service is “leave a message”Response:1) CCD HD Camera “ It is an HD camera, the specifications sheet is out dated” Really a manufacturer is going to include a specifications sheet that makes their product look like a lower grade than it is? NO\t  No mention to refund the $49.99.The picture in the monitor was MUCH worst than the back up camera in my car.2) 130 degree view “They do not offer 130 only 120, 150 or 170 degree”They never asked what angle I would like and the specifications sheet calls out 170 degree field of view”                                      \tNo mention to refund the $19.99.3) They supply a cable to mount the transmitter remotely BUT you must supply a cable to power the transmitter.As for the 95”  “ It is what we supply to all our customers to give them the best reception.4) Movable grid lines. “They do not offer moving grid lines, only fixed” \t\t\t\t\t\t\tNO mention to refund the $52.995) As it was only showing black & white I asked for a return authorization number. They sent me an email with the address to return it. Sent a reply to their email stating, as the unit was defective out of the box THEY should pay for the return shipping.They did email me a UPS label to print and attach to box.Took a picture off all components I was returning in the box. Sealed and sent it back.1-28-22I get a phone call from Tadi “They want to review a few things I did wrong”YA THAT WENT OVER WELLAs for Black & white “must be a bad solder joint”. Field of view “I got 150 degree” even though the specifications sheet called out 170 degree field of view” and they missed the WHOLE point I ordered 130 degrees. No comment on not being HD or moving grid line.Next they tell me the Furrion adaptor kit is not in the box, “sometimes people miss returning it and so they will be deducting that from my refund” The fact I took a picture of the contents of the box I returned to them back them up. I emailed the photo, which clearly shows the Furrion package in the box, to everyone I had an email for.Full refund was posted to my card.In closing a few more things to know other that items mention above:1) The cigarette lighter power adaptor is extra. This is mentioned in one of their videos.2) EVERYTHING you get is made in China.   FYI3) Caveat emptor"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S MacD",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T16:46:30.000Z",
          "Titre": "Update on \"No customer service\"",
          "Contenu": "I thought I had originally posted this May 23, but cannot find it on the Trustpilot review page! Makes me wonder who has control of what gets posted?? Ordered SKU 90113 on 3/17 including 3day shipping for $40 extra going on a trip wanted camera before departureConfirmed order 3/18 with a customer service representative (see previous review)Received tracking number/label created 3/21 package 1 of 2Actual ship date 3/23Package 1 of 2 delivered 3/27--TEN days from order day: monitor was broken.  Second package delivered 3/29.Customer Service Manager communicating with text and phone said he would refund three-day shipping costs and replace broken monitor, shipped to location in Arkansas. I had to pay ½ of three-day air so I would have monitor in time for next leg of journey.Installation of system took one full day.Total of four phone calls and ten texts with the customer service manager. Last two texts 4/17 and 4/28 requesting refund have gone unanswered. Shipping has not been refunded as of today, 5/2/23! Monitor seems fine but problems with Camera:Image is not HD, image is spasmodic and jerky, blanks out for three to five seconds after passing under overpass, signal drops out intermittently for several seconds, has a one to two second delay to display on monitor. Finally received a $368.29 refund on May 24. A partial refund of the incorrect $451 order, according to the Tadi Bros website for my account.  The actual order was for $426.24, including the three-day shipping that didn’t happen. I calculate that I am still owed $57.95.Absolutely a horrible experience. I recommend that you look somewhere else. Buyer beware.Updated Sept 7. \"I have received a full refund for the system. Thank you, gentleman who I think was an owner (no one wants personal information, especially names, to be included in these reviews).I have upgraded this review to two stars, only because one and a half is not possible. The experience I has has not changed—it was and will always be a nightmare experience.The gent who arranged the full refund seemed to be more interested in the number of stars in the review than the actual customer experience. As a matter of fact he asked, if I understood him correctly during an extended phone call in late July, that I either remove the One Star review or change it to a Five Star review because I have received the full refund. As I have said, the experience was what it was and that will never change. I told him that I would make my decision about changing the review once I had proof of the refund. The account is my wife’s card and she only informed me of the refund about a week ago. I apologize for the delay in responding to the refund. My personal integrity demands that I stand by the truth."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannon Parker",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T17:42:42.000Z",
          "Titre": "Overpriced Junk",
          "Contenu": "Overpriced Junk.  I purchased my original system from them back in 2018 when I was in LA.  I had nothing but problems with it.  They reluctently swapped out my system after a few months, and it had problem too.  It was always crashing, rebooting, cycling on and off.. ect.  I just became burned out with dealing with it... I wanted the DVR function to work reliably.. but it was very inconsitant.  I just lived with it because in my RV I really need it to be a side view monitor so I can see in the blind spot.. which it did do that 90% of the time.  Fast forward to 2022 and I damaged my side camera.  I called Tadi bros and they looked up my account, I gave them my credit card number, and they sent me camera for $90.  I set it aside for a couple months until I had time to install it, and when I opened the box, I realized they sent me the wrong camera.  I contacted them and asked for a return label, and they told me they don't issue them, and since it has been over 30 days I can't return it.  They offered me a \"discount\" on the right camera as a solution.  I finally found the camera I need on Amazon for $70.. the exact same camera they have marked up to $200.  I purchased the camera and hooked it up..it works fine.  The problem is the DVR function had stopped working altogether .. and the unit itself barely works now days.  I am going to just tear that piece of crap out and replace it with a MUCH better one I purchased on ebay for less that half the price...  I would avoid these folks because you are paying a premium mark-up for poor quality items, and poor quality service...EVEN WORSE.. Tadi Bro called me within MINITUES of posting this review offering a refund if I \"remove the review\".. I declined because they should do what's right, and THEN allow me to make a decision.. not bribe  or bully me into anything.  The then went to Trust Pilot to contest the review as if I was not a real customer in hope I would not respond, and thus silence me that way.. well guess what.. I AM a real customer, and I will respond with Proof to trust-pilot... Quit trying to silence the truth and do the right thing in the first place TadiBrothers!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis M Giaruso",
          "Nb_Reviews": 5,
          "Date": "2014-05-07T15:45:19.000Z",
          "Titre": "Barely adequate!",
          "Contenu": "I purchased the TadiBrothers backup camera system:   Pickup truck wireless seven inch mirror monitor and license plate/frame camera.  All was delivered in about 10 days.  The installation was reasonably intuitive.\r The instructions are plentiful, but are “one size fits all!”  In other words, none of my backup system components looked like the pictures shown in the graphic instructions; you have to know how to “read between the lines.”\r The 7” mirror backup camera system functioned, but it was woefully useless in my circumstances.  I have a small pickup truck and during daylight hours, the light flooding into the cab was so bright, it was totally impossible to see the transmitted image in the mirror monitor.  The angle of view for the backup camera was 90°, not the 120° angle advertised on the TadiBrothers’ website.  I checked the angle by triangulation. \r I emailed TadiBrothers who responded by suggesting replacement of the “defective” 90° camera and swapping the mirror for a seven inch monitor.  They even offered to pay for shipping of the returned components.  I accepted.\r The replacement license plate camera still has the 90° viewing angle, not the 120° advertised.  I found the 90° to be sufficient for my purposes, so I accepted it.  I have the new monitor mounted under the dash out of the light.   It works adequately, but the colors are not reproduced faithfully.  No amount of adjustments of color, hue, brightness, or contrast could improve the color.\r CONCLUSION:  My TadiBrothers backup camera system is acceptable for viewing low and behind.   They did come through with something that works for me.  My only suggestions are that TadiBrothers should make their instructions more system specific and investigate why they sold me a 90° camera instead of the 120° camera advertised.  Also, they need to warn customers of the inadequacy of the mirror type monitor.  I feel TadiBrothers’ intentions are good, but I think their backup camera systems need serious company scrutiny."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:03:25.000Z",
          "Titre": "I havent had an experience to rate yet…",
          "Contenu": "I havent had an experience to rate yet but the screen wont let me move until i submit this"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monte",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T03:29:32.000Z",
          "Titre": "Rose in sales chat argues with you and…",
          "Contenu": "Rose in sales chat argues with you and gives answers that are not truly straight forward and the whole process was difficult to get answers to exactly what we needed.This is a very high-pressure sales business. After a supervisor called me directly and requested this review to be taken down and promised me the moon to do so, I stood firm on my promise to edit the review after he did his part.  That's part of the way you review things after following through, and I will continue to stand by this review if the product or promises do not happen. I was also promised that he would make sure everything worked before it shipped, I hope this is not the way they get rid of the bad, open box, or returned stock. Now I have to prepare to find a place to store the moon if the supervisor does in fact make this happen.Update, the sales experience obviously has not changed that's history. Yes the supervisor did give me his direct phone number and when the product did not work he pointed out where to look for a small red light. It was not working so 3 hrs later I was able to locate a replacement fuse and the system started working. While Rose kept insisting the cameras would work from 150 feet I have enough experience and common sense to know the 150 feet is strictly in open areas, not 150 feet or even 35 feet through a camper behind my truck. The signal and picture does not refresh fast enough to keep from hitting something if you are using it to backup. This is not the companies issue but a fact of how wireless works still something I was told would not be a problem.As of 7/21 I am updating the review from the original 1 star to 3 stars because it at least works some of the time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Scheideberg",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T14:49:47.000Z",
          "Titre": "Tough to get a straight answer out of…",
          "Contenu": "Tough to get a straight answer out of customer service. Had trouble with a rear view mirror monitor. The suggestions to isolate the light from the monitor using cardboard is ridiculous. They also said that excess light was reflecting into the camera, they offered me a sunshadethat had had to be modified to fit and it still didn't fix the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy Evans",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T19:45:44.000Z",
          "Titre": "Monitor problem and NO help",
          "Contenu": "UPDATE: I had a manager call me after initial review and he was very helpfull, He personally gets 5 stars *****. He imediately refunded the 15 dollar handling charge and offered a discount on a different system he thought would work, most importantly, he understood and knows about the monitor problems. I updated my rating from 1 to 3 for his efforts. The company still has its issues, as for all the hoops they had me jumping through for months. I chose a different brand on the system, although at the end they were helpful, I have trust concerns with TadiBrothers as a whole. ORIGINAL reveiw: Had problems with the system out of the box. I called, sent emails and pics to which they ignored. I continued to have problems and they asked me to sent it back, at my expense, they plugged it in and it worked. I talked with them at that time and told them I could do that to, but doesn't work in real world conditions. I asked them to put it in freezer and try it, which they did not.  They returned bad system to me, and I did the trouble shooting to prove that the monitor fails below freezing. I just wanted a monitor that worked. They treat every call as a new complaint, even though there is a long record of emails, pictures, videos and phone calls on record, very frustrating. Finally after 3 months of stress, 20 plus hours of my time, they asked me to return the product for a full refund. So, i sent it back, again, at my expense. Finally get refund 18 days after they receive it, for $260.04, but the purchase price was $274.99. So I have lost the $30 in shipping, and then they take take an extra $15 from me for good measure. At 52 this has been the worst customer service I have received, dishonest and disgusting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Coursey",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T16:38:48.000Z",
          "Titre": "Changing my response to 3 stars since…",
          "Contenu": "Changing my response to 3 stars since there is no way to get out of giving a review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki Murray",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T03:35:01.000Z",
          "Titre": "customer service",
          "Contenu": "It was a bummer the system and our Furrion preset up wouldn’t work.  Tech support tried helping but to no avail. We return the system once the return department emailed specific return directions and yet we were docked a restocking fee.  After talking to customer service, they said they will provide the full refund.Both employees I talked to on the phone were pleasant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keegan Williamson",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T01:41:12.000Z",
          "Titre": "I wasn't offered a extended warranty."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Knapp",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T14:59:21.000Z",
          "Titre": "Never given a chance to enter…",
          "Contenu": "Never given a chance to enter \"summer20\" at check out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walt",
          "Nb_Reviews": 1,
          "Date": "2014-01-17T18:58:50.000Z",
          "Titre": "So far good product but terrible install instructions",
          "Contenu": "After ordering online, promptly received products. Bought system that required drilling hole in rear door of vehicle for camera. To do installation of camera, wiring and wireless transmitter obviously had to remove paneling for inside access. Installed all the system  paying attention that there is no orientation mark on camera and nothing in instructions to tell that camera is required to be rotated to a certain point for it to see the world as it is. Put all the paneling back on and installed monitor system up front. Turned on system to find that the camera needed rotated about 1/4 turn because it was seeing the world sideways. Because of this had to retake paneling and dirt barrier back off hatch door, rotate camera then reassemble. Would it not be a huge customer service to put an orientation mark, an \"UP' or \"TOP\" marking or something on camera or at least mention it in the instructions. Removal and installation of the access panels and dirt barrier were no fun to remove and install the first time, let alone the second time. This is surely not the first time that an installer has encountered this and mentioned it to the seller. The jury is still out on the dependability and durability of the product but getting a good set of installation instructions would be huge. Might want to mention also that there is very gray areas of presentation of product on their prepared presentation. 7\" mirror monitor is good representation of its width but would be nice to know the height of it because it takes up so much room it is vision infringing looking out the windshield and is maybe even unsafe. Don't feel like I have been lied to but just feel like  the problems I have encountered are probably things other  customers have encountered but the seller is not as concerned about good service as good sales."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:26:39.000Z",
          "Titre": "revi",
          "Contenu": "As expected, difficult to check out"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Simon Igoche",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T11:17:22.000Z",
          "Titre": "Great Cameras",
          "Contenu": "Sharp cameras for the review of my car and unbelievable prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard  Clough",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T18:46:25.000Z",
          "Titre": "Rose was very helpful and…",
          "Contenu": "Rose was very helpful and accommodating. When placing my order on your website and not being able to provide payment on site, I got concerned about a  possible scam. Being forced to call to record payment was even more concerning. When Rose mentioned my previous purchases, I began to relax. If I hadn't purchased before and Rose had not recited those purchases, I don't know what I would have done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rudy Aquino",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:52:40.000Z",
          "Titre": "Rose",
          "Contenu": "Rose, answered all my questions on several different systems, i wanted to be sure i had the information to make an infomed decision on my purchase.she was very patient with my questions, and she was very knowlegable about the many different product systems i was inquiring about."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Hale",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T21:53:10.000Z",
          "Titre": "Thanks, but just a little rushed.  Great product support!",
          "Contenu": "Thanks, Rose. You were very knowledgeable about the various product offerings, so thank you. I felt just a little rushed during our call.  If I had not already done a significant amount of on- line research before my call with you, I think I would have felt too rushed to make up my mind and complete the the transaction during our call, and probably would have waited. You seemed to be a bit in a rush to get to the closing of the sale. This was a large purchase and I didn’t think you were sensitive to that.Edit 5/22Product Support is outstanding.  Received my system two days ago and started install today.  Noted a small error in the order fulfillment and customer service sending me a replacement  immediately.  Thank you. also, Installation instructions spot on!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Heisterkamp",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T18:17:16.000Z",
          "Titre": "Communication improved",
          "Contenu": "I have had to contact via email each time to find out the status of my order. And push the order along to fulfillment. So far received a connector for a camera and monitor. But nothing else.Updated review: Was contacted by customer service who relayed their apologies and an explanation of the delay for delivery. Received camera and monitor on the 3-8-23. Unfortunately am returning the package as the monitor was far to small for the dash opening and there was no adapter to make it fit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhea",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T08:59:39.000Z",
          "Titre": "The website is word heavy so takes time…",
          "Contenu": "The website is word heavy so takes time to read through all of it to be sure you are purchasing the correct items. I appreciate the RV GPS with backup camera option. This is the only place I could find one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOEL L ESKENAS",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T17:20:02.000Z",
          "Titre": "You make it easy",
          "Contenu": "Web-site was helpful in finding what I was looking for.More then one option available.Payment options were a little confusing.I already have a Pay Pal account. Why another credit check??"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HyeSierra",
          "Nb_Reviews": 3,
          "Date": "2023-05-27T20:07:48.000Z",
          "Titre": "Return customer",
          "Contenu": "Return customer. Their products have always been quality made. I have found their website quirky and hard to make my desired choices, to the point that I have given up in the past to make the purchase I made today."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "david burley",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T02:15:22.000Z",
          "Titre": "ease of use",
          "Contenu": "ease of use buying for the motor home"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Guylian Kapel",
          "Nb_Reviews": 14,
          "Date": "2023-04-20T11:30:26.000Z",
          "Titre": "TadiBrothers is a great place to find a horse.",
          "Contenu": "TadiBrothers is a great place to find a horse. They have a huge selection of horses, and if you aren't looking for something specific they will find it for you. I got my first horse from them, and loved every minute of it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael VanMeeteren",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:18:53.000Z",
          "Titre": "Representative was kind and courteous…",
          "Contenu": "Representative was kind and courteous and resolved my issue immediately"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T22:14:57.000Z",
          "Titre": "Clear communication and I didn’t have…",
          "Contenu": "Clear communication and I didn’t have to wait on the phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TK",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T00:13:54.000Z",
          "Titre": "Checkout had some glitches",
          "Contenu": "Checkout had some glitches. However, it may be my Google browser as it has auto-complete."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Sucipto",
          "Nb_Reviews": 6,
          "Date": "2023-04-22T12:38:40.000Z",
          "Titre": "Tadi Brothers is a reliable and…",
          "Contenu": "Tadi Brothers is a reliable and customer-oriented company that provides top-quality backup camera systems and other related accessories. Their products are also well-designed and easy to install, and their customer service is exceptional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RAY Ramsden",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T21:32:48.000Z",
          "Titre": "they were helpful with questions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Fries",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T01:02:51.000Z",
          "Titre": "easy to do bussiness with",
          "Contenu": "Easy to navigate the web siteEasy to communicate witheasy to ordereasy to do bussiness with"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haily Buffman",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T04:53:23.000Z",
          "Titre": "Poor shipping, good customer service",
          "Contenu": "Hans helped locate the different parts of my order and make sure they were shipped out from different factories. I had not had a positive experience so far with Tadi brothers except for Hans, who went above and beyond. The original man I spoke with about what I needed in a camera suggested I do an order with him over the phone to insure I got the best discount. He then forgot to apply a discount to my order and had to refund the difference when I asked about the promised discount. A week after placing my order I called to inquire and found it had not been shipped. The man on the phone this time confirmed my order would be sent out that day by 2pm from the California warehouse as the Midwest warehouse was out of stock of some of the parts. I wasn’t thrilled as they were shipping ground from California to Michigan, a week late. I then called two days later and spoke with a man named Hans who informed me the order had STILL not been shipped and went out of his way to make sure the order was shipped for me. I appreciate his help immensely as I cannot leave for my winter work plans until my camera is installed on my trailer. Thank you Hans."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Stang",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T21:53:16.000Z",
          "Titre": "clear description of the products",
          "Contenu": "clear description of the products . Quality is important to me and the products are of fine quality ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Bowles",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:45:44.000Z",
          "Titre": "Newbee purchase and review",
          "Contenu": "Good information to the use of and mounting of the cameras and mounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Tapia",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T21:11:01.000Z",
          "Titre": "Looking for RV back-up camera",
          "Contenu": "Looking for RV back-up camera, many options available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Stone",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T21:53:38.000Z",
          "Titre": "Easy to navigate and find what I was…",
          "Contenu": "Easy to navigate and find what I was looking for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Toscano",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T01:49:49.000Z",
          "Titre": "Backup Camera",
          "Contenu": "It was very easy to navigate and order the product tonight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wallace",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T00:52:03.000Z",
          "Titre": "Great sales video",
          "Contenu": "Great sales video. Sold me.Would have been 5 stars but it was hard to find the coupon code button on a small cellphone screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T22:07:01.000Z",
          "Titre": "great and easy ordering",
          "Contenu": "great and easy ordering. I do not like that your forced to leave a review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Michno",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T06:22:30.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, fair price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy Shammo",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T19:20:40.000Z",
          "Titre": "waiting for delivery",
          "Contenu": "The video was very informative.  Made it easy for me to make my choice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Starkey",
          "Nb_Reviews": 3,
          "Date": "2023-01-10T21:14:26.000Z",
          "Titre": "It was easy to find what I needed and…",
          "Contenu": "It was easy to find what I needed and the price was right.  My only problem will be getting it installed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caitlin Kim",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T22:06:27.000Z",
          "Titre": "just placed the order",
          "Contenu": "just placed the order , i will follow up when i get my products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Mcnamara",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T16:44:05.000Z",
          "Titre": "Overall good",
          "Contenu": "Overall good, website a little clunky with adding and removing accessories to cart"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Kost",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T17:07:00.000Z",
          "Titre": "Timely returned phone call...very…",
          "Contenu": "Timely returned phone call...very knowledgeable tech and directed me to the correct part needed. Highly recommend this fine company and their products!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Barker",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T06:04:34.000Z",
          "Titre": "Easy order with good details",
          "Contenu": "Easy to find for my application"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T18:06:08.000Z",
          "Titre": "Got my questions answered in minutes",
          "Contenu": "Got my questions answered in minutes!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TSCHMUCK",
          "Nb_Reviews": 2,
          "Date": "2023-03-11T01:23:56.000Z",
          "Titre": "Very good videos explaining the products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray Butler",
          "Nb_Reviews": 2,
          "Date": "2022-08-06T02:18:37.000Z",
          "Titre": "At first it was very good the agent had…",
          "Contenu": "At first it was very good the agent had did what ever he could to get my order shipped to me. But then later I received a call from another agent saying my order wouldn't be shipped out at least 2 weeks. Not happy about that.been waiting for awhile and still don't have my order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T20:53:30.000Z",
          "Titre": "easy to order",
          "Contenu": "Good videos with fine instructions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "arthur  houde",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T20:28:45.000Z",
          "Titre": "good experience just hard to find where…",
          "Contenu": "good experience just hard to find where to apply the discount code"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T18:35:33.000Z",
          "Titre": "Ordering process was easily followed",
          "Contenu": "Ordering process was easily followed. Good descriptions and good videos. Can't rate the product until I get it and install it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Tatar",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T19:11:14.000Z",
          "Titre": "Easy to order",
          "Contenu": "Ordering was very easy"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Richard Bezovie",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T18:26:42.000Z",
          "Titre": "New dash cam faulty",
          "Contenu": "New dash cam faulty, sent unit back to Tadibrothers which they called me with a replacement. Service was good on replacement unit, waiting for new cam to come in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert A Fournier",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T21:23:14.000Z",
          "Titre": "TThe system looks like it will work great for my needs.he system looks like it will work…",
          "Contenu": "The system looks like it will work great for my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "THOMAS  WILLIAMS",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T03:06:46.000Z",
          "Titre": "Rose was a great help in getting me…",
          "Contenu": "Rose was a great help in getting me what I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2017-05-30T23:48:42.000Z",
          "Titre": "First tme experience with rearview systems",
          "Contenu": "The instructions sent with the kit were incomplete, hence four stars. Customer service was excellent. Adi saved the day and the sale by providing extensive instructions over the phone, several phone calls actually. With his patience and counsel, I was able to troubleshoot some issues and ultimately complete the installation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Wegner",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T22:39:38.000Z",
          "Titre": "Could not complete order online because…",
          "Contenu": "Could not complete order online because Website did not have a city field.  So i had to call to place an order.  Rose did s great job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Perrine",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T16:46:08.000Z",
          "Titre": "Well setup website",
          "Contenu": "Good product. Watch the hard to read statement for putting in the discount code."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Bridgman",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T22:32:40.000Z",
          "Titre": "Great selection",
          "Contenu": "Great selection. Glad I could find my Furrion-compatible side cameras!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald R Mccoy",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T17:48:25.000Z",
          "Titre": "quality",
          "Contenu": "nothing here"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "doug jones",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T20:38:28.000Z",
          "Titre": "4 camera wireless system with upgrades…",
          "Contenu": "4 camera wireless system with upgrades on monitor and to digital cameras. Spent $1200+. Would have been 5 stars if customer service hadn't changed their mind about free shipping on my return for repair item.  Told me no,  I fussed, they said yes but never sent the label then said no.  I relented and paid $18 to send my side camera back to them.  They repaired it under warranty and sent it back within 7 days.  I started out with my monitor on the console and the sun light canceled that out.  I made a magnetic mount on the dash and that was the ticket.  I bought a battery pack for the fourth camera,  after the fact and use that as a portable camera showing,  in part, the side of the rv that I am running up on the ramps,  etc. Works fabulously.  Easy as can be.  What a terrific resource.   The other cameras were mounted to our fifth wheel and provide excellent situational awareness while driving."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Johnson",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T22:21:48.000Z",
          "Titre": "The system I bought works great on my…great system BUT***",
          "Contenu": "The system I bought works great on my houseboat with the camera at least 60’ away from the display. I do have a complaint though. I decided to add another camera to display the upper deck and placed an tried to place an order. If I had originally ordered the system with two cameras the second one was a $75 adder since I waited two days the camera costs$190. This makes no sense so I canceled my order original system only cost $235 so I can’t see almost $200 for the second camera. UPDATE. Eddie from Tadibrothers called and said I can get the same price for the second camera as if it was ordered as a two camera system. Thanks Tadibrothers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyle Kaup",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T00:46:40.000Z",
          "Titre": "sales person was very helpfull in…",
          "Contenu": "sales person was very helpfull in finding me what i wanted and guided me thru the web site to place my order.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Barnes",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T16:57:15.000Z",
          "Titre": "safe",
          "Contenu": "Your reviews are annoying"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Doucet",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T02:48:47.000Z",
          "Titre": "Great support",
          "Contenu": "I just ordered it today will know more when I get it in and try it out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melanie Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T23:48:50.000Z",
          "Titre": "Easy website and very informative."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Boettcher",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T23:04:23.000Z",
          "Titre": "So far I gave 4 star until I receive…",
          "Contenu": "So far I gave 4 star until I receive the unit good online experience very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronnie Post",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T20:41:59.000Z",
          "Titre": "good",
          "Contenu": "Hopefully this one will work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Bruhn",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T15:40:56.000Z",
          "Titre": "Called support staff looking for help…",
          "Contenu": "Called support staff looking for help in choosing system.  Very helpful and knowledgeable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANTHONY MOHAMMED",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T03:58:34.000Z",
          "Titre": "Information was clear and informative",
          "Contenu": "Information was clear and informative, plus the discount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BRUCE reck",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T21:10:21.000Z",
          "Titre": "Service was good",
          "Contenu": "Service was good. Had a few problems with the wireless but Carl took care of it. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alfred Perez",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T20:57:35.000Z",
          "Titre": "My experience with tadibrothers was…",
          "Contenu": "My experience with tadibrothers was excellent. Good products and moreover excellent service.I’ll recommend to all ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dion Simpson",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T17:13:51.000Z",
          "Titre": "easy to use website but if i had to do…",
          "Contenu": "easy to use website but if i had to do a review in order to get to next page"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beverly Godwin",
          "Nb_Reviews": 6,
          "Date": "2022-11-11T15:24:29.000Z",
          "Titre": "Easy-peasy!",
          "Contenu": "Website very easy to navigate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT TAYLOR",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T20:45:06.000Z",
          "Titre": "RV Back up Camera",
          "Contenu": "easy to navigate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Zentmyer",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T20:22:42.000Z",
          "Titre": "Gggg",
          "Contenu": "It was ok you had what I need thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rohit Krishnan",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T23:49:17.000Z",
          "Titre": "Small issues, quick fix",
          "Contenu": "Despite some minor issues, the customer service associates were very quick to respond and fix the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebel Repair",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T05:04:18.000Z",
          "Titre": "easy to find what I was looking for"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LouNY",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T19:46:44.000Z",
          "Titre": "Sounds like a good product",
          "Contenu": "Sounds like a good product, we shall see."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dale Cloutier",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T03:34:17.000Z",
          "Titre": "No comment at this time"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nick Luongo",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T16:10:17.000Z",
          "Titre": "easy to use website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MJohnson",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T23:10:32.000Z",
          "Titre": "Nice product",
          "Contenu": "Nice to review different models online."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Coveyou",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T03:10:46.000Z",
          "Titre": "Looking for the antennae extender",
          "Contenu": "Looking for the antennae extender.   Could have provided info about length of the cable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey Fullington",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T02:37:10.000Z",
          "Titre": "Nice job",
          "Contenu": "Nice job. Had what I needed for a decent price, and easy to find."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Watson",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T18:49:38.000Z",
          "Titre": "backup camera",
          "Contenu": "Website is friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Kuhns",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T16:31:43.000Z",
          "Titre": "Like",
          "Contenu": "It was Easy to order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Scheideberg",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T00:33:03.000Z",
          "Titre": "Quick response"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2019-10-31T20:44:40.000Z",
          "Titre": "Got it sorted out......",
          "Contenu": "Tadi did a good job hanging in there while we sorted out what we were dealing with in an old system conversion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "edgar gates",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T03:19:55.000Z",
          "Titre": "just needed a camera",
          "Contenu": "just want a camera I hate reviews"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "matthew briley",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:14:32.000Z",
          "Titre": "super good eminence",
          "Contenu": "Good experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wayne oaks",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:54:30.000Z",
          "Titre": "The video explanations clarify many…",
          "Contenu": "The video explanations clarify many questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rohit Krishnan",
          "Nb_Reviews": 2,
          "Date": "2022-07-26T16:39:48.000Z",
          "Titre": "Camera Order",
          "Contenu": "The process of ordering the camera was quick and painless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hector Rosa",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T02:07:22.000Z",
          "Titre": "Coupon code was difficult to find but…",
          "Contenu": "Coupon code was difficult to find but overall good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wiley mcadoo",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T16:17:34.000Z",
          "Titre": "good just complicated for old folks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gus Wilkins",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T23:57:33.000Z",
          "Titre": "This is on the ordering",
          "Contenu": "This is on the ordering, not the product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "george",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T01:59:33.000Z",
          "Titre": "no no",
          "Contenu": "abcdefghijklmnop"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Angel R,  Del Valle",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T22:50:11.000Z",
          "Titre": "good customer service",
          "Contenu": "very good customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Lal",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T00:34:41.000Z",
          "Titre": "Product info is a little confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adriene Kelly",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T16:57:57.000Z",
          "Titre": "sales",
          "Contenu": "Everything was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond Socia",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T20:29:43.000Z",
          "Titre": "please",
          "Contenu": "please, no forced reviews"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bert Finland",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T14:34:25.000Z",
          "Titre": "easy to use",
          "Contenu": "ease of use for site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sdfasdf",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T14:39:09.000Z",
          "Titre": "Feedback",
          "Contenu": "Fast shipping, good product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ALAN SCOTT",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T19:45:54.000Z",
          "Titre": "online chat was very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kerry Sander",
          "Nb_Reviews": 2,
          "Date": "2022-07-27T02:21:13.000Z",
          "Titre": "Easy to navigate the web site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Gautreaux",
          "Nb_Reviews": 5,
          "Date": "2023-07-03T19:35:43.000Z",
          "Titre": "Very good price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RDMD",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T18:02:25.000Z",
          "Titre": "Effective sales support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean Goatlady",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T03:33:57.000Z",
          "Titre": "Rose knowledgeable and helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald J Koebel",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T01:28:13.000Z",
          "Titre": "back up",
          "Contenu": "good good good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Earl Diem",
          "Nb_Reviews": 2,
          "Date": "2022-08-31T01:33:17.000Z",
          "Titre": "dfgeryefdgddgdfgfg"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Richard Deshaies",
          "Nb_Reviews": 2,
          "Date": "2022-09-05T17:12:59.000Z",
          "Titre": "Tadibrothers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry Wyse",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T23:20:11.000Z",
          "Titre": "Knowledgeable service person."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T12:38:41.000Z",
          "Titre": "fast and easy"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dustin  Christianson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:10:22.000Z",
          "Titre": "Great customer service. …",
          "Contenu": "Florence was a huge help in making sure my order was filled properly and even found a way to get a product out to me faster than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Rocco",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:09:03.000Z",
          "Titre": "A special sales person",
          "Contenu": "Rose is special, she walked me through all the comparable camera systems to help me choose the most cost effective and technical system I needed. Thank you once again Rose for the simple way of buying a system that will work best for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Gaboury",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:06:16.000Z",
          "Titre": "Josan was much nicer than anyone else there, give her a bonus!",
          "Contenu": "Josan has just helped remedy a situation which has gone on far too long.  The 5 star rating is for her help in (maybe) resolving this issue, not the quality of what I bought.  The basic problem I had is that the wireless unit I first bought (349 dollars) was a piece of cheap, worthless, junk…. I’ve spoken to at least 3 people about the fact that this thing never worked correctly, didn’t work correctly after I sent it back for repairs, and what little picture I did get on occasion was delayed and totally useless for any type of decision making, backing up, or lane changing.  We made a 5-month bucket-list trip this summer back and forth across the US and Canada.  The camera was turned off and put in storage because it was useless.  Granted, not everything made in China is perfect.  The way the antenna attached to the back of the camera and screen  ( a melted plastic retainer) set a new low in cheapness.  Despite words of assurances that all bench checks were “good”, the unit was returned with the antenna wire separated from the antenna.  But, what really added insult to injury in this situation was the attitude from your company in that “this is normal and good, how can you not like it?”  Words of platitude did us no good.  I do, however, appreciate the 200 dollar trade-in value towards what I hope will be a better unit.  I also paid an extra 100 dollars for a “new” warranty, plus the difference in the upgrade.  So, in answer to what I felt about paying an extra 110 dollars, plus twice shipping back a bad unit which began this whole fiasco in the first place; I’m positively “overjoyed”—sarcasm intended.  Overall, I rate your company as a “2”."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William M",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T23:45:41.000Z",
          "Titre": "Sherwin from Tadi Bros. was FANTASTIC!!!",
          "Contenu": "Sherwin was fantastic! The quintessential professional. He took me through a customization, and it took about 15 minutes. He paid attention all the necessary detail which I would’ve known to look for. I find that outstanding in a sales person. I especially find the attention to detail of paramount importance, as I’m a plastic surgeon. Sherwin was very courteous, precise in his explanations, and very knowledgeable.If I have any friends or family that are interested in doing what I’ve done, I will not hesitate to not only tell them about Tadi Brothers, but I will tell them to ask for Sherwin, by name, that’s how impressed I was."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rivera-Clemente Ruben",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:21:13.000Z",
          "Titre": "GREAT SERVICE REPRESENTATIVE",
          "Contenu": "I have to give this customer service representative a 5 star and some for, first the quick response how Great she was able to call me back but also to check my phone number and see my prior orders but also to communicate my options  also because of this I have added her on my contact for any future orders THANK YOU SO MUCH JONAS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Chiocchio",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:14:20.000Z",
          "Titre": "Service was outstanding!",
          "Contenu": "Service was outstanding. I made numerous mistakes with my own installation but my support person was patient with me and stepped me through the proper installation. Thank you for the service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Floor",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:38:10.000Z",
          "Titre": "Everyone was so very helpful and…",
          "Contenu": "Everyone was so very helpful and accommodating, especially Sherwin! I would so recommend buying and using TadiBrothers products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GINA NIPITELLA",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:27:37.000Z",
          "Titre": "Very professional and polite",
          "Contenu": "Very professional and polite.  Josan assisted me with my order and was informative and extremely helpful.   I wish all customer service were like Josan.   Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Driscoll",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:57:07.000Z",
          "Titre": "Josan provided excellent customer…",
          "Contenu": "Josan provided excellent customer service with my order. The windshield mount was broken and she got a replacement out quickly. Also answered some installation questions I had easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "philip kurtanich",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:05:37.000Z",
          "Titre": "Curtíos knowledgeable",
          "Contenu": "The team was very helpful and Josan was knowledgeable about the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Vick",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:45:29.000Z",
          "Titre": "Excellent service",
          "Contenu": "Received phone call on status of my shipment. Unit I ordered was a older version and they called to let me know a newer version was available with additional features at minimal cost. Was I glad to receive that phone call. Thanks for the excellent service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:55:15.000Z",
          "Titre": "I was customer service representative…",
          "Contenu": "I was customer service representative for 30 years.  A very very hard job to be good at. I can say rose is superior great at being concise able to lead to what I need and effectively get there quickly  She would be great example to teach And help other representatives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Ingraham",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T04:26:37.000Z",
          "Titre": "Rose took the time to listen to my…",
          "Contenu": "Rose took the time to listen to my questions and always answered them with grace and confidence in her answers. I think the company did themselves proud hiring Rose. To offer up some creative criticism, I did at times feel a little pressured to close the sale before I had all the information I felt that I needed. But Rose picked up on my cues and gave me the time to talk to my builder and then followed up with me the next day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Roop",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T19:04:36.000Z",
          "Titre": "Great chat and ordering experience with Rose!",
          "Contenu": "Great chat experience with Rose. I was interested in purchasing another camera similar to the two I already own, but couldn’t find it on website (my fault). She used previous order to immediately find it and send me a link. She called  me after I accepted offer to place order via phone. Rose was very courteous and helpful. Very good ordering experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max  Goldacker",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:41:42.000Z",
          "Titre": "Question about the monitor !!!I had a question about the system I was…",
          "Contenu": "I had a question about the system I was looking at and it was answered quickly along with the upgrade price . I was very impressed with the service I received.Thank You and keep up the great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Aucoin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:37:25.000Z",
          "Titre": "Very friendly and knowledgeable…",
          "Contenu": "Very friendly and knowledgeable customer service representative. Was very helpful. Great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVEN  SUKEL",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:57:22.000Z",
          "Titre": "Dawn was great",
          "Contenu": "Dawn was great, helpful and helpful knowledgeable. She provided me with the information that I needed and answered all of my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Bedard",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:43:46.000Z",
          "Titre": "Very helpful customer service agent",
          "Contenu": "Sherman went over and beyond wonderful customer service. He answered and helped me in a very professional manner. Great asset to your company. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geri Rosol",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:50:00.000Z",
          "Titre": "MDoc Geriy questions were answered and quickly",
          "Contenu": "My questions were answered and quickly. Support Agent was very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "garymartingary",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T02:28:19.000Z",
          "Titre": "I would give a 25 star if it was…",
          "Contenu": "I would give a 25 star if it was available but I guess I’ll have to settle for just five for one JOSAN who took care of me on the phone for he getting of a camera systems for my RV! Tried to do my old wired system with the ancient Luke tv monitor and got frustrated and she helped me pick out a new wireless system! Anyway, she’s a deffinate keeper! I’m a Combat Veteran from Viet Nam with Ptsd! I require special attention when hearing and communicating! She had no problem with this Vet! She just crawled into the foxhole with me and took care of my needs! She didn’t know of my malady! Hoorah for JOSAN!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oksana T.",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:58:24.000Z",
          "Titre": "Knowledgeable and helpful shopping assistance on busy day",
          "Contenu": "Rose helped me choose cameras for my motorhome and horse trailer over support chat. She was very knowledgeable and took time to understand my needs and motorhome installation limitations before making a suggestion for most suitable system. This avoided the pain of difficult install or having to return the kit later. Rose also suggested a better system at better price than I had originally picked for my horse trailer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:09:03.000Z",
          "Titre": "Josan was very polite and helpful",
          "Contenu": "Josan was very polite and helpful. The item I ordered was out of stock but they let me know in a timely manner and then offered me an upgraded kit for a hefty discount. Nice to talk to an actual person for a change"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joann Mcconnell",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:23:05.000Z",
          "Titre": "Rv motorbomeWe needed help with understanding and…",
          "Contenu": "We needed help with understanding and getting the correct extention cables f[r the microwave sensors for out 33 ft motorhome.We contacted the customer service depth. And they were very helpful in understanding our needs and getting us the proper. Microwave extension cables. Thank you so very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia Jacobson",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:51:43.000Z",
          "Titre": "Dawn gave me excellent service with my…",
          "Contenu": "Dawn gave me excellent service with my order today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harley Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:41:19.000Z",
          "Titre": "Very quick at getting back to me about…",
          "Contenu": "Very quick at getting back to me about the cameras I was having issues with. Josan was extremely nice and helpful with the process. Thank you Josan and tadibrothers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walker Moffitt",
          "Nb_Reviews": 5,
          "Date": "2023-11-15T19:41:01.000Z",
          "Titre": "Rose was so knowledgeable",
          "Contenu": "Rose was so knowledgeable. I had an idea of what products I wanted and Rose listened and then suggested a package that had the options I want plus additional features for a few less bucks. She went over each item and was not in a hurry. I felt like I got all the information I need to make my purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Chiocchio",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T19:06:16.000Z",
          "Titre": "Thanks again for your help selecting a…",
          "Contenu": "Thanks again for your help selecting a camera."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil M",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T04:58:04.000Z",
          "Titre": "Sherwin went out of his way to make…",
          "Contenu": "Sherwin went out of his way to make sure that my concerns were addressed. His level of concern changed my attitude about your company. When I called I never thought this was going to end up with a positive experience.  So thank you for the help, and for resolving my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick  Colton",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:23:31.000Z",
          "Titre": "Rose was the best",
          "Contenu": "Rose was the best. Knowable, polite and a pleasant person to speak with. She goes the distance to turn an ordinary order into very smooth process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronnie Watson",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:06:53.000Z",
          "Titre": "Even though I called 3 or 4 times",
          "Contenu": "Even though I called 3 or 4 times, Tommy was very helpful and courteous. He Answered all of my questions and helped me pick the system I needed. I will definitely recommend Tadibrothers and Tommy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clive Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:29:06.000Z",
          "Titre": "Good customer service",
          "Contenu": "The ordering process was very simple and I received a phone call which helped me upgrade the system they seem to give very personal service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom  Bushman",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T20:54:01.000Z",
          "Titre": "Rose was fantastic to work with!",
          "Contenu": "Rose was fantastic to work through my problems! She sent me a video that walked me through trying to pair a camera that I put a screw through the wire. When that didn’t work she sent me a link to customer service and a detailed explanation of how to get the quickest response. Then she looked up my order of when I purchased the setup and gave me a quote on a replacement camera. She was wonderful to deal with! She was very polite and professional and had all the answers to my questions! She is a keeper! I wish all sales representatives were as helpful as Rose!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shon Barr",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:20:01.000Z",
          "Titre": "The sales associate was very helpful…",
          "Contenu": "The sales associate was very helpful with selecting the right options to make sure the installation would go as smoothly as possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie  Sellon",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:35:14.000Z",
          "Titre": "Last experience with Tadi Brothers",
          "Contenu": "With good customer service being at an all time low these days, it's good to know there are some companies around that knows about good customer service. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T22:37:32.000Z",
          "Titre": "Rose was very prompt in replying",
          "Contenu": "Rose was very prompt in replying, courteous and helpful in answering all my questions.  This service made my purchase decision easy.   Thank you Rose!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Langton",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:44:32.000Z",
          "Titre": "Spoke with Josan in regards to the…",
          "Contenu": "Spoke with Josan in regards to the replacement of a backup monitor that had a screen issue. Josan checked with Tech and advised me via a returned call a new monitor was going to be shipped out as a replacement unit.Josan was very professional in our conversation and the speed in getting me a reply was most"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JENNIFER  CHASZAR",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T15:13:41.000Z",
          "Titre": "Tadi BrotherLs customer service was outstanding!",
          "Contenu": "Tadi BrotherLs customer service was outstanding. I was so pleased with the service I received from this business. They went above and beyond to help me find the solution to my issue , not to mention, provided several steps to troubleshoot the problem.  I was very impressed with the knowledge of the customer service rep and the time she spent resolving my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Hayes",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:12:58.000Z",
          "Titre": "I purchased a system upgraded to larger…",
          "Contenu": "I purchased a system upgraded to larger monitor which was a mistake on my part, called to get instructions on how to return and swap monitor. Talked to Gabe he was very helpful and friendly. Everything went ok."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Roop",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T15:41:42.000Z",
          "Titre": "Excellent system and great customer service",
          "Contenu": "I’ve had the 7” wireless monitor and one camera installed in the horse area of my 36 ft long living quarters horse trailer for a few years and it works great. I bought a second camera earlier this year to install as backup camera on trailer. I was only rarely receiving signal from that camera. After some troubleshooting I determined the problem was in the monitor itself. A call to tech support resulted in a conversation with Gabe. Although out of warranty, he requested I send the monitor back for repair. I was pleasantly surprised to receive a new monitor at no cost. Both cameras work great now and I’m an extremely satisfied customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T02:53:56.000Z",
          "Titre": "Great service",
          "Contenu": "Dawn seemed very interested in making sure that the product I purchased was working correctly and to my satisfaction. Thanks for the great customer service. Tom"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Lusardi",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T22:25:08.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Josan was patient and listened to my specific request and requirements to navigate the cost effective solution for my needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ELLEN",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T22:32:10.000Z",
          "Titre": "Rose was so helpful and patient with…",
          "Contenu": "Rose was so helpful and patient with me.  Her knowledge of the items that are available is excellent and she directed me to the perfect purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:23:45.000Z",
          "Titre": "Well layed out web site",
          "Contenu": "Well layed out web site.  Found what I needed quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Sitar",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:05:02.000Z",
          "Titre": "i was able to speak with Live chat who…",
          "Contenu": "i was able to speak with Live chat who was very informative, and also connected me with a live  representative who called me to discuss my application and provide me with additional options.great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Turkoly",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:34:12.000Z",
          "Titre": "I needed to get the correct monitor for…",
          "Contenu": "I needed to get the correct monitor for the existing cameras I already have. Spoke with Josan, and she was very helpful. Thank you,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK  WILCOX",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:20:42.000Z",
          "Titre": "Rose was very helpful in setting me up…",
          "Contenu": "Rose was very helpful in setting me up with the right system."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Otto Langer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T21:10:44.000Z",
          "Titre": "Thank you for your prompt reponse. Service from the Tadi service rep was…",
          "Contenu": "Service from the Tadi service rep was excellent in that responses on a repair item was fast and professioal. Often one gets a run around on a warrantee issue. Here that did not happen. Otto Langer BC  Canada"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anthony Demarco",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T23:09:40.000Z",
          "Titre": "Just love my Tadibrothers rear view…",
          "Contenu": "Just love my Tadibrothers rear view camera with mirror monitor. Make traveling down the road much safer with no blinds spots. Great for backing up as well. I recommend this product to anyone who pulls a trailer. Thanks TadiBrothers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Lough",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T22:54:22.000Z",
          "Titre": "I've spoken with Gabe and he upgraded a…",
          "Contenu": "I've spoken with Gabe and he upgraded a recent order I made.  Still waiting to receive new unit,  but he assured me it would certainly be shipped to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shad Atkinson",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T23:05:16.000Z",
          "Titre": "Tommy was extremely helpful!",
          "Contenu": "Tommy was extremely helpful!! We were skeptical that we would be purchasing a camera today, but after discussing our needs with him, we felt confident with his professional guidance to make the purchase and found out that because we had called on Monday, we would be receiving a discount!! Tommy is an asset to your company….confident, professional and friendly!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Xtravel Tech",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:02:22.000Z",
          "Titre": "Chat information was awesome",
          "Contenu": "Chat information was awesome! Got the questions answered with actual links I could just go Buy! Super impressive! Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Babcok",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:59:29.000Z",
          "Titre": "Rose was able to answer all my…",
          "Contenu": "Rose was able to answer all my questions.  She was well informed about the specifications, technical aspects and accessory options for the system in question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne  Glemming",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:59:05.000Z",
          "Titre": "Gabriel has been most helpful in his…",
          "Contenu": "Gabriel has been most helpful in his technical knowledge of the camera system. His care to get everything right is rare these days, and he has it!! Thanks for being awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "marshall elliott",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T01:23:20.000Z",
          "Titre": "Rose in Sales was fantastic to deal…",
          "Contenu": "Rose in Sales was fantastic to deal with over chat. She answered 101 different questions and got the deal done. Hats off to her customer service help as this sale wouldn't have happened otherwise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlen Jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:12:34.000Z",
          "Titre": "Jordan was the only great experience",
          "Contenu": "Jordan was the only great experience. She gets the 5-Stars. The rest of the experience was average."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob P",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T20:13:09.000Z",
          "Titre": "Josan was wonderful",
          "Contenu": "Josan was wonderful. She was very helpful and understanding of my needs and understood exactly what I needed. She was able to answer all of my questions and went the extra mile or two to take care of everything I needed and then some. It would great if all customer/tech people could be as patient and caring as she was."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dale Hockley",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:50:23.000Z",
          "Titre": "Customer Service",
          "Contenu": "First off - Once I made contact with the company they were quick to reply by phone and not over e-mail which usually creates more e-mails. I had sent an earlier e-mail with photos describing the wiring already in place on my trailer but was not compatible with my the camera purchased. Secondly he was very personal and patient in making sure I understood the direction and proper wiring practice he was giving me on how to make this unit compatible with my trailer.  To ensure satisfactory customer service I was left with a phone number - not a usual practice in my experience with other companies and very much appreciated by myself. Thanks very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DARRELL  LEHNEN",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:39:48.000Z",
          "Titre": "Gab helped us out",
          "Contenu": "Gab listened to our issue and resloved the issue quickly without extra problems. we are a happy with our resolution since the product didnt work with the existing system. thank you again Gab."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick  McKenna",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T00:03:55.000Z",
          "Titre": "What a true pleasure talking to Rose…",
          "Contenu": "What a true pleasure talking to Rose today. She was not only a delight to talk with but was very knowledgeable also.  I’m so glad I called Tadi Brothers for a new purchase as my other purchase from Tadi was 2015 and since become antiquated.  Thank again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Calvert",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:24:51.000Z",
          "Titre": "Rose was perfect on the phone last…",
          "Contenu": "Rose was perfect on the phone last night and answer all my question.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don  Husack",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:25:54.000Z",
          "Titre": "Great camera after almost 10 years of problem free service.",
          "Contenu": "Great product, repacing my back up camera after almost 10 years of problem free service.Great customer service, Very helpful and fiendly.Thanks Tommy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JEFFREY  CRUME",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T03:45:48.000Z",
          "Titre": "Josan was amazing and very thorough…",
          "Contenu": "Josan was amazing and very thorough through the whole ordeal. From trying to fix my broken camera to the news it couldn’t be fixed. To the sale of the new camera with all the discounts to be appied. Very great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Preston",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T19:40:31.000Z",
          "Titre": "Rose was very great to work with…",
          "Contenu": "Rose was very great to work with ordering my backup camera. I was misinformed about the trade in policy. She listened to the problem and provided me a gift card. She calked me back after Speaking to her supervisor about this issue. I didn't ask Her to do this.She was able t.Expedite my shipping without any additional cost. Above and beyond service of this nature is very rare. I couldn't be happierith the service she provided. She is definitely an asset to your team. She deserves a raise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff  Klinder",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:55:56.000Z",
          "Titre": "rose was easy to work with and very…",
          "Contenu": "rose was easy to work with and very efficient. Pleasant…an asset to your business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lacy Sr.  Helms",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:35:14.000Z",
          "Titre": "Rose was very curtious and explainef…",
          "Contenu": "Rose was very curtious and explainef the details of the purchase.  My bank rejected the purchase due to us never using your company which was a precaution for scammers and safety precaution for us.  Rose called me back and the transaction went through.  Rose is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T00:00:27.000Z",
          "Titre": "Sherwin made the “deal” work!",
          "Contenu": "Sherwin made the “deal” work!Good knowledge, very helpful with excellent explanations!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard  Clough",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T21:22:25.000Z",
          "Titre": "Quality, long lasting product, keeping me safe on the road.",
          "Contenu": "Quick and easy access to what I need on site. I've been a customer since 2019. My heavy-duty wireless backup camera is indispensable in my RV (Class B) travels around the USA and Canadian provinces."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Witters",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T21:34:59.000Z",
          "Titre": "Gabriel is a problem solver",
          "Contenu": "Gabriel is a problem solver!  He took the time to find a setup that worked with my non std furion travel trailer mount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick  Washam",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:32:29.000Z",
          "Titre": "Great customer service a tech had…",
          "Contenu": "Great customer service a tech had explained my problem and directed me to the parts needed for repair Thank you Josan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Shultz",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T04:06:32.000Z",
          "Titre": "Great customer service",
          "Contenu": "Rose was very knowledgeable about the product and was very polite and conscious about making sure that I got all the correct parts for the installation and going over the options so I would get all I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul  O'Connor",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:55:24.000Z",
          "Titre": "Rose is the best",
          "Contenu": "Rose is the best. Just ordered our 2nd digital system from Rose. She assisted us so well on our rv system that we went back to her for our new system, this one for our boat. I was unable to stump her with any of my numerous questions. I finally had to ask her if I missed asking any questions ; she likely had an answer for that as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Ellzey",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:19:58.000Z",
          "Titre": "Josan was able to walk me through what…",
          "Contenu": "Josan was able to walk me through what I needed and was able to get me a better price in the backup camera that I needed to work with the monitor I ordered!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Michael Crossland Jr",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:28:17.000Z",
          "Titre": "Sherwin gave me advice and presented your products well on Sunday morning and took my order on Sunday night.  Very helpful and courteous.  Excellent service so far.",
          "Contenu": "Sherwin and your website represented your company brilliantly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T22:17:04.000Z",
          "Titre": "Had a great experience!Very…",
          "Contenu": "Had a great experience!Very knowledgeable about product and answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T23:03:08.000Z",
          "Titre": "I was hoping you would send me a replacement sense my other one had moisture in it.…",
          "Contenu": "I was hoping you would send me a replacement sense the other one had moisture inside it.Down did good. She was easy to understand and seemed to make sure I was happy with my service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "REUEL CRITES",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T18:50:20.000Z",
          "Titre": "I have talked to Rose today to ask some…",
          "Contenu": "I have talked to Rose today to ask some questions about their 76599 about what was all needed to hook the unit and she was very nice and helpful in answering all questions and so I ordered it 😀 😊 Thank you very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Primrose",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:00:52.000Z",
          "Titre": "Josan quickly and efficiently handled…",
          "Contenu": "Josan quickly and efficiently handled my regarding shipment of my replacement monitor!!  Thank you much."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jo  Sentes",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T23:36:42.000Z",
          "Titre": "Rose took the worry out of selecting a…",
          "Contenu": "Rose took the worry out of selecting a system proper for my needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RTB",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T22:50:44.000Z",
          "Titre": "The camera was very easy to install and…",
          "Contenu": "The camera was very easy to install and it works perfectly. Picture is clear and makes it much easier to drive the motorhome ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T01:09:12.000Z",
          "Titre": "Quick answer on chat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J R Smith",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T05:25:07.000Z",
          "Titre": "Every business likes to claim they have…",
          "Contenu": "Every business likes to claim they have great customer service but the reality is for most, once they get your money you are left on your own.  My experience started shortly after placing my order when I got a call that they had just shipped the last one of that model and I could either wait for the next shipment or possibly consider a new model that had just arrived.  They supplied me a link to look at the new system and I decided to switch to it.  They expedited the shipping and I received it a couple of days later.  Already a pleasant experience with the company.Once I installed the screen and camera in my van I realized the screen was upside down.  The cameras rotated but not the screen.  I called customer service and spoke to Josan.  Since the system was new she asked me to video the problem and send her the video.  I sent it and a few hours later I received an email from Josan saying they had received the video and were looking for a fix.  The next day I got a call from her with instructions on how to fix it.After following the instruction everything worked perfectly.  I sent her an email with thanks for the prompt replies.  I was surprised the following day to get a followup call from Josan just to check that everything was okay.Believe you won’t get that kind of service from most businesses.A real pleasurable experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robin Steward",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:43:05.000Z",
          "Titre": "Rose was very helpful in assisting me…",
          "Contenu": "Rose was very helpful in assisting me with my purchase of the SKU90116V back up camera"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara M",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T22:00:28.000Z",
          "Titre": "Great customer service",
          "Contenu": "I purchased an item that was not what I expected. Dawn, at customer service, was friendly, knowledgeable, efficient, and is able to give me a refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T21:55:42.000Z",
          "Titre": "Great service!",
          "Contenu": "Josan was very helpful in getting me set up with my cameras and monitor! She took the time to help me work out some bugs, and was extremely helpful! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul D Moss",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:54:15.000Z",
          "Titre": "He followed up with installing option…",
          "Contenu": "He followed up with installing option in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Kearns",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:15:34.000Z",
          "Titre": "I had a few items in my order missing",
          "Contenu": "I had a few items in my order missing, these issues was resolved quickly with no hassle. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "I.D.",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:38:15.000Z",
          "Titre": "I appreciated the call and service…",
          "Contenu": "I appreciated the call and service because I had been trying to get a hold of the company earlier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hmfic",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:41:54.000Z",
          "Titre": "Exellent company to order from, VERY HELPFUL!",
          "Contenu": "Great company to use. Website had all the information that i needed listed. Also I had a follow up call from Gab so thanx to him for all his help. Top notch!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike longust",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:17:10.000Z",
          "Titre": "Dawn was simply great",
          "Contenu": "Dawn was simply great! She returned my call within minutes and was very helpful. She also sold a new unit for the company.  I’ll be happily looking rearward soon!  Thank you Dawn!  Mike Longust. Hot Springs, Arkansas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Giles",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T09:31:31.000Z",
          "Titre": "Fast and accurate service with…",
          "Contenu": "Fast and accurate service with additional call to confirm from Josan at TadiBrothers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Cabot",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:32:09.000Z",
          "Titre": "easy website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JT Steele",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:33:36.000Z",
          "Titre": "Very helpful and professional",
          "Contenu": "Very helpful and professional. Remedied our issues in no time. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Eichhorn",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:34:33.000Z",
          "Titre": "Tadi Brothers responded quickly to my…",
          "Contenu": "Tadi Brothers responded quickly to my inquiry about my antenna that fell apart. Dawn helped me out and was very pleasant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Selig",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T16:24:46.000Z",
          "Titre": "I purchased a 4 camera digital system…",
          "Contenu": "I purchased a 4 camera digital system for my custom 30ft car hauler. When I received my cameras I could not wait to install them .The install went very well I did have a few questions so I called Tadi Brothers and spoke with Gabe he was very helpful in answering all my questions and even gave me some good pointers .After using the cameras on 2 trips I noticed my passenger side camera was blurry .So I call Gabe and he asked for picture to help him identify the problem .Gabe asked for me to send back that camera for further review so I did .A few day later Gabe called me and said the camera had a piece of glue on the inside lens .They fixed it like new and sent it back works perfect until I turned the system off and tried to power it back up all screens said no signal .So I tried pairing all cameras and nothing worked .I contacted Tadi Brothers and had the opportunity to talk with Tamir one of the owners and after I spoke with him I learned that this system works a lot  better with having the power direct to it's own fuse block a very simple fix to a problem I had. It is great to have such good support when something goes wrong and my system is unbelievable the clarity of the cameras are the best.I recommend this system it is very easy to install and use ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SCOTT  GILLETTE",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:13:35.000Z",
          "Titre": "Rose was helpful and patient.",
          "Contenu": "Rose was not only very helpful, but she was also patient as I asked questions. She helped me get the right features in this system for my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:21:30.000Z",
          "Titre": "Your rep was well versed about the…",
          "Contenu": "Your rep was well versed about the product and very helpful. It would be nice if more companies were as good. Thanks for the good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ed valenti",
          "Nb_Reviews": 5,
          "Date": "2023-10-19T23:23:19.000Z",
          "Titre": "These guys take customer service…",
          "Contenu": "These guys take customer service seriously. Gabriel is the best!!!Would give 6 stars if possible"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Rhea",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T16:39:30.000Z",
          "Titre": "Found what I wanted at a good price",
          "Contenu": "Found what I wanted at a good price.  Web site was easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harris Gosselin",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:26:25.000Z",
          "Titre": "He work efficiently",
          "Contenu": "He work efficiently getting me information to my email address that I was having difficulty receiving. Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Cox",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T02:16:30.000Z",
          "Titre": "Rose did a great job in helping me…",
          "Contenu": "Rose did a great job in helping me select the best products for our needs."
        }
      ]
    }
  ]
}