{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.factoryoutletstore.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sheila",
          "Nb_Reviews": 13,
          "Date": "2023-12-13T14:00:47.000Z",
          "Titre": "A truly awful experience",
          "Contenu": "I bought a refurbished sat nav from Garmin FactoryOutletStore. It suffered a complet system failure on a trip through the alps. I tried to return it but it cost €40 and was never delivered, arriving back a while later. In the meantime, I purchased another from the smae company, this time having to pay €45 to have it sent. I was told this was because it was not being delivered within the UK. When I returned to the UK I returned, as arranged, the first, faulty sat nav, having to pay £9.45 to do so. I received absolutely no refunds on the €85 and £8.45 in postage I had to pay. The whole process has taken nearly a year in all. This is not a company I would recommend. At one poiint, my emails were not responded to. Now when I call I get what seems to be a US call centre, not the UK customer services I first spoke to when ordering the first sat nav. Given the time frame, it's difficult to give a date for my experience. It's ongoing regarding the refunds."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mychal Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T08:22:53.000Z",
          "Titre": "A complete scam",
          "Contenu": "A complete scam. Do not spend your hard earned money to fund this disgrace of an retailer. I've been waiting two months for a refund. With each inquiry (ie,, 4 contacts) I'm told, \"It will be complete in two business days\". My next stop is the Attorney General.Bottom line... Steer clear."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sue Morrison",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T11:39:19.000Z",
          "Titre": "Still waiting over a month now for some…",
          "Contenu": "Still waiting over a month now for some boots I ordered … will never use this company again and will let everyone I know to avoid it too. 0"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Howard Cowell",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:58:14.000Z",
          "Titre": "I ordered Sonicare replacements on July 31, 2023",
          "Contenu": "I ordered Sonicare replacement heads on July 31, 2023.  I waited over a month and called.  They said they were not in stock but would be in about 2 weeks and would ship then.  I did this 2 more times and as of today (Dec 1, 2023 - 4th call) they are still not in stock.  My original item was $31.96 and now it's listed as in stock for $93.99.  Clearly they do not want to honor the original price they sold it to me for.   I found a suitable replacement on their website and said send me these instead.  Reply was: Oh, they're not in stock either even though the website says they are In Stock.  Then she says the website has not been updated.  If that is the case, they're selling inventory they don't have in stock.  If I could give this company a NEGATIVE 10, I WOULD.  What a bunch of CON artists!!!!  Don't order from these \"people\".  To factory outlet: don't bother with a pathetic response, I'll never read it... juist get me my refund!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Shalbin John",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T05:17:58.000Z",
          "Titre": "This store is cheating the customers.",
          "Contenu": "This store is cheating the customers.. we had placed an order on 26 (Order Date: 9/26/2023 7:14 PM) with 2 days shipment (\"In-stock\"  item) after many follow-up's they  found out that its backorder and NO ETA..    No Emails, No tracking information, No updates.. false promise to call back.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tomo",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T23:48:52.000Z",
          "Titre": "Service not as promised",
          "Contenu": "To Whom It May Concern:In checking back in with you today, 10/10/23, your representative advised me that on August 17th, 2023 I was notified via email from Ordersatfactoryoutletstore.com  that this replacement battery was discontinued and the order cancelled the same day.Other than the solicitation for the battery which occurred on the same date, you can see from a screen shot of my messages, no such email exists.  I will be doing an audit of my bank account regarding this matter and if a charge occurred and was not returned, I would advise you credit my account $104.73 which represents treble damages for a fraudulent transaction.If no such credit is discovered, your next communication will be from my legal  counsel.Tom 520 979 2041"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tony",
          "Nb_Reviews": 4,
          "Date": "2023-07-23T10:34:17.000Z",
          "Titre": "Item arrived damaged",
          "Contenu": "Item arrived damaged.  Received UPS return label and dropped off item at UPS access point (corner shop in Epsom).  UPS have no record of tracking number provided on return label and are unable to locate item.Return label obviously not right.  Factory Outlet Store have not refunded and are unresponsive.Do not buy from Factory Outlet Store.23/7/23 Hi, tried calling no response.  Are you The Factory Outlet Store or Factory Outlet Store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren Brady",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T02:51:46.000Z",
          "Titre": "Placed an order back in June and…",
          "Contenu": "Placed an order back in June and product had not arrived come August. I reached out to customer service for an explanation or refund. When they strung me around twice asking me to wait a number of extra days for product to arrive instead of refunding me, I reached out for a third time and they still have not responded. Don't shop from here. It's a hoax."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trent Brown",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T21:52:19.000Z",
          "Titre": "I ordered an item from Factory Outlet…",
          "Contenu": "I ordered an item from Factory Outlet Store and I keep getting an update on a later delivery date. Very aggravating when the date keeps moving forward.  I don't believe i will be ordering anything from Factory outlet store again. As of to date I still haven't received the item."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "El Cranko",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T19:40:09.000Z",
          "Titre": "Total Con - Do not buy",
          "Contenu": "Got confirmation email, no tracking information and then when I chased it was told due to factory issues satnav model wasn't available, but I could buy a more expensive one. I said no and asked for refund, they said to return the product (that I never received!).Post their contacting me below, I asked for a refund but I have not received it. DO NOT BUY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicki Belt",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T20:00:20.000Z",
          "Titre": "Negative Starts",
          "Contenu": "If I could give  -stars I would.   I thought I was purchasing a Plantroncis wireless device to use on my computer to Teams calls/meetings.  What I ended up paying was $200 for a heavy paper weight. It worked for a short time, and just when it passed the time I could return it, it died.  when I tried to call their \"LIVE SUPPORT\" - I ended up having to go through a chat box and they said they could give me a number to reach out to the manufacturer.     HORRIBLE CUSTOMER SERVICE and SUBPAR PRODUCTS.   I DO NOT recommend purchasing from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AnnR",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:01:52.000Z",
          "Titre": "misrepresentation of Garmin GPS",
          "Contenu": "Company lists a reconditioned Garmin Drive 50LMT, which means Lifetime Maps and Traffic. They show a Traffic receiver power cord in their picture. But when I asked if it is included in the sale, I was told that only a standard cable is included and I would have to purchase a Traffic power cord in order to have traffic. For $60, almost as much as the GPS. CSR seemed unable to accept that this was misrepresentation. Of course that's not his job. And oddly enough, when you look at some of the reviews on Trustpilot, the written reviews are pretty bad, but they have 5 stars on them. Seems pretty bad to me. I guess Trustpilot is not to be trusted either."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kathy Jowitt",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T01:24:27.000Z",
          "Titre": "The Factory Outlet store ( also trading…",
          "Contenu": "The Factory Outlet store ( also trading as JZ Y and PE Group Azamoor) seem to be a  fraudulent scheme that involves creating fake online stores from China. These fake stores lure unsuspecting customers with attractive discounts and offers, but they either deliver counterfeit or inferior products, or nothing at all. The customers who fall victim to this scam end up losing their money and personal information, and have no recourse to get a refund or compensation. I git a delivery notification pretending they had sent the goods but its all lies.I did get emails back after lots of digging and was told lies about shipment issues and they have offered part payment back but not shipping. We will see."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brian Turner",
          "Nb_Reviews": 7,
          "Date": "2023-09-28T21:52:05.000Z",
          "Titre": "Garmin GPS refurbished",
          "Contenu": "Had a bounce back email accepting my email and telling me within 24 hours I would be answered. 5 days later and still nothing and my garmin gps is broken. I have since emailed customercare email and still nothing. What is going on with this company. I am close to calling my credit card company and getting my money back. Service is shocking.————-Update. 4 days to respond. Tell me to deal direct with Garmin. They send me a link that is totally useless. I then email them again and that was 2 days ago again. Nothing. Please Please Please Garmin stop dealing with this company and secondly Please do not buy off this company. Absolute fraud and joke. I’m off to the ombudsman and my credit card company. Double shocking"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rachael Wood",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:29:02.000Z",
          "Titre": "Numerous emails",
          "Contenu": "Numerous emails, no response.24 hrs and I will write full review but would NOT recommend using. Very scammy behaviour"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "patty johnson",
          "Nb_Reviews": 4,
          "Date": "2023-08-11T16:01:19.000Z",
          "Titre": "Problems with delivery and receiving product …",
          "Contenu": "I ordered support adjustable sandals  942119 and I became very worried I had been scammed.  The delivery took much longer than expected, and had mixed messages about when it reached the US, Minneapolis and our local distribution center. I tracked the package. It was supposed to show up at my home on Aug.8.  I received a notification it was supposedly delivered at 7:15  but my security system showed no such delivery.  I received another notice that it was delivered at l0:54.  My husband was home and the Ring doorbell showed no such delivery. What is going on. now contacted support and they say SebastianIt seems 236723055840036 to be a different order number , our order number starts from  FOS.In the light of some similar emails and chats we received recently, I suspect that you along with some others could have been a victim of a mala fide online transaction..Alternatively, this can be a genuine error from the company you transacted with, you may want to try and reach out to them..Since we are not a party in this arrangement, I am afraid that we are unable to be of any assistance to you.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thorvald Hansen Jr",
          "Nb_Reviews": 4,
          "Date": "2023-01-24T15:08:36.000Z",
          "Titre": "No confirmation email",
          "Contenu": "No confirmation emailNo shipping emailNo answer when the were contacted!Canceled order then received an email with shipping!Contacted bank and Canceled the transaction!They should be ashamed of the treatment of their customers!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed in MI",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T21:30:43.000Z",
          "Titre": "Resolved after posting",
          "Contenu": "Edited:  I am glad to report that, after posting this review, I received a phone call (and then a refund within a few days of the portion of funds that were withheld from my original return).  This amount made my refunds equal my purchase price (I paid return shipping) which was all that I asked for many months prior and wish I had posted sooner.[original post] I am so disappointed that when I returned a (brand new, in the original box, packaged impecably for return) Pet Safe dog containment system (after following the correct proceedure and receiving a RMA-Return Merchandise Authorization number) I received only a partial refund!  I have a copy of the return policy which says I can make returns for a FULL REFUND if all of these proceedures have been followed. I have made phone calls directly to the customer service, sent emails-everything short of filing a claim with my credit card company for fraud-with no satisfaction.  I was told that their policy was to not refund shipping (no shipping was charged at purchase AND I paid return shipping which wasn't cheap and further adds to my losses)!  Another comment from customer service during a phone call was that there is a 15% restocking fee (to open a box and put a perfectly good item on a shelf?). That does not sound like the written 100% refund policy listed online. They withheld $56.17 and it cost me $14.90 return shipping besides!  Unacceptable!  Every time their (daily) emails come to my inbox, the bandage is torn off again-reminding me of how this company treats its customers-I can not bear it any more and I want to warn others not to fall into the trap that I did thinking that I could believe in this company when their stated policy is that you will receive a full refund for proper returns."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Boyle",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T21:58:09.000Z",
          "Titre": "Discontinued items show as in stock, then they falsely tell you they are \"backordered\"",
          "Contenu": "Items that show as in stock are not; service then says they're \"backordered,\" even if they are no longer in production. They are just trying to get you money and to hold onto it as long as possible. Definitely avoid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dawnna K  Ayres",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T07:15:39.000Z",
          "Titre": "not good",
          "Contenu": "Was to be shipped in 3 days and been 10 now and is now on back order and was not told that poor information on this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "garbage can for spam",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T22:45:54.000Z",
          "Titre": "No returns.",
          "Contenu": "This store sold a sham item to me and then would not take it back. There is no returns service and it is impossible to return items.  They make it seem like you can return things but you cannot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James  Boyle",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:28:09.000Z",
          "Titre": "payments pain in the butt",
          "Contenu": "I did not get the monthly payments even though my credit rating is over 800. I was not happy with the out come. Trust pilot is a major pain, you need to allow us to bypass."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmanuel H.",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T19:51:15.000Z",
          "Titre": "Suspension of scam website",
          "Contenu": "I placed an order FOS12314568E. I was sent an email saying that there was an issue with the order. Once I called the guy said that I need to pay by money order or check. I asked why when you have already debited my account? This appears to be a scam website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve McCamey",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T20:50:43.000Z",
          "Titre": "These people are not good people to buy from.",
          "Contenu": "I cant speak for everyone but these people are not user friendly to fisherman.  They sent me the wrong transducer cable and it was not the correct cable for my Lowrance unit that they sold me also. I ordered a 9 pin transducer cable and they sent a 5 pin that wouldn't work. It was several months before I had an opportunity to put it on.  That's when I realized it was wrong cable.  They would not even allow me to send back to them, at my own expense and swap for the correct cable. Why would they not want to help me especially when I was going to pay freight to send wrong cable back. It was brand new in box. Return policy or not,  what’s  the problem with helping someone one especially when it’s your fault in the first place. That's the kind of people they are. I will never do business with them again. You can take your return policy and personally stick it up your ass, especially after I offered to pay the shipping. This is not the kind of company anyone want's to buy from....Your FactoryOutletStore.com Order Receipt # FOS12186275EFactory Outlet Store 575 Underhill Blvd. Unit 350 South Wing Syosset, NY 11791800) 720-5529 Extension: 721"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Burroff",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T01:50:14.000Z",
          "Titre": "slow",
          "Contenu": "slow, annoying help pop up, even after you close it, the search feature does not work wellThis is NOT a Garmin factory store"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bernard Jaquemot",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T01:42:43.000Z",
          "Titre": "I order a GPS and it came with no power cable",
          "Contenu": "I order a GPS. It came with no Power cable.. It is like Buying a car but  the engine is missing .Without the power cable the GPS is Dead. Support should just have sent me the cable.  Instead they want picture of the content of the box. there is no power cable in the box. Will that proof that the cable is missing.They gave me a link to buy one for 29.95.  That is the easiest thing for me to do.. It is not the money but why pay for something the I already pay for"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leanne Barnes",
          "Nb_Reviews": 17,
          "Date": "2023-09-08T17:50:01.000Z",
          "Titre": "I still haven't received my item",
          "Contenu": "I still haven't received my item. I've emailed you twice and heard nothing. And I haven't received any call or email"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Loeb",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T17:00:55.000Z",
          "Titre": "Unrelenting spammers",
          "Contenu": "Unrelenting spammers. Keep emailing from different addresses so it's harder to block"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Kramer",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T23:18:23.000Z",
          "Titre": "Scam — be careful",
          "Contenu": "I never got the Bose system I sent for.  They claim to have delivered it.  That’s $50 wasted.  This place is a SCAM — be very careful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "itsadqthing",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T18:21:08.000Z",
          "Titre": "Buy elsewhere, customer serverice is non-existance.",
          "Contenu": "Ordered a trolling motor, was told it was being shipped from the next state.   Was expecting, kept checking for a tracking number,  Never got it.   Called, they said it was cancelled,  Never notified me,  and I had to dispute the charge on my CC.   Will never order or deal with this company again.Update:  Got an email saying it was now back ordered, call the company back, and told them to cancel.     I guess they have no clue what is going on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shona Mccoy",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T23:35:23.000Z",
          "Titre": "If I could give a 0 I would",
          "Contenu": "If I could give a 0 I would.  Not the right product yet clearly stated it is.  Offers another product which isn’t it either"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kenny D Glenrothes",
          "Nb_Reviews": 15,
          "Date": "2022-10-20T07:08:19.000Z",
          "Titre": "Garmin 55 renewed not sure what part of…",
          "Contenu": "Garmin 55 renewed not sure what part of this the company missed out came with screen that was white all around the outside edge and what I could see could not make out the picture and the battery would not holding a charge just kept closing down the minute I removed the power and had to setup all over again when I requested a return they had the the brass to ask me to pay for P&P my 1st and last purchase from this lot Don't Buy from this company you will have problems also Factory Outlet Store don't post any reply to this review as I don't want to hear your white wash Also that bad they have two review pages 3.1 stars that bad they change name to boost reviews"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Marzena Barej Mysak",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T14:55:30.000Z",
          "Titre": "diit its scam be careful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Gaston-Kilgore",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T14:18:23.000Z",
          "Titre": "Only buy new they ship defective items",
          "Contenu": "sends you a defective unit makes you pay to send back. then send you money for shipping. then without telling you cancels your order. No email! have one asking me how i like my voyager 5200. like the way they say they are plantronics outlet when they have no affiliation. BUY SOME WHERE ELSE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T21:20:33.000Z",
          "Titre": "I ordered a data transfer cord for my…",
          "Contenu": "I ordered a data transfer cord for my Garmin...it said ‘this cord will connect your Garmin to any pc’ to transfer data.  Unfortunately to does not work on mine.  I need a mini head, not a micro, so I still can not do the job.  Below oil said works with Garmin models, and i saw dezl, which I have, but you sell so many models and there is no model number on my case.  How was I supposed to know?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HENRY VAN GOETHEN",
          "Nb_Reviews": 4,
          "Date": "2022-05-04T17:31:28.000Z",
          "Titre": "LIES LIES AND MORE LIES",
          "Contenu": "placed a order on the 22ed of April 3 to 5 day delivery lie called the28th told it would be delivered today  a lie called again the2nd of may told it was out for delivery again another customer service LIE and could not give me a tracking#  CALLED AGAIN THE 4THWOULD NOT GIVE ME A REFUND AND SAID IT WILL BE HERE TODAY STILL WAITING   WILL NEVER ORDER FROM AGAIN !!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl Haggard",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T20:39:46.000Z",
          "Titre": "Avoid FactoryOutletStore.com",
          "Contenu": "Avoid FactoryOutletStore.com. I don’t know if I trust this Trustpilot either as, check now after the fact, most review sites are pretty negative about this outfit. Bought a refurb TomTom and it did go past the 90 day warranty. But they wouldn’t work with me at all when it stopped working shortly after that and it stopped acquiring any satellites at all. Totally locked up. They just referred me to the manufacturer. I wouldn’t buy from them again as most places would work with you and take it back and send you another refurb device. If they won’t be somewhat flexible on returns, just shop somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesus",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T15:30:40.000Z",
          "Titre": "This place is the worst",
          "Contenu": "This place is the worst. They will not ship you your items in the timeframe they tell you. It is better to pay a little more and actually receive your items on time. If you call them and the recording asks you to hang up but keep your place in line it BS. They call you back but wait for 1 second before hanging up. DO NOT BUY ANYTHING FROM THEM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Weller",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T16:38:29.000Z",
          "Titre": "I purchased a refurbished Polycom…",
          "Contenu": "I purchased a refurbished Polycom 2200-07880-160 Wireless Conference Phone and when i received it it didn't work. one of the power supplies were bad so i called support and she stated they don't guarantee power supplies when purchasing refurbished items. I literally unboxed it and plugged it in and it didn't work. I would never purchase from this place again and i urge others not to as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Montgomery",
          "Nb_Reviews": 7,
          "Date": "2022-01-20T19:32:22.000Z",
          "Titre": "Ordered a headset from them",
          "Contenu": "Ordered a headset from them.  It arrived promptly but didn't work.  Sent int he form to get a replacement and was supposed to get a label to return the defective headset.  Didn't get it.  Called back 4 more times.  The last two times I was told that my case was being elevated.  Never got anything.  In order to dispute with the card company had to pay $11 to ship back to them.  Avoid this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Mattingly",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T23:16:30.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Worst customer service ever. Don’t order from these guys- they advertise 2-5 days delivery. It’s been two weeks now and I still don’t have my order. They shipped UPS and then handed off to USPS. What a cluster. Each entity is blaming the other. Ultimately Factory won’t resend or refund. They are telling me I have to wait another 8 days to get a resolution from them. I WILL NEVER ORDER FROM THESE CLOWNS AGAIN !!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leigh Ann & Brian Nielson",
          "Nb_Reviews": 3,
          "Date": "2022-03-14T18:48:13.000Z",
          "Titre": "Do not trust that your item is in stock- they lie",
          "Contenu": "Their website showed the product I wanted was in stock. I called to confirm my Minn Kota product was in stock and they assured me it was so I ordered it. I received an email confirmation of my order. Two hours later I received another email stating my product was back-ordered!! Called again and was told the item was in stock and my motor would be shipped out the next day. Not true!! Finally cancelled order.Will recommend to my Minn Kota Rep. that they do business elsewhere. As far as I am concerned, this place is a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "L. Rose",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T17:03:33.000Z",
          "Titre": "Order never arrived - and was charged for item. No refund was returned",
          "Contenu": "Order never arrived, but they charged the credit card for the order. It had been in \"Waiting Fulfillment\" status for over a month - but they took the money on April 12 - with no delivery.  Order is still in the same \"Waiting Fulfillment\".They did not respond to Email/Contact us forms for refund.Live Chat always was closed: \"No Agents available at this time\" - regardless of what time you try.Was on hold with the phone for over an hour - without being passed to a customer service person.Still can't get my request for a refund to get answered. Please return my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2021-11-21T00:28:48.000Z",
          "Titre": "I ordered a replacement charging cord…",
          "Contenu": "I ordered a replacement charging cord for a Garmin Rino650 radio, but was sent a mini USB wall charger. In order for me to return the wrong product, I have to pay shipping and a restocking fee for a $17 item. It's almost pointless for me to return it after all of that is deducted, so they keep my money, I keep a charger that I don't need, and I still don't have a charger for my Rino!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David  Brandon",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T21:07:34.000Z",
          "Titre": "You should have offered a tune up for…",
          "Contenu": "You should have offered a tune up for my existing Garmin 6\" GPS.  It's an older unit that needed a new screen.  I don't know if it's a good as the one In have just ordered.  I hope the new one will talk while I'm driving.  You might emphasize the features.  Does my new one take pictures as the old one did?Please advise.David Brandon 313 330 1842Thanks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Conrad Wojnar",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T20:28:34.000Z",
          "Titre": "Slow and Inaccurate",
          "Contenu": "I ordered a Motorola 7 phone with \"expedited\" handling.  It took 10 days to arrive and I tracked the package traveling all over the country, logging about 2,000 miles for what should have been a 900 mile journey.  Then I found out that the charger they sent me did not fit, and they would not replace it after several phone calls.  I had to get my own charger,  I would not purchase from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T16:50:28.000Z",
          "Titre": "unsanitary",
          "Contenu": "I would not recommend ordering from this company. we ordered \"certified refurbished\" call center headsets. The items received had missing and or incorrect parts. Most importantly they appeared to not even have been cleaned much less \"refurbished. The employees would not even put them on due to the ear pieces. They appeared to have been pulled from the trash and placed for sale online. do not do business with this company. on the upside, they will ship the unsanitary and incomplete items quickly!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RawJawRick",
          "Nb_Reviews": 5,
          "Date": "2021-09-24T00:54:55.000Z",
          "Titre": "BUYER  BEWARE! Charged to return defective GPS",
          "Contenu": "I bought a Garmin GPS and when it arrived it was defective so I returned it, BUT, the FactoryOutletStore kept almost $20 from my purchase (I guess due to re-stocking a defective item????)You state you \"test\" each item to assure it's condition, BUT, you sent me a broken \"refurbished\" item and then have the nerve to charge me for RESTOCKING & SHIPPING.sad!WHAT A SCAM & RIP-OFF!BUYERS BEWARE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Young",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T22:01:20.000Z",
          "Titre": "Don’t waste your time ordering from them.",
          "Contenu": "I ordered a trolling motor and all associated hardware the first week of March and was told that it would be in stock within 45 days. They shipped me one of the components and then kept back ordering the actual trolling motor. I tried to return the part they sent and they argued with me that it was past the return window. I did get a refund after they”made an exception “. Now it’s going on 90 days and all I have is a bunch of emails telling me it’s still on back order. What a waste of time this company has been!Factory Outlet Stores contacted me after this review and promised me the trolling motor on July 27th. Instead I got another email informing me that it is still out of stock!More empty promises!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon M Chu",
          "Nb_Reviews": 3,
          "Date": "2021-09-26T20:54:15.000Z",
          "Titre": "The model selection filter does not…",
          "Contenu": "The model selection filter does not work. User manual is not always available for some models. It would be nice to have a chart showing the differences among the models. You really need to dig into the details in order to figure it out. I must say my shopping experience is less than happy. Garmin being the major GPS vendor around is like Comcast in cable TV, providing a needed product/service but pay little attention to customer needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T16:14:53.000Z",
          "Titre": "Horrible customer service and shipping misrepresented",
          "Contenu": "Horrible customer service and misrepresentation on their website for shipping. Website says 2-3 days free shipping. Have been waiting almost 10 days. They say UPS but it's actually UPS + USPS so no guarantee of when it will be delivered nor is it tracked. When I asked customer service they said 10 days shipping--so completely misrepresented. I should have just used Amazon for a few dollars more and gotten it the next day. Would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "abcd",
          "Nb_Reviews": 3,
          "Date": "2021-09-17T15:02:00.000Z",
          "Titre": "Extremely poor customer service",
          "Contenu": "I ordered a razor for my husband and never got it.  It shipped UPS and then was turned over to SmartPost.  I got an email that it was delivered to the \"mailroom\", so that must be USPS.  Anyway, after 5 phone calls and 3 emails and 2 months, I contacted my Credit Card Co and filed a dispute.  I will not buy anything from this website!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 7,
          "Date": "2021-08-06T15:14:48.000Z",
          "Titre": "Poor customer service and product description",
          "Contenu": "Ordered a telephone handset, based on their description, it was supposed to work with my base.  It did not.  I spent $37 (including tax) for it.  It cost me $7.70 to sent it back, requesting a handset that would work.  Instead of a handset that would work with my base, they issued me a $23 refund.   TOTALLY unacceptable and total rip-off!   I shall never do business with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Old Dog",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T02:58:22.000Z",
          "Titre": "DO NOT ORDER FROM THESE LIARS",
          "Contenu": "I ordered a Dogtra training collar from these clowns, NEVER AGAIN.  I asked and paid for Priority shipping and it took them over 48 hours to ship the collar FedEx. FedEx stated the time of pick up. They said 3-5 days and so far it's been a week. Told them I was going to send it back and now its a 15% return fee plus shipping. Dogtra told me do not order from them, I have learn a valuable lesson Do not order when the people taking the order are middle easterns. NOT TRUE AMERICANS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich  K",
          "Nb_Reviews": 2,
          "Date": "2021-08-28T01:49:52.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service. Shipped item came in a plastic bag with no instructions or template to install. Have to return original quick release bracket so they can send again. Hopefully, this time I'll get the box so I can cut the template from the box so I can install the bracket. Waste of time and delays installing trolling motor by days if not longer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph  Melchiorre",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T08:52:46.000Z",
          "Titre": "Order shipped 30 Sept",
          "Contenu": "Order shipped 30 Sept. by UPS, supposed delivery 5 Oct. by USPS.  Still not delivered today, 14 Oct.  Factory Outlet is paid and absolute no help to locate order.  Response from Factory Outlet, if not received by 21 Oct. will issue refund or resend.  That would be more than a month to ship from NY to DE.   Not acceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CLARENCE DRIVER",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T18:08:22.000Z",
          "Titre": "I purchased two filters for my…FOS10958582E",
          "Contenu": "I purchased two filters for my refrigerator in November of 2020. Unaware that they  couldn't be returned after six months.  This wasn't the first time I had ordered them. I  recently bought a new refrigerator and gave the old one to my daughter and she has no water available. I was planning to use this source for my new refrigerator but now I will seek another source. The purchase was not planned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Harris",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T19:35:22.000Z",
          "Titre": "Ordered 3 batteries for my dog collar",
          "Contenu": "Ordered 3 batteries for my dog collar, plus the 2 year protection warranty.   One battery worked about 2 weeks, so I attempted to return it, but this company referred me to the insurance (protection plan) and the insurance company referred me back to the manufacturer.   Catch 22 for the customer (me in this case) with no resolution other than to contact the manufacturer.   I call a 3-way scam alert on this after being jerked around and left with a defective product sold by factory outlet store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph  H",
          "Nb_Reviews": 3,
          "Date": "2021-06-18T04:01:56.000Z",
          "Titre": "The payment page is all messed up",
          "Contenu": "The payment page is all messed up. The site worked well until I attempted to pay then many letters in words were missing, the price disappeared,  and I was no longer sure if what I was about to buy was what I wanted. Refresh didn't help; it only scrambled the text and graphics again.the item I found was a good price, but if you can't buy it then the site is pretty much usless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheila Perez",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T16:06:15.000Z",
          "Titre": "Awful customer service",
          "Contenu": "Awful customer service. Pay for two days delivery and 2 weeks later I’m still waiting for items.  Trying to cancel order and they don’t want to cancel saying order is with carrier but they don’t have tracking number.  I sent multiple emails trying to get info about my order with no luck.  I trying to talk with supervisor is not available to talk to me.  Horrible experience, the worst customer service ever.  Never again..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Elliot",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T17:30:24.000Z",
          "Titre": "Scam stay away.  You will lose your money.",
          "Contenu": "Placed an order almost a month ago.  Has yet to be delivered.  We ship and receive shipments daily for our business.  Customer service has been no help at Factory Outlet Store.  Stay away from this site.  At this point I deal the whole site is a scam.  Customer service is not in USA.  Big red flag.  I lost $ make sure you don't.  Find someplace else to buy ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colleen Miele",
          "Nb_Reviews": 2,
          "Date": "2021-12-07T20:13:40.000Z",
          "Titre": "Read the reviews!!",
          "Contenu": "Read the reviews! I received my phones on October 29, 2021.  After a difficult time installing them, we had the main base phone work for 3 weeks total.  None of the other phones will work with this base, but since we are 7 days past their 30 return policy, they won't do a thing.  I am going to buy a replacement on ebay where I have the option to purchase a 1 year warranty.  I think that 37 is a pretty short period of time to be able to use phones I paid over $600.00 for!  Never trust this company, don't believe me? Read the reviews!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carolyn Morris Lynch",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T21:54:20.000Z",
          "Titre": "I ordered a Garmin activity tracker…",
          "Contenu": "I ordered a Garmin activity tracker (refurbished) & it only worked for 2 months.  you can't talk to anyone live on customer service. their recording says email them.  I emailed them & they answered once to say give them order #.  i gave them order # & they never responded.  I will never order from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "raymond  tartakoff",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T14:17:56.000Z",
          "Titre": "I bought a fishfinder last year on…",
          "Contenu": "I bought a fishfinder last year on amazon, not realizing it didnt include transponder.  today i was waiting 25 min for tech support.  then i was told item i wanted was out of stock.  then to chat, where i was told item was IN STOCK.  next i will get email saying it is out of stock.  i wont deal witha  company that has so few lines for tech support and with incorrect information and so many lines to order.  your company will get '0' business from me in future.ray tartakoff"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T19:02:05.000Z",
          "Titre": "THIS COMPANY DOES NOT CARE ABOUT THE CUSTOMER!",
          "Contenu": "I purchased a GPS product and after 3 weeks it is yet to arrive. FedEx told me it was lost and when I told FactoryOutletStore.com that it was lost they said it would take 10-30 days to \"investigate\". I then told them I would like to cancel the order and was told \"that is not our procedure\". Upon that info, I called my CC company and disputed the charges."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KT",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T15:49:59.000Z",
          "Titre": "Didn't have the item in stock and didn't say so",
          "Contenu": "When I ordered this strap, they did not tell me that they were out of them. After 6 days I initiated a chat with them and they told me it would be  another10 days before they received their shipment.  I cancelled the order and found it for $40 dollars less on Walmart arriving in two days.I won't bother ordering anything from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Irene R. Maloney",
          "Nb_Reviews": 9,
          "Date": "2021-05-21T20:06:00.000Z",
          "Titre": "Bought a Garmin GPS thru this store…",
          "Contenu": "Bought a Garmin GPS thru this store they say easy returns which is an untruth. You must call and wait for someone to help who lives in India. Then you pay shipping in full and have a 15% restocking fee. They have this well hidden on their website at the very bottom of the first page in the smallest font know to man or woman. Don't buy anything here it is not worth it go to amazon get free shipping and free returns from your computer and no restocking fee."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Halter",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T18:57:13.000Z",
          "Titre": "This has been the worst",
          "Contenu": "This has been the worst! when i ordered for this company they said next day it would be sent out and now after 2 weeks of waiting, I called customer care only to be told my order is not available maybe until next week, but he was not sure! Do your self a favor and buy some other place that can at least answer when you will get the product that they sell you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sonny Gleason",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T10:11:48.000Z",
          "Titre": "I wish I could give negative stars",
          "Contenu": "I wish I could give negative stars. If they have what you want in stock and you get it with zero issues,  congratulations. But if it is backorderd, you need to return or any other issues, good luck. They will lie, promise call backs that never happen, or just ignore you. I will never send them money again for anything. Be very careful doing business with this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T12:09:04.000Z",
          "Titre": "I call to return a product that was…",
          "Contenu": "I call to return a product that was wrong and they hung up on me. That’s no way to do business. New report: I did receive a call from a man that was willing to help me resolve my issues. Since then they have issued me a credit and did not require me to return the other filters. Now if I could just get the right filters I would b a happy camper lol"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chicagoland Dave",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T12:41:46.000Z",
          "Titre": "Nine days after placing my order and waiting",
          "Contenu": "Nine days after placing my order, FedEx says that my package is someplace in Ohio....maybe. NY to Chicago by way of Va, Tenn, Miss, KS and now Ohio. I paid for shipping to boot !  If you need your item this month, shop somewhere else. Note: this fiasco started well before the Indy FedEx shooting - so don't blame it on that !  FOS customer service don't seem interested. I can only imagine what my package will look like when it finally gets to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff V",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T19:20:21.000Z",
          "Titre": "Waiting, waiting and still waiting",
          "Contenu": "I placed an order for a replacement battery for my son's laptop on Feb. 17th. When I placed the order they said it would ship in 3-5 business days, that was 2 and a half weeks ago and I am still waiting for it. And to top it off I talk to Reuben online today Mar. 6th to get a copy of my order receipt, that was never sent to me so that I could track my order. This was my first and probably my last order from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shanice",
          "Nb_Reviews": 2,
          "Date": "2021-02-09T16:53:04.000Z",
          "Titre": "THIS SITE CUSTOMER SERVICE IS POOR",
          "Contenu": "THIS SITE CUSTOMER SERVICE IS POOR. THEY DON'T KNOW WHAT THE HELL THEY ARE DOING AND VERY MUCH DISRESPECTFUL. THE ONLINE ORDER NOR THE PHONE PERSONELLS HAVE NO MANNERS. KELLY TOLD ME TO BUY SOMETHING THAT FITS NOTHING TO THE DESCRIPTION I GAVE HER AND DEREK CAN'T ANSWER QUESTIONS THEN HAVE THE NERVE TO HANG UP THE CHAT ON ME... I AM VERY DISPLEASED FOR A PLACE THAT HAS BEEN AROUND FOR SO LONG AND MANY COMPANIES USE IT"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KEITH HITZKE",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T18:16:36.000Z",
          "Titre": "Absolutely the worst !!!!",
          "Contenu": "Absolutely the worst !!!!! I ordered over $6,000 worth ow lowrance fishing products.  The shipping box was totally damaged with parts falling out.  I filled several claims with lowrance factory outlet store and uploaded pictures twice.  I still haven't got a call back.  I would never buy from them again, there customer service is terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "first time buyer",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T20:29:13.000Z",
          "Titre": "Totally happy with the service I got from WalMart........",
          "Contenu": "Took F.O.S. a week, after taking my order, to tell me they couldn't assess my CC info. Took one day for WalMart to tell me that the same exact order has already 'shipped'."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Holmes",
          "Nb_Reviews": 8,
          "Date": "2021-07-09T14:46:36.000Z",
          "Titre": "I have had to write a review after poor customer service and an empty box.",
          "Contenu": "I have had to write a review after poor customer service, being lied to and being sent an empty box via Amazon even though they don't use Amazon apparently.  Requested a refund several times, but kept getting the same message - its being delivered today.  It's just not on for something so expensive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark W.",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T19:45:44.000Z",
          "Titre": "DO NOT BUY ANYTHING FROM THIS…",
          "Contenu": "DO NOT BUY ANYTHING FROM THIS COMPANY/SITE.Bought an item; they shipped a broken one. Was a hassle to return. They agreed to replace. We had to pay to ship it back, even though it was defective. Then they charged us a re-stocking fee and refused to send us a new one! 100% RIP-OFF, IMHO.UPDATE: After a very threatening letter, they agreed to refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Sagel",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T10:46:20.000Z",
          "Titre": "Do not buy from here",
          "Contenu": "Do not buy from here, they post \"Easy return\" 20 day money back warranty when you try to return a broken out of the ox unit, they will not refund your money and you will be out shipping to send units back.  Keep getting promised i will get a full refund but then they don't do it.  Stay away keep your money do not trust.  Also not very good at communicating shipping, my order was broken into multiple shipments and they couldn't tell me when it was arriving."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Russo",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T19:43:26.000Z",
          "Titre": "THE WORST SERVICE I HAVE EVER DEALT…",
          "Contenu": "THE WORST SERVICE I HAVE EVER DEALT WITH IN MY ENTIRE 56 YEARS ON THIS EARTH.  WOULDN'T RECOMMEND ANYONE TO DEAL WITH THIS HORRIBLE ORGANIZATION!!!!!!Order Raymarine Quantum Radar. It was shipped in mid June and was lost and they have not replaced it or credited mu charge.  Made over 100 calls to support and note once did they return a call when they told me i will receive a call from a Manager. Steal your money and don’t even replace the lost product $1705 later and nothing!!!! Good Business practices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Copper",
          "Nb_Reviews": 2,
          "Date": "2021-07-19T01:18:27.000Z",
          "Titre": "Absolutely horrible customer service…",
          "Contenu": "Absolutely horrible customer service and dishonest. I ordered a cannon uni troll 5 6/3/21 and was told I would receive the product by the end of the month. June came and went. In July I called customer service and they told me that if I upgraded to the cannon uni troll 10 I would receive it in 7-10 days because the product is in stock. I paid for the upgrade. I have now found out that despite what I was told, the upgraded product is now back ordered and delivery date is unknown. Dishonest and unethical! Buy elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul  Lege...",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T15:21:58.000Z",
          "Titre": "I gave this site a 1 star rating…",
          "Contenu": "I gave this site a 1 star rating because I was not able to clear my screen after I placed this order until I wrote a review .  I HAVE NOT received the products yet.  I ORDERED IT 5 secs ago!   How can i rate a product I JUST ORDERED?    Get your $#@%# together."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T02:06:39.000Z",
          "Titre": "Worst company I have ever had the…",
          "Contenu": "Worst company I have ever had the displeasure of dealing with.  Their customer service is offal, no one there knows what they are doing.  They would not work with me on a product that was defective out of the box.The worst company I have ever dealt with.I will never buy anything for them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Lavoie",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T17:18:55.000Z",
          "Titre": "A Sign Of The Times Sad To Say",
          "Contenu": "First if possible they should get a negative -1 rating. I called to tell Factory Outlet that the emails they sent to my inbox had an offer for a Waterpik unit at $39.99but when I clicked on it their website said it was $59.99. Talk about ignorant or gaslighting. They acted like they didn't understand at all. I called 3 times two of the Cu agents didn't even know what a Waterpik dental unit was. They said they didn't even sell it. Well Waterpik is on their website. This I thought was a good company until a month ago. Sad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2021-06-24T21:32:53.000Z",
          "Titre": "Yes easy return,buyer beware",
          "Contenu": "I bought a Talon bracket for my boat said it was 360 degree turn did not work on my boat did not turn 360° went to return it cost me $40 to ship it back and then they are going to get a inventory 15% love the cost of the item to restock unbelievable and they wonder why people go to Amazon"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A.White",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T15:36:55.000Z",
          "Titre": "BEWARE - Horrible Customer Service",
          "Contenu": "EDIT - 11.30.2021 - After leaving this review, I was contacted by the company. They are shipping me the missing pieces. Once I have an operational headset, I will follow up with another edit to this review. I ordered a headset 10.13.21. It arrived on time, but did not work.  After my company helpdesk and the manufacturer both agreed it was broken, I paid out of pocket to return it and selected the option of getting a different product. Instead, they sent me the same product, but pieces were missing. After 3 attempts there is no resolution yet. Today is 11.29.21 and I still do not have a working headset."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "joe",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T20:44:39.000Z",
          "Titre": "Bad phone service",
          "Contenu": "There order service needs work it’s hard to understand there order representative she really did not have a good communication skill so I don’t know if my order went through or not they charge my card partially have no idea why don’t know if I should Call and cancel or not"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David J Dunville",
          "Nb_Reviews": 2,
          "Date": "2021-09-10T20:12:51.000Z",
          "Titre": "Their web site made a FALSE PROMISE",
          "Contenu": "Their web site made a FALSE PROMISE. They claim same day free shipping, that is not the case. Their own internet chat people even stated it as well. Received a call from the \"Manager\" for \"Customer Service\" Thursday. She claimed they shipped my order on September 6th, which was Labor Day. Yet UPS tracking shows 09/07/2021 9:01 P.M. Order information received. 09/07/2021 9:33 P.M. Shipment tendered to UPS Mail InnovationsSyosset, NY,  84 hour after the order is placed it is being shipped. When they claim Same Day Shipping, they must mean a 84 hour day!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh Jackson",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T23:41:31.000Z",
          "Titre": "If I could have 0 stars I would",
          "Contenu": "If I could have 0 stars I would. Worst customer service ever. I order some filters 3 weeks ago. They were supposed to be out for a 2 to 5 day delivery. 3 weeks later and I still have yet to receive them. I called customer service to speak to a manager and file a complaint and they hung up on me. The representative told me that the product was on back order and i told him that I didn't receive any notice when I ordered them. In fact I had to email them a week after I placed my order and they said they forgot to put the order in."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Schneider",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T19:48:18.000Z",
          "Titre": "Terrible costumer service",
          "Contenu": "I ordered a ghost trolling motor in April and found they were order till may and was told they had a larger one in stock I ordered it arrived a couple days later when I opened the damaged package several parts were missing I return the package was told I could wait for another one but they could not tell me if or when that would be so I asked for a refund after at least 15 call to them I could not get a answer from anyone they repeatedly said they would contact me and no one ever does I am still waiting to here from them to return the 3400 dollars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tab eli",
          "Nb_Reviews": 2,
          "Date": "2021-07-05T15:11:09.000Z",
          "Titre": "I asked for 3 Motorola H730 and got only one. Your website changed the amount",
          "Contenu": "I asked for 3 Motorola H730. Your site change d it back to one. I didn't' notice until it was delivered. I went into site today to order the other two and it kept changing it back to one.  I will go back in and order the 3rd one. But I shouldn.t have to go through this,."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Missy McCormick",
          "Nb_Reviews": 4,
          "Date": "2021-04-17T21:08:57.000Z",
          "Titre": "Sent me the wrong items and still…",
          "Contenu": "Sent me the wrong items and still charged me a 15% restocking fee plus shipping and the real kicker is I paid for the shipping to begin with. Chat agent had no explanation as to why I paid for shipping to receive the item, but they will still deduct shipping from my refund...plus the 15%."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack  Peterson",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T18:20:54.000Z",
          "Titre": "I placed an order",
          "Contenu": "I placed an order. Got it the next day. It was the wrong part. I tried to exchange it and they kept hanging up. After about 4 times I gave up. I’m calling my card holder to request a refund. Very frustrating. There were communication issues that made things worse. They told me to call back in an hour or so and everything was the same. All day and no results. I had part numbers from there site, and still more confusion. I spent to much money for all this crap, to be treated like I was just window shopping. If I have to buy another autopilot it will not be Raymarine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Anapol",
          "Nb_Reviews": 2,
          "Date": "2021-04-21T09:32:43.000Z",
          "Titre": "STAY AWAY!",
          "Contenu": "STAY AWAY, pricing is typically decent but India/offshore poorly trained  customer service is industry WORST.  Many other purchasing options are available that provide better service.  Frankly, they are brand killers with horrendous policies and service.You have been warned!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 24,
          "Date": "2021-09-23T16:38:32.000Z",
          "Titre": "Garmin 50 is horrible always chose…",
          "Contenu": "Garmin 50 is horrible always chose stupid narrow road in Wales if I use google I se compared to Garmin what Garmin doing I try everything on dhis gps always chose stupid narrow road highly Not recommended because Garmin don't doing nothing about dhis."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Miss Olivia Barton",
          "Nb_Reviews": 4,
          "Date": "2021-05-20T09:41:07.000Z",
          "Titre": "Poor Service",
          "Contenu": "Poor Service.  Received the item quickly but it would not charge or pair with a phone.  Tried several times to get help from the pretty awful support team.  When I asked to exchange or refund they still could not deal with the issue and told me to wait for yet another email!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Butch",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T21:02:09.000Z",
          "Titre": "Bought a replacement cell phone battery",
          "Contenu": "Bought a replacement cell phone battery. Product showed up in a timely manor. But, when I took it out of the package the pink water mark stickers were not on the new battery, that was the first indicator that I was going to have a problem. Next, I installed it in the phone and it powered up, but when I went to charge it, the phone said the battery was \"not compatible\" and would not charge. So when I returned it in the original package, undamaged and able to be restocked with no repackaging required, they would not give a full credit. Long story short, don't buy from them, you will get ripped off in the end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T06:09:22.000Z",
          "Titre": "Run Away, Do not trust Them.",
          "Contenu": "Going with the advice of the chat person. He says this will work, We shall see. And I saw .Chat person just wanted to \"Upsell\" Sent wrong one. Now want me to jump thru hoops to exchange. F-Them. RUN AWAY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith Davis",
          "Nb_Reviews": 3,
          "Date": "2021-03-22T15:49:52.000Z",
          "Titre": "Product shipped to us was in terrible condition…",
          "Contenu": "Product shipped to us was in terrible condition - I mean, covered in what looks like earwax - disgusting! On top of that, the box contained the previous buyer of these products who returned it and complained about restocking fees. We have spent hours trying to get these returned and get the money back. After repeated attempts to get ALL of our money back, they are still charging us something called \"return fees\". As far as are concerned, this place is a joke and has terrible customer service. We will not buy again and will warn anyone that asks to say away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 6,
          "Date": "2022-06-02T06:03:39.000Z",
          "Titre": "Couldn’t provide a simple USB C cord",
          "Contenu": "Ordered a simple USB C cord. Twice they sent the wrong item.too much hassle for an $8 item. The second time they wanted CLEAR pictures of what I received. Told them same as the first."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "McWhorter",
          "Nb_Reviews": 3,
          "Date": "2021-07-20T13:59:13.000Z",
          "Titre": "Shipped wrong filters",
          "Contenu": "I ordered 2 water filters and they sent the wrong filters. Called customer service 4 times and the rep told me that I received the filters I ordered. If so, why am I calling to exchange the filters? Just so frustrating and such a run around. I decided NOT to exchange the filters because they couldn't even confirm that it was in stock and never admitted to sending the wrong items. They still have my money, but I finally received the FedEx return email. Please do NOT do business with this company! I found my filters on eBay for slightly less with great reviews. There are numerous fake filters being sold."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "J.",
          "Nb_Reviews": 7,
          "Date": "2023-11-21T11:40:28.000Z",
          "Titre": "Had to complain to get my order.. No warranty information included in delivery!",
          "Contenu": "[Updated 21/11/23:] Finally got hold of the product - but only after complaining about the service.. Great product, which is credit to Garmin.. I just wish that Garmin would provide an in-house service for \"refurb\" products, instead of palming them off to companies whose main concern is short-term profit.. FYI: No warranty information included in the delivery, or at any point for that matter, company emailed but with no response - except for the sycophantic comments they've left below this review ;)"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jenny Yate",
          "Nb_Reviews": 3,
          "Date": "2023-04-20T19:33:38.000Z",
          "Titre": "Device doesn't work, crashes and turns off.",
          "Contenu": "I bought a Sat Nav, which has never worked correctly, it switches off and crashes. I tried to contact you, the only way I could find, was to email, so I did, I received a response saying a ticket had been created and I would be contacted. I have still heard nothing several months later.*update: customer services now in touch, not resolved but did respond."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:48:19.000Z",
          "Titre": "I ordered a \"factory refurbished\" phone…",
          "Contenu": "I ordered a \"factory refurbished\" phone and upon arrival it did not work.  The handset did not work on the phone, only the speakerphone was working.  I called customer service and they would not provide me with an advanced replacement, even though it specifically said \"2 year advanced replacement program\" on the page I purchased it from.  Upon ordering another phone to replace the broken one they sent, it showed up missing multiple accessories, including the cable that connects the handset to the base.  The replacement phone had the same exact problem and they refuse to compensate me with even free shipping on my 3rd order.  Just fine a reputable dealer that has US based customer service to buy your phones, the customer service here is a joke."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ray  Elliott",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T17:13:07.000Z",
          "Titre": "Don't use cookies for anything",
          "Contenu": "Purchase was fine, but there is no reason to put cookies on my device for any reason, and I can't opt out. Don't invade my privacy and I'll give you 5 stars. And I don't give a crp about your terms and conditions."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "Syeda Noorulain",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T12:31:42.000Z",
          "Titre": "FLP importance is if u work in forever…",
          "Contenu": "FLP importance is if u work in forever living product u can get 10p percent profit not in other companies Our sir tell us and most of the people are luxury now and spending a happy life due to flp u can check on Google and Instagram"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Meebs",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T22:42:49.000Z",
          "Titre": "New/refurb Garmin 61-lmt model",
          "Contenu": "New/refurb Garmin 61-lmt model.  Keeps giving me wrong directions.  On a 25 mile trip, was approximately 2 miles north of destination when it told me to turn right on street xxx and kept me in a neighborhood for 15 minutes.  It then directed me to the entry point of where I went in.  It then directed me north?? (opposite direction of destination).  I used my cell phone and went south and arrived at destination.  This a suspect of accuracy or malfunction of this GPS, I don't want to rely on it.  Bad purchase of Garmin.  Never had another brand do this to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "nathan  merrihew",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T20:04:30.000Z",
          "Titre": "present prodicts clear with all product…please",
          "Contenu": "present prodicts clear with all product information"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CHRIS WALLA",
          "Nb_Reviews": 3,
          "Date": "2023-06-12T21:42:18.000Z",
          "Titre": "charging too much for just a car power…",
          "Contenu": "charging too much for just a car power cord for my garmin unit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob H.",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T21:39:18.000Z",
          "Titre": "Frustrated!",
          "Contenu": "I bought the NSUSOO1L recently to load on my Echomap HD (model 74cv) which is listed as being compatible with this software. The memory card shipped was too big to fit in my Garmin and there were no instructions about taking a piece out of this card that would fit, so I returned it. I was just on with a help agent for an hour and am more confused. He suggested other models, and one that did not list the 74cv on its compatible list... I just ordered the eastern NSUSOO7R that says its compatible with the 74cv."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MARY  CARTIER",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T00:13:16.000Z",
          "Titre": "As I ordered my  items",
          "Contenu": "As I ordered my  items, I selected the number of units that I want to recieve, and then add them to my cart. When I look at the order in my cart, instead of the number I ordered, it says one. I had to redo this several times for each item that I was purchasing.  THe system is not working well. You  have done better in the past. Have you changed your ordering system in the last 6 months?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve F",
          "Nb_Reviews": 2,
          "Date": "2022-01-11T20:06:21.000Z",
          "Titre": "These folks use UPS Mail Innovations",
          "Contenu": "These folks use UPS Mail Innovations, which is subject to the usual USPS incompetence. According to the UPS website, my package has been sitting at my local post office for 8 days. USPS claims they don't have it, based on their computer and not on an actual physical check. When I suggested that these folks contact the Mail Innovations Team, they gave me some baloney about waiting until January 13 before they will launch an investigation. They should consider using UPS Ground and avoid this stupidity."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie  Logan",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T02:05:08.000Z",
          "Titre": "Pricing",
          "Contenu": "I felt for an outlet store, the price I paid for my dog collar was very high. The person who helped me may have made a commission on the sale of the collar, but I don't know that. So, it made me feel like I was getting ripped off. I had no choice but to buy a collar, but this was one of the most expensive ones I saw! Why???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "toby",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T09:11:07.000Z",
          "Titre": "the page is false",
          "Contenu": "the page is false , it tells you , same day shipping ends tomorrow , not true , it says that every time you go to the web sight and it does not ship the same day , my order was late to send and i did not get on the date they claimed .  i ordered because of their false page advertisement , i should have just gone to town and got it , would never order from them again ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandis  Roundy",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T00:19:10.000Z",
          "Titre": "i tried calling 1800 number while…",
          "Contenu": "i tried calling 1800 number while waiting for the first woman to check on my question.     The phone dumped my call and the woman dumped my chat, because it took her for ever to get the answer I ran out of my office and missed her.  Second one took over 10 minutes to figure out which headset to sell me to go with my office phone.    TOO SLOW!    And I don't like computers helping me!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Very Concern",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T14:02:46.000Z",
          "Titre": "The process was easy but the electronic…",
          "Contenu": "The process was easy but the electronic invoice provided at the time of purchase was not readable.  I have no idea if I purchased my item, the final cost, and the shipping address/method.  Fingers crossed I get my item and my PayPal account is properly charged."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2021-05-27T21:58:09.000Z",
          "Titre": "Prices were right",
          "Contenu": "Prices were right, but using their \"virtual assistant\" was a bit challenging!  Also, I'm not sure who writes your reviews and product descriptions, but I would think a company the size of Garmin would have someone who knows proper English and knows how to use spell check!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Johnnie   Outlaw",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T21:11:46.000Z",
          "Titre": "I would of thought that paying so much…",
          "Contenu": "I would of thought that paying so much for a headset would of came with everything I needed to answer calls thru the headset. Unfortunately it didn't come with a polycom electronic hook switch in which it cost more money. You should really include everything that is needed for the headset to work!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Norman Murphy",
          "Nb_Reviews": 3,
          "Date": "2020-06-05T12:41:25.000Z",
          "Titre": "I have had continuous problems with…",
          "Contenu": "I have had continuous problems with Uniden Loud&Clear.  The light on the handsets come on randomly throughout the day and night.  Although I contacted the Factory Outlet Store, and they replaced the first one, it was also common to the second.  I live in a remote area and there are no unusual frequencies in or around my home to trigger these events.  Have to keep unplugging the main phone to stop the visual ringer.  Most unfortunate.BV60021500 made in Vietnam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul in Michiganistan",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T15:30:15.000Z",
          "Titre": "Giveth and Taketh Away",
          "Contenu": "Have bought several Water Flossers. All failed. Last one in 3 months, but I did not register it, so even with the box and receipt, no warranty. Chat sent me this site, where I could buy a new one at \"discount\" and free shipping.I accepted, because the product is otherwise excellent. But the Factory Outlet price is higher than Best Buy, where I've always bought. With the discount, price is the same!At least I didn't have to wear a mask. That is why I gave it an extra Star."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "K. M. Stewart",
          "Nb_Reviews": 3,
          "Date": "2021-01-03T17:52:40.000Z",
          "Titre": "Model identification on site",
          "Contenu": "The  website has inadequate or  poorly functional  links to help owners identify or verify the model # and type of tooth brush order to match them  to heads which fit- very poor \"under the hood\" site design.  The system for naming the models is confusing.   Checkout is easy, though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Veronica Zapata",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T03:12:01.000Z",
          "Titre": "used the chat to get 2-way walkies w/…",
          "Contenu": "used the chat to get 2-way walkies w/ compatible headsets.  Trusted that the rep and ordered over $650 in merchandise. Order came in within a timely manner but of course the headsets WERE NOT compatible.  So now, I ordered another $250 of merchandise and they did nothing to speed up the delivery for the 2nd shipment. Frustrating!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marion W Spohn",
          "Nb_Reviews": 1,
          "Date": "2019-05-12T15:15:25.000Z",
          "Titre": "Incomplete order still remians.",
          "Contenu": "I still have not received my complete order which began February 2019.  I have contacted Factory Outlet Store several times.  After several contact attempts I was given a ship date of April 2019 for the final shipment but that did not happen.  I contacted Customer Service this past week but am not holding my breath until I receive their answer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gisela  Reiss",
          "Nb_Reviews": 1,
          "Date": "2018-08-22T23:35:51.000Z",
          "Titre": "I am a Senior was chatting with…",
          "Contenu": "I am a Senior was chatting with Margaret about if my order was Complete gave   her all the info she ask she said she is going to check can you wait? I said O.K. She never  came back so no answer.   to my Question.I appreciated the call back from your customer service to find out what my Problem was & how they could resolve it .In the mean time it was resolved & I received the Part & I am changing my Rating to 4 Stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chad  Cosby",
          "Nb_Reviews": 2,
          "Date": "2018-11-06T15:01:20.000Z",
          "Titre": "Your tech support need product knowledge.",
          "Contenu": "Your tech support need to know about the products you sell.  Tech could not answer whether Raymarine parts come with necessary cables to connect to chartplotter.  This is basic knowledge your operators should have.  Don't give me the number to Raymarine to answer the questions.  10 minutes of my life I'll never get back.  Pathetic."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daidra  Tillman",
          "Nb_Reviews": 1,
          "Date": "2017-06-09T18:53:32.000Z",
          "Titre": "On a previous order I had problems",
          "Contenu": "On a previous order I had problems, when calling the company I was never put through to anyone above the operators.  I was trying to help Factory Outlet by telling them that I had several calls from  people about paying my bill. The bill had been paid & the transaction was on my credit card. I  received the Panasonic phones last year in December.  Somebody is trying to charge me again illegally."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Len Rogers",
          "Nb_Reviews": 2,
          "Date": "2017-05-21T22:05:54.000Z",
          "Titre": "I need an additional handset",
          "Contenu": "I need an additional handset, due to a recent move.  Additional handsets are $18.97 at WalMart.  I feel I'm being \"hosed\" in having to pay $39.95.  This, in addition to having to buy an additional Internet radio because you no longer maintain a website to support products purchased in good faith.  You're not scoring high in the \"Trust\" category at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vermel",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T18:00:56.000Z",
          "Titre": "I tried this before and got an…",
          "Contenu": "I tried this before and got an incompatible receiver but got no consideration on the cost and no recommendation on what to get that will be compatible with the base unit. Unimpressed going with hope this time only"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael  Grindle",
          "Nb_Reviews": 1,
          "Date": "2017-06-30T14:50:04.000Z",
          "Titre": "You need to update your item …",
          "Contenu": "You need to update your item description and picture. when you click on an item that shows a headset and an accessory. the description of that should include both the headset and accessory. not just the headset. I've encountered this in many of your products. This lack of description to picture makes it very hard to find the correct product for the job."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard  Mielke",
          "Nb_Reviews": 4,
          "Date": "2017-07-29T00:21:44.000Z",
          "Titre": "To confusing I thought I would get an …",
          "Contenu": "To confusing I thought I would get an instant download. I don't what I am getting now. A disc ?  A download ? What ? I would like to know. Also the gps can not find my address. w305  s3055 Brookhill Rd Waukesha Wi 53188. House was built 1999, so it is not a new address. I had a Tom Tom so I thought I would upgrade. Richard Mielke 262-424-2044 Please call I will be Home tonight. It is very difficult to know what is happening. What do I do"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald  Sinclair",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T21:03:54.000Z",
          "Titre": "I am 88 yrs old and am not so clever…",
          "Contenu": "I am 88 yrs old and am not so clever with a computer, but I think I finally found out how to order new maps for my Garmin GPS.  It took several days and the help of several people to get it done----that is if it is done.  I am not sure my Garmin has new maps, but I paid to have it done and waited for the clock to count down all the way before doing anything.  Then I clicked on \"Payment\" and used my credit card to spend $109.00.  I think I finally got it to work for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eugene  Jarrell",
          "Nb_Reviews": 1,
          "Date": "2018-09-08T01:34:12.000Z",
          "Titre": "Misleading website",
          "Contenu": "Bought the flush mount power port to hook up a used Cannon Mag 10 downrigger on my pontoon boat. Shows a female receptacle on the pictured part on the website. Does not come with the receptacle as pictured. Cost an extra $55.95 for the female receptacle I did not get with the flush mount power port. Try not misleading people and show items as supplied or inform people that another part is needed at quite a higher price. I will not make the mistake of buying another Cannon product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rex  Rose",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T18:43:39.000Z",
          "Titre": "You make it so Damn hard to find a…",
          "Contenu": "You make it so Damn hard to find a repair station, You pay $300. for the top of the line shaver a cleaning station. and the damn state button falls out. then you have to jump through so many hoops. to find a repair station, I got Pissed off and ordered a new cleaning station. why don't you just advertise a list of service stations. and let us deal with them direct. weather hang on the Damn phone for 40 min. Another thing I don't like about your series 9 shaver is you have to replace the cutter foil about every 2 mo. should last for about a year like your older models. Your shaver Series 9 is an Excellent product. Everything elce is a piece of Stink."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Coolbaugh",
          "Nb_Reviews": 2,
          "Date": "2017-08-15T18:29:29.000Z",
          "Titre": "Factoryoutletstore.com",
          "Contenu": "Placed an order with factoryoutletstore.com never received it.  Called 3 times, they said the problem was me.  I cnxed order and asked for a refund.  Still waiting for refund, but not holding my breath. Bad business people make it bad for all of the rest of us. I would give this a one star but couldn't find anything that low"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2017-08-25T11:29:34.000Z",
          "Titre": "Don't Count on Shipping Information being Correct.",
          "Contenu": "I have been a amazon user but i like to try other company's. I'm very disappointed with your service. I place my order on Saturday spoke to a rep on Sunday was told i would received my order Wednesday no later than Thursday. After not receiving it on Thursday i called and was told it should arrived on Saturday. order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary  Guyer",
          "Nb_Reviews": 2,
          "Date": "2019-08-26T01:57:07.000Z",
          "Titre": "contacted online chat for a specific…",
          "Contenu": "contacted online chat for a specific answer and instead of verifying with as to whether the model number I ask about he daid he had already sent the package and just forwarded a web link. I already had the web site up and just needed clarification on the product # due it being multiple fit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry dowd",
          "Nb_Reviews": 2,
          "Date": "2020-08-01T00:18:23.000Z",
          "Titre": "Ordered Honeywell replacement filters 6…",
          "Contenu": "Ordered Honeywell replacement filters 6 each as they advertise such a good priceWaited almost 2 weeks for delivery Alas wrong cheap filters that do not fit our AC unitsAsked for correct replacement was told they would be $79 eachAsked for a Return Authorization NumberThey continue to avoid any effortAppears we will have to call our credit card companyGeeeeeeezUpdateFilters were returned via FedEx and had to notify Credit Card company to intervene due to lack of response from vendor Told us they would resolve the issue in 3-5 days and now have gone totally silent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barry  Bywalec",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T14:39:28.000Z",
          "Titre": "Very easy to use the web site, but received incorrect information.",
          "Contenu": "Very easy to use and the chat option was very helpful and efficient.  Overall my initial reaction was a very good experience.I have updated this review because, on two separate occasions I used the chat feature to confirm that the cordless phone handsets had a jack for an external headset.  Both time the response was yes.  One response ever quoted the size of the jack as 2.5 mm.  Unfortunately when the product arrived the handsets did not have any jacks.  The phones will work, but I am disappointed that the information given to me was incorrect to two occasions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-04-06T23:57:29.000Z",
          "Titre": "Lengthy check out process",
          "Contenu": "The form kept telling me my phone number was entered incorrectly and even when the agent shared my screen and he tried it wouldn't work. He told me to then refresh the screen and all my data was deleted so had to start over. After 30 minutes of this I was then told there was a 30 day return policy but when I mentioned we had shelter in place orders and couldn't get to a post office if we needed to return it he came back and said they aren't even accepting returns, only for defective products. This new information should be clearly posted on the home page."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2017-05-21T16:53:09.000Z",
          "Titre": "I purchased thte Garmin NuMapLifetime …",
          "Contenu": "I purchased thte Garmin NuMapLifetime Download; however, at no time was I offered the opportunity to download.  I saw the link that should have taken me to a page that explains how to do the download, but it just greyed the screen and did nothing.  I finally called customer service to be told the process. It was a disappointment. I would not have made the purchase if I had known how weird the process would be.  And the instant download actually means that the download is instant after a couple of days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis  Miller",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T04:09:47.000Z",
          "Titre": "you don't need and I don't want to give…",
          "Contenu": "you don't need and I don't want to give you my phone #.BUT, YOU MAKE ME GIVE IT TO COMPLETE THE ORDER?Intrusive an should be removed from the order requirements.It is a DO NOT CALL #. I accept the terms under protest. d"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan W",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T02:08:19.000Z",
          "Titre": "It was hard to compare the Judge and…",
          "Contenu": "It was hard to compare the Judge and the RMR-C435. I still dont know if the Judge has the instant pop stuff or not, I'm just guessing at this point. I have had my RMR for 10 yrs now it has paid for its self 100 times i;m betting"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tammy Gatenby",
          "Nb_Reviews": 2,
          "Date": "2019-03-26T02:24:43.000Z",
          "Titre": "I put in an order and it was bounced…",
          "Contenu": "I put in an order and it was bounced back twice.  I contacted customer care and they would not listen to me to make the purchase to go through.  With 3 phone calls, needless to say, I went to ebay to get my purchase.I will not make or try to purchase from Factory outlet again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 10,
          "Date": "2022-10-05T22:51:21.000Z",
          "Titre": "sorry but customer care at this place…",
          "Contenu": "sorry but customer care at this place deserves minus one star, gave two only because of products."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brenda  Miernik",
          "Nb_Reviews": 2,
          "Date": "2021-01-06T18:07:53.000Z",
          "Titre": "Slow website issues",
          "Contenu": "This website is difficult.  It would not let me go to where I needed to go quickly.  I had to pound on my keyboard to get a response.  I love that I can order replacement parts for things we need but gracious!  It was slow going today!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "wendy jones",
          "Nb_Reviews": 1,
          "Date": "2016-10-03T18:16:22.791Z",
          "Titre": "PHONE DIDN'T WORK PROPERLY",
          "Contenu": "We ordered a phone (the same item # as the old one) and when we got it line 2 would not work, so I called customer service and she said \"well have you called AT&T support and I said no why would I call them, \"Well we just sell the products. So I put it back in the box filled out the return and paid for the postage back. They charged me $30.00 for something, which is not right seeing how they shipped me a defective unit. I will never used them for our business or personal again, I will go back to Amazon at least they know how to treat their customers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T13:56:50.000Z",
          "Titre": "I bought a pet door for a sliding glass…",
          "Contenu": "I bought a pet door for a sliding glass door.  I loved the product but the measurement suggestions are incorrect so the opening was too small for my dog.  The issue came when I needed to return the item.  I filled out the online paperwork and was told I would receive a response in 24 hours. I didn't so I had to call only to find out that THERE IS NO PAPERWORK!!  The online form has to be printed off and put in the box.  There is no shipping information, no return information, NOTHING!!!  Any other time I have had to return an item to ANY company I at least get sent shipping information even if I have to pay the cost of the return."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly W",
          "Nb_Reviews": 1,
          "Date": "2017-08-30T20:09:59.000Z",
          "Titre": "Extremely Poor Customer Service",
          "Contenu": "I have not even received my order yet and I wish I had not used this company. I have been misinformed from the 1st phone call. I will never order from them again. Product knowledge poor. Placed the order. They got it wrong. Called to correct it and OMG! Told me would ship the day I placed the order. It did not. It still hasn't. Sent me an email advising me of tracking number WITHOUT A TRACKING NUMBER! Called to get tracking number was advised had not been shipped yet again! Only a label was created. God I pray I actually receive what I paid for. Never never again will I order from here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey  Woods",
          "Nb_Reviews": 1,
          "Date": "2019-07-06T02:57:48.000Z",
          "Titre": "Lowrance needs to come up with a better…Tripleshot transducer",
          "Contenu": "Lowrance needs to come up with a better idea for the triple shot transducer. I have broke 2 at the top of the transducer below the mount, it is not made for 50+mph. Now I cant even use side scan, Changing all electronics to Hummingbird.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Searcher",
          "Nb_Reviews": 1,
          "Date": "2021-06-14T20:04:09.000Z",
          "Titre": "I really hate the web site",
          "Contenu": "I really hate the web site. It is so awful in its' design and layout, I had to check several times to be sure it isnt a scam site based in India or Russia. It appears to be legit, so I placed my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eliot Michelson",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T16:35:56.000Z",
          "Titre": "Problem with checkout"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hector Najera",
          "Nb_Reviews": 2,
          "Date": "2021-04-04T08:20:49.000Z",
          "Titre": "Long time waiting",
          "Contenu": "Purchase was easy and I asume a good price but my product took over three week to get to me I’m still waiting after three week it got stocked in a facility for two week, almost a month to get to me a trimer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barry  Reynolds",
          "Nb_Reviews": 1,
          "Date": "2019-04-11T01:59:52.000Z",
          "Titre": "Advertised discounts were not applied",
          "Contenu": "Advertised discounts were not applied, with no explanation. I tried on-line chat to learn why the discounts were not applied, and was only told, \"it's not available.\" If it's not available, take it off your website !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valentine Kozov",
          "Nb_Reviews": 1,
          "Date": "2020-12-19T16:58:09.000Z",
          "Titre": "Return Policy",
          "Contenu": "Return Policy30-Day Money Back Guarantee. But not all the money. Returns are subject to a 15 percent restocking fee plus the actual cost of shipping. This amount will be deducted from the amount of your refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Holland",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T21:31:36.000Z",
          "Titre": "5 days after order, backorder with no ETA",
          "Contenu": "Ordered an item, received notification that item was preparing for shipping. 5 days later received a notice that the item is back ordered with no ETA.  When I called the rep tried to sell me something else.  Canceled the order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2019-08-01T01:30:44.000Z",
          "Titre": "Web site was easy to use for my radio…",
          "Contenu": "Web site was easy to use for my radio purchase. I do not like the fact that they do not offer any big truck style antennas. If you are going to sell a CB radio why not sell all the required items needed to install and use it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "marlys",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T20:14:10.000Z",
          "Titre": "ordering very slow",
          "Contenu": "ordering very slow, difficult to add additional numbers of product and recalculate cost, had to reorder because fist order didn't go through and couldn't access the site with the sale price on the reorder."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arnold  sanchez",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T00:11:52.000Z",
          "Titre": "i have several problem we the blue…",
          "Contenu": "i have several problem we the blue parrott also we the legend to i used the blue to all day in my driver to i depend in the blue to i dont know if i send my other older blue to yuo can fixe  512 775 1185  arnold"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RASENDRA  PATEL",
          "Nb_Reviews": 1,
          "Date": "2019-03-19T00:32:34.000Z",
          "Titre": "UNHAPPY",
          "Contenu": "UNHAPPY. -contact me  by phone  and  e:Mail me. I DID NOT ORDER ONLY LUBRICANT OIL.  I HAD ALSO ORDER \" BRAUN 8000 CP/515 \" FOIL AND CUTTER TOO. You forgot to bill me for above item. I am really surprised."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Burbank Jones",
          "Nb_Reviews": 1,
          "Date": "2017-07-31T17:25:47.000Z",
          "Titre": "I have ordered the Garmin NuviCam 6\" …",
          "Contenu": "I have ordered the Garmin NuviCam 6\" LTMHD twice and it has been canceled on me twice. The first time I ordered it on-line only to find out that it had been canceled. I called in to re-order, figuring a human being would handle it properly. Cancellation #2! I then called customer service and got a man (Smith, first name) who was difficult to understand. I speak 5 languages so I usually do not have trouble with accents. He asked if my debit card was International. No one has been able to explain the cancellations. I did 20 years in the USAF and have a very clean record across the board. Maybe FOS just does not want my business? And that of my numerous retired military friends?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Graham",
          "Nb_Reviews": 33,
          "Date": "2021-01-01T20:58:42.000Z",
          "Titre": "Be sure before you buy from them, extortionate return fee.",
          "Contenu": "I ordered a garmin smart watch for my wife which when I received it, wasn’t liked and was too big for her wrist.I asked to return the item which was fine with them, all good. The description they gave was accurate so no complaints there, it just didn’t suit us. So here is the gotcha and a word of warning to everyone purchasing from here. The company charge 15% of the purchase price for you to return the item and put it back on the shelf. Also I had to pay the postage back. So all in all I spent nearly £50 returning the item and have nothing to show for that £50. I cannot believe it costs so much to put a 4” square box back on a shelf. I could understand a flat rate of say £5 maybe. Shame when lots of other companies don’t charge in this way."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adam Chown",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T18:19:03.000Z",
          "Titre": "Appalling Customer Service",
          "Contenu": "Appalling Customer ServiceTried to return a faulty wearable fitness tracker 5 months into my 12 month warranty and still haven't found a way through their scripted customer service jungle. Help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bonnie Rose McIntyre-Hooper",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T19:58:18.000Z",
          "Titre": "Will not take return of new in box item within 30 day limit",
          "Contenu": "Bought a dog fence through FactoryOutletStore.com. The product came, just as they said it would, but when we tried to return it, even though it was never out of the original shipping box, they would not take the return.  This is not what their webpage said.  Their publish policy said we could return it for any reason up to 30 days for a small restocking fee and the cost of shipping. When we said that we wanted to return it because we had found another somewhere else for less, though, they refused to take it back saying their new policy had changed April 1, 2020 and was published online. Their webpage doesn't and never has mentioned this, though.  Saying you have new policies without publishing those policies seems like bad business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tammy",
          "Nb_Reviews": 1,
          "Date": "2021-03-11T17:45:12.000Z",
          "Titre": "Customer service is poor and they don't…",
          "Contenu": "Customer service is poor and they don't know what they are doing.  I have called several times on an order and get all different answers.  Wait time to get as associate is ridiculous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Highly Disappointed",
          "Nb_Reviews": 2,
          "Date": "2021-12-10T20:32:01.000Z",
          "Titre": "Shrinking Furnace filters...check before you buy here.",
          "Contenu": "I just received my Furnace filters and was surprised to find they are apparently now being sized like \"dimensional\" lumber...reduced in size from what is advertised and if you don't buy the name brand you get short changed..  Supposed to be 20\"x 20'x 4\" but a half inch short on all dimensions.  They barely fit the hanger area and leave plenty of room for the air flow to bypass the filter on all sides.  I bought a higher MERV value to get better filtration and ended up with less coverage....Very disappointing.  Can I make them work?  Sure but at a cost of operation.  I'm so tired of fighting Corporate bottom feeders who screw the customer at every turn.  If the can shrink it, dilute it, or in some other way reduce the quality to save a fraction of a cent /unit they just don't have the integrity to do what right."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Sady",
          "Nb_Reviews": 2,
          "Date": "2020-06-24T16:40:40.000Z",
          "Titre": "First of all you can't understand what…",
          "Contenu": "First of all you can't understand what they are saying because the can barley speak ( engleish) just like this word is spelled.  Allot of times they don't know the products as they should."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CHRIS  HAYNES",
          "Nb_Reviews": 1,
          "Date": "2017-08-03T17:56:41.000Z",
          "Titre": "hard to go thru and find what you need",
          "Contenu": "hard to go thru and find what you need. Does not have all the Norelco shavers on lists. Does not even show older shavers that have been replaced or what coincides with them now. Bad setup and  limited choices."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kerry Harte",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T14:31:04.000Z",
          "Titre": "I call last week to order a transdurce",
          "Contenu": "I call last week to order a transdurce, I furnished the part number and sales person told me that would not work. He would send me right part. The part showed up and was a transom mount, I need a trolling motor mount.  I called customer service, was told I need to call lowrance for correct part number. I did and called customer service for return and right part. I gave girl the part number and was told you do not carry this part number. I informed her I was looking at your web page and it shows the part. after long conversation she found the part. next asked for return label to send wrong part back. this was Fri. told me should get return label by Tue.  if it had not been for past orders that went flawless I would give a ZERO on feed back.  not a happy customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CL White",
          "Nb_Reviews": 1,
          "Date": "2017-07-31T15:12:39.000Z",
          "Titre": "Cheap prices HOWEVER  the amount of …",
          "Contenu": "Cheap prices HOWEVER  the amount of crap I had to go through to find a shipping address they would 'approve' was ridiculous.  I will not be buying anything through Factoryoutletstore.com again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2018-12-07T14:46:29.000Z",
          "Titre": "Sent me the wrong battery",
          "Contenu": "Sent me the wrong battery. Now I have to mail back the one they sent me before they will refund my $.  I ordered the correct battery again.  Hopefully I will receive the correct battery this time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Daniel",
          "Nb_Reviews": 4,
          "Date": "2015-07-20T17:01:49.943Z",
          "Titre": "i was told i would get it the 18  then it was monday now its friday but they cannot contact the shipper to find out where its will not order again",
          "Contenu": "don't plan on getting the order on time they claimed it was delivered itwasnt and keep changing the day now ist Friday but cannot contact the shipper very bad service very bad all I get is excuses"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "G T",
          "Nb_Reviews": 2,
          "Date": "2021-02-16T09:43:29.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I would like to give this company 5 stars as I've received my Garmin watch as described. However all was ruined by customer service. Easy to buy, good website layout. So far no problems. However when Ive tried to check order status, everything gone wrong. No updates at all, one very basic and delayed email from them with no updates nor explanations. Call center is in US, no matter what they say on their website. Order number couldn't be find by them, etc. They left me frustrated and dissapointed. What a relief when finally after almost week my watch arrived,  without any notice, just nothing. Pretty happy with me watch, but overall experience is bitter-sweet, hence just 2 stars feedback. Company is legit,goods delivered in condition as described but customer service is one of the worst I've experienced in my life."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2020-11-11T18:43:03.000Z",
          "Titre": "$25 for simple phone charger is a lot…",
          "Contenu": "$25 for simple phone charger is a lot of money when base station with phone and 4 additional phones with chargers sells for $80. Charger should not fail in a year of service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T19:41:05.000Z",
          "Titre": "Charged for item, now back ordered, wont allow me to cancel",
          "Contenu": "Purchased item, was told later that week via email that it was not going to process unless I called. Responded back to cancel since item would now be too late. Now they processed payment and told me item is back ordered and will process once available unless I called. Why process the order if I originally needed to call? Called got caught on hold, they tell me first that I must call my bank to cancel payment. I question it and am placed on hold. This is crazy! Luckily I used Paypal where I can dispute this. UPDATE: While on hold I all of the sudden receive an email confirming cancellation. What a mess this has been. Not sure if it's just miscommunication but I definitely wont be using this place again! Raised one star because at least they cancelled the order. Will see if I am refunded over the course of the next week."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "david  adelman",
          "Nb_Reviews": 2,
          "Date": "2017-06-30T23:57:45.000Z",
          "Titre": "annoying survey pop-ups (2 of them) …",
          "Contenu": "annoying survey pop-ups (2 of them) popped up over my purchase confirmation.  Not cool.  I had to click to consent to the survey just to get back to my purchase confirmation.  Not cool--Does not feel like a premium experience and I perceive Celestron to be an otherwise excellent brand.  Also, I just wanted the 5 of the hard-framed eclipse glasses, but you do not offer an option that does not come bundled with the book (don't want it--certainly don't want 5 of them) and the lens filter (which I now have 5 of).  I feel like if I didnt have to get the unnecessary books and lens filters, I would not have had to pay so much.  I did anyway, however, because I believe in the quality of your products and would not entrust my children's eyes to some no-name-o cardboard eclipse glasses manufacturer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debra  Lamers",
          "Nb_Reviews": 4,
          "Date": "2017-09-09T01:38:21.000Z",
          "Titre": "What storewide discount!?",
          "Contenu": "It said storewide discount, and we didn't get any discount for such a large purchase! Very disappointed! Why say there's a discount if you aren't going to give one!?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doris Michaelson",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T12:28:09.000Z",
          "Titre": "No communication",
          "Contenu": "On 04/03/20 I ordered a Garmin  watch and got an email that my order was processed and I was gonna get another email once the item was shipped. A week later still nothing so we called and were assured that the item was shipping out that afternoon. The next day still no shipping information so we called again and were told one more time that the item was getting ready to ship but the agent would put a rush on it. Following day same scenario, no shipping information and another phone  call. This time  we were told that the previous two agents didn't know what they were doing and she was gonna send a message directly to the warehouse to have the watch shipped. A couple of days later and still nothing updated. Finally cancelled the order after this ridiculous game  of back and  forth. Still don't know what their issue was, but it was unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph C DUrso",
          "Nb_Reviews": 1,
          "Date": "2019-09-06T20:38:04.000Z",
          "Titre": "They aren't Amazon",
          "Contenu": "Very Poor supplier.  They sent wrong material and wanted to charge a restocking fee plus return shipping.  After several emails and a phone call, they agreed to waive restocking fee but not the $34 cost to ship product back.  I'll never do business with them again and warn others to reconsider ordering product here.UDPATE 9/6/19After posting above review and additional emails and calls, customer service staff, Jessica, agreed to have return shipping reimbursed.  We have received a check for this cost.   At the end of the day, it took a lot of effort to reach a point of no product but no cost.   Their price initially looked less than Amazon, which is why I tried them.   However, their product is undersized and I would need a 20 x 25 x 5 filter to be equal to the 20 x 25 x 4 from Amazon, so Amazon ended up being cheaper and much easier to deal with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Langenfeld",
          "Nb_Reviews": 1,
          "Date": "2019-08-19T23:01:17.000Z",
          "Titre": "I placed an order for a supposedly \"in…",
          "Contenu": "I placed an order for a supposedly \"in stock\" item.  The order was reportedly \"processed,\" but the promised shipping confirmation/tracking info was still outstanding after 8 days.  When I called to inquire, I was told the item was OUT of stock and back ordered.  The problem is, the item has been out of production for some time (I only placed the order with FactoryOutletStored because they claimed to have it \"in stock\") -- thus, the supposed back order would NOT be able to obtain the discontinued item from the manufacturer. I cancelled the order, but wished they'd let me know right away and without my having to follow-up. They also had gone ahead and charged my account, even though the item was back ordered -- highly irregular. And, for the record, the item is still shown as \"in stock\" on the FactoryOutletStore website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Wilson",
          "Nb_Reviews": 2,
          "Date": "2021-01-25T16:34:22.000Z",
          "Titre": "Horrible customer service and do not issue credits",
          "Contenu": "Their web site defaults to the wrong part and it was shipped.  When I tried to call to return it I was told to contact the manufacture, even though they were an authorized dealer.  The return line would not be answered, then hang up.  I talked to someone twice and they hung up on me once, then was told they would refund the purchase price and I could keep the item.  That surprisingly did not happen so I had to stop payment on that charge.  I went elsewhere to get the correct part.  Horrible customer service.  Before you buy, just call the customer service with a question to see for yourself.  Do yourself a favor, save headaches and shop elsewhere.I did get credited for the part after this was posted as well as a call from Factory Outlet Store Rep asking about the one star.  I changed it to 2 stars because I had to spend a lot of my time and days waiting for a part I had to get elsewhere.  Still would not return to this store."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2022-01-04T21:23:01.000Z",
          "Titre": "Out of stock status",
          "Contenu": "I ordered an atlas and it was supposed to be shipped in 2 to 5 business days. I was given a tracking number and after 3 days went online and checked on it, no information was available. I called and was told it was out of stock and on backorder. I was also told that an email had been sent to me stating it was on backorder on the 15th which was the same day I called. I did find the email but decided to cancel the order as the website should have shown it was out of stock before they accepted my credit card. I was told that the website would be updated to reflect the backorder status. Now 3 weeks later I checked and you still can order it with 2 to 5 days shipping. When I called again I was told it is still on backorder. I understand that FactoryOutletStore cannot control when the supplier will ship the atlas to them but they do have control over what their website shows for shipping time frame. Customers have the right to know when their credit card is charged when they should expect the product they purchased."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2019-12-17T12:00:05.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "The prices are certainly good, but hope you never have to work with their customer service.Ordered a smartwatch through them. Barely worked - battery life was way below what was advertised (draining 10x faster). Sent it back for a replacement, suddenly every excuse under the sun appeared - 'we don't operate in the UK' (it's a UK phone number), 'that's an invalid order number' (I have correspondence with them where they knew exactly what order I was talking about), and rudely hung up on me midway through without even describing what was going on. I tried to call back and they hung up on me as soon as I started speaking!After a while they finally got back to me via email, and replaced my watch with a functioning one. The customer service was so bad to the point I was convinced it was a scam - certainly didn't fill me with trust. In the end we got there, though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "vern",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T19:06:06.000Z",
          "Titre": "I purchased 13 Motorola clp1040 radios…",
          "Contenu": "I purchased 13 Motorola clp1040 radios with chargers and earpieces 11 months ago. Spent just under $3,000, I just had a radio and 3 earpieces fail within the last 30 days. According to the customer service person at Factoryoutletstore.com the 2 year warranty is not thru them. I must contact Motorola to replace the failed units. Sounds fine to me. So I call Motorola and they say that they cannot replace the failed units without the order information that only Factoryoutletstore has!! I cannot use my order info and I cannot attain the numbers needed from factoryoutletstores. With that being said, the warranty is a lie. Just for giggles I called factoryoutletstore and spoke to a sales person and asked about the two year warranty and I was told that they do indeed have a two year warranty and that they would take care of me if there were to be a problem. Wow!!! Someone has a problem with integrity!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Graham",
          "Nb_Reviews": 2,
          "Date": "2018-12-08T01:45:58.000Z",
          "Titre": "Not sure about Factory Outlet Store efficiency",
          "Contenu": "I have had 2 experiences with this firm, both for high ticket items. The savings are good, but each time there has been confusion on their end requiring phone calls to clear up. The first time, they had not adequately communicated in their offer exactly which model #s were available and which were not. Ultimately, in spite of my specifying exactly what I intended to purchase, they delivered the wrong item, leaving me responsible for shipping charges to return it, and they were not able to fulfill my original request. The second time, again I was required to call them to “verify” my purchase, only to learn that the purchase had been “cancelled” due to some unidentifiable problem with my profile information. After investigation on my end, I’ve learned I cannot edit my primary PayPal address. I have moved to a new address, and the change in address short circuited something somewhere."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Joe Palmer",
          "Nb_Reviews": 11,
          "Date": "2020-01-12T09:22:28.000Z",
          "Titre": "Poor service after receiving faulty goods",
          "Contenu": "I ordered a Garmin Dash Cam 65W, when the item arrived it was faulty and couldn’t even start up. I phoned the customer helpline number and was told I had to go online and fill out a returns form. After doing this I had to wait to be emailed with the returns address. I had to pay the returns myself which cost me £7:40 I emailed the company explaining that I had received faulty goods and didn’t think that it was fair that I had to pay to return the faulty item (they should in my opinion supplied me with a pre-paid returns label). They completely ignored me and I realised that the only way I was going to get the item exchanged was to pay the postage myself. I just felt that they really couldn’t care less about good customer service, and would definitely not recommend them, or use them again. Post note:- after posting this review, a representative phoned me and offered me a refund to cover the postage cost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Hines",
          "Nb_Reviews": 2,
          "Date": "2022-08-01T16:05:25.000Z",
          "Titre": "Leve me alone.",
          "Contenu": "I don't like stupid requests for reviewing simple  transactions. Just do your simple job."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T17:13:02.000Z",
          "Titre": "Lowrance Hook 2 7TS",
          "Contenu": "Lowrance Hook 2 7TS. We recently ordered a Hook 2 7TS with navigation and charts.  However we were never told, nor does it state on the product description, that we would need an additional mapping card at a cost of$140 or more depending on your region.  We have an older Lowrance unit that came with all the charts we needed.  Their website does not state anything about the charts.  You get Base Charts and have to order mapping charts if you want more details.  Base charts give land location.  We live on a canal and it showed us navigating our boat off land to the water.  Customer service agents were nice and polite and tried to accommodate the inconvenience, but the company itself was not very customer oriented.  Their website is misleading in respect to giving details about products or at least this product.  The product itself is nice and we will get much use out of it when we receive the mapping card. Just a word of caution for the consumer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "brian  cera",
          "Nb_Reviews": 1,
          "Date": "2017-11-27T20:56:38.000Z",
          "Titre": "Said my paypal wouldnt go through …",
          "Contenu": "Said my paypal wouldnt go through because the total amount was 0 dollars. Hit it 2 or 3 times I am hoping your site didnt charge me all those times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Betsy  Baer",
          "Nb_Reviews": 1,
          "Date": "2018-05-11T21:07:30.000Z",
          "Titre": "I cannot rate as I have not received…",
          "Contenu": "I cannot rate as I have not received your deliverydelivery yet. I just put in my order. Cannot rate or review until everything is done.Then ask me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2021-08-12T20:40:27.000Z",
          "Titre": "Trouble finding the charger for my760x…",
          "Contenu": "Trouble finding the charger for my760x shaver. The existing has lost most of it's insulation. Taking a chance on this one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vicky Bell",
          "Nb_Reviews": 1,
          "Date": "2018-01-27T21:28:21.000Z",
          "Titre": "Horrible customer service and business practices!",
          "Contenu": "I ordered a phone set that was switched for another one.  When I  called to report that I received the wrong product I was offered a different phone set that cost a whole lot more. I declined and was told that it was the only one with the features I wanted. I found another online as I was speaking to her and gave her the inventory number after which she informed me that it was no longer available. I asked for a refund and a return label which I got in my email. I have to pay the postage to return a product that is not what I ordered! This is unbelievable!  Why should I have to pay to return something that was switched from product I did want! By the way I went back online and placed said \"unavailable\" product in my cart and went through the motions of purchasing it. Not one time was I informed that the product was unavailable!  Or maybe it would have been switched also! Needless to say I did not purchase it from this website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurianne  Senecal",
          "Nb_Reviews": 1,
          "Date": "2017-08-19T02:45:09.000Z",
          "Titre": "Trust is shaky",
          "Contenu": "I 1st tried the website & couldn't find what I was looking for, so I called. The young man I talked to told me I couldn't order the item I needed which is the car charger for model number RM9612T-LM from the website, and also the company site no longer allows the use of pay pal.  So I had to get the chargers which I wanted 2 as mine was stolen out of my truck. And I was getting a spare. I gave him my information name, address and card information.   I decided to see if you still carried my GPS, then I found the INFORMATION on your site!!!! I can still use pay pal... I called and cancelled the order, told the person about the above issue. And he said I was charged only for 1 yet the man who took my order stated I was charged for 2,  43.90. what's going on is he ripping me off?  The person I talked to cancel the order said he would turn it over to his supervisor. That does not fix the problem....I am having TRUST issues and I use this company in all my cars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tlk",
          "Nb_Reviews": 4,
          "Date": "2019-04-01T23:58:00.000Z",
          "Titre": "Too much information..t",
          "Contenu": "Too much information... hard to select links are very very slow. Unable to chat because wait time was too long.No one ever responded!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig  Larter",
          "Nb_Reviews": 1,
          "Date": "2017-06-05T16:19:13.000Z",
          "Titre": "I want to buy 2 replacement receivers …",
          "Contenu": "I want to buy 2 replacement receivers and the store forces me to by red or blue then I must buy a separate black collar, stupid!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darrel  Branham",
          "Nb_Reviews": 2,
          "Date": "2022-01-30T05:03:01.000Z",
          "Titre": "is shame to spend so much money on…",
          "Contenu": "is shame to spend so much money on buying cordless phone and phone doesn't come with Batteries."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kim  kirchoffner",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T00:29:45.000Z",
          "Titre": "I'll wait until I get my Product & then…",
          "Contenu": "I'll wait until I get my Product & then I'll give a Reviewer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John  Weinrich",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:08:24.000Z",
          "Titre": "Web site messed up..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tomm",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T21:48:47.000Z",
          "Titre": "Just spoke with one the rudest customer…",
          "Contenu": "Just spoke with one the rudest customer service people in quite a while.  And over a terrible connection."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barb Miltibarger",
          "Nb_Reviews": 2,
          "Date": "2018-10-08T23:12:39.000Z",
          "Titre": "could not understand the man I was…",
          "Contenu": "could not understand the man I was talking with. Please get someone that speaks English as their primary language ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Hartney",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T23:02:43.000Z",
          "Titre": "Calling to order was a nightmare your…",
          "Contenu": "Calling to order was a nightmare your people need to speak and understand ENGLISH... ordering on line was GREAT"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CARL  SANTANIELLO",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T23:42:11.000Z",
          "Titre": "I don’t know why I had to add a debit…",
          "Contenu": "I don’t know why I had to add a debit card when I had sufficient funds in my account to buy the item?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dianemarie Frappier",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:13:48.000Z",
          "Titre": "Choices limitted with little or no…",
          "Contenu": "Choices limitted with little or no detail.  The timing of this \"experience\" is lousy.  Try in a week when Iv'e recieved my flaps and installed them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LM",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T06:56:36.000Z",
          "Titre": "Decent price on a hard to find Norelco…",
          "Contenu": "Decent price on a hard to find Norelco Spectra charger. Lost one star because 1) had no HQ8 shaver heads which are quite common, and only had the newer version (SH50), and 2) they were an outrageous price - way overpriced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Toolworker",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T21:21:40.000Z",
          "Titre": "Order Not Shipped Next Business Day as Promised - But They Promptly Refunded",
          "Contenu": "I ordered by phone on a Saturday. I needed it quickly so paid for two-day shipping and was assured it would go out Monday. My credit card was charged immediately, but I got nothing by email so called Monday evening and was told I should get a tracking number by the next day. Apparently it hadn't been shipped, so I emailed to cancel the order.They get two additional stars because Tuesday morning I got a very courteous email and voicemail assuring me that the order had been cancelled, and the credit was on my card by noon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LH",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T06:27:02.000Z",
          "Titre": "I like the ease of purchase through…",
          "Contenu": "I like the ease of purchase through this website. I am leary about purchasing here as I've never used Factory Outlet store before and there is a substantial 15% restocking fee if the delivered product is nonfunctional. THis is forcing the customer to take on a huge risk on any purchases they make through this website/company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret A  Searight",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:36:07.000Z",
          "Titre": "Wrong Batteries",
          "Contenu": "You sent me the wrong batteries & I had to take a picture & send it to you to get a credit on my credit card. If these batteries aren't Panasonic & green with black lettering, don't bother to send them. Just issue me a credit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Rubin",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T19:47:00.000Z",
          "Titre": "I enjoy the human approach i.e",
          "Contenu": "I enjoy the human approach i.e. actually speaking with a person.Please don’t think the above was a bad review. Dealing with your company was great. Great product Great response time. I would recommend your company to all!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Zavetsky",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T16:45:13.000Z",
          "Titre": "I had questions",
          "Contenu": "I had questions.  I spoke with an Agent, but I think they need a bit more \"Sales\" knowlege.  I was trying to ask what things are for?  Like if I'm fishing, do I need a heading sensor????  They kept giving me technical sheets , which really didn't answer \"IF\" I need it, nor exactly what it does....  But, The Tech info was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "john  k",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T23:43:22.000Z",
          "Titre": "The web site is SOOOO slow in…",
          "Contenu": "The web site is SOOOO slow in responding.A button is clicked, and the response is up to a minute. Making a person not know if there is any one home.Any way. Your products are very good.Earlier this year it took almost 7 months to have the new Boston exit numbers updated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T19:25:01.000Z",
          "Titre": "It was difficult to find the correct…power cord",
          "Contenu": "It was difficult to find the correct power cord. It says it is for the model that I have, but it gives a list of compatible shavers and the number of mine was not on the list. Unless they want the number from the back of the shaver. And those numbers are WAY too small for me to see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frustrated User",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T11:49:49.000Z",
          "Titre": "The return link did not works in any browser",
          "Contenu": "I have purchased garmin but there are some scratches and the device is very slow. So now i need to return the item. But the return button did not works. So not sure how to retun the item. In the website it says 30 days return but provide process to return it.There is one page which can be used to request return but its asking for order number without characters and i cant add my order number which have characters.Update: The representative from Factory outlet reached out to me same day when i posted my review, so the customer service is good, but waiting for the return label mentioned below. I can update my review after i am getting through the return process.Update 7/17/2023:I got refund for my product but its very lengthy process to follow up with the person who reached out to me after i wrote the review. I am still not updating it to 4 or 5 start as the there are issue with this site regarless customer service tries to resolved your issues.Issues: 1. The return link does not works, there excuse is they have new site which is working, but who keeps two sites and paying for infra to keep it alive. 2. They have reached out to me after adding the review and calling constantly like 4 or 5 times for asking to change the review - not a good practice.3. It took me several mail follow up, disputing the charges to resolve my refund issue but got refund finally after a month of adding this review. 4. Final verdict, dont buy any product unless you are going to keep it. the return process is hassle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Sample",
          "Nb_Reviews": 3,
          "Date": "2022-12-30T20:06:34.000Z",
          "Titre": "For the first time in all my orders I…",
          "Contenu": "For the first time in all my orders I had problems checking out. Would not allow me to change credit cards. I assume it was a problem with internet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert  Harvey",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T00:19:17.000Z",
          "Titre": "Great service",
          "Contenu": "They respected me! I  made a mistake on my 1st order and contacted the vender, they returned and I placed the2nd order and it has been shipped.Can't beat that"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cyssf",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T17:02:25.000Z",
          "Titre": "8 out of 12 batteries I received were defective and won't hold a charge",
          "Contenu": "EDIT:  1/26/23 Am editing this review because the customer service to remedy the problem is very good.  They refunded me 50% of the original purchase, notified their warehouse to remove these batteries from stock until they could be checked, and provided a two year extended warranty for the four batteries that did work after I expressed concerned about the strength and durability of the batteries that did work.   Changed the 1 star to 3 stars to acknowledge the good customer service but still 3 stars because of the length of time it took to get the original batteries delivered, the faster but still 3-4 days to get the replacements which were duds, and the need to buy other batteries to replace the original mfg batteries which I put back in the phone as an interim measure until I could get new batteries for all the phones.  Original review:  Out of the initial 8 batteries I received, four would not charge.  These are pre-charged batteries and should have started the phones on insertion.  Four kept flashing \"insert battery/charge over 7 hours\".  Even when charged in the phone overnight - no power.  Called and was sent four more replacement batteries.  All four of them also would not charge.  Customer service was excellent about refunding the money but I ordered the first set Jan 9 and it took about 8 days to arrive then I had to wait another 3-4 days for the replacement batteries.  I finally ended up putting in the old original batteries that still worked.  Will not buy these batteries again.  Agent on the phone agreed that the warehouse needs to check these batteries before shipping.  66% fail rate is abysmal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell A Bader",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T21:29:24.000Z",
          "Titre": "Need a better system to identify brush…",
          "Contenu": "Need a better system to identify brush and model numbers. 800 # knew less than I did."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven  Baker",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T01:40:37.000Z",
          "Titre": "Very expensive for cleaning solution!!",
          "Contenu": "Very expensive for cleaning solution!!Thank you for hearing my comments and addressing my concerns."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Strive for Balance",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T23:01:07.000Z",
          "Titre": "Offers discounts but doesn't honor.",
          "Contenu": "Midland offers a discount, and tells me it will show in cart, but it doesn't . Bait/switch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carollee  Moates",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T01:28:45.000Z",
          "Titre": "too much work to buy a phone",
          "Contenu": "Way too many steps and computer side trips to but a phone. It takes more time than driving to the store and buying one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sidney Crumley",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T20:51:09.000Z",
          "Titre": "Satisfied",
          "Contenu": "I like the fact that when they realized that they were wrong they corrected it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T00:48:59.000Z",
          "Titre": "Information page needs better error announcement",
          "Contenu": "Information page could have been more straightforward in asking for information, and error detection made clearer than an infinitely long spinning annulus \"Processing\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Boone Kindrachuck",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T22:42:53.000Z",
          "Titre": "I couldn't find the compatible earpiece…",
          "Contenu": "I couldn't find the compatible earpiece for my radio purchase without considerable outside research, the website wasn't a huge help in that department."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glen S.",
          "Nb_Reviews": 7,
          "Date": "2023-08-04T05:19:06.000Z",
          "Titre": "Search engine and website needs some…",
          "Contenu": "Search engine and website needs some improvement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward  Burke",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T20:26:55.000Z",
          "Titre": "No headband spare part",
          "Contenu": "All I really wanted was a headband which I couldn't find as a spare part.  My puppy chewed up the old one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald  Leonard",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T03:06:03.000Z",
          "Titre": "Had the SD card needed to update maps",
          "Contenu": "Had the SD card needed to update maps. I would have liked Garmin to include this in the GPS purchase  I made because I cannot update the Garmin Drive 61 Maps without this. Not enough memory in the original GPS unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob  T.",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T09:33:09.000Z",
          "Titre": "Nothing Greate to say, however divinely",
          "Contenu": "Average. not great however very good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "gerard  oie",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T20:32:32.000Z",
          "Titre": "card shy",
          "Contenu": "in order to check out, i needed my microsoft ore-mail password, which i can't remember.but by switching to paypal,on which i use the same credt card, it went straight through. i prefer using my credit card ratherthan paypal because with the card , the company will back my purchases whereas paypal will not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Brockstedt",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T23:29:58.000Z",
          "Titre": "Your system could be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawyer124",
          "Nb_Reviews": 3,
          "Date": "2022-07-12T15:54:02.000Z",
          "Titre": "I tried ordering through the phone was…",
          "Contenu": "I tried ordering through the phone was told I could use a check, just give them the routing number and account number,  they called back to get the information and then said they could not process it that way.  the right hand doesn't know what the left hand is doing or saying there.  I do want the product so I went back online and used a debit card, which I preferred not to do. Update, they did call back to make sure i was able to place the order and that i had received it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cathy  Matthews",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T00:40:27.000Z",
          "Titre": "There's nothing to review yet",
          "Contenu": "There's nothing to review yet.  I hope this one last longer than my last two, my husband has gone through at least three in the past five years.  I have to admit we spend a lot of time on our phones.  These things are expensive, so here's hoping this one holds out longer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carla Pfeiffer",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T20:48:58.000Z",
          "Titre": "Return policy sucks",
          "Contenu": "Return policy sucks. I'll never buy from there again.  I bought $75 worth of product and they charged me $30 to return it! They actually charge you for the original shipping cost even though they are the ones that offer free shipping if you purchase enough product.  Total bunk IMO.  Buyer beware! Small print matters!   ETA: I wrote them to excites my dissatisfaction and they refunded the entire purchase price.   I don't know if I'll use them again yet, but we'll see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles  Webb",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T02:05:23.000Z",
          "Titre": "had to find the correct model mount…",
          "Contenu": "had to find the correct model mount myself after extensive internet search. your support department was sending my the wrong mount. unable to understand support operator."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff L.",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T00:14:51.000Z",
          "Titre": "Couldn't easily find charging cord for…",
          "Contenu": "Couldn't easily find charging cord for trimmer even with model number of trimmer and model number of cord. Had to wait several minutes for chat to figure it out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edmund Boyle",
          "Nb_Reviews": 7,
          "Date": "2022-06-17T23:27:13.000Z",
          "Titre": "I spent 4 hours trying to blunder my…",
          "Contenu": "I spent 4 hours trying to blunder my way through ordering this item on Quill.com A trulySso at this point, i at least got the order processedd miserable experience! Factory Outlet Store, although far from perfect, at least processed my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William  Dyar",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T02:30:05.000Z",
          "Titre": "When I contacted the store to find out…WHAT IS THE DIFFERENCE?",
          "Contenu": "When I contacted the store to find out the difference between the ES_LA93 and the ES-LA93K models, I was put on hold and after thirty minutes I was told \"It doesn't make any difference\". It must have been like a pig looking at a piano."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ernest  Wells",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T21:23:22.000Z",
          "Titre": "I had purchase a few of these Boom 2 a…",
          "Contenu": "I had purchase a few of these Boom 2 a couple years ago and the back keep falling off  losing the volume button. Now the price have increased tremendously but I can't wear no other Bluetooth especially the ones that stick inside my ear. If these 2 fail me I will not be purchasing from you all again.Ernest Wells"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Judith  Crump",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T01:55:56.000Z",
          "Titre": "Buying replacement brush heads for…",
          "Contenu": "Buying replacement brush heads for electric toothbrush I've had for a few years...Frustrating. So many different numbers associated with various parts, each one of them microscopic print tucked in unsuspecting places. I finally just relied on the picture of the brush head that matched what I had. Hopefully that will work or I'm out $30."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia  McL.",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T21:38:53.000Z",
          "Titre": "It's way too confusing",
          "Contenu": "It's way too confusing. Do you really need a zillion different models? And even after I'd found the faded number on the bottom of my toothbrush--either HX6250-00 or HX6250-09--it turned out there are several different model numbers of brushes that are supposed ti fit it. And, although it was the come-on promising up to 75% off, 4 brush heads cost $58+.Some bargain!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald  Thacker",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T21:05:00.000Z",
          "Titre": "It was difficult to find the charging…",
          "Contenu": "It was difficult to find the charging cable for the forerunner 245, website kept suggesting GPS cables.  Needs to be easier to find specific gear.Price of $39 is VERY high for your proprietary charging cable.  Either start using standard connector such as on phones, or find a way to lower your price on the proprietary cable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael  Galchus",
          "Nb_Reviews": 2,
          "Date": "2021-07-30T14:03:26.000Z",
          "Titre": "Misled by service rep",
          "Contenu": "when chatting with your service rep, Kane,I asked about ordering this GPS with the North American card rather than just the USA maps and he referred me to the NA card itself rather than this model that already comes with that card.  I saved a substantial amount ordering the GPS with the North American card already installed.  SO I didn't appreciate that approach to solving my request.Other than that prices and free shipping are good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 2,
          "Date": "2021-11-06T03:02:54.000Z",
          "Titre": "It was a nightmare to order…",
          "Contenu": "It is kind of difficult to order certain items. I went to your website trying to order \"plaque removal\" brush heads. Well, to begin, the sonicare does not provide a model number. There is only a letter on the head itself (good thing I never got rid of the instruction booklet). I believe it would be a lot easier if there was a model number on the handle and then list the brush heads according with the model number. I don't know if is me but there has to be an easier way to order replacement heads."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daze Off",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T18:28:50.000Z",
          "Titre": "Ordered a Raymarine Cam200IP",
          "Contenu": "Ordered a Raymarine Cam200IP. There product info says it works with Light house II. My Multi-function display has Lighthouse III.  Call customer service they gave me Raymarines customer support number and told me the cam would need framework update that only Raymarine could do. Raymarine advised that if it operates with Lighthouse II it is also compatable with Lighthouse III. Would have been a 5 star if the customer service person was more knowledgeable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tobi",
          "Nb_Reviews": 1,
          "Date": "2021-06-20T20:19:51.000Z",
          "Titre": "Everything was fine except one significant thing",
          "Contenu": "Everything was fine - then I saw my address.  I entered it correctly, but on the checkout page it appeared in 2 places and one of them had dropped my unit number (815 124th ST. SW, #128) - the #128 was dropped.The other appearance was correct - I'm hoping that was the shipping address - it wasn't identified.  If the shipping address dropped the unit # I will never receive the item.  It might be a good idea to fix that..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jackie  Lowe",
          "Nb_Reviews": 2,
          "Date": "2021-11-07T13:03:41.000Z",
          "Titre": "Smartpost does not work for delivery.",
          "Contenu": "I will change this rating if I receive it in 3 to 5 days as stated on your site.  The other one I got took nine days to get here.  So, I said I would change this review.  Added one star and even the they called me twice, it was a day late.  Yes, they use Fedex Smartpost and it just sat around for USPS to finish the delivery.  Didn't happen so Fedex delivered it themselves on Sat.  They need to get rid of SmartPost.  They are just trying to save money instead of satisfying customers.  Or they need to change their delivery times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hal Slapin",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T03:24:32.000Z",
          "Titre": "We ordered water filters for our Bosch…",
          "Contenu": "They sent the wrong refrigerator water filters and we had to return them. It was their error and gave us a credit less a re-stocking charge. After writing an unfavorable review with 1 star, they did the right thing and promptly gave us a full refund. I did not expect that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 2,
          "Date": "2021-03-12T16:05:47.000Z",
          "Titre": "Ordered a refurbished magellan gps - not pleased",
          "Contenu": "Ordered a refurbished magellan gps. Had dead spots and so hard to program. other than that it worked. Delivery was fine. Haven't seen the refund yet but the reduced price might make the torment of using a defective model tolerable. The issue is trying to input streets, the screen is not calibrated and the back button is nearly useless in the top right corner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dixie",
          "Nb_Reviews": 2,
          "Date": "2021-07-23T15:57:31.000Z",
          "Titre": "Don't waste your time on chat…",
          "Contenu": "I tried to find an extra handset for my existing system, which says it is expandable to 12 handsets,  I could not find it on the website so I chatted with Peter.  He kept me on hold for over 30 minutes only to tell me they did not have extra handsets.  Then why does it say it is expandable 10 12 if you can't get the handsets?  I purchased one from the AT&T Outlet previously, but it failed so I wanted to replace it.  I was totally unsatisfied with my chat and disappointed that they do not have the items I need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SH",
          "Nb_Reviews": 2,
          "Date": "2021-05-29T14:29:49.000Z",
          "Titre": "Ordered two Honeywell Merv 13 16x24x4…",
          "Contenu": "Ordered two Honeywell Merv 13 16x24x4 furnace filters.  Two problems - Shipped by FEDEX who partially crushed the shipping box deforming the two filters.  These were not inexpensive, so am filing a claim with the Factory Outlet Store.  Factory Outlet responded promptly to my claim and is providing a full refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark  Snyder",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T23:17:13.000Z",
          "Titre": "I received a 15% discount code from a…",
          "Contenu": "I received a 15% discount code from a Midland Representative at Smokey Mountain Jeep Invasion that was good until 12/31/21.  Your agent said that amount was not possible and the code would not work.  So, a bit disappointed, but I ordered the radios anyway."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joel  Piper",
          "Nb_Reviews": 3,
          "Date": "2021-04-23T19:50:52.000Z",
          "Titre": "It was off the wall when it came to…",
          "Contenu": "It was off the wall when it came to getting the payment finalized.  I had to go thru the checkout process twice, and I'm still not sure it's done right.Shouldn't have that type of trouble after I've already agreed to buy the phone.Need to talk to your interface partners about that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug Staab",
          "Nb_Reviews": 2,
          "Date": "2021-06-24T20:29:13.000Z",
          "Titre": "Buyer beware - make sure your phone is supported BEFORE you buy it",
          "Contenu": "Why sell phones you do not support?  One should be able to purchase a replacement part (like a handset only) rather than be forced to buy a complete phone.  Makes one decide to look elsewhere for product that is supported by making replacement hardware available - extremely disappointing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "christine",
          "Nb_Reviews": 12,
          "Date": "2021-11-07T19:50:06.000Z",
          "Titre": "too many different products",
          "Contenu": "too many different products, all called something different.  confusing to figure out which replacement brush heads are for which models.  a product line of less that 10 items would be plenty, with maybe 3 different brush styles.  It's overkill."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell Williams",
          "Nb_Reviews": 4,
          "Date": "2021-04-02T13:02:38.000Z",
          "Titre": "False information",
          "Contenu": "I ordered 3 Lowrance items on 3/10, your website listed 2 in stock and one backordered.  Understanding that I went ahead and ordered, my boat has been pulled apart in anticipation of the two items.  As of today none have been received and anticipated delivery is not until the end of the month.  Order was #FOS11240115E.  If you don't have them in stock, don't list them as such.  The Ghost was still listed as \"in stock\" as few weeks later.  My boat will miss early spring fishing and will sit idle until I get the Ghost and Elite FS units."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WILLIAM WALTZ",
          "Nb_Reviews": 2,
          "Date": "2021-03-03T21:07:53.000Z",
          "Titre": "I was told through chat I could make a…",
          "Contenu": "I was told through chat I could make a substitution of a weedless prop for the standard power prop. When I went to order it was not the case. :-(I also ask a question about an extension handle that could not be answered. This was an order for Minnkota trolling motor and extras."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Carnevale",
          "Nb_Reviews": 8,
          "Date": "2023-09-04T16:44:57.000Z",
          "Titre": "Hard time checking out!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Angell",
          "Nb_Reviews": 2,
          "Date": "2021-05-08T19:38:29.000Z",
          "Titre": "Still on the fence",
          "Contenu": "Still on the fence, ordered GPS and traffic cable. GPS great, cable appeared used/broken. Returned, on my dime, for new cable. Got refund instead less 15% restocking fee, for broken cable? Reply from FactoryOuletStore and they added the restock fee to refund. Thank You"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacqueline  Kemp",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T21:35:46.000Z",
          "Titre": "My opinion of Factory Outlet Store is very good and trustworthy.",
          "Contenu": "My opinion of Factory Outlet Store is average as it has always sent my order as expected; I have never needed to return any items I ordered for any reason; I trust this source for purchasing by mail.  Further, payments as scheduled are without confusion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mary",
          "Nb_Reviews": 2,
          "Date": "2021-11-28T15:38:32.000Z",
          "Titre": "It was not straightforward picking…",
          "Contenu": "It was not straightforward picking replacement heads: the # I chose didn't match the # that showed up in the cart. I tried several times. Hope I got it right. Happy Holidays! Love this toothbrush so much buying one for my sweetie."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 2,
          "Date": "2021-04-16T03:58:10.000Z",
          "Titre": "Don't expect any order updates just inbox full of wanting to sell you more",
          "Contenu": "2 Weeks since I placed a order. I never received any order updates. Emailed company a few times asking on a update on order.  Never received reply.  Today called and foreign call center said product on back order.   It would have been nice to know this 2 weeks ago since I need the item now not who knows when!After I wrote this review I was told by their  foreign customer service that magically The order they had no idea when it would be in was shipping and I would have by the date I was requesting refund.  The battery arrived and does work.    So all in all  it is ok ..It did arive and works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Guilford",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T20:59:56.000Z",
          "Titre": "Order finally received 5/19 to 6/8",
          "Contenu": "Updated. I ordered a Barcolounger on 5/19. I have called many times to check on where my product is, no one can tell me and now they are blaming the delay on FedEx. I put in the tracking number and it is not in FedEx system.  Factory Outlet Store had NO problem taking my money but they will not take responsibility in getting me my product. Gary has seemingly tried but so far failed in his promises.  Ordered on 5/19 and now it will be a minimum of 6/7 before I possibly see this chair. Although the chair finally arrived after many calls, they did not honor the $80 off they promised for their mistakes. Milan was the one who escalated my case to a manager.  Thank you, Milan. Now please honor the discount you promised.  I’ll be waiting.  Ordered 5/19, delivery 6/8.  Not exactly the 3-5 days promised on their site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chandler  Roth",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T23:31:15.000Z",
          "Titre": "Just ordered it and they make me fill…",
          "Contenu": "Just ordered it and they make me fill out this dumb survey. Can't say anything yet except filling out my card info was easy. I guess they are good at taking money. We'll see about the rest soon enough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Dean",
          "Nb_Reviews": 2,
          "Date": "2021-09-05T16:36:50.000Z",
          "Titre": "1st time",
          "Contenu": "Do not want to write a review as it is a pain and since I have not used this site long enough to form a good opinion this is what you get.  If this happens again the review will go down as there is no way to exit the review page."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diana  Colby",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T19:30:54.000Z",
          "Titre": "i asked a few questions about the 32G…",
          "Contenu": "i asked a few questions about the 32G micro sd card but the rep did not answer my questions. the only wanted the 32g micro sd card but your company only sells on with an adapter. i ordered it anyway and hope it works on my Garmin Nuvi 50"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell Williams",
          "Nb_Reviews": 4,
          "Date": "2021-04-06T11:29:05.000Z",
          "Titre": "Chat recommendation incorrect",
          "Contenu": "Spoke with a chat person on a previous order and he gave me incorrect technical/product information according to Lowrance.  I got it straightened out but will need to return the item I purchased on the chat person's recommendation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William  Rattenbury",
          "Nb_Reviews": 2,
          "Date": "2021-12-23T18:49:13.000Z",
          "Titre": "Asked for telephone and to use -,",
          "Contenu": "Asked for telephone and to use -,. or () and I first used . and it would not use it Had to guess on why? Found out i needed to use- to go to checkout. If not able to use. then remove it from remarks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gene Moore",
          "Nb_Reviews": 2,
          "Date": "2021-04-02T16:50:17.000Z",
          "Titre": "I have never used this before",
          "Contenu": "I have never used this before.  I rated the middle option since I don't know the outcome, YET.  If I had an opportunity to rate my experience AFTER I HAD AN EXPERIENCE, I could make an EDUCATED evaluation!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "john  robbins",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T19:21:54.000Z",
          "Titre": "I was told when I called your Phone #",
          "Contenu": "I was told when I called your Phone #, that I would get a15% discount if I ordered online, & put the promo code ATT7985 in the promo box at checkout, but was never shown a promo box to enter the code into."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lucille  Mosur",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T18:38:44.000Z",
          "Titre": "I would like to use the online…",
          "Contenu": "I would like to use the online promotion code ztech3754 for the discount for ordering on line.  You do not show any prompts to do so.  Please use the code on your end to give me the discount.  Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clay Camp",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T02:53:28.000Z",
          "Titre": "I could not find the different brush…",
          "Contenu": "I could not find the different brush heads ie. Plaque Control, Gum Care, Premium White, and Tongue care.I have a model HX993R serial number 210121.Please advise.  Thanks;    Clay"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 4,
          "Date": "2021-06-04T11:14:36.000Z",
          "Titre": "Very good pictures that need to be able to enlarge by customers.",
          "Contenu": "Very good pictures, but do not see a way to make them bigger. Great selection, but only good pricing. Was expecting much larger discounts, clearance items and refurbished items. Did not see these."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John2447",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T14:03:33.000Z",
          "Titre": "Backorder",
          "Contenu": "Factory outlet is good. Backordered the key component to making my new two unit Helix, Ultrex system work togehter which is the Ethernet Adapter to allow the units to plug into the network.  Wow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Wedow",
          "Nb_Reviews": 3,
          "Date": "2023-06-14T00:47:03.000Z",
          "Titre": "the help bot didn't work very well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William  Dean",
          "Nb_Reviews": 1,
          "Date": "2021-02-20T00:48:18.000Z",
          "Titre": "We ordered new heads with lots of…",
          "Contenu": "We ordered new heads with lots of explanation to be sure that we were getting the correct heads. When they arrived, we were sent a set of heads that I had never seen before. They could not be used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve  Herman",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T21:33:52.000Z",
          "Titre": "Website is too cluttered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 4,
          "Date": "2021-10-18T23:56:15.000Z",
          "Titre": "the last time I ordered cables from the…",
          "Contenu": "the last time I ordered cables from the factory outlet store they were supposed to be data cables but wouldn't allow my Nuvi to connect to my PC. I hope they work this time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "maf",
          "Nb_Reviews": 2,
          "Date": "2021-11-04T17:50:35.000Z",
          "Titre": "you have an unreachable writing chat",
          "Contenu": "you have an unreachable writing chat and voice was not to a decent standard, had to go trough 3 customer service operators graphic payment interface was very good instead"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CustomerJoe",
          "Nb_Reviews": 3,
          "Date": "2022-08-31T00:53:50.000Z",
          "Titre": "Could not find replacement cushions for…",
          "Contenu": "Could not find replacement cushions for model that I wanted.  Hopefully the ones that I ordered will fit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry  Tanner",
          "Nb_Reviews": 2,
          "Date": "2021-09-20T19:26:14.000Z",
          "Titre": "First time ordering from this vendor",
          "Contenu": "First time ordering from this vendor. So neither good or bad review, since I haven't actually submitted the order yet. I will review again after receiveing my item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Theresa Hanson",
          "Nb_Reviews": 2,
          "Date": "2021-02-23T16:43:10.000Z",
          "Titre": "Annoying pop-up for help interrupted my…",
          "Contenu": "Annoying pop-up for help interrupted my shopping. How many times do I have to close it to get it to leave me alone? I closed it at least 5 times.Otherwise the website seems okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen Miller",
          "Nb_Reviews": 3,
          "Date": "2021-07-15T20:01:28.000Z",
          "Titre": "Maybe good battery?",
          "Contenu": "I have gotten phone batteries from this site before and they always wear out in a few weeks. This time I have added the protection so I will see it it makes any difference."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Haas",
          "Nb_Reviews": 2,
          "Date": "2021-03-05T00:01:11.000Z",
          "Titre": "Could be better",
          "Contenu": "The site is mostly easy to navigate. One thought: you don't list the OEM part number, it only appears to be your stores product number only. This isn't ideal for people confirming they're ordering the correct part/product. Second Thought: The listing for the product i was buying has a buy option on the top of the page, then covered details in the middle of the page, and then there was another option to buy at the bottom of the page. This was confusing, as if there were 2 different models to buy or something. 1 single spot at the top or the bottom is sufficient and minimizes confusion.*** correction; my mistake, the part has a product code and a part number also. the product code is listed but i was only familiar with the part number. you are correc that is the oem product code. thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Pearre Cabell Jr",
          "Nb_Reviews": 3,
          "Date": "2023-05-28T17:47:29.000Z",
          "Titre": "Rejected me twice"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M Meehan",
          "Nb_Reviews": 2,
          "Date": "2021-12-26T14:45:29.000Z",
          "Titre": "No Means to Get AN Order Receipt after Placing an Order!",
          "Contenu": "Made a Few Purchases from Factory Outlet and They Could not Provide any Sales Receipt which is needed for a Browning Trail Camera Warranty - Order. I Never received any Email Order Confirmation. When I Contact them a few months Later They Could NOT Provide A \"Sale / Order Receipt\"! Odd that They use Technology to place Orders So They SHOULD Have Means to Provide an Order Receipt especially when it less than 1 Year from the Time the Order Was Made! So I am now reluctant to Buy Anything Electronic as You have No Warranty Coverage if You Need a Date of Purchase. So This recent Order was for non Electronic  Items! Requested several times and Then Always Required a Phone Call? And Never Got an Order Confirmation I Could have USED for this Warranty Issue so I had not means to get a Warranty from Browning Trail Cameras. And Since I did not have a Printer then No way to get any Kind of Order Receipt!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug  Steiner",
          "Nb_Reviews": 1,
          "Date": "2021-07-11T22:10:06.000Z",
          "Titre": "The web site seamed difficult to…",
          "Contenu": "The web site seamed difficult to navigate when ordering and the complete order took a few times to get it to go through. Maybe I didn’t understand something not sure"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcia Hochberg",
          "Nb_Reviews": 3,
          "Date": "2022-03-28T18:34:10.000Z",
          "Titre": "The chat was difficult and took a lot…",
          "Contenu": "The chat was difficult and took a lot of time.  Did not get all my questions answered.  Have not received anything.  Only ordered assessories"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary  Vohland",
          "Nb_Reviews": 2,
          "Date": "2022-02-14T20:13:23.000Z",
          "Titre": "by ordering from the factory store I am…",
          "Contenu": "by ordering from the factory store I am hoping to get a new unit not sitting in stock for months with expired batteries and old model features."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas  Mathewson",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T22:37:51.000Z",
          "Titre": "I had trouble communicating with Peter",
          "Contenu": "I had trouble communicating with Peter. Is Peter a robot? Next time I will talk to a person at Customer Service (I really like the shaver, BTW).Tom Mathewson"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Stinson, M.D.",
          "Nb_Reviews": 6,
          "Date": "2022-12-04T18:43:15.000Z",
          "Titre": "This assessment is premature",
          "Contenu": "This assessment is premature, as I just ordered my item. Check with me after I receive my trolling motor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BZ",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T03:42:26.000Z",
          "Titre": "Some products are hard to find",
          "Contenu": "Some products are hard to find or miscategorized."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John  Gernert",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T17:49:43.000Z",
          "Titre": "From where I'm sitting at my computer…",
          "Contenu": "From where I'm sitting at my computer this looks like any other program.  I will know more when I receive the product  and work with it for a while."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Oldguy",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T15:36:51.000Z",
          "Titre": "Not all of what I thought I was getting",
          "Contenu": "I ordered the Striker Plus CV5 Ice Fishing package based on the description of what it does and what was included. The description is very misleading since it is written mostly for a boat mount instead of the ice fishing package. With the ice fishing package, the ClearVu features are not available transducer supplied, so it's another $100 to get the transducer that gives you all the features the unit is capable of. There is also a picture of all the parts that are included. THE PICTURE CONTAINS ITEMS THAT ARE NOT INCLUDED, like the ice fishing mount ($95 extra) and the mounting swivel base is different. I haven't used the unit yet, and it may give me everything I need, but the description and picture are very misleading. Customer Service says they will fix the problem with the listing, but that doesn't help me much. Shame on me for not doing more research before I purchased it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James  DiCuffa",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T21:27:20.524Z",
          "Titre": "Have been generally pleased with 6-pack…",
          "Contenu": "Have been generally pleased with 6-pack of DeWalt 18 volt - ordered a few years ago - though one of the 6 is questionable..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey  Gilliland",
          "Nb_Reviews": 2,
          "Date": "2022-02-26T01:05:22.000Z",
          "Titre": "Very hard to determine the model #",
          "Contenu": "Very hard to determine the model # , nothing matches the numbers, or letters on the brush. Where oh where is the model # located?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C.J. Smith",
          "Nb_Reviews": 4,
          "Date": "2021-08-01T23:09:14.000Z",
          "Titre": "Items I Wanted Found!",
          "Contenu": "I checked other sites for some specific products, they didn't have the exact ones I wanted. So, this site had exactly what I wanted. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara McLeod",
          "Nb_Reviews": 3,
          "Date": "2021-05-28T20:39:41.000Z",
          "Titre": "I got offers to chat",
          "Contenu": "I got offers to chat.  Was not a \"chat\" but a written exchange I apparently could not figure out and the response was error or some such."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "debbie  dumas",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T17:49:17.000Z",
          "Titre": "I just wish you could debit from a…",
          "Contenu": "I just wish you could debit from a savings account like a lot of other places do . It would have saved me another trip to the bank"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John  Cox",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T19:22:48.000Z",
          "Titre": "Very difficult to find the correct…",
          "Contenu": "Very difficult to find the correct replacement brush head for my Sonicare.  Call center operator not helpful at all and very difficult to understand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard  Ashton-Brown",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T00:34:51.000Z",
          "Titre": "Very poor support for my Nuvi 2789",
          "Contenu": "Very poor support for my Nuvi 2789Very poor support for my Nuvi 2789LMlm"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "de",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T23:48:22.000Z",
          "Titre": "shipping unreasonable",
          "Contenu": "i like pet safe products but $60.00 for shipping is a rip off when total weight is less than a pound."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry  Day",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T18:58:52.000Z",
          "Titre": "Don't know yet",
          "Contenu": "Don't know yet. 1st time using this site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AUDREY VOIGT",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T16:19:20.000Z",
          "Titre": "THE COSTS FOR THESE BATTERIES ARE VERY…",
          "Contenu": "THE COSTS FOR THESE BATTERIES ARE VERY HIGH AND EVEN THOUGH THERE IS A DISCOUNT TO ORDER MORE IT IS NOT REALLY VERY SIGNIFICANT."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan F.",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T16:23:05.000Z",
          "Titre": "Different new website",
          "Contenu": "This site was not as easily manageable as other sites. It took some time and adjusting to figure the site out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T R Patterson",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T18:18:23.000Z",
          "Titre": "I cannot say what the overall…",
          "Contenu": "I cannot say what the overall experience was. I just ordered. So far, so good. shipment, and product test will determine further yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William  Barron",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:19:15.000Z",
          "Titre": "Available and quick!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr. Darby",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T02:04:48.000Z",
          "Titre": "I recently returned an Apple Watch 6…",
          "Contenu": "I recently returned an Apple Watch 6 that I had purchased as new. Sadly, the watch was absent of functionality upon opening the box. After contacting customer service, they issued me a return label, which I promptly used to send the watch back. However, I was unpleasantly surprised to receive only a partial refund of $200, despite my expectation of a full refund. As a consumer, I believe that this decision was worth reconsidering, especially since I had requested an exchange, which was unfortunately denied. The next day, after placing a complaint, they refunded the additional funds that they withheld."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Burns",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T03:15:46.000Z",
          "Titre": "I ordered a MinnKota trolling motor",
          "Contenu": "I ordered a MinnKota trolling motor. There was some issues with communications in regards to inforegarding my order. Once the issue was resolved, which took 2 days and multiply representatives the shipping was very quick and everything was in order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Lyons",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T08:01:39.000Z",
          "Titre": "Best price I found for a Minn Kota…",
          "Contenu": "Best price I found for a Minn Kota trolling motor and they take PayPal, but 4 days later, I had no confirmation from them of any kind, but my bank account had been debited  . . I checked the status on line and it said there was no record of my order # . . .  . I called support and spoke to a woman in India . . it was very slow process, lots of waiting, but she was polite and helpful . . . another 4 days and still no confirmation, but there was a tracking number that showed 'In Transit\" . . . so I read the on-line reviews here and another site AND BBB and now I'm thinking I really screwed up this time ( I really can't afford a $300 hit!). . but next day, there it was at my door and everything they said it would be, best price and free shipping ,  so other than lack of communication, I'm happy  . . 4.75  out of 5 stars and I will buy from them again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald W",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:47:58.000Z",
          "Titre": "Update - FactoryOutletStore.com turned around a bad experience",
          "Contenu": "Update 12/10/23A couple of days after leaving a negative review, I received a phone call from a Factory Outlet representative who informed me that they had issued a full refund and that it was not necessary to return the filters I had purchased that were supposed to be for my air purifier but did not work in my equipment. Although the initial experience was bitter, this adjustment shows that they really care about customer service. Thank you Factory Outlet for turning around a bad experience. November 9, 2023I purchased 2 air filters advertised as a Replacement Purifier Filter For GermGuardian FLT5000 Filter C (2-Pack).  I kept them available for when the filters that came with the Germ Guardian needed to be replaced.  When I went to install the Factory Outlet filter, the size was fine, however, the original filters are in a rigid plastic frame.  The Factory Outlet filters are in a cardboard frame with foam around the outside edge.The problem is that the rigid plastic frame is necessary to depress a button in the Germ Guardian to let the device know that there is a filter installed.  The foam on the Factory Outlet filters to not depress the button, so the air purifier does not work.  The filters are totally useless.I called to return them, however, it had been six months since they were purchased because that is how long the filters that came with the Germ Guardian lasted.  Factory Outlet Store would not allow a return because it was past 30 days.  I recognize that it had been a long time, however they originally sold a product that does not work in the intended device.  It is advertised as replacement filters for the GermGuardian FLT5000.  However, they do not work in the intended device, so I consider this to be false advertising.  I am surprised that no one in their Quality Control ever actually tested the filters in the intended device.If you want to throw your money away, purchase filters from Factory Outlet Store.  If you want actual value for your dollars, buy directly from GermGuardian."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis  Pluskota",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T00:14:23.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order. The Capital One extra information was time wasting.  I don't have the phones yet but just ordered them. That makes it too soon for a review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ricky Dickerson",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T18:14:35.000Z",
          "Titre": "Trimmer works as Described",
          "Contenu": "Ordered a trimmer. Tracking showed it was returned to sender. Call customer service. Replacement was sent right away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott  Groce",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T06:36:41.000Z",
          "Titre": "4th Minn Kota Motor",
          "Contenu": "I was able to get exactly what I was looking for. Minn Kota makes an excellent trolling motor. I only gave 4 stars because I haven't received the order yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reinhold Schlieper",
          "Nb_Reviews": 4,
          "Date": "2023-01-03T18:41:19.000Z",
          "Titre": "It's a bit confusing whether one buys…",
          "Contenu": "It's a bit confusing whether one buys for Series 8 or 9 or whatever. Presumably, the cleaning cartridges are all the same."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PATRICIA  LIBBEY",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T20:59:18.000Z",
          "Titre": "I needed to 'chat' and the customer…",
          "Contenu": "I needed to 'chat' and the customer service rep was responsive & wanted to help after completing my purchase, but when I did, I lost the 'chat'"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chip  Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T06:07:24.000Z",
          "Titre": "Easy to navigate site ..",
          "Contenu": "Easy to navigate site ... parts are reasonably priced ... looks like Factory Outlet Store has it all !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald Dowd-McClary",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T10:44:44.000Z",
          "Titre": "Hunt and you will find what you're looking for…",
          "Contenu": "At first it was a bit difficult to find exactly what I was looking for but as with most things, I didn't ask the right question. I got past that and found what I was looking for.  I will be shopping here again in the near future. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frederick  Jones",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T18:39:14.000Z",
          "Titre": "Review Update: The shipping package for electric razor…",
          "Contenu": "The shipping package for electric razor had virtually no packing material, which must have caused damage to the razor.  The razor seemed misaligned and gave a poor shave, so I returned it.  Because I used razor, I had to pay shipping.  Please use more packing material this time!  Thank you.(This is a wonderful razor.  I still have one from an earlier order.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Micky",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T00:07:12.000Z",
          "Titre": "Difficult to compare items.",
          "Contenu": "The site looks great, but there should be a way to compare similar items side by side.  Best Buy is a good example of how to make it easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin  Sosville",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:53:04.000Z",
          "Titre": "Chose this phone because it says that it has 200 contact list entries",
          "Contenu": "Chose this phone because it says that it has a 200 capacity contact list, and has speaker phone capability."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William  Lau",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T01:05:19.000Z",
          "Titre": "Remington R4 Shaver replacement power adaptor",
          "Contenu": "Remington - power supply adaptor replacementProvides detailed steps online, to find the correct power supply adaptor replacement for R4 PR 1340 D model of Remington Electric Shaver PR 1340 D"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Bateman",
          "Nb_Reviews": 3,
          "Date": "2023-03-24T18:30:55.000Z",
          "Titre": "Dual voltage",
          "Contenu": "I liked that the charger (ordered separately) had dual voltage / worldwide voltage feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James R  Herrin",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:51:54.000Z",
          "Titre": "Fast and quick",
          "Contenu": "Fast and quick. Somewhat confusing about replacement heads for older models."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vance richenberg",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:17:46.000Z",
          "Titre": "useful informattion"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam Starr",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T01:15:30.000Z",
          "Titre": "found the part i needed",
          "Contenu": "big selection can be confusing, but I think I ordered the right part"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond  Roseland",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T02:17:39.000Z",
          "Titre": "easy to navigate thru ,so you could…",
          "Contenu": "easy to navigate thru ,so you could look at different options"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EDGAR  AMAYA",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:26:40.000Z",
          "Titre": "EASY BUT THE PRODUC HAS NOT YET ARRIVED"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret Pignataro",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T04:40:58.000Z",
          "Titre": "website login is most up to date",
          "Contenu": "Having phone model Number most helpful  info to choose rechargeable battery"
        },
        {
          "Note": 4,
          "Lieu": "UM",
          "Pseudo": "Mya Berry",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:52:30.000Z",
          "Titre": "Amazing products but prices are…",
          "Contenu": "Amazing products but prices are slightly high"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peyton B.  Ellis",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T17:01:12.000Z",
          "Titre": "abcd",
          "Contenu": "checkout fine except got msg stating phone # was invalid"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WAVELY WASHINGTON",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T19:44:22.000Z",
          "Titre": "First Time Buy",
          "Contenu": "This is my first time buy from the Factory Outlet Store.  Everything has gone well.  I really appreciate how the order process layout is clear and easy to follow.  Now if the delivery process performs as well as the order process, then I will move my rating from 4 to 5 star!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose Franta",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T17:20:44.000Z",
          "Titre": "I was able to find accessories easily…",
          "Contenu": "I was able to find accessories easily for my Garmin"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T21:56:09.000Z",
          "Titre": "I bought a gps for my boat from here",
          "Contenu": "I bought a gps for my boat from here, spent about $50 more to purchase from them because in the description it said that they were going to send the upgraded transducer. When i got it the box did not contain the updated transducer. When i called them about it they gave me some excuse on why their wording did not mean what it said and that was SOL. Watch the wording on their discription, it is false advertising and very misleading. UPDATE: They did reach out and corrected the error on their website. They were apologetic and made it right with me. I changed my stars from 1 to 4."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "james  whisman",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T23:24:49.000Z",
          "Titre": "I'm not sure they have helped or not…looking for a solution",
          "Contenu": "I'm not sure they have helped or not until  I see if the second part works"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John  Dorsey",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T21:27:04.000Z",
          "Titre": "Purchase replacement power cord",
          "Contenu": "Quickly found the replacement power cord for my razor.  I was surprised the original cord deteriorated so quickly. I've only had the razor for a few years.  It's made somewhat cheaply and the plastic covering for the wire began breaking off in pieces after only a couple of years. Something like that should last at least a decade. Hopefully the new unit will stand up better than the last one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiger Tim",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T19:57:32.000Z",
          "Titre": "Replacement cord easy to find."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bridget  vincent",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T04:10:30.000Z",
          "Titre": "easy transaction",
          "Contenu": "easy transaction. able to find items with out much clicking"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyndsay",
          "Nb_Reviews": 3,
          "Date": "2022-12-19T05:23:03.000Z",
          "Titre": "ease of shopping",
          "Contenu": "Was pretty easy to use for battery replacements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward  Turner",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T20:28:37.000Z",
          "Titre": "They had the part I needed and the…",
          "Contenu": "They had the part I needed and the website was easy to navigate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JML",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T23:58:02.000Z",
          "Titre": "site was easy to use",
          "Contenu": "site was easy to use, but I suggest they get a full 360 view of product.  I do not know if product will work for me because I could not see back side of product.  At least they have a return policy of 30 days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:08:11.000Z",
          "Titre": "Good Selection",
          "Contenu": "They have a wide variety of motors on here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David  Gates",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T15:57:36.000Z",
          "Titre": "It seemed to work fine",
          "Contenu": "It seemed to go fine until I got to all this review stuff"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherrie  Curtis",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T18:03:59.000Z",
          "Titre": "The real thing!",
          "Contenu": "I found too many negative reviews on Amazon regarding a replacement charger for my Garmin. My charger/cord lasted me over 8 years so I came to the Garmin website to buy what I know was a good product. I was difficult to find the replacement charger on the website but I eventually did and it's worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregg Walters",
          "Nb_Reviews": 2,
          "Date": "2022-09-20T16:52:11.000Z",
          "Titre": "Replacement car charger for my Magellan GPS, updated review",
          "Contenu": "I ordered a replacement car charger cable for my older GPS.  It was not compatible with the mounting fixture.  Hopefully I am getting a correct one this time.9/20/2022:  I received the replacement charger and this one is compatible with the mounting hardware.  Factory Outlet refunded the money I paid for the first shipment and did not require that I return the first shipment.  FO was eager to help, and I will continue to do business with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt  Reinke",
          "Nb_Reviews": 6,
          "Date": "2022-10-30T13:50:19.000Z",
          "Titre": "Site offers everything you need!",
          "Contenu": "This site is like an everything in one site experience.  Navigation is slightly confusing but once you get the hang of it, smooth sailing."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Mohsin Jaffar",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T22:56:14.000Z",
          "Titre": "Nice store  i will return my apple watch"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Petty",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T23:40:37.000Z",
          "Titre": "items easy to find",
          "Contenu": "items easy to find, explained, not outrageos priced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joyce",
          "Nb_Reviews": 4,
          "Date": "2023-08-31T19:22:07.000Z",
          "Titre": "easy to order and purchase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T18:20:07.000Z",
          "Titre": "Boss liked the Uniden phones",
          "Contenu": "Boss liked the Uniden phones, we have, but we lost one handset.  The process was easy, to find the correct model and ordering was a breeze."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald  Leonard",
          "Nb_Reviews": 3,
          "Date": "2022-10-27T02:40:58.000Z",
          "Titre": "Got the Memory card I needed for the…",
          "Contenu": "Got the Memory card I needed for the full map update on the Drive 61 GPS.  Now I am able to load the full  map updates with the chip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jodi",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T22:02:58.000Z",
          "Titre": "Search problems",
          "Contenu": "I could not find the Plantronics DA80 10 pack I purchased the last time...   Also, the search feature should be on every page...I kept having to go back to the home page to search."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eula  Cobb",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T20:04:02.000Z",
          "Titre": "Easy transaction",
          "Contenu": "Easy transaction. Simple website. Easy to navigate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "john  guinan",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T23:26:14.000Z",
          "Titre": "simple process & seemingly cost effective",
          "Contenu": "simple process & seemingly cost"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard  Hines Sr.",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T21:20:56.000Z",
          "Titre": "Why can't I just buy the item with out…",
          "Contenu": "Why can't I just buy the item with out all this S**t poppingup ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlos Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T22:10:48.000Z",
          "Titre": "I want to thank Savio for all the help… From Carlos Gonzalez",
          "Contenu": "I want to thank Savio for all the help and time that he gave me. He tried to find an office headset for me with a hard spec to find, but he gave me 100%. I would like to conduct business with him again. Grate technical support. Give him a promotion or raise.!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheila   Buranen",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:41:22.000Z",
          "Titre": "Easy to find product and reasonable…",
          "Contenu": "Easy to find product and reasonable prices"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Wright",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T20:55:21.000Z",
          "Titre": "The product I got was bad and they…",
          "Contenu": "The product I got was bad so They contacted me and refunded me including the restocking fee. Made me happier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "judith  W",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T23:24:38.000Z",
          "Titre": "Complicated trying to compare phone…",
          "Contenu": "Complicated trying to compare phone features, need easy comparison methods. Hope the phone compares to Panasonic set I have been using for almost 25 years! Seniors do not like changes.  Love my old set, but have difficulty dialing numbers and answering due to key pads are worn out.GA Southern senior lady"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gerard  oie",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T20:41:00.000Z",
          "Titre": "card shy",
          "Contenu": "factory outlet contacted me regarding my (card shy) review of my experience trying to pay with a credit card, and told me it was a technical issue with their equipment. for that reason, i gave them one more star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "McKinley  Barnes",
          "Nb_Reviews": 3,
          "Date": "2022-08-09T20:28:23.000Z",
          "Titre": "If you need to return - you pay shipping - AND 15% fee",
          "Contenu": "A company representative told me the headset I was buying did not use Bluetooth technology. The headset arrived today, and uses Bluetooth. Via chat I was informed that I must pay the shipping to return the item AND pay a 15% fee to make them take it back. I will never purchase anything from this company again.UPDATE: I received a call from a representative who is sending me a return shipping label and will refund the full price. I think this only happened because I was given incorrect information by the original chat representative about the product.I'm going to leave the title as is, because their policy is that you pay for return shipping and pay a re-stocking fee of 15-20%."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad  Schafer",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T20:27:17.000Z",
          "Titre": "It was a little confusing to determine…",
          "Contenu": "It was a little confusing to determine if the blades and screens were both included. It was hard to get the 2 items I had looked at in different windows into the same shopping cart. The chat rep helped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Ulrich",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T21:49:38.000Z",
          "Titre": "I liked the item page description"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valhalla",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T17:28:10.000Z",
          "Titre": "Easy to navigate site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tom r",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T01:58:09.000Z",
          "Titre": "easy to use",
          "Contenu": "I have Panasonic phones now and I like them, they are easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Giuliano Costa",
          "Nb_Reviews": 5,
          "Date": "2022-04-20T18:58:51.000Z",
          "Titre": "Product never received - but the aftersales team helped me",
          "Contenu": "Made a purchase and the item was shipped incorrectly. The carrier only make changes if the sender allows to.Now my order will take a longer time to get received.The customer service is very bad and they refused to return the sales. Please look at the reviews on their google maps. They are 1- stars.They mentioned that called me, but it never happened. I do not recommend this company to anyone.The aftersales team responded and resolved this properly! Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Dietz",
          "Nb_Reviews": 4,
          "Date": "2023-06-05T21:37:05.000Z",
          "Titre": "a little pricey",
          "Contenu": "Easy to reorder supplies altho expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles  brock",
          "Nb_Reviews": 2,
          "Date": "2022-03-21T01:05:53.000Z",
          "Titre": "I wish it was clearer",
          "Contenu": "I wish it was clearer. The active target and live sonar and activ imaging is real confusing and I am still not sure if I have ordered what I want . But I have spoke to Kane on the computer at your store and he says this is what I need for the live target look at fish, I hope this is right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Merle  Sollenberger",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T17:59:14.000Z",
          "Titre": "ordering it worked fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHRISTOPHER BAKER",
          "Nb_Reviews": 3,
          "Date": "2022-07-27T01:12:40.000Z",
          "Titre": "I couldn't read the numbers on my…",
          "Contenu": "I couldn't read the numbers on my shaver and was one letter off but your chat person cleared up my dilema and I was able to complete my purchase. She gets 5 stars. Your site gets 3. To complex."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard  walley",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T01:37:39.000Z",
          "Titre": "I am a little disappointed in the…",
          "Contenu": "I am a little disappointed in the extension arm for the roadmate commercial. The suction is not sufficient to hold the gps. I would like to see the suction part and the part which attaches to the gps with the rubber ball made as parts to the extension. The gps units i have are older models, but still work fine. I ordered new mounts to use and both new items failed with the suction cup. the factory outlet is replacing my original parts, but the new items have failed after one day. One is used for a tour bus, the other a school bus.  I am sure the factory outlet is not the problem. The original mounts I bought in 2011 and 2014 just failed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas  Jermyn",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T01:32:57.000Z",
          "Titre": "website is easy to navigate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom  Hase",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T21:34:28.000Z",
          "Titre": "The price was right",
          "Contenu": "The price was right, and I hope the follow though is too,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 3,
          "Date": "2022-11-15T16:44:50.000Z",
          "Titre": "Very easy to order and also to return…",
          "Contenu": "Very easy to order and also to return items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas  Donnelly",
          "Nb_Reviews": 3,
          "Date": "2022-08-09T01:01:23.000Z",
          "Titre": "Telephone extension cords.",
          "Contenu": "One of the items I was looking for was displayed earlier,but not on the 2nd login.  No matter.  I will be able to testthe existing hardware with the items purchased here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liz  Tolero",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T23:59:12.000Z",
          "Titre": "Your phone products work well",
          "Contenu": "The Planetronics phone headsets works well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reni Ken",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T23:39:32.000Z",
          "Titre": "men's groomer",
          "Contenu": "Have an existing Norelco trimmer, but need an additional one for travel.  Would be nice to have carrying cases for these items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ms Audrey",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T19:37:08.000Z",
          "Titre": "Panasonic is workable...",
          "Contenu": "I read the reviews before making my section. However, I presently own Panasonic Cordless Phone Set. I have had it over three years. I just need a new set, the one does not work on my old set."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken  Hoard",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T22:27:26.000Z",
          "Titre": "Had difficulty with telephone number",
          "Contenu": "Had difficulty with telephone number.  The number came up automatically with a + in front of the 1, I did not know how, came up like that??  No biggy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "clifford  Paquette",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T02:23:04.000Z",
          "Titre": "Too late",
          "Contenu": "Got notice to use phone call to get free gift just before completing checking out.  Missed it as I watched screen transition to this review request."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WYNTONS PEST CONTROL",
          "Nb_Reviews": 3,
          "Date": "2022-12-22T18:59:50.000Z",
          "Titre": "I had to ask for help to find the part…",
          "Contenu": "I had to ask for help to find the part I needed. The agent was kind and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurie Bowman",
          "Nb_Reviews": 3,
          "Date": "2022-07-07T18:09:42.000Z",
          "Titre": "I found everything easily that I…",
          "Contenu": "I found everything easily that I needed.  To remove an item there should be an button to push to delete it instead of having to go to quantity and change it to 0 and edit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve H",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T22:14:43.000Z",
          "Titre": "Website easy to use however confusing…",
          "Contenu": "Website easy to use however confusing on warranty. Description of item states 2 year warranty included but when you go to checkout option for 2 year warranty is $39.00?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEPHEN  MEASMER",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T16:50:50.000Z",
          "Titre": "\"In the box\" details aren't clear",
          "Contenu": "For my purchase of a chartplotter I couldn't find out if it came with a sunscreen or not.  I added a sunscreen to my purchase just in case it didn't come with one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Silver",
          "Nb_Reviews": 4,
          "Date": "2022-11-10T22:28:42.000Z",
          "Titre": "It was easy cancelled what I bought…",
          "Contenu": "It was easy cancelled what I bought from Amazon"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Bridwell",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T00:57:39.000Z",
          "Titre": "Website a bit tricky to…",
          "Contenu": "Website a bit tricky to navigate...getting to what you want as replacement parts/accessories."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B Gottfried",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T18:10:27.000Z",
          "Titre": "Ease of ordering",
          "Contenu": "It was easy to find the product I need and easy to order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LARRY PAISLEY",
          "Nb_Reviews": 4,
          "Date": "2022-10-13T22:42:42.000Z",
          "Titre": "I couldn't find what I wanted",
          "Contenu": "I couldn't find what I wanted, which was the W3 brush head in the color black."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Cannon",
          "Nb_Reviews": 6,
          "Date": "2022-04-22T12:19:08.000Z",
          "Titre": "UPDATED....Honorable Company!",
          "Contenu": "UPDATE:This company has surprised me. I was contacted within one day by a manager concerning my order and frustrations. This company truly cares about its online reputation and offered me a deal to continue with my order. I order a lot of products online and it means a lot to me to have this kind of attention when there is an issue. Everyone makes mistakes, it's all about how you correct mistakes that matter most. I will update again once the product is received. I placed an order for a Minn Kota Trolling motor and was informed after ordering that the item was on backorder. I wanted to cancel. Customer service offered me a free extended warranty if I didn't cancel the order and that my item would be available within 15 days. I agreed. Then my card was charged again for the new order. Long story short, they are holding up funds on my credit card with pending charges."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryant  Humphrey",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T17:43:37.000Z",
          "Titre": "5 stars for sure",
          "Contenu": "5 stars for sure! Kind, helpful, fast, what more could you ask for? will do more business here for the future, if every thing works out? LOL!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Hoover",
          "Nb_Reviews": 7,
          "Date": "2023-06-13T10:06:33.000Z",
          "Titre": "Found battery I needed",
          "Contenu": "Found battery I needed, good price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank  Wampler",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T00:20:29.000Z",
          "Titre": "It was quick",
          "Contenu": "It was quick,   Now we will see how the dely goes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodney  Bolton",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:53:20.000Z",
          "Titre": "Quick & Easy",
          "Contenu": "Quick easy to use website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roy  Boudreaux",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T21:22:31.000Z",
          "Titre": "Easy to order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 6,
          "Date": "2022-07-11T19:14:45.000Z",
          "Titre": "Model number?",
          "Contenu": "It was not clear if the ES8103S replacement blade that I need is identical to the ES8103 listed.  I bought it anyway."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete Kerr",
          "Nb_Reviews": 5,
          "Date": "2022-04-15T17:12:57.000Z",
          "Titre": "High price",
          "Contenu": "It would seem that I could have acquired my ear tips at half the price elsewhere.  Nevertheless, I prefer to buy from the manufacturer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BZ",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T14:02:53.000Z",
          "Titre": "This is an update to a previous review",
          "Contenu": "This is an update to a previous review.  I was contacted by the vendor and they found the issue I mentioned “Products miscategorized” and fixed the issue.  The search was returning an incorrect product.  Thank you for reaching out immediately to fix the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael  Whatley",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T04:37:55.000Z",
          "Titre": "water filters",
          "Contenu": "easy site to find what you want and the check-out is simple"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T00:03:03.000Z",
          "Titre": "Competitive pricing and good info",
          "Contenu": "Easy to maneuver and I was linked to the site by the online chat for Panasonic. They led me to the perfect option"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon  Mark",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T02:30:08.000Z",
          "Titre": "I LIKE THE PHONE WITH THE BIG NUMBERE…",
          "Contenu": "I LIKE THE PHONE WITH THE BIG NUMBERE AND THE BOOST ON IT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy  Moore",
          "Nb_Reviews": 2,
          "Date": "2022-10-17T22:40:17.000Z",
          "Titre": "incorrect entries",
          "Contenu": "Several items were entered automatically and were incorrect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oneil",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T18:32:35.000Z",
          "Titre": "easy to order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T. Lewers",
          "Nb_Reviews": 3,
          "Date": "2022-08-03T02:43:42.000Z",
          "Titre": "When will it arrive?",
          "Contenu": "Couldn't find in the ordering process how long the estimated time was until I received the item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David J",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T19:42:41.000Z",
          "Titre": "Will see after I get my order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul c Lugara jr",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T15:29:13.000Z",
          "Titre": "THE PRICE OF PRODUCT EASY CHECK OUT…",
          "Contenu": "THE PRICE OF PRODUCT EASY CHECK OUT PROCESS"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Sampath Kapugamage",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:08:30.000Z",
          "Titre": "Website is Very user friendly",
          "Contenu": "Website is Very user friendlyWebsite is Very user friendly. If I have questions, there is a phone number for me to call before I place my order.I enjoyed this purchase. Made it real easy. Almost feel like second guessing myself. ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felipe  Gabaldon",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:22:12.000Z",
          "Titre": "Website is Very user friendly",
          "Contenu": "Website is Very user friendly. If I have questions, there is a phone number for me to call before I place my order. I enjoyed this purchase. Made it real easy. Almost feel like second guessing myself. LOL"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Kelly Jr",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T21:08:45.000Z",
          "Titre": "One-Stop Replacement Blades Shopping",
          "Contenu": "Always have what I am looking for in stock, with fair pricing and speedy delivery!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christopher Price",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T14:10:39.000Z",
          "Titre": "Pleased with the refurbished GPS and follow up service from FOS",
          "Contenu": "1. Order processing and dispatch were fast.2. They used reputable and efficient courier service ( UPS) rather than the useless Hermes/ Evri.3. Most importantly, when I expressed concern over the screen accuracy of the sat nav, they directed me to the relevant help page, and offered to exchange the unit, if I was not able to resolve the issue. Thankfully, I was able to.4. To conclude, this is not a sell and forget company, They have sent follow up emails to ensure the issue was resolved,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Schlegel",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T19:01:12.000Z",
          "Titre": "Minkota upgrade",
          "Contenu": "After waiting months for delivery of an upgrade kit from Bass Pro for my trolling motor I learned they were lying and would NEVER deliver since they only gordered from minkota who had discontinued the product. WhenI found you and ordered the part on Aug 12th you predicted a late Aug delivery. To my delight it ywas delivered on Aug 16th. It has been installed and is working correctly. It is actually a factory unit in the original packaging. Thank you profusely for a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARY L  GILLIAM",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T15:24:35.000Z",
          "Titre": "I have ordered replacement heads three…",
          "Contenu": "I have ordered replacement heads three times, and they do not work on his razor.    I got the number listed for his model of shaver.   I will be returning one purchase.The customer service agent called me and after answering her questions about my order, she credited my account with the cost of the products. I appreciated her efforts in taking care of this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:28:15.000Z",
          "Titre": "Kane was outstanding",
          "Contenu": "Kane was outstanding.  I was asking questions about a Jabra phone and he researched my questions, within 2 min or so was back with the model of phone I really needed for what I wanted.  I asked a few additional questions about the model and what was included, what additional product I would need...he did not try and sell me things I didn't need, was very professional - you are very fortunate to have an employee with such a knack with customer service - it is priceless these daysThank you,  Lisa"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Guglielmetti",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T02:41:51.000Z",
          "Titre": "The Phone Source",
          "Contenu": "Like the look of your website.  Like the way you have organized the different phone categories.  Comparable prices.  Free shipping.  Sweet!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth  Cortner",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T16:18:29.000Z",
          "Titre": "Purchase was easily done",
          "Contenu": "Purchase was easily done. Seeing different models with prices and features was great. Plus I did not have to drive  around possibility to more than one store to find what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK  RANSFORD",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:33:21.000Z",
          "Titre": "Had a very nice on line chat",
          "Contenu": "Had a very nice on line chat. Can't remember her name"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lucien",
          "Nb_Reviews": 4,
          "Date": "2023-06-24T10:43:42.000Z",
          "Titre": "5 stars for Stacy and customer service and FOS; And zero stars of plantronics C3225",
          "Contenu": "My experience with this web store was 100% excellent; STACY the customer service was wonderful customer service representative because they honor the warranty and 100% refund for one item and its replace; Means right now there are 2 items in the trash and my refund is on the way.I bought 1 refurnished plantronics C3225 headset (micro is in front of the mouth) and in my phone calls people told me that they can not ear me properly or at all...The store replaced with other free cost and non return; The second item had the same problem; I spoke with Stacy and she told me that I can trash the product and my refund will be done in some days...5 stars for Stacy and the FOS; And zero for this model of plantronics...I don think so the problem is because the product was refurnished, because in both the really main problem was the same...I will tray with other brand or model"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward  Sowden",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:18:18.000Z",
          "Titre": "Courteous People"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond  Price",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:48:12.000Z",
          "Titre": "easy to order online",
          "Contenu": "easy to order online. product info was good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:28:30.000Z",
          "Titre": "Nickie help me out and was very nice",
          "Contenu": "Nickie help me out and was very nice. I ordered a Braun clean and renew refill. When it came last Friday it was leaking  and I couldn't use it. At that time I spoke with Adam. He said he was going to ship me out a replacement. During the conversation, I asked him specifically, if he wanted me to ship back the defective order 3 times. His reply was no, you can just throw it away. So I threw it away in my dumpster and an hour later he called me wanted me to ship the defective part back. I wasn't going to go into the dumpster and dig it out and he said that he would still ship out my replacement order. Well the order was never shipped and I was not contacted again. After close to a week, I called to check on my replacement order and Nickie helped me out and got me a refund. She was professional, and polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve H",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:25:17.000Z",
          "Titre": "Found what I was looking for without a…",
          "Contenu": "Found what I was looking for without a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert  Pletcher",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T19:16:33.000Z",
          "Titre": "The ease of finding the product needed  Excelent",
          "Contenu": "The ease of finding the product needed and the cost.  The  ease of moving through your ordering process.  This is the second time I have used your company and have been satisfied with the process bot on line and with your sales staff on the phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill  Harris",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T13:10:36.000Z",
          "Titre": "First -time ordering and it was a pleasant experience..Fast and easy which is great when you…",
          "Contenu": "Fast and easy which is great when you have a busy schedule.  The delivery was quick, and it was a good experience all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JustAnswer Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T21:47:50.000Z",
          "Titre": "The person that I ask questions gave me…",
          "Contenu": "The person that I ask questions gave me the information that i needed very quick so I could purchase what i needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert  Gellock",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T16:22:57.000Z",
          "Titre": "After speaking with a Remington…Great Products",
          "Contenu": "After speaking with a Remington representative regarding a different matter, I decided, on her recommendation, to make this purchase. Even though I was able to find it elsewhere a little cheaper, I trust Remington more than other online shopping sites. As a very long-time Remington user, I thank you for your great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John  Wallet",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:56:28.000Z",
          "Titre": "good description of product",
          "Contenu": "good description of product, good pictures of product, easy checkout. I would like to see you use PayPal as a payment option. Free shipping is nice! 6/15/2023"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Vuchinich",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T03:55:08.000Z",
          "Titre": "Niche Needed items!",
          "Contenu": "Very helpful for niche but needed items for consumers, through google search after several websites found this. had what i needed in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas  Standifer",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T21:47:38.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy.  Had no problem finding the part I was looking for with plenty of information to insure the part was for the model I had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TROY WINSLOW BENSON",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T02:13:27.000Z",
          "Titre": "AT&T is the right choice",
          "Contenu": "AT&T is the right choice.  I had the account already setup and ready to use and ordering a replacement handset was so easy for one that is lost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EARL  CORNELL",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T00:58:26.000Z",
          "Titre": "I AM 89 years old and and find some…",
          "Contenu": "I AM 89 years old and and find some onlineordering difficult . THIS EXPIERENCE SIMED EASY   THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Weigle",
          "Nb_Reviews": 3,
          "Date": "2023-07-11T20:43:08.000Z",
          "Titre": "I got what I needed",
          "Contenu": "I got what I needed and Sebastian was extremely helpful and finding the right model for a 20 year old model"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Qaisar  Farooq",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T20:34:43.000Z",
          "Titre": "Stock availability is great",
          "Contenu": "Stock availability is great. Could not find ready to ship stock anywhere else but they have it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Ragsdale",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T15:24:11.000Z",
          "Titre": "easy complete order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald C",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T23:18:19.000Z",
          "Titre": "Good deal wallphone",
          "Contenu": "Company had what I was looking for, plus factory new.Site was easy to navigate and no surprises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William  Helmer",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T19:03:34.000Z",
          "Titre": "Order phone set",
          "Contenu": "I have always had excellent service from Uniden  phones.Item description was very informative, and the ordering prep was easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassandra Fleming",
          "Nb_Reviews": 3,
          "Date": "2023-06-30T01:40:22.000Z",
          "Titre": "After using the chat feature",
          "Contenu": "After using the chat feature, I was able to locate the batteries I needed.  That feature was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Martin",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T20:33:07.000Z",
          "Titre": "Great job",
          "Contenu": "Great job! Savio confirmed a question for me that our contact list can be transferred to my new phone set!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randi  Alba",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T16:31:55.000Z",
          "Titre": "Easy to find the battery I was looking…",
          "Contenu": "Easy to find the battery I was looking for.  Creating an account was also easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alvah  Cass",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T19:23:14.000Z",
          "Titre": "Had what I was looking for",
          "Contenu": "Had what I was looking for. Easy to find. Easy to order. Appreciate free shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PaulaJean  Darnell",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T00:29:17.000Z",
          "Titre": "Customer service was good.",
          "Contenu": "The only person I dealt with was via chat, but he sufficiently answered my question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin  Knight",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T20:56:09.000Z",
          "Titre": "I felt like the process was easier to…pleasanr",
          "Contenu": "I felt like the process was easier to follow than some of the purchases I'ved made online. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John  Beyer",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T18:01:24.000Z",
          "Titre": "You had my model number and the battery…",
          "Contenu": "You had my model number and the battery that was required ... it was a no brainer!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Combs",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T22:02:08.000Z",
          "Titre": "The Representative was able to help me…",
          "Contenu": "The Representative was able to help me find model for replacement but I then decided to buy new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Alice",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T17:54:58.000Z",
          "Titre": "Had what i needed",
          "Contenu": "Had what i needed, easy to complete order and free shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Hart",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T17:20:06.000Z",
          "Titre": "Quick, Easy, Discount Surprise…",
          "Contenu": "Quick and easy to place my order with an unexpected 10% discount - yea!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Spencer",
          "Nb_Reviews": 3,
          "Date": "2023-05-18T19:32:12.000Z",
          "Titre": "This purchase was very easy",
          "Contenu": "This purchase was very easy, plus it had an instruction video on how to install.  I thought the price of this flap was high."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cecelia  Mercer",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T19:19:53.000Z",
          "Titre": "This item was at the top of the Google…",
          "Contenu": "This item was at the top of the Google listings and popped right up on your website from there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T14:55:22.000Z",
          "Titre": "Very easy to chat with Sebastian and I…",
          "Contenu": "Very easy to chat with Sebastian and I was able to easily place my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ram  Moy",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T22:40:56.000Z",
          "Titre": "The online chat seal the deal",
          "Contenu": "The online chat seal the deal. I got the answer I needed before ordering"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOUGLAS HEWITT",
          "Nb_Reviews": 4,
          "Date": "2023-09-29T15:59:28.000Z",
          "Titre": "Website was easy to find and easy to…Easy Peasy",
          "Contenu": "Website was easy to find and easy to navigate.  Prices for items were very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Wittenberg",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T16:00:42.000Z",
          "Titre": "Fast and simple...answered questions…",
          "Contenu": "Fast and simple...answered questions and completed purchase in record time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Phipps",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T17:41:41.000Z",
          "Titre": "Quickly found the product I was looking for…",
          "Contenu": "Found the product I was looking for quickly and was able to order without any issues. Very easy to complete."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara   McAtee-Hege",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:31:23.000Z",
          "Titre": "Ben helped me and answered all my…",
          "Contenu": "Ben helped me and answered all my questions and was very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary.",
          "Nb_Reviews": 5,
          "Date": "2023-05-19T10:25:11.000Z",
          "Titre": "Complete description of device's specs and program.",
          "Contenu": "Fast, thorough description and good price, no shipping charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan  Kastberg",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T18:55:22.000Z",
          "Titre": "It's helpful to be able to find exactly…",
          "Contenu": "It's helpful to be able to find exactly what you want so easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T14:52:51.000Z",
          "Titre": "Great experience",
          "Contenu": "easy to find what i needed and price seemed great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T00:45:40.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service; helped me find the right product for my needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 5,
          "Date": "2023-09-28T14:17:57.000Z",
          "Titre": "Very happy!!!",
          "Contenu": "Found exactly what I needed right away, good price and fast checkout. Very happy!!!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Joseph",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T13:08:24.000Z",
          "Titre": "Amazing ..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Thorp",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T22:50:00.000Z",
          "Titre": "Very simple, fair price, better than off-brand refills."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Illneverbeback",
          "Nb_Reviews": 3,
          "Date": "2023-06-19T05:35:37.000Z",
          "Titre": "Broad Selection & Good Descriptions",
          "Contenu": "Excellent assortment of purchase options, great item details, and your company seems to be trustworthy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher  Weait",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T00:17:34.000Z",
          "Titre": "Convenience and ease of being sure I…",
          "Contenu": "Convenience and ease of being sure I was ordering the correct item"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Shelly Ricards",
          "Nb_Reviews": 6,
          "Date": "2023-07-10T18:58:19.000Z",
          "Titre": "I have used the factory outlet store…",
          "Contenu": "I have used the factory outlet store many times before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T23:20:29.000Z",
          "Titre": "easy peasy",
          "Contenu": "Found what I needed quickly, great price, no charge for shipping and quick checkout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darleen Rogers",
          "Nb_Reviews": 3,
          "Date": "2023-07-02T21:27:23.000Z",
          "Titre": "Easy to find the product I was looking for!",
          "Contenu": "Easy to find the product I was looking for at a reasonable price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 5,
          "Date": "2023-05-26T20:53:05.000Z",
          "Titre": "My questions were answered quickly and…",
          "Contenu": "My questions were answered quickly and the representative was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FelixF",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T19:54:55.000Z",
          "Titre": "Great products",
          "Contenu": "Great products.  Great prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "james  whisman",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T21:49:13.000Z",
          "Titre": "easy checkout and good description of…",
          "Contenu": "easy checkout and good description of product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Brennan",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T15:20:59.000Z",
          "Titre": "The informative product descriptions…",
          "Contenu": "The informative product descriptions really help with making a confident purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T23:03:58.000Z",
          "Titre": "Hard to find battery was in stock.",
          "Contenu": "Hard to find battery was in stock.Easy to order on the website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise C.",
          "Nb_Reviews": 3,
          "Date": "2023-08-28T00:05:35.000Z",
          "Titre": "Easy website to use!",
          "Contenu": "Easy website to navigate and make purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacqueline  Nicoud",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T23:51:43.000Z",
          "Titre": "fast efficient takes a minute to reorder"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John  Sharpe",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T19:42:58.000Z",
          "Titre": "Efficient",
          "Contenu": "Efficient, quick and simple."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Edwin Pogoy",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T17:17:34.000Z",
          "Titre": "Friendly honest faithful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T22:27:20.000Z",
          "Titre": "Savio was very helpsul!",
          "Contenu": "Savio directed me to exactly what I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy  Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T17:49:20.000Z",
          "Titre": "Great shaving product",
          "Contenu": "Fast and efficient.  Great product and easy to read details."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David  Hershberger",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T03:04:47.000Z",
          "Titre": "accurate info and fair price for product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Klaas Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T05:53:17.000Z",
          "Titre": "Easy to find the correct batteries",
          "Contenu": "Easy to find the correct batteries. Website was clear and intuitive to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph  Wallis",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T17:20:47.000Z",
          "Titre": "Great price..easy to navigate website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T22:28:02.000Z",
          "Titre": "replacement clippers",
          "Contenu": "Been looking for these clippers for a while. My old ones  lost its charge"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Tahira Saeed",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T10:49:45.000Z",
          "Titre": "Google app store is a great app",
          "Contenu": "Google app store is a great app. It's new features are very useful and easy. Thank Google app store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward  Sparacio",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T20:20:36.000Z",
          "Titre": "Easy and fast delivery",
          "Contenu": "Easy and fast delivery. Got my order in 2 Days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary  Seligman",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T20:03:50.000Z",
          "Titre": "Ease of finding my product and…",
          "Contenu": "Ease of finding my product and availability!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold  Conover",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T17:39:14.000Z",
          "Titre": "fast & easy",
          "Contenu": "fast & easy; have 10 of these radios already"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim  Reed",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T00:40:02.000Z",
          "Titre": "Very easy",
          "Contenu": "Very easy, entered item number and it came up in stock and I ordered it. That simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn  Bresler",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T22:20:35.000Z",
          "Titre": "Easy checkout",
          "Contenu": "Easy checkout.  Automatic promo code"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim  Capel",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T22:22:00.000Z",
          "Titre": "easy ordering/free shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GERALD SZEFLINSKI",
          "Nb_Reviews": 10,
          "Date": "2023-09-03T21:05:03.000Z",
          "Titre": "very understanding  ( SAVIO ) sales…",
          "Contenu": "very understanding  ( SAVIO ) sales person- good prices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken  Livermore",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T18:21:18.000Z",
          "Titre": "you did well it was easy to read and…",
          "Contenu": "you did well it was easy to read and there wasn't a lot of crap"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john  trunnell",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T15:46:50.000Z",
          "Titre": "It was easy to make our order",
          "Contenu": "It was easy to make our order. If everything else is as simple we will be very happy. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Barber",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T21:34:40.000Z",
          "Titre": "fish finder transducer",
          "Contenu": "found item and says fits my fish finder"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earl Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T03:11:18.000Z",
          "Titre": "Great seller",
          "Contenu": "Great seller, quick and easy transaction"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "deckbob",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T21:19:40.000Z",
          "Titre": "I hope the razor works as smoothly as the online transaction ...",
          "Contenu": "... everything online very user-friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert  Plaus",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T20:32:45.000Z",
          "Titre": "fill ins easy to find",
          "Contenu": "fill ins easy to find, correctly labeled went smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill  Harris",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T18:19:48.000Z",
          "Titre": "Easy to use and informative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy  Gorman",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T02:45:11.000Z",
          "Titre": "Fast ordering",
          "Contenu": "Fast ordering, easy to follow website!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 6,
          "Date": "2023-06-12T16:57:42.000Z",
          "Titre": "- Nice Find",
          "Contenu": "- User friendly site- Lots of affordable choices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Magdi  Malek",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T21:25:46.000Z",
          "Titre": "Your website is very clear and direct",
          "Contenu": "Your website is very clear and direct, I like that. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 5,
          "Date": "2023-06-18T06:10:27.000Z",
          "Titre": "Easy to use",
          "Contenu": "It was easy to use and got an extra discount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim R",
          "Nb_Reviews": 4,
          "Date": "2023-06-04T22:26:31.000Z",
          "Titre": "Great company",
          "Contenu": "Great company, fast shipping and great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peredz Huxman",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T11:40:28.000Z",
          "Titre": "That feature is very helpful",
          "Contenu": "That feature is very helpful. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James  McQuistion",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:47:27.000Z",
          "Titre": "Best price",
          "Contenu": "10% OFF. Cheapest I could find product online. Free shipping!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William  Tackett",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T23:41:58.000Z",
          "Titre": "easy to open account and order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles  Smith",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T18:11:55.000Z",
          "Titre": "You always have what i need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N Martinson",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T23:24:47.000Z",
          "Titre": "Good level of specification detail and…",
          "Contenu": "Good level of specification detail and ease of ordering"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Soter",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T19:16:55.000Z",
          "Titre": "The order form was short and easy to…",
          "Contenu": "The order form was short and easy to complete."
        }
      ]
    }
  ]
}