{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.dlgamer.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Rick Deckard",
          "Nb_Reviews": 7,
          "Date": "2023-10-24T09:30:04.000Z",
          "Titre": "I made a purchase of a key that never…",
          "Contenu": "I made a purchase of a key that never was sent to me. The money was charged but the key was not delivered. Order no.1638296"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Stephan Nikol",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T09:14:29.000Z",
          "Titre": "Clunky and not user friendly",
          "Contenu": "The website is poorly translated and switches between various languages. This isn't too bad in the age of google translate, but rather annoying.What's really annoying is that the site cancelled my order, which was already payed for, without giving a comprehensible reason.Update: according to the message I received from the vendor, the item I ordered was out of stock. How can a digital item be out of stock?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Salivala",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T01:01:31.000Z",
          "Titre": "Avoid site",
          "Contenu": "Avoid site. I've either 1. been scammed or 2. of all the sites i've been looking through to get this key cheaper are the only one that doesn't properly display if they're out of stock. For that reason alone I wouldn't take the gamble. On top of that, once you bought the product and it gets \"delivered\" the product page that should have the key, just wont and there is literally nothing on the page that shows that anything is going wrong. At a certain point incompetence might as well be malice."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T08:24:53.000Z",
          "Titre": "Didn't deliver",
          "Contenu": "Didn't deliver, and didn't refund money.Stay away.Edit after DLGamers reply:After uncountable steps of verifications, there was no indication anything went wrong. If there is a link to a page saying \"here's your code\", but there is no code, I do indeed submit a dispute and don't wait around for hours or days waiting to get contacted. If I go to the supermarket to buy milk, and if I pay for the milk, I expect milk - not being sent out with an empty shopping bag after checkout.PayPal is waiting for their response, which they are apparently not providing. Them pointing to the payment service is ridiculous and, in my eyes, a sign of bad will and dubious business practices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roland Akguard",
          "Nb_Reviews": 5,
          "Date": "2023-05-03T02:21:33.000Z",
          "Titre": "Horrible buying experience.",
          "Contenu": "Its an 8 step process to verify your order, with everything from giving them your cell phone to linking them to your PayPal account and running 3 separate verification checks - one on each individual part. And they said they'd send me a text to verify my number, which I never received. Horrible process. I can't even see the logic behind it, aside from fishing for as much information as possible with every order. Never ordering here again, and I'm asking Paypal to stop this order as I never recieved my game in the first place."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Dom The Elegy",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T09:43:44.000Z",
          "Titre": "Fraud",
          "Contenu": "The store took my money and didn't offer any product. Upon contacting them they told me it wasn't their fault and that I should have used a different payment provider and not HiPay. Why they offer the one they KNOW has issues is beyond me. Now I can battle with HiPay because DLGamer refuses to take responsibility for the wrongful charge on my account they are responsible for. Avoid this store like the plague."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Michal Certicky",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T22:41:01.000Z",
          "Titre": "Takes 1-2 days to process an order",
          "Contenu": "The purchase on DLGAMER requires a manual validation by their human employee, which means it can take several hours, or even a day or two, to go through (especially on a weekend). In my case, it took a day to process and even then it was cancelled, because when they finally asked me to confirm my paypal email, it took me more than 5 minutes. Buy elsewhere. This service doesn't belong into this century. The only good thing I can tell about DLGAMER is that it's probably not an intentional scam."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "בן חי מכלוף",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T08:33:11.000Z",
          "Titre": "order canceled yet still payed",
          "Contenu": "i tried to buy the demon slayer game yet they said the order was canceled and refundedafter a2 and a half weeks i see that im being charged for this game at the same amount!my credit card company tell me that the payment went thru even tho i didnt get the product.i send a massage to them and still havent got an answer.really hope they will replay to me cause this is really frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Del C Maria",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T15:48:33.000Z",
          "Titre": "this is big scam company",
          "Contenu": "this is big scam company. They are thief's. i purchased elden ring from them and they charged me and then sent me to phone verification and then i verified by phone and they scammers sent me this key..Your key(s) : ELDEN RINGSteam  WX6AT-ZM9X0-PNHPO-B63KVi checked it and it was invalid because steam provide 12 digits key but this one is 16 digits key so i reported it to their customer support but then blocked my account without any reply.. Don't use this site...They are big scammers..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T02:57:08.000Z",
          "Titre": "Wait for another",
          "Contenu": "Kept sending review email requests for the product, like 2 per hour on the hour for 10 hours."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jonathan Knight",
          "Nb_Reviews": 15,
          "Date": "2022-08-31T15:49:41.000Z",
          "Titre": "Thieves",
          "Contenu": "I begrudge giving these fools so much as a single star. Every other company process orders in seconds these people have stolen my money and are yet to provide ANYTHING. Definitely do not use. This is a con. They are thieves.No you didn't SMS me and no you haven't refunded me. Thief."
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Mauricio Ahumada",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T14:23:24.000Z",
          "Titre": "Feeling scammed",
          "Contenu": "I bought Tekken 7, payment went through, validation went through and after less than 3 minutes my order was \"completed\" but sadly there's no cdkey to be found. On the product page I can see the game, I can see the invoice and instructions on how to activate the game on steam but there no key anywhere on that page. I sent message to support but after a couple of hours there's still no response. If tomorrow I get an answer for them I will update this review.Edit. I got a response from DLGamer, the order appears to be refunded, they say there was a problem with their supplier, they were out of stock but now the item is in stock again. I could try again if I wanted... I did and got the same situation. Payment went through, no key. Now I really feel scammed but I guess is on me now (Fool me once, shame on you. Fool me twice shame on me)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gul Naz",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T11:13:46.000Z",
          "Titre": "Hello there",
          "Contenu": "Hello there, I had purchased  Little Nightmares II just a minute ago but it's cancelled and refunded. Why did this happen ?"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Tiago Santana",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T18:34:30.000Z",
          "Titre": "I purchased football manager this…",
          "Contenu": "I purchased football manager this morning and im still waiting for the order to be processed.. can you please help me?! i want to play today pls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Carter",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T23:28:38.000Z",
          "Titre": "No Delivery",
          "Contenu": "Ordered.. no key provided.  Website states key delivered but nowhere to be found on the details page.. I feel scammed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendell Newton",
          "Nb_Reviews": 1,
          "Date": "2022-03-13T08:53:18.000Z",
          "Titre": "After payment they cancelled order",
          "Contenu": "After payment they cancelled order. Don't know why..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Muhammad Arif",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T09:35:22.000Z",
          "Titre": "order Paid and then refunded without…",
          "Contenu": "order Paid and then refunded without any reason."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Paul Lewis",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T08:19:36.000Z",
          "Titre": "Rip off. No game and no service.",
          "Contenu": "Paid money for an Origin EA game and I am getting \"waiting on Origin account login\" and there is popup window says \"account linked sucessfully\" but I didn't get game. Sent messages to dlgamer for assistance and got no reply. What a waste of money. Won't be using them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rivera, Jesse",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T14:50:57.000Z",
          "Titre": "Never received purchase",
          "Contenu": "I purchased a game from them but when I received the code steam informed me that it had already been used. I then put in a service ticket with them and have heard nothing back beside that they were looking into it. Will not use this site to make any further purchases."
        },
        {
          "Note": 1,
          "Lieu": "MD",
          "Pseudo": "Chris Russu",
          "Nb_Reviews": 7,
          "Date": "2017-11-26T00:11:36.000Z",
          "Titre": "Dodgy costumer service",
          "Contenu": "Tried to purchase Guild Wars 2 Fire and Thorns expansion key for 42$. Wouldn't let me since i'm from RP of Moldova, Europe.Switched to European Currency Euro's for 42E, still wouldn't let me. Tried to purchase a key from them and save 20$, not worth the wasted time with all the limitations and regional blocks they impose.Fine job DLGamer, you can claim your 1 star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lentz, Randy",
          "Nb_Reviews": 1,
          "Date": "2017-07-09T02:49:25.000Z",
          "Titre": "Fail",
          "Contenu": "Fail - Bought Civilization III Complete for Mac, and could never even get it to open.  Tried to submit a request to DLGamer support, but the game I bought was not listed in the help/e-mail form dropdown, so I was dead in the water.  Gave up and considered the money I spent  for a dead game to be a write-off; not worth my time to fight for.But then they sent me this link to submit a review, so yeah."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2018-03-24T22:09:43.000Z",
          "Titre": "Difficult to do business with.",
          "Contenu": "This website regularly has great deals. However, the purchasing time can be extremely long and difficult to deal with. Their website will accept your payment and then they will reject it or refund you for a host of various reasons.I have successfully purchased from them once and unsuccessfully purchased or attempted to purchase from 3-4 more times before this review. I have sent several messages to support without getting a response in return."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Bradley",
          "Nb_Reviews": 16,
          "Date": "2018-02-18T15:15:44.000Z",
          "Titre": "Stay well clear of DLGamer.",
          "Contenu": "Stay well clear of DLGamer.I preordered Gravel (Order 664672) for the PC and paid with PayPal.I confirmed my email address and also added my mobile number and confirmed that with a code that was sent to my mobile.A couple of days later I get a email saying that I need to verify my PayPal account.What rubbish they have cancelled my order because I preordered the game for £8.79 and now it’s on their website for £26.39!.Complete joke avoid at all cost!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2016-02-09T18:19:37.000Z",
          "Titre": "Purchased ESO.....key wasn't valid.",
          "Contenu": "Purchased Elder Scrolls Online while on sale for 18.99 tried to activate the key was given an invalid key error. Tried copy paste tried typing multiple times no luck. Submitted a ticket to customer support for a refund was not granted a response. Will be contacting my Credit Card processor to issue a charge back. Lesson learned will just purchase from sites such as greenmangaming, humblebundle, and STEAM from now on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KH",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T16:22:37.000Z",
          "Titre": "Dont Trust This Site",
          "Contenu": "01/26/2021 \t$29.99 \tDownload \t\tYour payment has been declined, please check all details and try again.01/26/2021 \t$29.99 \tDownload \t\tYour payment has been declined, please check all details and try again. Yet they still charged my card--dont trust this site"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Lukas Antverp",
          "Nb_Reviews": 1,
          "Date": "2015-12-07T17:40:48.000Z",
          "Titre": "Unblock my account",
          "Contenu": "Please unblock my account. When I tried to buy 3 copy of ESO, every time your system received the money from my account I was getting the message about error and indulged me money. Then I was locked on your site. Only recently I received email with information that the emails did not reach you, in which I wrote a question why you blocked my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Helmes, John",
          "Nb_Reviews": 1,
          "Date": "2017-10-29T10:01:03.000Z",
          "Titre": "I can't find anyone online",
          "Contenu": "I can't find anyone online, The game doesn't support 21x9, If I put it in full screen the game stops working. Btw I have 2 1080s in sli, a I7 7700k, 32gb ddr4 ram, I'm wayyyy over recommended specs My computer can run any game perfect except this one, I want my money back for the unacceptable experience!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2014-10-29T16:06:41.000Z",
          "Titre": "Impossible to order anything",
          "Contenu": "I have tried now to purchase items multiple times on DLGamer, both using a verified Paypal account and my Visa Card. Every time they have refunded me without stating the particular reason why, and I was charged a banking fee for each transaction which was never returned to me. All they gave me was generic list of reasons why the transaction might have been canceled. I contacted support for the specific reason why, and they will not answer me. I am now lead to believe that this site is actually a fake."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "J",
          "Nb_Reviews": 2,
          "Date": "2018-04-20T13:25:39.000Z",
          "Titre": "Accepted my money, did not deliver.",
          "Contenu": "Accepted my account creation, accepted my money; instead of automatically delivering my product, made me wait for manual review, which eventually declined my purchase. No reason was given. No opportunity was given for appeal. Instead, I have to wait for up to 7 days for a refund of the money they were able to take from me instantly. Bad luck if I now can't afford to buy the game that I am intending to play at this weekend's LAN party from a less stupid website. Support are not answering my request for information. Avoid this site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WolfeWaves",
          "Nb_Reviews": 1,
          "Date": "2016-08-28T16:41:54.000Z",
          "Titre": "Sketchy",
          "Contenu": "I just made an order with these guys. First attempt it didn't clear with my bank. No problem, I gave them a call and straightened everything out. Second attempt, payment went through and was cancelled by DLGAMER. Now I'm out about $65. I am very disappointed and this seems extremely sketchy. I will not be doing any more business with DLGAMER and will be expressing my concerns with all of my followers and friends on social media. I just wanted the games that I paid for and went through all the trouble of verifying."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Emil",
          "Nb_Reviews": 2,
          "Date": "2017-02-10T14:06:05.434Z",
          "Titre": "Unacceptable",
          "Contenu": "Unacceptable! They REQUIRE your phone number in order to send you a code to \"validate\" your order. No code has arrived, and it's been 20 minutes. They are not answering their e-mail, but payment went through just fine. Hmm! They didn't tell me about any of this beforehand."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Plummy95",
          "Nb_Reviews": 2,
          "Date": "2015-09-09T08:27:35.000Z",
          "Titre": "Rude service",
          "Contenu": "something didn't arrive at all. Contacted paypal resolution to sort it out. \"Customer services\" sent a badly written message which made no sense via paypal calling me a liar told me to respond to them but blocked me so I couldn't.\rSounds like a scam to me. At least paypal helped"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unsatisfied",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T15:05:30.000Z",
          "Titre": "No Customer Service",
          "Contenu": "If you buy anything from DLGamer, know that there is no chance you will ever receive any support for any issue, whether if it is billing/refund/technical. I requested a refund from them because the game was not working. DLGamer customer service replied to me telling me that I should Google my technical question since it appears to be a known bug. I replied that I wanted a refund and not to investigate a technical issue, especially since DLGamer claims to give you 48 hours to request a refund, I didn't want to waste any of that time. They never responded."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2015-03-29T23:08:29.000Z",
          "Titre": "Waste of time",
          "Contenu": "I recently purchased Dragon age Inquisition from DLGAMER as they were having a sale on it by about 25%, after making the purchase I received the game and everything fine however when I received my bill on my Credit Card the company had charged me full price and did not give me the sale price, even though my final receipt from them showed a total including the discount. I tried to contact the company to resolve the issue and have heard nothing back.\r Might as well buy games directly from the source instead of using this site if they aren't going to be honest about pricing."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Alexander Ellison",
          "Nb_Reviews": 1,
          "Date": "2013-11-24T04:57:45.000Z",
          "Titre": "Awful, where is the after sale service",
          "Contenu": "I bought a product through DL gamer and STILL have had no response to an email I sent asking for help. I had to eventually get help from game designer, but got no response whatsoever from DL gamer. First contact almost two months later is to ask for this feedback....."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad D",
          "Nb_Reviews": 1,
          "Date": "2016-05-18T02:57:19.000Z",
          "Titre": "Security system is an extreme hassle",
          "Contenu": "I will exhaust all other options before buying from dlgamer.only worth it if I am saving $8+security process is a pain in the Apurchased Fallout4, GTAV, and DOOM. I will probably bite the bullet and pay the extra money, the savings are just not worth it,"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Juan Guitian Arroba",
          "Nb_Reviews": 1,
          "Date": "2014-04-06T08:36:16.000Z",
          "Titre": "total disaster, they send me keys 6 times and none works",
          "Contenu": "PLEASE DONT BUY IN THIS SITE IS A FRAUD, THEY TELL YOU SEND A KEY BUT ALWAYS THE KEY IS INVALID AND DONT WORK IF YOU MAIL THEM THEY SUCKS ABOUT YOU AND AGAIN AND AGAIN SEND YOU NEW KEYS BUT THIS NEW KEYES DONT WORK TOO. SIMPLE I BUY HERE ONCE BUT LAST TIME TOO."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Morris Christopher",
          "Nb_Reviews": 1,
          "Date": "2014-10-27T15:03:04.000Z",
          "Titre": "Billing system is a joke",
          "Contenu": "After getting one account banned for no apparent reason, and several attempt to charge two different cards later, my purchase finally went through.  Thankfully the only charge was for the game I wanted.  I will likely never do business with DL gamer again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 7,
          "Date": "2018-09-03T19:04:31.000Z",
          "Titre": "WARNING - Requires even more personal info after payment",
          "Contenu": "After payment they requires you give them a bunch more personal information including phone number.  And if you use a VOIP phone number you're SOL.------------------------------------Reply follows> \"Do you think we deserve this scoring\"?Yes.  Your company clearly claims 'Instant Delivery of your game code' on your store page.  Even though you know this isn't true, you promise this.If you want to stop getting bad reviews from customers, move the verification process to BEFORE charging payment so users who get stuck in verification hell can just go to a different shop instead.  Otherwise you will continue to have more annoyed customers when they get their money stuck and can't get their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William H",
          "Nb_Reviews": 1,
          "Date": "2018-07-14T16:53:16.000Z",
          "Titre": "They canceled my order 3 times.",
          "Contenu": "I tried to purchase a game THREE TIMES and it was canceled each time. First time, they wanted me to verify my paypal, but I was confused whether I had to or not, because it looked like my order was complete and required no additional action, but I got an email the next day that it was canceled. Then I tried buying it using my credit card, and I got a text from my bank asking if the charge was legit. I told them yes, but I had to try the purchase a third time. The third time, I tried my card again, and an hour later DLGamer emails me telling me my order was canceled because I used the same card too many times, or possibly some other reason. This is ridiculous. I've never faced so much resistance from a website when trying to give them money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Landry",
          "Nb_Reviews": 2,
          "Date": "2016-05-26T19:07:16.000Z",
          "Titre": "Fail",
          "Contenu": "Eso was 18$, i tried to buy 3 copies for me and my brothers, and they banned my account, asked me to do this review a few months later i cant even login to their stupid site never use this website."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mizzle",
          "Nb_Reviews": 2,
          "Date": "2015-06-26T00:05:40.406Z",
          "Titre": "Shady Site Wants Your Phone Numbers",
          "Contenu": "After ordering and successful payment I was suddenly asked to give my mobile phone number and then verify that I received a code texted from them. Apparently it's an \"important precaution to protect my payment data\". They would not let me access the product I just bought until I did it.\r I don't see how it verifies anything other than that I have a mobile phone. And they already confirmed successful payment so if they were unsure that the card was mine it's a bit late to ask. Can't see any reason for it other than maybe wanting to supplement their income by selling phone numbers to spam companies. When I sent a ticket to customer service asking about it and why it was required, they immediately gave me a refund which is pretty suspicious."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon Liu",
          "Nb_Reviews": 16,
          "Date": "2019-05-30T12:25:22.000Z",
          "Titre": "I almost immediately got a warning from…",
          "Contenu": "I almost immediately got a warning from my bank's credit check system that my personal info went up on the dark web after making a purchase at this site."
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Darkness",
          "Nb_Reviews": 6,
          "Date": "2021-01-06T20:13:26.000Z",
          "Titre": "This is the best site i have ever…",
          "Contenu": "This is the best site i have ever bought from . I had a problem with monster hunter world and they refunded me immediately with zero delays ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "keep looking",
          "Nb_Reviews": 1,
          "Date": "2015-11-21T18:45:56.000Z",
          "Titre": "Wouldn't use them again.",
          "Contenu": "They required more information than I was comfortable with in order to unlock my game.  I purchased the game using paypal, and their system demanded more personal information from me until I could receive my item even though my account had already been charged.  After which, they used to send me unsolicited messages.  Their privacy policy states that they will not share my information, but I have yet to run into a company that collects this much and doesn't sell your information.\r My money was taken and my product was held hostage for more information.  If had enough time in my life to pursue every person who does something like this to me, I would go into this matter further, but I don't.  I wish I could do more to ensure businesses like this weren't around.  I find this practice appalling and I don't think anyone should buy products from this company.  You might save money on a product here, but you'll pay for it in other ways.  Keep looking."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Banks, Jamie",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T20:46:23.000Z",
          "Titre": "Didnt work at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Recx",
          "Nb_Reviews": 11,
          "Date": "2015-04-24T19:04:27.000Z",
          "Titre": "Do Not Trust This French Company",
          "Contenu": "I preordered Grand Theft Auto V PC from them in the beginning of March expecting to get the bonuses of the preorder for the game. When the preloading for the game starts, I didn't receive my game key as I was suppose to, only to have them just cancel and refund my order when I contacted support and asked where my key was.\r  I did not make a chargeback. I filed a dispute, then got an email stating \"You've made a paypal dispute, you've been refunded of the amount, you're the only responsible of this.\" \r The dispute could have been handled as a normal seller would do, by actually giving the customer the product they had ordered, but you instead decided to become spiteful and cancel my order.\r It's really bad when a company has to lie to cover their mistakes, but it does let you know what kind of a company you're dealing with and not to deal with them in the future. It also lets other people know how the company acts, and how it's employees are trained to behave."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Atkinson, Timothy",
          "Nb_Reviews": 1,
          "Date": "2018-01-15T01:38:59.000Z",
          "Titre": "Was given an invalid code for a game I …",
          "Contenu": "Was given an invalid code for a game I purchased, had to contact support to get the situation corrected."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "HG",
          "Nb_Reviews": 1,
          "Date": "2018-10-15T12:53:07.000Z",
          "Titre": "i should have bought the game through…",
          "Contenu": "i should have bought the game through steam directly.  i am unable to play this game. disappointed."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Mehow",
          "Nb_Reviews": 2,
          "Date": "2020-09-17T23:11:24.000Z",
          "Titre": "AFTER buying the game (AFTER the…",
          "Contenu": "AFTER buying the game (AFTER the payment has been processed = money was already transferred) they REQUIRE from you to give them your phone number [!] ... - you WON'T get the game you've already PAID FOR without it.I've gave them some phony number that I won't use in couple of days but they are NOT accepting those temporary free SMS boxes - if I were to give my regular number I would request a refund.No info about that before I decided to buy - no such info on the order processing page either. This is the last time I've bought something on this site, what a scam :/====EDIT AFTER RECEIVING THE RESPONSE FROM THE SHOP:1 - please quit your BS - the info about the phone number was visible? OK, where? In the very bottom with 5px font, maybe white font on a white background? Everything else was VERY clearly visible... How does giving you my phone number protects anyone? My card handler has its own protection features. I haven't seen that in any store before - ever.2 - Money wasn't transferred you say - no such info on the site with my key which supposedly was already bought as I followed through withy every step of the payment process! The option for a refund was NOT there. I'm not answering any of your further inquiries, I'm not adjusting anything in my review as well."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dr Andrew Shannon",
          "Nb_Reviews": 2,
          "Date": "2014-06-25T15:46:11.000Z",
          "Titre": "Horrible customer experience",
          "Contenu": "Just to buy a steam key, I had to sign up for an account, and become a member of their community.  This made me very angry.  That, alone, was terrible customer service.  Although I spent some time searching, I couldn't find any way to delete my account, nor did their emails to me contain this information, which should always be included in such \"we've signed you up to our community\" type emails.  Agains, terrible customer service.  Frustrating as hell, for no reason at all.  \r Then, after getting prodded into writing a review, I get another an email from Trustpilot, claiming my review didn't comment on the customer service, when in fact in commented on nothing but (indeed, they're a company selling software written by someone else - nothing but customer service).  I can only conclude they complained to try and get it taken down.  Terrible experience.  I probably should've realised that a retailer that required me to make an account just to buy something was going to be a horrible experience.  I made that mistake, and will never buy from them again.  I'd delete my account if I could, but searching around their website I couldn't find any way to do this, nor did their signup email contain this information.  Don't make the same mistake I did.\r Unbelievable that in 2014 a company that just sells things over the internet hasn't learnt the lesson of the $300 million button."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "dajana klos",
          "Nb_Reviews": 1,
          "Date": "2020-10-10T12:14:59.000Z",
          "Titre": "WARNING SCAM!",
          "Contenu": "WARNING SCAM!NO CODE AFTER MANY HOURSBE AWARE OF ScAMMERS!"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Zarnescu Theodor",
          "Nb_Reviews": 1,
          "Date": "2016-10-28T07:42:22.000Z",
          "Titre": "A functional trainwreck with lapses in customer care communication",
          "Contenu": "Tried to buy a discounted game key on a time-limited offer; confirmed the purchase with my bank via SMS and was left on a screen telling me that the purchase was being verified by DLGamer, with no hint that there was ANOTHER SMS-based confirmation, this one from DLGamer, incoming at some point in the future.It bounced, the money was locked, I had to argue with my bank to get it back.On the second day, my second try resulted in the successful purchase of a nonfunctioning code, which three attempts to replace failed to get working. Was refunded without being consulted.The money was now locked, again, I had to argue with my bank to get it back, again.I subsequently had no reply for over an entire day, despite inquiries as to the status of the issue. Again, the discount was time-limited. A simple \"We're still investigating and will get back to you as soon as possible.\" would've sufficed.On the third day now, the discount had expired, replaced with a slightly less deep discount. I still had no word back. I attempted to purchase the new deal in a different currency (DLGamer does the whole 1eur=1usd thing), and this time the transaction did NOT require an SMS verification step.Worked fine, got the product registered, and an hour later I finally got word back from DLGamer staff, telling me the issue had been resolved.Thanks... I noticed...TL;DR: Never again, if I can help it.Not 1 star, because I must give kudos to the second Customer Care employee I bumped into. You tried, mate. You damn well tried.Update: I have been billed for both transactions, including the one THAT DID NOT WORK. GG, WP; no RE.1 star it is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2016-05-19T03:45:42.000Z",
          "Titre": "Cheap prices, difficult purchase process.",
          "Contenu": "TL;DR:  Would recommend shopping with absolutely anyone else, seriously, pay twice as much if you have to, worst experience I've had with a retailer.  Sure, your purchase will probably go fine but, if it doesn't they will call you a liar to your face and cause you endless stress.Pros: Item purchased 20% cheaper than anywhere else online.Cons: Extra cumbersome steps added for the appearance of 'security' but, don't actually make anything more secure.  There is a required 2 step verification process you find out about after your purchase but, this number does not have to be in any way tied to you.  They couldn't send a verification text to my personal number and wrongfully claimed it was a VoIP number.  I had to borrow a friends phone to finish the purchase.  A phone number check that will accept a random persons phone number does nothing to add to security and adds quite a bit to difficulty if the system is not functioning properly.UPDATE:  Removed a star because they also apparently can't read complaints.  My PayPal account is verified for one, I double-checked right now and, my phone number is with T-Mobile, not 'Google Voice' and is again, not a VoIP line, it's a cell phone.  If their system is claiming otherwise, then their system is at fault.  As an extra bonus, for the friends phone number I borrowed that they claim was in the same 'region', they live in an entirely different state.  If the 'region' is that broad, then using it as a security check is again pointless.  The only thing it adds is extra difficulty to legitimate customers.UPDATE2:  Can't remove any more stars, would recommend anyone else purchasing anything to just pay the extra cost that comes with shopping somewhere legitimate that cares about customer service.  Was called a liar repeatedly via email and received threats and ultimatums asking me to remove my review.  Have just been informed that they are cancelling my order.  Oh, they also reported my review for 'Inappropriate Language' in an attempt to censor it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jamil Ahmed",
          "Nb_Reviews": 60,
          "Date": "2021-05-07T07:40:08.000Z",
          "Titre": "Mobile phone verification after purchase and order cancelled without consent",
          "Contenu": "After purchasing my first serial key, I was taken to an order processing page. Here, I learnt that further verification is needed to complete and deliver my purchase.One of these verification steps was to provide my mobile phone number and the verification code sent to it.Doing this after the purchase is probably deliberate on DLGAMER's part. Most people won't want to cancel their order.I don't trust DLGAMER with my personal information, yet I had to surrender my mobile number to receive my order.They did deliver my purchase within minutes of me completing verification. Still, it seems paying with PayPal (who have already verified me) doesn't make a difference. DLGAMER wants your mobile number and I don't know what they will do with it.---\"Most of our users appreciate the extra security step\"How do you know that?\"Do you think we deserve this scoring for our overall services?\"Yes.---Update: DLGAMER have now refunded my order and cancelled my serial key. I never asked for this.This is what they said:\"We would like to inform you that your order to DLGamer is going to be canceled for one of the following reasons:- Several purchases with a single or multiple credit cards;- Using multiples DLGamer accounts;- Using an Unverified Paypal account;- Using a VPN or Proxy;- incoherent personnal informations provided by customers;- Unanswered or Missing mobile or landline verifiction request;- Cancellation asking on your side;- Refund request due to a mistake.\"I can confirm that there has been no \"cancellation asking\" from my side, nor any of the other reasons.They sent a further email:\"Following your comment we are sorry that you did not read our general conditions of sale before your purchase you were warned that we could make a verification by sms in particular if you use a means of payment which does not offer any guarantee on the products in download in particular the delivery of your order is made on email different from the owner of the paypal account.We are sorry to have disappointed youWe have therefore refunded your order and your key will be canceledWe invite you to login to your dlgamer account and delete your account.\"---As a consequence for cancelling and refunding the order without my knowledge or consent, I am downgrading this review to one star."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "林, 建豪",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T06:09:07.000Z",
          "Titre": "Product cannot be used"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "勇気明日奈",
          "Nb_Reviews": 5,
          "Date": "2019-12-20T00:24:36.000Z",
          "Titre": "They will pre-authorized a charge on your card, and THEN require you to verify your phone number",
          "Contenu": "Edit 4: Ladies and Gentlemen, the gloves come off. I've now been called a liar and a fraudster, and they have openly admitted they don't care about my privacy. For those of you not following the show, the summary is that this company will throw you under the bus, back up and run over you again (yes, in this analogy they are the ones pushing and driving apparently). Your experience may go great with this company, but God help you if it doesn't. I thank God they don't have any of my personal info, who knows what they would do with it at this point. Just take some time and read the other negative reviews on this site- it's easy to filter them. You will notice several instances where this company threatens users with order cancellations for posting negative reviews, and a review by Terra in 2016 who said, \"They really .. they used my order name instead of my review name when answering. I am .. well, now I'm really worried they have my phone number.\" Also, make note that there are many 3 and 4-star reviews that state they did not appreciate having their phone number extracted (and probably should have given fewer stars). The bottom line, this company needs to require verification BEFORE order completion (not just show a notice, which failed to appear in my case). This has been a frequent request and complaint since they implemented the system in 2014. I have also updated the title of my review to make it more transparently accurate.Edit 3: Please- keep it coming! Everyone knows the true measure of a company is seen in how they respond to criticism. I have at this point literally read hundreds of 1 and 2-star negative reviews, and dozens more that should have been lower scores but people gave you the benefit of a doubt. The fact that you continue to propagate this \"discussion\" as an attempt to show I am in the wrong, further serves to illuminate my position. You looked up my IP address on a map, and compared that to the zip I provided- that's a first bad sign as to what is being done with my data. This is why I typically only use VPNs because I can't trust that random websites like yours will actually safeguard my information. For that matter, I read a review where you used another lady's private full name in your response to her review! No, I don't want to provide your site ANY personal information. If I'm providing personal information at all, it is to a PAYMENT PROCESSOR- you require that I fill out my private information into YOUR SITE! Not only can that be illegal, by violating PCI requirements, it is completely disingenuous for you to then turn around and use what little personal information you harvested off me against me. On that note, in response to people's continued questioning about your need for their phone numbers, you've copy/pasted a clause from the EU mandate on online inter-commerce, which clearly states that an IP address alone can be used as validation for an order.  Lastly, thought experiment- if my bank didn't go through with the payment, and I wasn't charged, then why did you need to issue a refund....? Edit 2: So everyone can see how ridiculous this exchange has become- just take a brief look through the rest of the comments and see others' reviews (even ones that are positive). This company will require all of your personal information, including your phone number, *after* you create an account and *after* you complete a purchase with them. You can believe what they say... or believe the thousands of other people who say otherwise. Either way consumer, it's your choice whether or not to purchase from this company.Edit: I do not share personal information with any of the sites I use to purchase game keys from- I have never had a problem with any of them. I understand collecting the minimum information to complete a purchase, but that is not what your site did. You completed a purchase from a consumer and then requested more information than is even generally necessary to verify the information. After begrudgingly sharing any of this information, your site then locked this purchase and asked for even more information. If you need information- please ask for it upfront.  This company charged me and THEN asked me for a bunch of additional information to \"verify me\" (You already took my money honey, the amount is literally showing as processed on my card). If you're going to ask for information to \"verify someone\" do it BEFORE you take their money- now I have to deal with this through my bank. Save your time and money and go to another site that's actually verified- stay away from this place."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Wing",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T18:29:30.000Z",
          "Titre": "took my money and blocked my account",
          "Contenu": "There was an issue with the payment(2fa never went through with my bank I assume) and they said I would be refunded. 4 days later no refund, so I send support a message and now I am just getting sent to the blocked account page.*UPDATE*It seems that both myself and my wife opening accounts and buying the same game to play together on the same day triggered their fraud system, we both got the refunds back, but still have blocked accounts, so I cant give them a good review, and leave this review as a warning for people living in the same household."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "J.",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T17:10:46.000Z",
          "Titre": "game key works, KYC sucks",
          "Contenu": "game key worked as expected but i dont appreciate the requirement to disclose my phone number, or these repeated emails asking for this review. i am only here now to shut you up"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Leigh Gorrie",
          "Nb_Reviews": 2,
          "Date": "2021-10-19T10:21:20.000Z",
          "Titre": "You pissed me off with the amount of…",
          "Contenu": "You pissed me off with the amount of personal information you wanted from me after the transaction but before you gave the key.Name, address, email, phone number... you dont need all of that!That pissed me off!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Leon, Blackwell",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T03:41:49.000Z",
          "Titre": "Requiring phone numbers is terrible",
          "Contenu": "Having to hand over a phone number for verification AFTER paying is terrible.  I saw no notice that this would be required prior to purchase.I paid using Paypal, who would have ensured that you got your money anyway.It's certainly not worth the trouble for a dollar or so saved over all the other competing sites."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Br, Dadaddada",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T03:53:16.000Z",
          "Titre": "Cheap.",
          "Contenu": "Cheap.Don't tell me I need to put in a code sent via SMS after I've already paid. Beforehand yeah ok, after I paid seems sketchy.I put all of my correct details in as well so don't try and use your tired excuse of my credit card details not matching because they did."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stoneman, Kenneth",
          "Nb_Reviews": 4,
          "Date": "2019-06-22T02:48:50.000Z",
          "Titre": "Good deals, but annoying and unprofessional",
          "Contenu": "I got a really good deal on a game, but if my friend hadn't assured me it was safe, I would have assumed dlgamer.com was a scam site. It's riddled with bad English and typos, and the process for setting up an account making my first purchase was just ridiculous. I have no desire to come back - I'll just wait for Steam sales."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Hash",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T11:22:57.000Z",
          "Titre": "Requires way too much information.",
          "Contenu": "They require your phone number and don't send keys, but require some sort of link to your gaming account to send licences (in my case, Origin). It would make things \"more secure\", but this isn't a bank, for something like budget games I don't want more secure -keys-, I want my personal and account details secure -by not giving them to the store- I'm buying from (DLGamer).In the end it worked, but they could be selling my number, or the hook-in to my Origin account could be hacked if they have a breach in the future, who knows."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 4,
          "Date": "2021-01-16T23:29:16.000Z",
          "Titre": "No response from Tech Support",
          "Contenu": "I recently bought a game from DL Gamer, but couldn’t find the activation code per the instructions.  I emailed their Tech Support and haven’t heard back four days later. I did get get the game to run without a code, but I’m not pleased that Tech Support never responded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam, Smith",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T16:17:42.000Z",
          "Titre": "Why in the world would I need to give a…",
          "Contenu": "Why in the world would I need to give a cell phone number to make a purchase? There is absolutely no reason to require personal information for a purchase like this. It's scummy and leaves a terrible taste. On top of that, you wait until after the order has already been made. Accounts being secure is great. But you know what's even better? Not holding my purchase hostage unless I play ball with your data harvesting. I shouldn't need an account just to get a freaking code sent to my email.For shame. I will be actively discouraging anyone from using you in the future. For shame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Not Buying from DLGamer Again.",
          "Nb_Reviews": 1,
          "Date": "2018-02-17T21:24:42.000Z",
          "Titre": "DLGamer required a phonecall to a…",
          "Contenu": "DLGamer required a phonecall to a non-voip landline or a text to a non-voip SMS number to make the purchase.  All of my numbers are voip and they never answered my support emails.Somehow their system still released my code so I was able to eventually get the game.  Too much trouble and no support.  Won't buy from them again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2014-10-16T17:33:17.000Z",
          "Titre": "Unprofessional and straight up unpleasant",
          "Contenu": "Made a wrong purchase by accident due to lack of info in the description section of the item, asked for a refund, and was met with 1.reluctance to refund, 2.very informal tone and drama after i politely clarified i'd like a refund. 3.   no wonder i made a mistake, because the rep they chose to deal with customer services knows little to no English, which i could barely understand. grammar was nonexistent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "austin",
          "Nb_Reviews": 1,
          "Date": "2015-07-28T10:21:07.691Z",
          "Titre": "extremely slow download",
          "Contenu": "a friend downloaded on steam, i downloaded on DLGamer and it took well over an hour just for my purchase to be verified. and another half hour just to get the game going. ridiculous. I will never buy from these guys again. Really DLGamer? Obviously I know the servers to download the game are ran through Bethesda. I mean after the hour wait time, I had to wait another half hour to get my key and start downloading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2017-03-23T20:51:18.000Z",
          "Titre": "Goods were delivered, but it was an awfully shady experience.",
          "Contenu": "The entire experience of purchasing a game from this website felt awful. I was required to provide an address even though I was not receiving physical goods, and required to provide my phone number. The game code I received worked fine, but I am intensely worried that giving this site so much personal information was a mistake."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "TwiztedNature",
          "Nb_Reviews": 1,
          "Date": "2016-06-01T23:18:07.000Z",
          "Titre": "Way too much \"required information\".",
          "Contenu": "The amount of required info is kind of insane compared to any other site where you can purchase games from. I thought it was fake, and had to do a lot of digging to see if others had used the site before and if they could confirm it being genuine. Luckily, this is a real site, but customers shouldn't have to second guess like that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2015-11-15T22:43:54.638Z",
          "Titre": "Almost a great deal",
          "Contenu": "I preordered Battlefront from DLGamer and then noticed that their release date was 11/19. Knowing that the US release date is 11/17, I asked customer service to provide the activation code a little early. For asking, my order was canceled. A polite no would have been fine.\r They get 2 stars for all the security/fraud prevention measures."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2014-10-27T14:03:00.000Z",
          "Titre": "super awkward site",
          "Contenu": "Seriously, who makes you validate your phone number in order to buy a game?\r Clunky site. Super annoying. Why does it take 10 minutes to get a steam key? It's not delivering a package.\r I see zero reason to ever use this site unless they have specific games on sale. The interface was clunky, awkward, and confusing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "christopher",
          "Nb_Reviews": 2,
          "Date": "2016-02-22T14:23:49.000Z",
          "Titre": "no response from customer service",
          "Contenu": "The order process was rather easy however I ran into one problem.  The game description stated there was no monthly subscription (ESO) needed to play the version purchased.  I was able to download and set the game up easily.  After playing for an hour or so, the game logged me off and sent me to the page which indicates a subscription was necessary to continue playing.  I sent a message regarding the problem through my order form at DL Gamer however there has been no response to resolve the issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lex",
          "Nb_Reviews": 1,
          "Date": "2015-12-01T19:20:07.000Z",
          "Titre": "Black ops 3",
          "Contenu": "The game itself runs fine but has some issues and idk whether these issues are because of treyarch or because of where I received my product key from. The purchase process where u enter all ur personal and creditcard info seems extremely impersonal and shiest to me. I don't think I'll buy again from here"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "croston eamonn",
          "Nb_Reviews": 1,
          "Date": "2014-02-01T08:58:17.000Z",
          "Titre": "frustrating registration process",
          "Contenu": "Website english translation poor in places.wasnt sure if this was a legitimate website. Took ovrr an hour to sort out my order.kept asking questions for added security and then stating that you already had my details. Amateur website compared to the competition. Will put off some.dont trust it to use again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jesus Moralez",
          "Nb_Reviews": 3,
          "Date": "2015-01-01T17:42:30.000Z",
          "Titre": "Overzealous security",
          "Contenu": "DLGamer were not up front about their security procedures. They held my purchase to ransom until I gave them my phone number in order to receive a pin code which then unlocked my game. Otherwise it suggested it would be cancelled and no indication was given if I would get my money back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TheKeyMom",
          "Nb_Reviews": 2,
          "Date": "2017-02-22T03:52:44.000Z",
          "Titre": "Lack of Customer Service",
          "Contenu": "I understand there is a limit policy to purchase a single title. So this is not an issue. The issue comes in where I am able to purchase 2 of a title, but have 5 different pending charges with my bank. I could even almost understand if they were for the same amount. However,  this is not the case. Now 6 days later I am still seeing pending charges on my account. Though they assure 3-5 days to resolve \"refund\" issues. I am extremely disappointed at the lack of customer service, or ability to respond and assist customers in a resolution. I will not use their site again."
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "Suchopar Jiri",
          "Nb_Reviews": 4,
          "Date": "2014-09-03T16:24:49.000Z",
          "Titre": "I got the game in the end but ....",
          "Contenu": "As first time customer i wanted to pay with my paypal account that i use for purchases all over internet. Payment got accepted, but then they canceled my order and gave me refund without stating reason. Mail with reason that my paypal account isnt vertified and they doesnt accept unvertified paypal accounts arrived like 2 hours later. In meandtime i was wondering what the hell is going on. Well so I payed with credit card but had to wait for about 20 minutes for them to confirm transaction before i was able to download game. I almost thought site being fraud but they delivered in the end."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2016-01-07T22:04:59.000Z",
          "Titre": "No customer service/support",
          "Contenu": "Purchased a game through DLGamer and wanted to change card details as I had not been charged and wished to use a different credit card. I was not contacted by DLGamer at any stage even after I made 4 support requests. Instead of requiring a code via SMS, the order was instead processed without permission or verification anyway. Very very shady and dishonest company. I do not trust this shady reseller and will never purchase from them again. ALWAYS TRUST AND USE STEAM OR GOG.COM. Took my money without verification (what the hell is the point of requiring phone code verification when you just take people's money regardless?) The hell with this company..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ponvelle, Eric",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T15:38:39.000Z",
          "Titre": "Needs More Work for Purchasing.",
          "Contenu": "I tried purchasing a game at a deep sale rate. The experience was atrocious. Support was helpful in that they told me to just do the purchase again after it was canceled because I couldn't validate my phone number. I couldn't do that because the site glitched and never prompted me to enter that information.On another attempt, it straight up crashed while purchasing. Eventually, on this second purchase the item did go through. Support helped ensure I received my item in the end, but the transaction was not straight-forward nor clean.I think if they implemented a way to verify your account in the settings, so that you could verify it before purchasing, this would solve a lot of issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "not real pleased",
          "Nb_Reviews": 1,
          "Date": "2016-07-30T06:21:03.000Z",
          "Titre": "Seemed Scammy",
          "Contenu": "Made me sign in with an email address, get a confirmation number after purchase, then made me give a phone number after I had paid with paypal to then get a text with yet another number before giving me the key I paid for."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Anonymous coward",
          "Nb_Reviews": 1,
          "Date": "2019-01-07T15:45:28.000Z",
          "Titre": "Had to try four payment methods",
          "Contenu": "Had to try four payment methods. Eventually PayPal worked, but only when funded by a bank account.Difficulty paying makes the operation feel pretty shady.Actual product was good once received: no complaints."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Knapp, Dakota",
          "Nb_Reviews": 5,
          "Date": "2018-08-31T14:03:23.000Z",
          "Titre": "This site felt really sketchy",
          "Contenu": "This site felt really sketchy, they would not accept my card, it was difficult to sign up and after paying with PayPal it took a long time to get my key.  Good sale price but the site overall is a mess."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Want to play",
          "Nb_Reviews": 1,
          "Date": "2018-07-22T15:39:55.000Z",
          "Titre": "Frustrated",
          "Contenu": "Hello, sorry for the low score, but my experience has been frustrating. Why would you restrict the purchase of more than one of the same type of game for account/card, in this case an expansion to Guild Wars 2? I understand that it might be to stop others from taking advantage of something, but what about families? Why can't I simply buy two copies, one for me and one for my husband? I have one, but you won't take my credit card again or my debit since it has the same name, we've made a new account and still no, he's sent in a report so that someone can take a look and last I checked with him it hasn't been answered. Thanks for offering a game we were interested in at a great price, but if these are the rules, I'll have to pass on your site the next time, thank you again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ali",
          "Nb_Reviews": 2,
          "Date": "2017-02-18T21:36:10.000Z",
          "Titre": "Too much process to get a game",
          "Contenu": "It was my first time to buy a game from dlgamer, and it took forever to validate my information, from confirming my email address, SMS text, and finally a phone call..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2019-10-20T14:59:48.000Z",
          "Titre": "Great price BUT...",
          "Contenu": "Great price, fast delivery...so why 2 stars?All the verification hoops. Several emails AND a phone call?! I am buying a game key not a car."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "BL",
          "Nb_Reviews": 1,
          "Date": "2018-09-11T18:45:19.000Z",
          "Titre": "Good price, but shady?",
          "Contenu": "Good price, but I've made two purchases, and each time they've asked for my phone number to text/call me a confirmation code. Seems shady"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Young, William",
          "Nb_Reviews": 1,
          "Date": "2018-03-20T18:32:24.000Z",
          "Titre": "They needlessly require personal…",
          "Contenu": "They needlessly require personal information and say that it's for security reasons. It makes me question what they're doing with it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T17:33:31.000Z",
          "Titre": "Horrid website design",
          "Contenu": "Service was fine, but website was AWFUL. No online store should require both a personal computer *and* a cellular phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beardy",
          "Nb_Reviews": 1,
          "Date": "2017-03-13T01:03:26.000Z",
          "Titre": "Took too long",
          "Contenu": "I had to provide way to much information to dlgamer in the name of 'security' to get my game. Lame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Huber, Lukas",
          "Nb_Reviews": 2,
          "Date": "2019-09-01T17:04:43.000Z",
          "Titre": "Return Policy Contradicts Itself and Phone Number Required... 2 Strikes",
          "Contenu": "They had some pretty great deals but honestly was not a fan of the requirement of confirming email, AND a phone.. Never seen a company require a phone number as well. I'm sure they don't share the number or anything but ever since I purchased a game from their site, and gave them my phone number, I suddenly started having a scam claiming to be Verizon Wireless calling me. Also not a fan of their return policy as it's quite confusing. When I bought Monster Hunter Worlds, it stated on where It gave me the key that it has a no questions asked 14 day return policy if there's less than 2 hours played. But also says on their website's return policy if you redeem the key or download the game, you immediately give up your right for a return. Luckily, I liked the game so I didn't have to worry about this too much but.. Just be wary.Edit: lowered score. By a star. Between the many, many spelling errors when responding back to a bad review, and instantly sending another email saying “We permit ourselves to contact since there is a change[sic] for you to not receive our answer on your trustpilot comment.”Honestly shows me even more they aren’t very trustworthy since their support can’t even spellcheck before entitling themselves to sending an email."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "RA van Scherpenzeel",
          "Nb_Reviews": 6,
          "Date": "2018-03-07T14:13:21.000Z",
          "Titre": "My order was cancelled for unclear…",
          "Contenu": "My order was cancelled for unclear reasons. When I tried to contact support, I got no response."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "O, N",
          "Nb_Reviews": 1,
          "Date": "2018-01-12T00:32:26.000Z",
          "Titre": "The user verification process is a mess …",
          "Contenu": "The user verification process is a mess and requires way too much (personal) data."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "An",
          "Nb_Reviews": 1,
          "Date": "2020-05-02T23:10:10.000Z",
          "Titre": "Don't require phone verification or…",
          "Contenu": "Don't require phone verification or mention it before you charge money"
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "AI",
          "Nb_Reviews": 1,
          "Date": "2016-01-23T15:18:23.000Z",
          "Titre": "got my game 3 days later",
          "Contenu": "Ordered a game on the 19th, received it 3 days later. \r So, I decided to buy the NeuroVoider alpha, which only DLgamer seems to carry. I placed my order on the 19th January, 2016 and chose the bank transfer payment method. Then I transferred the money to the adress provided, which was so messily written I had doubts I sent it to the proper account. \r At that point my order showing that all I needed to do to get the game was to transfer the money. I was thinking maybe the bank is waiting to do the actual transfer until the next day because I ordered sort of late in the day. Indeed, the transfer landed the next day, my bank told me. But no game code was seen on the website. I proceeded to contact their staff to clear this up. A day passed, no answer. The next day, I wrote again. No answer. \r Infuriated, I started looking for alternative ways of contacting the staff of the site and found the support email adress and wrote there. I got a reply from them several hours later, in the middle of the night. They told me that I had not emailed them previously and that's when I realised the contact form on the website must have been broken. \r After this, a lenghty exchange in broken English ensued. I was made to jump through seemingly infinite amount of hoops before the game code was actually released to me.\r I cannot recommend using their service to anyone at this point. If you are able, shop elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jimmy Barrett",
          "Nb_Reviews": 3,
          "Date": "2019-04-22T20:26:40.000Z",
          "Titre": "They hold your purchase hostage until…",
          "Contenu": "They hold your purchase hostage until you give them your mobile number."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "SMITH, clive",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T06:01:45.000Z",
          "Titre": "Service is good bit when it comes to…",
          "Contenu": "Service is good bit when it comes to refunds it becomes a problem"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Terra",
          "Nb_Reviews": 1,
          "Date": "2016-04-09T21:51:31.000Z",
          "Titre": "Too many silly hoops to jump through",
          "Contenu": "too many things to go through to get order \"confirmed\", including having to put in my sms... AFTER I already paid for my order. And then it took a long time to actually get the cd key I paid for and had to give away private info I didn't want to divulge - again, after it was already paid for!\r If you have the option, stay away from this seller.\r Edit: \r There are at least two things dlgamer should do to increase customer experience, and I hope they'll consider them.\r - The possibility of phone verification should be stated clearly and explicitly BEFORE payment step, along with a link to longer explanation and privacy policy. Consider finding alternative ways to do this step.\r- They should inform clearly and explicitly that there can be an (up to 10 minute?) delay before the goods are delivered. Again, before payment step.\r These things should in no way come as a surprise to the customer after s/he has paid. In addition, storing that information opens up possible liability and trust problems for the store, as this is valuable data on the black market.\r And btw, that amazon does something doesn't necessarily convey credibility. \r The rating stands. But if the site does update it's process to be more transparent and predictable further reviews might not be so negative.\r Edit2: They really .. they used my order name instead of my review name when answering. I am .. well, now I'm really worried they have my phone number.\r Edit3: And just noticed the amazon link is for 2step verification.. for your account. That is an optional extra security for logging into your account... Comparing that to mandatory phone number verification for seller's protection .. or other things... is showing a deep lack of understanding of the usage."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Hans Huber",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T05:50:40.000Z",
          "Titre": "careful - phone verification",
          "Contenu": "careful, they force you to phone verification"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "IceMaverick",
          "Nb_Reviews": 2,
          "Date": "2017-05-22T00:45:37.000Z",
          "Titre": "Unnecessarily Long Process For One Purchase",
          "Contenu": "Getting an account setup and getting a singular purchase made took infinitely more time than I felt that it should have. What should've been a two-step purchasing process turned into a ten-step flip between emails, other tabs, and this store and overall just ended up being a woefully long experience just to buy a single thing. I will be avoiding buying from here ever again if I can help it, just to avoid having to go through 5 levels of confirmation notices just to complete a singular order.Edit on 5/21/17: Apparently I cannot reply to store responses. Odd that the review site doesn't let me communicate with the store effectively. While the explanation of compliance with EU laws (which don't affect me personally as I am US based) is a valid reason for the additional security measures (owed to the EU's extensive consumer protection legislation), I still find that the entire process was overly arduous compared to competitors in your field. I have time-stamps from the emails I received from your company showing that the process of getting simply email-related confirmations out of the way took no less than 6 minutes; the total process, of course, took more time than that as I had to actually interact with your site after the several confirmations of confirmations had been processed through 3 emails and a text before I was allowed to *actually* proceed to checkout. The total time it took for my order to be completed by you from the time I clicked to checkout to the time that my key was accepted by Steam was at least a magnitude of 3 times or more than any other competitor of yours that I've done business with, even considering that this was a first-time, new account sale. If the standard checkout time is even half of what the first-time checkout process was, it would still be twice as fast to use any other storefront.I will not be changing my review score at this time because I honestly do believe that the over-verification hurt the user experience and ease of checkout when compared to other web-based key sellers. While I may give the store one additional chance in the future to see if things have been streamlined, I do not plan to willingly return to this storefront again unless some miraculous sale is taking place here. Coming here to purchase games currently on discount (when competitors are not) is simply not worth the red tape. I would rather spend the extra money elsewhere for the ease of use."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dave Dales",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T10:28:37.000Z",
          "Titre": "Trust concerns",
          "Contenu": "Got a working product from the site, but the activation process raised trust concerns. AFTER paying for the key I had to verify my address, my phone number, my Paypal email AND link my game store account to the site for activation without actually receiving any key. The game works, but I feel the procedure is tailored to fish as much information from you as possible. Avoid If you’re privacy sensitive."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T17:24:26.000Z",
          "Titre": "You gotta be patient",
          "Contenu": "It takes a while before you get the key, like 20 min.It also asks you for a lot of personal info before giving you the key (which is not indicated before purchasing) like adress and phone number.However the support chat is responsive and the key worked fine"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T02:17:57.000Z",
          "Titre": "There were too many steps to checkout",
          "Contenu": "There were too many steps to checkout, and i was a little uncomfortable being asked for my phone number. I don't think i needed one on a previous purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T22:50:41.000Z",
          "Titre": "my game did not get delivered",
          "Contenu": "my game did not get delivered and had to ask for a refund. the refund process is still going on right now. they are quick to respond though."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T12:29:03.000Z",
          "Titre": "Bought an OUT OF STOCK key",
          "Contenu": "I bought a Steam key, couldn't find it anywhere and after contacting support I was told that they did not have stock and that the supplier will restock today.Asked for a refund which I got without problems.UPDATE: I was given £5 voucher a few days later for the trouble caused. Fair game :)"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2021-03-01T12:30:40.000Z",
          "Titre": "The site is legitimate insofar as you…",
          "Contenu": "The site is legitimate insofar as you receive the item you purchase. I would suggest removing mandatory phone verification however. If every other retail website can function without forcing consumers to disclose their mobile number, then so can Dlgamer. Consumers don't know who is, and who is not trustworthy; the more companies we provide a mobile number to, the higher the risk that someone is going to exploit it."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2021-06-20T07:37:15.000Z",
          "Titre": "No refund policy - Buy elsewhere if you think you might not like the game!",
          "Contenu": "Game not as described on their website, no refund offered. Save your self the pain and buy off of a DLC platform like Steam or Epic which give you a 2 hour change of mind refund. Not worth the $10 savings imo.*Edit*: I agree with the response! Though, every DRM (i.e. steam, epic games, gog, origin etc) have a 2 hour refund policy. I suggest DLGamer update their policy to match the competition. The transaction process of the website went without a hitch though so 1* is a bit too harsh. 3* all around and would happily upgrade to a 5* if it wasn't for a terrible refund policy."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Albert-Jan de Ruijter",
          "Nb_Reviews": 1,
          "Date": "2018-09-19T07:28:06.000Z",
          "Titre": "Bought Guild Wars 2 HoT + PoF combo…",
          "Contenu": "Bought Guild Wars 2 HoT + PoF combo pack for my girlfriend and a separate PoF key for myself in the same order. Checkout was quick but I only received the combo pack keys.I created a support ticket but no response after 36 hours. After that I decided to email them. I received a response with the missing key after a few hours but just that, no apology or explanation about what happened in the first place."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Heran Bago",
          "Nb_Reviews": 1,
          "Date": "2018-03-17T17:46:01.000Z",
          "Titre": "Waiting for your purchase - worth the savings?",
          "Contenu": "The site works and is seemingly \"legitimate\".  They sell digital copies of games, and you have to wait after purchasing a game for the staff to \"review\" your purchase before you are able to use it. In the bigger picture this is not a huge amount of time, but if you want to gift the game to someone or if you want to play it soon this extra waiting time can be excruciating. Any amount of money you save on purchases with DLgamer comes at this price."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Muszynski Szymon",
          "Nb_Reviews": 2,
          "Date": "2016-05-16T22:27:31.000Z",
          "Titre": "Too hard to buy!",
          "Contenu": "The price was good, but the entire paying system is unintuitive and long. They ask for all the different passwords, codes and confirmations multiple times, and it takes forever to finally get a game here.And I had to get a refund and buy a game again, caus I didn't get the code the first time. Thank you for Far Cry 4, it's a fun game and your price was nice, but I'm done with you guys. Improve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Quinn K",
          "Nb_Reviews": 1,
          "Date": "2017-08-04T06:28:15.000Z",
          "Titre": "Steam key trouble but good customer support",
          "Contenu": "There was an issue of receiving a region-locked Steam key and the following replacement keys were also region-locked. Eventually, support cancelled the transaction, refunded me, and asked me to make a new purchase to get the proper Steam key. I was frustrated with the situation but greatly appreciated DLGamer support responding quickly to my support ticket and emails. The quick response and diligence from the support staff made this almost a 4 star experience."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2016-03-09T05:29:14.000Z",
          "Titre": "Good deal, long process",
          "Contenu": "The price was more than good enough to go through all of the extra security checks, and i do believe there should be too many as opposed to not enough. But the purchase process did feel slow, having to verify by both email and phone call. The phone-message could have been delivered via text as an option because my purchase had to be made in the afternoon due to not wanting the ringing phone to wake up my S.O. Food for thought."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kofey",
          "Nb_Reviews": 1,
          "Date": "2015-09-10T01:27:38.060Z",
          "Titre": "Good service for me, but not for my friend",
          "Contenu": "I bought a game twice on two separate occasions using PayPal and had good experiences both times. My friend bought the same game about a week or two later using a credit card ran into some problems (was charged but did not receive the game).\r Pretty difficult to say for sure what I think of them based on these experiences, but my own purchases were quick and without any issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "E Mehlos",
          "Nb_Reviews": 1,
          "Date": "2015-09-09T15:56:04.852Z",
          "Titre": "Legit deals; weird \"authentication\" process",
          "Contenu": "I bought a usually $60 game at DLGamer for $25. Great deal, but before I could get my key I went through layers and layers of identity verification, first email (pretty standard), then phone #(what?), neither of which worked correctly and I had to contact support both times. The process felt alarmingly phishey. In the end however I did get a working game key at a great price, so I might buy from DLGamer again in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2014-10-27T15:26:48.000Z",
          "Titre": "Needs better checkout for US customers",
          "Contenu": "The checkout process was pretty rough with a US credit card. You pay using a foreign bank for processing, have to give them your cell phone # for a security code text, and wait for transaction to go through. My credit card got flagged for unusual activity due to this transaction so I had to call my issuer to get that resolved. \r Besides that, I received my Steam key just fine and was happy with the price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brown James",
          "Nb_Reviews": 2,
          "Date": "2016-12-04T00:10:22.000Z",
          "Titre": "Purchase was difficult",
          "Contenu": "I don't know why but I found my purchase with DLGamer to be frustrating.  It appears that one paids DLGamer and then downloads from Stream but that was not clear.  If I remember, I had to select the game on Stream, pay on DLGamer and then go back to Stream to download - certainly not a \"normal\" way to buy and download anything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2016-01-03T19:36:43.000Z",
          "Titre": "Paranoid Much?",
          "Contenu": "I don't mind some security when making an online purchase. But really? I even have to do SMS verification? I don't have a cell phone, had to use the wife's.  What if no cell had been available?  There are reasonable security precautions, then there is DLGamer's Orwellian overkill.  Otherwise, I had no problems with my purchase, and once I got through the maze of continual security walls, I received my activation code very promptly."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Monteiro Pedro",
          "Nb_Reviews": 2,
          "Date": "2013-12-01T22:02:52.000Z",
          "Titre": "Once you choose a payment metod you can't come back",
          "Contenu": "The good, \r Very fast comfirming the payment and delivering the key\r The bad, \r Once you choose a payment metod you can't come back\r Also the price of the game on the store was diferent than the price on the check out.\r Had to buy it on the spanish website to be shure about how much i was paying.\r Good service but this kind of mistakes don't increase my trust in the system."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "David Luke",
          "Nb_Reviews": 3,
          "Date": "2015-02-02T20:54:34.000Z",
          "Titre": "Legit, but potentially fishy",
          "Contenu": "After payment was processed, requested a mobile number to send a code for authentication. I'm all for added security, but I paid with PayPal already, so this just smells of data gathering for sale to cold calling telemarketers/phishersmen. Springing it on me after payment felt like blackmail.\r Product key received and working, still feel a bit violated."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Voorend, martin",
          "Nb_Reviews": 2,
          "Date": "2017-12-03T16:11:52.000Z",
          "Titre": "They advertized Destiny 2 with pre-order bonus",
          "Contenu": "They advertized Destiny 2 with pre-order Bonus, but after purchase and activated the game it didnt container the bonus code, Made contact with them and they offered 4 euro's back, but eventually they couldnt refund itEdited:After this review they contacted me and made a refund possible after all, after i gave them all my details for the refund i got a message they made a refund of 20 instead of 4 euros.Changed from 1/5 stars to 3/5 because they did fix the issue after this review"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Moonmail",
          "Nb_Reviews": 1,
          "Date": "2017-06-15T22:00:12.000Z",
          "Titre": "Actually is a legit site",
          "Contenu": "Actually is a legit site, despite looking shady as high hell.Somewhat frustrating to use, especially those wait times but you get what you pay for.I'm not sure how to reply to Dlgamer's comment, but I'll touch on it here.What put me off was how the site felt. It looked like one of those sites that were not legit. Big neon signs for the price buttons. Broken english and the like.I had to read some reviews about the site before being comfortable making a purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason R.",
          "Nb_Reviews": 2,
          "Date": "2013-12-14T08:04:40.000Z",
          "Titre": "Decent service with atrocious download speeds.",
          "Contenu": "Two issues: No PayPal option for new accounts, and DLGamer's file downloader is the slowest I've ever used -- it took over fourteen hours to download a 6GB package, but that could have something to do with the fact that DLG seems to be located in France while I'm in the US. Other than that, the experience was pretty standard for a digital retail service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2016-08-14T06:40:55.402Z",
          "Titre": "Not much time spent on the website",
          "Contenu": "I only purchased a game from this site since enhanced steam suggested that i do, so i made an account, bought the game and got the code in less than 5 minutes. The site seemed a little sketchy, but that's to be expected from stores that people are new to. If i had to i'd buy another game from this website again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derek Hackley",
          "Nb_Reviews": 1,
          "Date": "2015-10-12T13:07:06.402Z",
          "Titre": "Good prices, solid experience, be prepared to jump through hoops",
          "Contenu": "Found a great deal on DLGamer for Civ V Complete, but I had to jump through a lot of hoops to get it.  I think there were three different points of verification I had to undergo to complete an order.  It was a lot.  I had to give them my phone number so they could call me with an automated message with one of my verification codes on top of the usual verification of email and verifying a text message.  It didn't totally put me off of the process, but like I said, it was a lot."
        },
        {
          "Note": 3,
          "Lieu": "IR",
          "Pseudo": "Cezar",
          "Nb_Reviews": 3,
          "Date": "2014-10-07T09:54:36.000Z",
          "Titre": "Good overall experience, but the payment process needs some work",
          "Contenu": "The deal I got was great, but it's not normal to take 15-20 minutes + interaction from my side (phone number, multiple confirmation emails) to complete the verification. The era when credit cards were stolen is pretty much over and for the majority of websites the payment verification and the delivery of the key is immediate, so it would be great if you could optimize that! Another thing - but I'm not sure of this - is that I think there is a (small) fee for using Visa cards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "COLL JUSTIN",
          "Nb_Reviews": 1,
          "Date": "2017-01-26T00:51:40.000Z",
          "Titre": "Downloading trouble but probably on rockstars end. Also my bank account was shut down from the purchase",
          "Contenu": "I had downloading trouble . Had to download 3 times to get game to work. Although you just provided keys so probably on rockstsrs end. Main concern was that purchase from dlgamer shut down my bank account. The transaction drew up a flag with the company. Is back up now but you might want to look into that"
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "Joyce",
          "Nb_Reviews": 3,
          "Date": "2016-02-26T20:19:27.000Z",
          "Titre": "Pretty good",
          "Contenu": "Received the key very fast and it works perfectly. I paid with iDeal (through a Dutch bank) and I received some weird emails telling me I paid with HiPay (never heard of it) and that I'd made an account there... Which I'm pretty sure I didn't. That seemed kind of sketchy, but otherwise it's fine!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Clarke Gabriel",
          "Nb_Reviews": 1,
          "Date": "2015-10-20T03:02:28.258Z",
          "Titre": "Decent",
          "Contenu": "It was OK. It doesnt have much rep, nor does it look very professional in certain tabs. The only way i knew i could trust it was the GW2 website. \rMaybe do some advertising? Get a good rep from ads ? \r Otherwise it was quite simple and It was a life saver when it comes to buying my birthday present."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CM",
          "Nb_Reviews": 1,
          "Date": "2016-05-11T11:47:43.000Z",
          "Titre": "Pretty good",
          "Contenu": "Okay so I bought something and tried to use my visa debit card, but was put through a (annoying) verification process that ended up in my card being declined. I gave up and tried to pay with paypal(the same debit card is linked to my paypal). PayPal payment worked fine and I was able to get the code I bought after like 10 minutes. The verification process seemed weird and sketchy, I have never experienced anything like that when purchasing online. But so far nothing unusual has happened to my bank account, so that's good."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "RC",
          "Nb_Reviews": 2,
          "Date": "2018-02-20T16:18:20.000Z",
          "Titre": "Possible scam",
          "Contenu": "Requesting my address, phone number, and requiring a three-stage confirmation after I paid and before you delivered my order looks like a complete scam. I don't care you eventually delivered the Steam key, other sellers do not need ANY of that information provided.EDIT: Fair enough, I appreciate you following regulations and replying with detailed information, but I still don't buy how email+phone confirmation codes made the transaction any \"safer\", and the process was still significantly more complicated than with other sellers."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Grant Allenby",
          "Nb_Reviews": 1,
          "Date": "2015-09-14T08:05:25.632Z",
          "Titre": "Overwhelming safeguard",
          "Contenu": "Purchasing from the site was fine, activating my product was not. It took several activation methods and a lot of unnecessary personal details for me to actually get my product. I'd recommend for the prices they have, but if you're looking for a quick purchase process then look elsewhere."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2016-08-13T06:56:27.685Z",
          "Titre": "Trusted, but too much hassle",
          "Contenu": "There is way too many different confirmations you need to make. Email, SMS, codes. Too much things to do for a simple action as buying a game.Still, I got the game, it works, you just need to be patient to buy from this store. If you gonna buy multiple items, it might get annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 1,
          "Date": "2017-06-02T10:59:10.000Z",
          "Titre": "Rocky start, made right in the end.",
          "Contenu": "After a semi lengthy back and forth with support about being given the wrong edition of a game I had ordered and redeemed (I received a standard edition of ESO Morrowind Upgrade, not the collectors edition upgrade I payed for), I was given a third key to redeem that unlocked the correct collectors edition upgrade, rather then the standard edition my original key had unlocked. They aren't sure themselves how I was sent the wrong key, but at least support was quick to begin a dialog, and eventually figure out what I was saying and correct the mistake."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "godfrey joe",
          "Nb_Reviews": 7,
          "Date": "2014-10-04T20:17:18.000Z",
          "Titre": "got the game, took abit of time.",
          "Contenu": "Got the game which is alway a great plus, however it took a bit of time with strange authentication methods, which I've never experienced with other companies. And slightly regret the purchase and wish I did more research as found the game for significantly cheaper on numerous websites."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Big Boss",
          "Nb_Reviews": 1,
          "Date": "2016-09-16T16:40:19.000Z",
          "Titre": "Got a good deal but not without some hassle.",
          "Contenu": "Purchased a steam key on DLGAMER and instead of just putting in my payment information and receiving a key I was forced to do not only email but phone verification as well. Would prefer a smoother experience although I suppose it was worth it for a fe bucks off of my game."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "That Guy",
          "Nb_Reviews": 3,
          "Date": "2017-03-23T16:42:21.000Z",
          "Titre": "Slow process that worked.",
          "Contenu": "During the purchase process they were quick to take my money but took around 10 minutes to give me my key. The key did work though so all is well in the end. Also funny passive aggressive customer support (in reference to the reply to this) - as someone that works in a similar environment they're trained well. :)- In regards to the rating they suggested I update: I still feel as though this is merely Average service as per TrustPilot ratings it was acceptable although I never felt anything to compel me back to your website even well over a year later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EW",
          "Nb_Reviews": 1,
          "Date": "2015-10-01T05:24:11.029Z",
          "Titre": "Purchase was scary",
          "Contenu": "The purchase process was scary, it seemed scamish, my credit card company thought so too, as it alerted to a scam.  However, it did go through for the correct amount and the key worked on steam.  I'm glad it worked, but a more trusted eCommerce middleman would be welcomed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay B",
          "Nb_Reviews": 1,
          "Date": "2016-07-24T01:05:27.000Z",
          "Titre": "Work for that Bargain",
          "Contenu": "Prices are pretty good, but the process is excruciatingly frustrating.Edit: I received a reply/explanation from DLGamer; PayPal was my second attempt at paying for my purchase, as my Chase Visa flagged the transaction as suspicious. I had to switch to a secondary billing method. After, I had to verify the transaction via text, which did not fire correctly on the first attempt. In total, it took 16 minutes for a process that at several points I should have probably walked away. The price for the product is the only reason I don't rate the transaction two stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A Customer",
          "Nb_Reviews": 1,
          "Date": "2016-01-27T22:28:48.000Z",
          "Titre": "So-so customer service",
          "Contenu": "I bought a game for a friend who bought it for themselves before I could give them an activation key. I contacted customer support and assured them that the key was not used. A week later and the key was not removed from my account and nobody else from DLGamer's customer service contacted me to let me know what was going on.\r Ordering the product also involved me going to three different web sites to verify my identity and credit card. I appreciate the security, but the hoops I've had to jump through so far mean I'm probably not going to use it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pawel",
          "Nb_Reviews": 1,
          "Date": "2019-01-18T18:35:07.000Z",
          "Titre": "Good Price, Poor Delivery",
          "Contenu": "The game I purchased was well priced, but DLGamer's key delivery system seems to have problems.A key showed up after I purchased my game as expected, but it didn't work.  The provided key changed several times before I received a working one."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "GB",
          "Nb_Reviews": 1,
          "Date": "2017-07-28T11:07:53.000Z",
          "Titre": "Generally fine",
          "Contenu": "Generally fine experience so far. Although I found it a little strange when I created my account that they emailed me a password rather than me creating my own. I wasn't prompted to change it on first log in, and had to hunt for the change password option."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Wright, Andrew",
          "Nb_Reviews": 1,
          "Date": "2018-03-03T05:10:43.000Z",
          "Titre": "I recieved an invalid code on my first…",
          "Contenu": "I recieved an invalid code on my first purchase, but customer service was helpful and friendly and gave me a refund immediately, so i will continue to do buissness with them. I expected better verification of products, but the staff handled the issue well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Umholtz",
          "Nb_Reviews": 1,
          "Date": "2015-10-26T20:51:02.365Z",
          "Titre": "I completely forgot that G2A was a thing or I'd have used them.",
          "Contenu": "I can appreciate the serious nature of the Paypal verification I was forced to undergo but at times it felt like I was being phished somehow. I needed to give phone numbers and a home address as well as enter email codes and receive an automated phone call. Although I am happy with the transaction, I realized shortly after I could've bought the same game for over USD$10 less at a competing online retailer. I've looked for a price match policy disclosure on DLGAMER's website but I cannot find one. Needless to say, I probably won't be using this website again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2017-04-01T14:55:28.000Z",
          "Titre": "Shady buying experience",
          "Contenu": "Needed to enter a lot of personal information, and STILL needed to provide a phone number AFTER already giving payment. Further, the phone verification step failed for me, and now I'm currently stuck in limbo without the game code nor an option to refund/cancel my order. I used their online support form for help, but have not received any response.The few bucks saved is not worth going through this hassle.EDIT: Support contacted me after posting this review, and I was able to get the game code. They also offered a partial refund for these technical issues, but I have not verified this yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2015-03-13T12:21:20.000Z",
          "Titre": "Good, but some confusion on price, and payment checking",
          "Contenu": "Everthing about the experience was pretty easy.\r My first concern was that I applied a 25% discount code to an order of $25, and it went to $22.50. I didn't realise that the 25% wouldn't stack with the existing $5 discount, and neither did the site that linked the deal to me. It was still the best price around, but quite disappointing when I'd expected a better deal.\r Second, it felt like it took a bit to long to get through several stages of authentication, and even then I had to wait a while for my steam code to appear. Other sites are much smoother in this regard."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Foo",
          "Nb_Reviews": 2,
          "Date": "2016-01-14T02:00:22.000Z",
          "Titre": "Good prices, bad checkout flow",
          "Contenu": "I have now purchased several items from this shop, usually for a better price than its competitors. While all of these transactions were successful, the checkout experience is cumbersome, requiring validation and even a phone call for every single purchase."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mildly Annoyed Miser",
          "Nb_Reviews": 1,
          "Date": "2016-12-28T09:58:31.000Z",
          "Titre": "Good Deals but Overly Difficult.",
          "Contenu": "The deals are often better than Steam once you can wrestle a game from the system, and it does seem legitimate, but the process is an ordeal.Each purchase requires several layers of authentication, which while it may sound nice can take over half an hour per purchase. First you place your order, then wait for it to be authenticated by their team, which can take quite a while, as it doesn't appear to be automatic. Then an email is sent to your paypal account email to confirm purchase. Then they phone you with another code to enter. Then the order must be \"prepared\", before you finally get your game."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "plf",
          "Nb_Reviews": 13,
          "Date": "2020-07-28T21:15:01.000Z",
          "Titre": "Forces you to make an account including…",
          "Contenu": "Forces you to make an account including phone, address etc to make a purchase, which seems dodgy - I'd have prefered to purchase with a guest account and not giving personal info, but the purchase went through ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "QL",
          "Nb_Reviews": 2,
          "Date": "2020-07-21T05:14:22.000Z",
          "Titre": "Convoluted first purchase",
          "Contenu": "Convoluted first purchaseMaking my first purchase was a little more involved than with other sites. I have accounts on six other game stores and this is the first one where I had to enter a code sent via e-mail along with a code sent via SMS to my personal mobile phone number. It's only been a few days since my purchase but I don't see the phone listed anywhere in my account settings. I hope this was a one-time deal. They don't make it clear why my mobile number was necessary. Even browsing through the FAQs afterwards, I couldn't find a reason for this.Otherwise, my experience with the site itself was positive overall and I received my working Steam key almost immediately."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Barcena Alex",
          "Nb_Reviews": 2,
          "Date": "2016-05-19T22:30:41.000Z",
          "Titre": "A bit over the top on security",
          "Contenu": "The storefront is fine, but the checkout process was quite tedious for a $30 transaction.  Basically had to go through 3 or 4 security checks.  I think two were via e-mail, one was by phone, etc.I can understand if someone was buying multiple games or keys that it would be prudent to have that security check, but for a first-time purchase and for something so trivial (its a video game) it seemed like overkill.Other than that, everything else seemed ok.  Price was good which was what motivated the transaction, but if it wasn't for price, there wouldn't have been much incentive to jump through all those hoops."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ash, Julian",
          "Nb_Reviews": 1,
          "Date": "2018-08-06T23:11:49.000Z",
          "Titre": "Buying things is pretty invasive..",
          "Contenu": "Buying things is pretty invasive... requiring phone numbers and phone calls. Otherwise the process was fine. Got what I expected. Probably wouldn't purchase again... simply because of the invasive purchase requirements."
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "Crimson.smith8 Crimson.smith8",
          "Nb_Reviews": 2,
          "Date": "2018-12-30T02:57:39.000Z",
          "Titre": "can't active at my country",
          "Contenu": "before I bought total war: warhammer II from you, I am pretty sure it said it can active at m country, but when i got the serial, steam just said the key can't active at taiwan.at least i can return the key  :<"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristopher Gates",
          "Nb_Reviews": 7,
          "Date": "2015-05-22T12:18:04.235Z",
          "Titre": "DLGamer's Phone Verification is Flawed",
          "Contenu": "After taking a customer's money, any verification system needs to be 100% bullet proof. DLGamer's is not. It hangs up on me, and I am having to wait on their customer service, which can only be reached via e-mail, and has not replied after a reasonably short wait for a quick e-mail response (also, no immediate reply via Twitter).\r I have done nothing wrong and have not been delivered my product for my payment.\r EDIT: DLGamer reached me back within a couple of hours and, after fulfilling the order, continued on to refund my purchase price for the game as an apology for the failed automatic verification. This was a noble thing for them to do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cole",
          "Nb_Reviews": 1,
          "Date": "2015-12-01T15:13:58.000Z",
          "Titre": "Solid experience but...",
          "Contenu": "The best thing I can say about this company is that they offer great deals.  The only hang up I have is the way they do purchases.  I'm not a fan of having to put my phone number in and get a automated phone call with a code before the purchase is complete.  It's clunky and lacks that sense of professionalism you get with other retailers.  On top of that I made a purchase heading towards a week ago and it still hasn't been posted to my credit card yet.\r If they can smooth out their setup a bit I'd easily give them 4-5 stars.  However as it is now they would have to be offering a pretty substantial deal before I'd want to use them again."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Tkachenko Diana",
          "Nb_Reviews": 1,
          "Date": "2014-01-14T20:51:53.000Z",
          "Titre": "Pretty good place",
          "Contenu": "A really good price for the games — but with some difficulties. The website often looses the cookies forsing you to re-login on every page. Also, it didn't accept my credit card, so I had to use Paypal (no problem here, though)."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Cobo Francisco",
          "Nb_Reviews": 1,
          "Date": "2015-01-29T14:10:20.000Z",
          "Titre": "still waiting for the text message",
          "Contenu": "Had to wait for more than 30 minutes for a text message on the phone with a code to confirm the purchase. The text never arrived and after a few minutes the purchase automatically changed to successful and recived my game code."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Jindrich",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T06:36:42.000Z",
          "Titre": "Game works, but order experience...",
          "Contenu": "Process with having to write code from email and then enter phone number and write code from SMS is not only weird for logged in user with previous orders. But primarily it's NOT described before money are sent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kohler, Riley",
          "Nb_Reviews": 1,
          "Date": "2018-09-19T22:52:42.000Z",
          "Titre": "Not Sketchy Like It Seems",
          "Contenu": "The site has good deals and seems to be reputable from the research I did. However, the design of the site makes it feel sketchy and made me want to check other internet information before making a purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2015-10-21T15:35:28.004Z",
          "Titre": "Fine",
          "Contenu": "Key worked, no issues, although I have to say their site and the site they redirect you to to pay look totally sketchy. But it worked fine, and no one has stolen my identity or anything, so I guess they're ok."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jesse, Stewart",
          "Nb_Reviews": 1,
          "Date": "2019-10-13T02:10:45.000Z",
          "Titre": "Time will tell",
          "Contenu": "I am not sure if they are trustworthy, I have not seen my bank statement yet and it’s only been a couple days since my purchase . The game did get transferred as described with a working CD key."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BTol",
          "Nb_Reviews": 1,
          "Date": "2015-02-02T17:50:51.000Z",
          "Titre": "Decent price, weird site layout and purchase setup",
          "Contenu": "The purchase was easy enough, but the process of getting my key was a little convoluted, could have been easier and more seamless. I don't need to see all the steps. Take my money and give me the Steam key."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Soren",
          "Nb_Reviews": 3,
          "Date": "2013-12-07T07:09:47.000Z",
          "Titre": "Nightcrew!",
          "Contenu": "DLGamer is the discount steam dealer, you get to pay a fraction of the price and endure a short wait before you get your steam key, at night at least. All-in-all worth being a go to daytime discount game dealer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "farnication",
          "Nb_Reviews": 1,
          "Date": "2016-01-19T20:46:43.000Z",
          "Titre": "Too many hoops",
          "Contenu": "I'm giving you 3 stars because while I value my security, the amount of hoop jumping, code verifications, etc. I had to go through to complete my purchase made me never want to use your service again."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Devon Biller",
          "Nb_Reviews": 1,
          "Date": "2015-06-13T19:11:20.859Z",
          "Titre": "Ok, but semi-annoying",
          "Contenu": "While the purchase went well, and I appreciate the acceptance with Paypal, the security measure with a phone was kind of annoying. Didn't like it too much, but acceptable. The deal was also very good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2016-02-19T02:24:24.000Z",
          "Titre": "Asks for way too much information",
          "Contenu": "Even when using paypal, for a digital download where they should require NO info for shipping, they still ask for address and phone number (required) AND they do an actual robo phone call to verify it's you.  The only thing I can guess is that they must be selling your info to make up the cost of the discounts they give.  Why else would they need 3 times the verification of any other online store I've ever shopped at, for a download code of all things?\r Edit: I notice in your reply you do not actually say, \"No we do not sell your information, it is ONLY used for verification.\"  Was that an oversight?  How do all of the other game code selling sites manage to not ask for this information and still turn a profit?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 2,
          "Date": "2016-02-26T10:33:57.000Z",
          "Titre": "Annoying",
          "Contenu": "Yeah I got a cheap game, but the authentication was some Digital River-levels of idiotic. Took way longer to get my code than I would've liked. So many websites are way simpler to use, why bother?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike.",
          "Nb_Reviews": 1,
          "Date": "2016-02-16T05:16:41.124Z",
          "Titre": "Exactly what you'd expect.",
          "Contenu": "I ordered a steam key from DLGamer. The process took a bit of cajoling because Paypal invalidated my email. So, my order was cancelled, then I re-ordered. After that, it was generally smooth sailing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Graham",
          "Nb_Reviews": 2,
          "Date": "2014-06-06T13:20:04.000Z",
          "Titre": "More time consuming than most game download sites.",
          "Contenu": "I base where I download games from based on prices from isthereanydeal.com. Out of Steam, GamersGate, Amazon, GetGames, Desura, GOG, Nuuvem, IndieGala, GameFly, Origin, Humble Store, and IndieGameStand that I have purchased from, DLGamer has given me the worse purchasing experience to day.\r To be fair, their FAQ does mention that the first purchase may take from under ten minutes up to 24 hours, with subsequent purchases falling in the under 10 minute range (I bought a second game that this was true with). \r It would be my recommendation for them to take $50 of \"research\" money and buy some games from these other sites so they know how much easier the experience is at the competition. This might let them improve their process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anarrandir",
          "Nb_Reviews": 1,
          "Date": "2017-11-27T01:12:58.000Z",
          "Titre": "You have to work for it.",
          "Contenu": "The checkout process is absolutely ridiculous for a first time customer - email verification, phone verification, on top of an already verified PayPal account to name a few. The whole thing is not fast and definitely not easy.It was so much it seriously made me wonder whether or not the site was legit, but I got the steam key.Edit in reply:First, the total checkout process took longer than 78 seconds, but that hardly matters. The point is that the number of steps required was onerous. As a developer myself, I’m sensitive to the balance between security and usability; however, you all should also be happy to use this to improve your service. I’m not trying to review bomb anyone - and a 3/5 is hardly bad, but you should know (which I imagine is why you solicit feedback)."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tabby",
          "Nb_Reviews": 2,
          "Date": "2017-07-13T02:08:07.000Z",
          "Titre": "Way too much faffing around and red …",
          "Contenu": "Way too much faffing around and red tape. Other sites I just click click click done. This one took like three steps of approval. Sure that's secure but it's pretty inconvenient."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "908626",
          "Nb_Reviews": 14,
          "Date": "2016-01-14T20:09:54.000Z",
          "Titre": "Great price, too many hurdles!",
          "Contenu": "Firstly I will start by saying I would use them again... however I am not sure I would want to make a new account with them again or recommend them to a friend due to their super-long winded process.\r To buy a game:\r1) Create a PayPal account\r2) Verify PayPal account with PayPal\r3) Select Game with DLGamer and proceed to checkout\r4) Create a DLGamer account, full delivery information, even for a CD-Key!\r5) Verify your email address\r6) Complete transaction through PayPal\r7) Get email to redeem your code\r8) Verify your mobile number (again, even after PayPal requires this for a verified account) with DLGamer\r9) Enjoy your purchase.\r Not even Amazon requires a verified mobile phone, not sure why these guys do! Please simplify the process, I almost gave up with the transaction."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "jarosław",
          "Nb_Reviews": 3,
          "Date": "2018-03-18T08:18:05.000Z",
          "Titre": "Seems like the site is gathering more…",
          "Contenu": "Seems like the site is gathering more info about people than it should. Maybe they sell it, maybe they don't but it doesn't feel good to give it just to buy a game key."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2019-10-29T21:17:00.000Z",
          "Titre": "Good, but a bit slow",
          "Contenu": "I appreciate the steps taken to ensure credit card/order verification, but a text would have been preferred to a call. However, I don't think either is required."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 6,
          "Date": "2015-03-11T20:42:24.000Z",
          "Titre": "Ridiculous palaver",
          "Contenu": "After taking my money, this company refused to provide the product until I jumped through a few hoops with email and text verification that I wasn't made aware of prior to handing over my money.  I suppose I can expect some spam texts and calls from the people this company have sold my details to.  Please note that the previous responses from DLGAMER on this point aren't true: I was forced to go through these steps even though the address on my PayPal account was the same as on DLGAMER so that excuse is a fabrication.  If you go with this company, you'll have to deal with the inconvenience regardless of the address.  I wish I had gone through Steam or another key site (I've never had this hassle with the ones I've used before) because it was a tiny saving and I feel as though I've been taken for a ride."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Micah",
          "Nb_Reviews": 1,
          "Date": "2015-12-07T16:35:30.000Z",
          "Titre": "Hoops",
          "Contenu": "I got a great price on the game I wanted, but had to verify my identity/payment information 3 different times.\r Kind of a hassle, but I was willing to save the coin."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "not telling",
          "Nb_Reviews": 2,
          "Date": "2015-12-06T21:03:25.000Z",
          "Titre": "A odd shop.",
          "Contenu": "A bit of a odd shop.\rnot really sure about it.\rit is legit and send me the game i bought directly.\rbut the order emails i received about my payment were a bit odd."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "JDFM",
          "Nb_Reviews": 21,
          "Date": "2016-05-28T09:47:18.000Z",
          "Titre": "Too much hassle and checks they don't warn you about",
          "Contenu": "I wanted to buy a game. So I added it to my cart, paid for it via paypal. Now they have my money, but they want my phone number before releasing the code!!  They have my money. I have no game. What kind of a way to run a business is that? If they want all kinds of extra information, they should ask for it BEFORE you pay, so you have a chance to go elsewhere.What's next? After they have my phone number, they want my passport too? Avoid this site. They don't tell you about all their \"security\" checks, which smells like another way of harvesting information to sell to ad networks.I have requested they release the code or refund my money. I will adjust this score once they have provided good customer service.-------------------------------------------------Edit: They refunded the money. Bump to 3 stars from 1, for at least being prompt."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Buyer",
          "Nb_Reviews": 1,
          "Date": "2017-04-20T09:10:20.000Z",
          "Titre": "The shopping experience was slow and …",
          "Contenu": "The shopping experience was slow and consisted of many steps. Checkout processes in, for example, Steam and Amazon, are more streamlined and way faster."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "francis.belanger",
          "Nb_Reviews": 3,
          "Date": "2017-02-11T20:11:01.000Z",
          "Titre": "The buy process is complicated",
          "Contenu": "It's somewhat convulted to receive 2 verifications codes to buy an item with paypal. and it forces me to give my phone number which I don't like"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sleven",
          "Nb_Reviews": 2,
          "Date": "2015-02-04T04:32:39.000Z",
          "Titre": "It worked",
          "Contenu": "I got my game, but had to go through a lot of hoops to get it. If it wasn't for the good price of the game I would have just gotten it through steam."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shetter, David",
          "Nb_Reviews": 1,
          "Date": "2018-02-25T19:20:50.000Z",
          "Titre": "Good price, bad experience",
          "Contenu": "Good price. But had to play 20 questions with email and text messages before I was added to access my game, after it had already charged my account."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Kuukeksi",
          "Nb_Reviews": 4,
          "Date": "2015-07-31T19:52:21.451Z",
          "Titre": "Took a bit longer than expected",
          "Contenu": "But they delivered in the end. I didn't get their weird confirmation SMS to my phone, but I managed to get the code anyways after e-mailing them."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Thierry",
          "Nb_Reviews": 1,
          "Date": "2021-02-21T11:50:03.000Z",
          "Titre": "Not allowing me to buy multiple copies…",
          "Contenu": "Not allowing me to buy multiple copies of a game while the company (Arenanet) has no issue with people having multiple accounts."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Pinck, Nathan",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T20:24:01.000Z",
          "Titre": "Locked my Bank Account",
          "Contenu": "Key delivered quickly and adequately, but for whatever reason purchasing from this site locked my debit card and I had to get a new one."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kevin Vo",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T06:31:19.000Z",
          "Titre": "Good prices/Bad verification System",
          "Contenu": "Good prices. Bad user confirmation , it requires sms confirmation for codes or landline calls. NEITHER OF WHICH WORKS. Waste of my time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ford, David",
          "Nb_Reviews": 1,
          "Date": "2018-02-13T23:08:28.000Z",
          "Titre": "Was unaware that they were …",
          "Contenu": "Was unaware that they were international so was charged extra fee for that,  but great service and product delivered right away"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Martin",
          "Nb_Reviews": 8,
          "Date": "2016-05-17T07:40:08.000Z",
          "Titre": "Worked fine but they keep bugging you",
          "Contenu": "Worked fine and got my stuff but when you buy something then they keep sending serperate mails begging for trustpilot reviews."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Fiduciary",
          "Nb_Reviews": 1,
          "Date": "2017-03-24T05:06:52.000Z",
          "Titre": "Got the game, the verification was a pain though.",
          "Contenu": "The sale worked, the key worked, I just don't really get why they need to do a phone number verification."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Elli Gibson",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T11:27:52.000Z",
          "Titre": "I bought a couple keys",
          "Contenu": "I bought a couple keys, had an issue, was fixed, they are sold out so i couldnt get my wife the game, etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 1,
          "Date": "2016-06-23T04:36:07.000Z",
          "Titre": "It wasn't as streamlined as what I am use to. Great price though.",
          "Contenu": "I am more use to USA system. Your system wasn't as user friendly. I did appreciate paying with paypal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gamber Ellen",
          "Nb_Reviews": 1,
          "Date": "2016-04-20T20:31:50.000Z",
          "Titre": "Stop sending me emails asking for a review.",
          "Contenu": "Seriously. Your website is perfectly ordinary and emailing me for stupid reasons makes me like you less."
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Szabo Gergely",
          "Nb_Reviews": 1,
          "Date": "2016-01-30T19:10:07.000Z",
          "Titre": "Too much verification",
          "Contenu": "Maybe it is only at the first purchase, but phone verification, etc. felt too much to buy a video game."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2017-10-30T05:20:44.000Z",
          "Titre": "way too much personal info needed to …",
          "Contenu": "way too much personal info needed to buy a key.  take my account info and money, thats all you need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2016-01-17T20:17:44.975Z",
          "Titre": "Some problems",
          "Contenu": "Got locked out of account and couldn't activate game, but got a quick response from support team"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Doe, Beck",
          "Nb_Reviews": 2,
          "Date": "2017-07-05T07:56:22.000Z",
          "Titre": "Smoother transaction.",
          "Contenu": "I wish the transaction could be faster and without me needing to share my phone number."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hess Ryan",
          "Nb_Reviews": 1,
          "Date": "2017-04-09T17:06:09.000Z",
          "Titre": "Nice over all",
          "Contenu": "Nice over all, not a fan of giving out my Phone # in order to use my credit card tho."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "ks",
          "Nb_Reviews": 1,
          "Date": "2015-12-17T13:50:51.000Z",
          "Titre": "Order verification was sketchy and took twenty minutes, but the deal was worth it"
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "ersyadi denny",
          "Nb_Reviews": 1,
          "Date": "2014-07-30T11:34:38.000Z",
          "Titre": "simple download link",
          "Contenu": "I'm still confused how to download dlc because there is no link available."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Anders",
          "Nb_Reviews": 10,
          "Date": "2017-08-05T00:12:53.000Z",
          "Titre": "Both the game for a 3party is doing vr …",
          "Contenu": "Both the game for a 3party is doing vr suport but dont work for me yet."
        },
        {
          "Note": 3,
          "Lieu": "LB",
          "Pseudo": "rbh",
          "Nb_Reviews": 2,
          "Date": "2017-08-26T19:10:35.000Z",
          "Titre": "the verification process took too long …",
          "Contenu": "the verification process took too long in comparison to other sites."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "lie ade santoso",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T18:10:27.000Z",
          "Titre": "Nice! Been waiting for the chance after 2 years to play this game 😁",
          "Contenu": "Nice. Quickturn after paid. Too bad I was buying the game before Halloween, few days after steam also give discount that is cheaper than this site. Anyway, DLGamer has great price for digital games purchase also proven as a valid steam key 👍"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Unknown",
          "Nb_Reviews": 3,
          "Date": "2021-09-29T16:49:01.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, Registrable key.But it's sorry that customer service is little disappointing.Since the game was able to be bought only one copy per a person, I asked if I could buy 5 more copies of the game.In an hour, they replied and said just buy like that. but it was not possible because checkout system did not allow it.Eventually, I couldn't buy games as I want."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Josh G",
          "Nb_Reviews": 2,
          "Date": "2021-11-29T18:31:43.000Z",
          "Titre": "I was initially suspicious but now happy",
          "Contenu": "I was initially suspicious by the level of information required for a simple steam code transaction, but I received the ordered keys promptly and they were as ordered.   While a high level of security was required (needing a code sent by text) this has in hindsight reassured me of the site's legitimacy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gary Lee Baxendale",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T15:13:20.000Z",
          "Titre": "Could of made it a bit easier then it…",
          "Contenu": "Could of made it a bit easier then it was but overall good service."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Antonio Jesus, Bernal Galera",
          "Nb_Reviews": 2,
          "Date": "2021-12-27T08:54:07.000Z",
          "Titre": "There was an Issue with my order",
          "Contenu": "There was an Issue with my order, however they responded really quickly and solved my problem with profesionality, definitely would recommend"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Laferrière, Hugo",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T23:53:07.000Z",
          "Titre": "Very very Good price !",
          "Contenu": "Very very Good price !! but more than 6 hours before having the key :("
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bytecus",
          "Nb_Reviews": 1,
          "Date": "2020-12-26T01:15:48.000Z",
          "Titre": "A little zealous in confirmation of…",
          "Contenu": "A little zealous in confirmation of ones identity but I assume and hope this just to better protect them from charge backs, which fine as long as their storage of personal information is well locked down.Turn around time of transaction was almost instant for digital goods once all the verification steps were completed.Happy to complete further purchases in the future at this stage."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "SIMON WHITEHOUSE",
          "Nb_Reviews": 75,
          "Date": "2020-10-21T09:27:16.000Z",
          "Titre": "Ordering game key was easy enough from…",
          "Contenu": "Ordering game key was easy enough from here, item arrived by email quickly.Was 50% off in Euro region stores but only 5% for UK!!! , which seems wrong in my view , ordered through French region version for better price. Would use again if place is on games official key seller list.For an improvement I would like to see all region sale percentages be equal in future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris R",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T18:44:23.000Z",
          "Titre": "Website purchasing is awkward.",
          "Contenu": "Your website seems odd to operate. Purchasing the game felt awkward, to the point that I had to go to reddit to verify if your website was legit. I got the game and everything was fine, I'd just recommend updating your \"shopping cart\" and your purchasing process so its more clear what the user is doing when.Edit: I was using a PC. Uping to 4 stars because of the quick reply."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Varga Szabolcs",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T22:20:21.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great deals and great customer service. The biggest flaw is the annoying verifications when buying a game, which I guess isn't that bad when the system is working as it is supposed to. In my case, the system didn't work properly and this process became rather time-consuming, but they took the time and explained what happened."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Istvan, Sipos",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T12:12:20.000Z",
          "Titre": "Confusing information",
          "Contenu": "The page said that I can activate the game in my country but I couldn't buy it. The message said the price would be 2 EUR higher but there was no link to that price/page. Even with that price the game worth it so I am confused and a bit disappointed I had to cheat with VPN to buy it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "No Name Thanks",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T01:04:40.000Z",
          "Titre": "Good, but a little too much trouble.",
          "Contenu": "I had to do too much work just to get my key. Also, they asked too much personal information and made me give them my phone number etc.. they are still good and reputable company though. I rate them as 8/10 on a scale of 1 to 10 and I would buy from them again if the price is low like it was for my copy of resident evil 3."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Ktoś Jakiś",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T11:53:39.000Z",
          "Titre": "Takes my money and refuses contact",
          "Contenu": "Edit:After leaving negative review I got contacted immediately and my issue was resolved. That is good. What's not good is I had to go through all of this to finalise the purchase. Original:I purchased a key two weeks ago and still didn't recieve it. Any forms of contact with the seller go unanswered. I tried contacting them via contact form on the site - no answer. I sent a direct email - no answer. My money is gone and I didn't recieve a key"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kass, Christopher",
          "Nb_Reviews": 1,
          "Date": "2018-11-30T22:29:39.000Z",
          "Titre": "Purchase was charged to my credit card…",
          "Contenu": "Purchase was charged to my credit card without any issues and I received my code within five minutes. Both the main site and their secure payment site look a little shady, but I believe that's because they're both outside The United States (France, maybe?) and the translations are a little off and the logos are unfamiliar. Would be willing to buy again and give a full 5 stars if no issues encountered on second purchase."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Angeline",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T06:29:08.000Z",
          "Titre": "I had the idea that the Steam keys…",
          "Contenu": "I had the idea that the Steam keys would be sent soon after purchase. Received it several days later, was told that for preorders, keys are released based on the publisher's decision. Overall purchase experience was ok, discounted price was great! Response time from the team was good, would be perfect if English was better, had difficulty making out what they were trying to express."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 2,
          "Date": "2020-04-20T17:34:55.000Z",
          "Titre": "Was looking for Max Payne 3 on sale",
          "Contenu": "Was looking for Max Payne 3 on sale, they had it at the lowest price, sent me the code within minutes an it totally worked- although when I was sent the code it said it was for steam, I actually had to enter in Rockstar's launcher. But I get to play all the same, I'd say as trustworthy as cdkeys."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Misa Misic",
          "Nb_Reviews": 11,
          "Date": "2021-01-09T23:50:57.000Z",
          "Titre": "Good experience",
          "Contenu": "Buying on DLGAMER was a good experience, only thing that was a negative was that game I was looking for (marked as available in my country) wasn't purchase-able for my country, this was contradicting so I contacted the support team and they fixed the issue in timely manner."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Someone",
          "Nb_Reviews": 1,
          "Date": "2017-04-06T17:52:04.000Z",
          "Titre": "Good website. I got my key pretty quicly and service was good despite the site looking pretty shady",
          "Contenu": "I first thought this site was shady AF but I had no problems. The service was pretty good and I got my key pretty much instantly. The only problem was that the dutch translation of the game description on the website was pretty bad. Also, some of the payment pages were in German, for me that's not a problem (I'm not super bad at german) but it might be for some other customers. Pretty good but could be better."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Gosine Alexander",
          "Nb_Reviews": 2,
          "Date": "2017-07-11T00:07:00.000Z",
          "Titre": "Was Skeptical At First. Turned Out To Be A Great Experience.",
          "Contenu": "I was a bit skeptical when I first read about DLGamer on some forums. I had usually stuck to Steam and GOG however as time went by I found my experience with this site was far more customer friendly than others. Everything was prompt, delivered on time and I never had 'duplicate key' issues or anything of the sort as I did on other retailers. Thanks DLGamer. Your discounts are excellent at times though I do miss the 5% VIP discount. :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christy K",
          "Nb_Reviews": 4,
          "Date": "2017-03-15T02:16:43.000Z",
          "Titre": "HIgh Security for purchase",
          "Contenu": "This was my first time purchasing from this company.  There were quite a few hoops to go through to get the security of the site so I could purchase the game, so be prepared for emails and questions as you go through the process.All of that said, I do appreciate the extra security. I was able to get my game my Steam key and installed it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2017-10-19T17:15:07.000Z",
          "Titre": "Great",
          "Contenu": "A few extra steps to complete the purchase compared to other digital distributors (not necessarily a bad thing). Otherwise simple process and got my keys in just a couple minutes. My only complaint is that I was unable to use a Discover credit card, other distributors have more options when it comes to making a purchase."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Whelan, Aaron",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T02:27:28.000Z",
          "Titre": "Payment issues",
          "Contenu": "I bought monster hunter with PayPal, awesome. I then tried buying Nier with the same account, declined, tried again, declined. Hmm. One last time, same account, same PayPal, declined and now my account is blocked.Awesome.Edit:They reached out and took care of this for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2017-08-14T06:41:40.000Z",
          "Titre": "I feel confident that they're reputable …",
          "Contenu": "I feel confident that they're reputable and reliable. I only rated below 5 stars because this is my first experience buying from DLGamer and I have yet to form a real conclusion. However, the process was a breeze and PayPal makes it breezier. As of yet, I certainly have no reservations about this site."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2016-11-06T19:11:15.000Z",
          "Titre": "Minor hiccup but resolved immediately.",
          "Contenu": "I've only just heard of DLGamer recently so I decided to give them a try as one of my other online haunts for games purchasing really turned me off with the way they handled some stuff with me recently. Picked up the newest Titanfall but the key issued to me didn't work. With a quick back and forth with support, who were surprisingly expedient in returning my query, we had it resolved within 20 minutes and a new key issued. Thanks a bunch and looking forward to dealing with you guys in the future."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Phreakysoul",
          "Nb_Reviews": 1,
          "Date": "2017-07-24T20:24:31.000Z",
          "Titre": "So far my experience has been fair when …",
          "Contenu": "So far my experience has been fair when I purchased a game and it didn't work even after countless hours tinkering I asked for a refund and there was no problem. That's is why I came back to purchase another game. Would be nice to have better exchange rates for Canadian but so far so good."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "H M",
          "Nb_Reviews": 1,
          "Date": "2017-03-04T15:09:40.000Z",
          "Titre": "Cheap keys with fast support.",
          "Contenu": "The keys arrived within 10 minutes, but for verification purpose a telephonenumber is required to get the keys. The need of verifiaction is sadly mentioned after the payment and not as you sign up the account...Support answers quickly, but mind their timezone as the support works in European time."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Søren Morsø",
          "Nb_Reviews": 2,
          "Date": "2016-12-18T19:01:44.000Z",
          "Titre": "Invalid key - Replaced by support in less than five minutes",
          "Contenu": "I purchased Dishonored for steam, but the steam key I received to redeem was invalid and did not work. The website made it easy to contact support, and they resolved my problem within five minutes of me contacting them, making me leave this (relatively) good review, as opposed to a bad one."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "NC",
          "Nb_Reviews": 11,
          "Date": "2017-06-12T14:30:46.000Z",
          "Titre": "Problem at first but sorted out very quickly.",
          "Contenu": "The price was great, cheaper than buying direct. The ordering process was quick and efficient. However there was a problem with the first serial I was sent, but after an email to support I was very quickly provided another that worked fine. Overall I'm happy with the experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Preston B.",
          "Nb_Reviews": 2,
          "Date": "2017-01-20T02:53:56.000Z",
          "Titre": "Got me my key quickly BUT they want all of your info",
          "Contenu": "They take your money and require you to give them your number so they can call/text you a code used to get your game key. Also wanted address so they can sell it online but you can just put a phony one.EDIT: I have to give DLgamer credit, they either have a really good bot monitoring these pages or a good staff who explained to me the reasoning behind the hoops required to jump through for them to give us good deals, Please see the reply to my review my DLGamer and ignore my previous review which I'm leaving just for context.Edit 2: Test"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackson, Ian",
          "Nb_Reviews": 1,
          "Date": "2017-12-11T00:26:41.000Z",
          "Titre": "Relatively quick and easy transaction",
          "Contenu": "Relatively quick and easy transaction. However, I wish there was an option for the steam version of a game where games are on multiple platforms/standalone. Asked for a lot of info and to verify my phone number which was odd. I guess to prevent fraud which is understandable."
        },
        {
          "Note": 4,
          "Lieu": "BN",
          "Pseudo": "original182",
          "Nb_Reviews": 3,
          "Date": "2018-07-20T02:09:30.000Z",
          "Titre": "The first question on most people's…",
          "Contenu": "The first question on most people's mind about dlgamer.com is, whether or not it is legit.Enough people from 3rd party sites have said it, so that's why I bought something from you. But if you could do more to prove that you really are legit, it can only help."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Tobi Tobsen",
          "Nb_Reviews": 4,
          "Date": "2017-04-20T22:23:14.000Z",
          "Titre": "good good",
          "Contenu": "Alien : Isolation - The CollectionTime: Less than 5 minutesOnly a negative point the keys are stored there on the side possible possibility of doubled n / a but otherwise very good fast gings also am satisfied for 12 euro ^^ the The Collection Edition game was well rated :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2017-11-29T12:58:19.000Z",
          "Titre": "Secure but extra steps",
          "Contenu": "While secure, they required several extra steps of confirmation (e-mail code AND texted security code) before I could download a game that I had already been charged for through PayPal. Got a great deal, but was a little concerned when I did not receive my code right away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2017-03-21T14:44:10.000Z",
          "Titre": "Okay service, complicated first purchase.",
          "Contenu": "I purchased Guild Wars 2, and I wasn't expecting so much verification.  Just to get the order through, and paying using PayPal, I had to give a verification key from my PayPal email, and then a verification from my phone.  Neither of which went very smoothly, as my email is already 2-factor authentication, and same with PayPal.  I understand the security aspect, but at the same time, this was rougher than using Amazon.  There is a reason why companies like Amazon and Apple have humans to review orders, and why sometimes they're delayed for up to two hours."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Girardi de Sosa, Fabrizio",
          "Nb_Reviews": 1,
          "Date": "2017-10-07T23:29:26.000Z",
          "Titre": "Used once",
          "Contenu": "Used once. It may be secure, but definitely invasive. I had to put my phone number in order to get a pin code to complete transaction. Funny story: created my account 3 minutes before. There was absolutely no way to confirm that the phone number used was actually mine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "derek gassen",
          "Nb_Reviews": 2,
          "Date": "2016-11-12T00:03:23.000Z",
          "Titre": "hey it works",
          "Contenu": "This was the cheapest deal I could jump on for Battlefield 1. I appreciated the 2 security checks the site performed to ensure my identity as a valid customer and not a miscreant. I'm hopeful the measures they're taking here ensures my game codes continue to work!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "zt",
          "Nb_Reviews": 1,
          "Date": "2017-03-30T06:16:20.000Z",
          "Titre": "No problems.",
          "Contenu": "I gave them my money, and I received a key for the game I paid for. Only reason it is not 5 stars is because I still can't get over how shady the site looks. All the dealings were fine but even after completing the deal I felt like I was swindled (but I wasn't!)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FARON",
          "Nb_Reviews": 7,
          "Date": "2018-03-11T04:43:32.000Z",
          "Titre": "Experience was great with a small…",
          "Contenu": "Experience was great with a small caveat the purchase sent me to another site for download of actual game and an account required there. But the price was excellent and worth the trip to secondary site. But I suppose this is the nature of most online games for PC."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 4,
          "Date": "2021-08-13T05:05:11.000Z",
          "Titre": "Great Transaction, Lots of Personal Information Surrendered",
          "Contenu": "The price and product were great and delivered in a timely fashion, but I did feel like I had to give my bank routing numbers and firstborn child (and the child's bank routing numbers) to make the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leth Ian",
          "Nb_Reviews": 1,
          "Date": "2017-01-02T05:42:28.000Z",
          "Titre": "The first look at the site, it does …",
          "Contenu": "The first look at the site, it does look fishy. They need a better layout. However, shopping from them is a very reassuring process. There are several verification steps to male sure purchases go through safely, and i received a steam code for my game with no hassles."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Watts, D",
          "Nb_Reviews": 1,
          "Date": "2018-05-23T05:02:05.000Z",
          "Titre": "Bumpy start, happy ending.",
          "Contenu": "Made two separate purchases of heart of thorns expansion for guild wars 2.  First code worked fine and second code was not recognized.  Once dlgamer became aware of my issue they promptly gave me another code to try which worked.  I would recommend to others."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Daniel Barona",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T00:14:23.000Z",
          "Titre": "cant get a second code for my wife on a mmorpg is just sad",
          "Contenu": "great service but is sad that MMORPG are games you  play whith friend or yopur family and i can not buy a second code for my wife not even if she makes a  new accaunt for her and use her own credit card. not everyone is alone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gathar",
          "Nb_Reviews": 1,
          "Date": "2017-06-07T13:59:37.000Z",
          "Titre": "Positive experience",
          "Contenu": "Positive experience - generally pretty easy and safe, although I felt like I had to jump through a fair amount of hoops to verify and validate everything, and wait for the order to process. Nevertheless, I had my purchase a good price shortly after find it here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris galleg",
          "Nb_Reviews": 1,
          "Date": "2017-05-01T23:05:03.000Z",
          "Titre": "too many secure things like confirm …",
          "Contenu": "too many secure things like confirm this confirm that it takes awhile to actually buy the game and get the code, like 5 minutes of just going through processing, other than that doom for 15 bucks was a steal so I guess it was worth the while. i Reccomend"
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Cake Meister",
          "Nb_Reviews": 2,
          "Date": "2017-11-07T07:18:14.000Z",
          "Titre": "Fast, Secure service",
          "Contenu": "Few weeks ago, I bought a game from DLGamer which is GuildWars 2. Even though the process is rather complex because you have to fill out forms as well as security check but only after 3 mins I received my CD keys and was be able to enjoy the game."
        },
        {
          "Note": 4,
          "Lieu": "HN",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2016-11-22T22:09:57.000Z",
          "Titre": "Fast Customer Support",
          "Contenu": "They are very good, but have a very deficient page. I tried to work with chrome but I never made it to work, contacted customer support and helped me out. But seriously guys fix your google chrome support its really bad :( Other than that no issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Del",
          "Nb_Reviews": 1,
          "Date": "2016-11-12T17:54:12.000Z",
          "Titre": "Easy enough buying process. Felt a bit more strict than other sites with different forms of verification,  but that feels more legit to me.",
          "Contenu": "Having had some bad experiences with buying game keys online. I was hesitant to use dlgamer. Their verification process involving multiple steps to make sure I am who I am helped me feel more comfortable with the user base and who I was buying from."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "s_",
          "Nb_Reviews": 2,
          "Date": "2018-09-12T08:27:40.000Z",
          "Titre": "One of the legit sites that sells Steam…",
          "Contenu": "One of the legit sites that sells Steam keys.Buying process has phone verification system that never seems to work, but luckily I've never had to wait longer than few minutes until someone has handled approved the payment manually."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Piotr",
          "Nb_Reviews": 2,
          "Date": "2017-02-08T17:39:56.000Z",
          "Titre": "Quick purchase, odd verification mechanisms",
          "Contenu": "I've finished the order and received the game in perhaps 10 minutes total, but they forced me to give up my mobile phone number AFTER the payment (which they forgot to mention at any point prior to the purchase) for \"verification purposes\".Edit: Regarding your response: my payment methods are already secure enough as I have to verify each payment with one time code (2FA on PayPal and 3-D Secure on card) and only my bank and PayPal needs to know my phone number. The entire order was indeed finished quickly as I noted in the original review, but I've updated the rating to reflect that a bit more closely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2017-08-17T13:31:34.000Z",
          "Titre": "It was my first time using this …",
          "Contenu": "It was my first time using this service. I was a little hesitant to use this service because of what I have heard about it.Though everything worked out just fine. The redeeming of the code had more confirming steps to the process than normal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "potSMASH",
          "Nb_Reviews": 1,
          "Date": "2017-01-25T02:40:01.000Z",
          "Titre": "Bought game, got game.",
          "Contenu": "I've only used DLGamer once, so I haven't much to say aside from that I did get the game I ordered, and everything worked out. Not 5 star simply (and kind of unfair to DLGamer, I admit) because this is my first and only time using them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Egan, James",
          "Nb_Reviews": 1,
          "Date": "2017-08-27T21:50:38.000Z",
          "Titre": "Got a faulty game key / Problems with Support ; Owner reached out to me personally.",
          "Contenu": "I was very upset with this site originally due to receiving a faulty game key and having trouble reaching support. One way or another the owner of the site became aware of this and personally reached out to me and gave me another key without question. Which was awesome and extremely appreciated. -----I took a star off for getting sent a bad key in the first place and for the unfortunate reality that you are not going to to give you the quick support larger corps can afford if you have a problem. Regardless with the great support I eventually received made up for a lot of this. They are honest people and have great prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dtrunk",
          "Nb_Reviews": 1,
          "Date": "2017-06-15T04:40:59.000Z",
          "Titre": "Purchase of a steam key for DOOM went …",
          "Contenu": "Purchase of a steam key for DOOM went pretty smoothly. The only hiccup was having to register an account during the checkout process. I would think it easier to have a person made aware that they need to register an account before purchase."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Kacper Młyński",
          "Nb_Reviews": 3,
          "Date": "2017-08-11T09:08:27.000Z",
          "Titre": "I bought Guild Wars 2",
          "Contenu": "I bought Guild Wars 2: Heart od Thorns. Unfortunately there was an issue with the serial number - It was not working. Support response was very quick and percise which od actually awesome. I'm going to się this site in future"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CommanderS7",
          "Nb_Reviews": 1,
          "Date": "2019-08-16T00:58:55.000Z",
          "Titre": "Confusing and frankly unnecessary red…",
          "Contenu": "Confusing and frankly unnecessary red tape needed to make a first purchase and could be streamlined, however, although outdated it still maintains security, and staff sorted out any issues I had almost instantaneously."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2017-11-19T18:40:04.000Z",
          "Titre": "I had no issues with purchasing my …",
          "Contenu": "I had no issues with purchasing my games. Only thing I didn't like was using codes to go through the security process.I just wish it was just quick and easy with my purchases without needing to go through those steps."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "K-Anator",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T22:38:53.000Z",
          "Titre": "I like turtles",
          "Contenu": "Aside from the minor annoyance of having to receive a phone call to verify my CC, everything was great. Good price on the game I was looking for, and I got the key faster than most other sites of a similar nature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harris, Michael",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T17:26:40.000Z",
          "Titre": "Got a great deal on a pc game",
          "Contenu": "Got a great deal on a pc game. Activation code worked on Steam. The security measures you have to navigate are frustrating but understandable. I would definitely buy from them again. Thanks for the great deal DLGamer."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "TAN, BRYAN",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T05:17:33.000Z",
          "Titre": "Was Quick and Easy",
          "Contenu": "Was Quick and Easy, Had a slight hassle when getting the steam key but at most only spent 3-5 minutes figuring it all out. Excellent Service (as well as good deals to boot). isthereanydeal.com brought me here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oren Koh",
          "Nb_Reviews": 1,
          "Date": "2017-12-04T07:07:24.000Z",
          "Titre": "Looks Shady - Performs Legit",
          "Contenu": "Payment system looks slightly shady and is a bit cumbersome (no AMEX accepted), but despite this the site is legit and offers great deals -- got my copy of Wolfenstein II (New Colossus) from there and had no issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helios",
          "Nb_Reviews": 2,
          "Date": "2017-03-22T01:27:58.000Z",
          "Titre": "Solid transation",
          "Contenu": "Nothing extraordinary. They had a good deal on a game. I paid them in the currency of my people. In return they gave me what a person may call a \"Game Key\", to be used with the \"Steam\" platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TSen",
          "Nb_Reviews": 1,
          "Date": "2017-12-30T20:05:59.000Z",
          "Titre": "Order took too many hours to verify...",
          "Contenu": "My husband and I each bought a copy of the same game. Instead of letting us put two in a cart, we had to each sign up for our own DLGamer account and buy a copy. We have only one family PayPal account. So my husband's copy went through their validation process withing 10 minutes But for mine we waited all night, went to bed, and then in the morning it finally finished. I am sure there are processes I do not understand at work, but I did think it was pretty lame that I had to wait so long for my copy just because we use the same PayPal account. Of course, this was my assumption as to why it took so long. We received no updates of any kind, and no communication until the process finished. It was very confusing."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Alexandra Pedro",
          "Nb_Reviews": 2,
          "Date": "2016-12-14T06:27:33.000Z",
          "Titre": "Process of buying was a little convoluted",
          "Contenu": "It was weird buying as so many data and confirmation codes were needed. However, even though it had many steps the buying process was as fast as possible and easy to understand. Could have been streamlined."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sinclair, Brandon",
          "Nb_Reviews": 1,
          "Date": "2018-07-20T02:39:25.000Z",
          "Titre": "Good customer service",
          "Contenu": "I didn't realize the service did not provide steam codes, but i was refunded in full and lines of communications were fast and very kind, if you plan to buy a non-steam title, strongly recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T15:31:02.000Z",
          "Titre": "Works well, but looks Sketchy",
          "Contenu": "Everything went through pretty well, and I got what I paid for. Easy to get your codes and put them steam. My only complaint is that this website looks incredibly sketchy."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Owen",
          "Nb_Reviews": 1,
          "Date": "2018-01-08T22:34:03.000Z",
          "Titre": "Great prices, but....",
          "Contenu": "Great prices, but more painful than any other purchasing experience online. From multiple codes being sent out to verify, to SMS codes to verify... I just want to sign in, buy with PayPal, done."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Janice",
          "Nb_Reviews": 1,
          "Date": "2018-08-30T06:11:29.000Z",
          "Titre": "great",
          "Contenu": "security measure is great but a little inconvenient. I wish there are a few options that we can pick to verify account and payment method. after all that, the purchase experience is a breeze."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2017-10-02T13:15:25.000Z",
          "Titre": "Great price and fast key generation",
          "Contenu": "Great price and fast key generation. The multifactor authentication is a little cluegy versus normal authenticators, also the site for English could use some grammar check and spell checking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcus Leese",
          "Nb_Reviews": 1,
          "Date": "2017-12-11T00:39:30.000Z",
          "Titre": "Will be buying from them again",
          "Contenu": "Very helpful, and was relatively fast. I found it a little bit annoying that they required a phone number and address, but I understand the reasoning behind it. Overall a very good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krishach",
          "Nb_Reviews": 4,
          "Date": "2020-04-07T23:53:15.000Z",
          "Titre": "Good delivery, great price, using the site is somewhat painful",
          "Contenu": "Good delivery, great price, using the site is somewhat painful; extra profile and security. Prices are good, and deliveries are accurate and timely. Its nice to have security, but"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riley",
          "Nb_Reviews": 2,
          "Date": "2018-07-09T22:40:53.000Z",
          "Titre": "Transaction went well",
          "Contenu": "Transaction went well, a little tedious on the needed steps to complete it though, what with all of the verification that was requested. But the goods (Gw2 HoT expansion code) were good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RLM",
          "Nb_Reviews": 1,
          "Date": "2018-05-23T22:12:43.000Z",
          "Titre": "Pretty Good",
          "Contenu": "Had some trouble activating the code I bought initially due to some confusing directions on the website, but tech support was very quick to respond and everything was resolved quickly."
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Jorge, Arjona",
          "Nb_Reviews": 1,
          "Date": "2018-07-15T22:52:37.000Z",
          "Titre": "Got a problem with my KEY for GW2 Path…",
          "Contenu": "Got a problem with my KEY for GW2 Path of Fire Expansion (the key that they send me was incomplete)  contacted support and send me another key that worked in less than 20 minutes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bunny Blake",
          "Nb_Reviews": 2,
          "Date": "2019-03-23T18:06:48.000Z",
          "Titre": "Had a little frustration with the SMS…",
          "Contenu": "Had a little frustration with the SMS verification, but the customer support message system was a quick response and got me happily sorted out. Great prices, would use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2017-07-14T23:31:20.000Z",
          "Titre": "Heavy on security but delivered the …",
          "Contenu": "Heavy on security but delivered the product at a much better price than any other market. Had issues with a code not working and the customer service resolved it within the hour."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Klasson Kristoffer",
          "Nb_Reviews": 3,
          "Date": "2017-03-21T18:02:56.000Z",
          "Titre": "Decent Keyseller",
          "Contenu": "Picked up Doom from them since the price was good and they had a good selection of payment §options i trusted.Have good visibility on region restriction info before buying"
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "Monterroso, Cristian Javier",
          "Nb_Reviews": 3,
          "Date": "2019-02-03T21:06:38.000Z",
          "Titre": "A tittle wee be different to other online game stores. But pretty good.",
          "Contenu": "So, there are a couple of steps that they do that no other online retail store has asked (including a pretty good two-steps aut), but the site and prices are pretty good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2018-04-09T22:12:28.000Z",
          "Titre": "Would recommend this Site for buying games in the US.",
          "Contenu": "Worked well for my purchase of Battlefront 2 and got a decent discount. Transaction was very secure and took a bit longer due to this, but was worth while. Would recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boom Shakalaka Kahn",
          "Nb_Reviews": 1,
          "Date": "2017-02-24T22:32:31.000Z",
          "Titre": "Somewhat involved purchase process, but solid vendor",
          "Contenu": "No issues whatsoever with the key, I even had to open an anet ticket because I applied it to the wrong account and still, no issues with it or getting my mistake resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate, Wilson",
          "Nb_Reviews": 1,
          "Date": "2017-05-28T16:05:18.000Z",
          "Titre": "Happy with purchase",
          "Contenu": "Worked fine. I had some issue with my bank declining the purchase and though I had to jump through some hoops to make sure the payment was validated, DLGamer came though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2018-05-30T12:17:45.000Z",
          "Titre": "Purchase required a phone and email…",
          "Contenu": "Purchase required a phone and email verification, which is a bit overkill. Just an email would have been enough, I felt kind of weird having to supply a phone number."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Arratta Sebastian Jose",
          "Nb_Reviews": 1,
          "Date": "2016-12-10T15:34:06.000Z",
          "Titre": "Safe and reliable",
          "Contenu": "This is the first time I bought this page and I found the security system very good, although at first cost to understand it, once I understood it came out very well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "jon",
          "Nb_Reviews": 1,
          "Date": "2017-04-06T20:58:36.000Z",
          "Titre": "Having to provide a phone number and …",
          "Contenu": "Having to provide a phone number and receive an automated call with a verification code to validate an order is strange but the price was good and the key works fine"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "t.s",
          "Nb_Reviews": 1,
          "Date": "2016-11-19T15:39:03.000Z",
          "Titre": "Everything went smoothly.",
          "Contenu": "You have to give them your phone-number during your first purchase, to verify your account. Would be nice if they told you about that before you start the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geoffrey Linn",
          "Nb_Reviews": 5,
          "Date": "2017-11-07T05:55:26.000Z",
          "Titre": "There has been issues in the past with …",
          "Contenu": "There has been issues in the past with lack of keys available even after I purchased items. However, I eventually received the items and they work as advertised."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2017-04-07T18:45:36.000Z",
          "Titre": "Great, but a little unclear",
          "Contenu": "No issues whatsoever. There was a short delay before I got what I wanted. Unfortunately, there was no information of this beforehand, which was somewhat worrying."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 2,
          "Date": "2018-08-13T16:45:25.000Z",
          "Titre": "Great site to purchase games on promotions!",
          "Contenu": "Look:The site looks a bit dated but it does its job. I have to express that I wish the english part for the preordering process (after purchase) is a bit clearer. The infinite looping arrows at the \"Preorder\" step is a bit confusing, I wasn't sure to either stare for something to happen or to leave the page. I'd really suggest removing that and just say \"Your game has been preordered, to download the game you will have to wait until date.\", the date you show already with a countdown.Experience:Smooth sailing ordering process.Download:The game I preordered was Monster Hunter World and it was releasing the keys early from another game site for other people, I had to ask DLGamer to provide the key as well. They were super quick to address the situation (within 30mins-1hour) and provided me with a key. Super great service!!Overall, I totally recommend!"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Galanos, Giorgos",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T15:33:20.000Z",
          "Titre": "I bought a DLC for Euro Truck Simulator…",
          "Contenu": "I bought a DLC for Euro Truck Simulator 2. Everything goes great, but i prefer not to take so much details about me, for example mobile phone number."
        },
        {
          "Note": 4,
          "Lieu": "LB",
          "Pseudo": "roland, samaha",
          "Nb_Reviews": 1,
          "Date": "2017-12-25T13:10:13.000Z",
          "Titre": "Would visit again",
          "Contenu": "Had to wait for my purchase about an hour or two because of the confirmation process but other than that smooth transaction. Would buy again from this store."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DL",
          "Nb_Reviews": 1,
          "Date": "2018-03-12T01:53:20.000Z",
          "Titre": "Weird site",
          "Contenu": "Weird site, asks for info that doesnt seem relevant at all for \"security purposes\" but they give you your stuff and it was a pretty good discount"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Bliss, James",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T10:00:14.000Z",
          "Titre": "Fast customer service helped fix issues",
          "Contenu": "Had some problems getting my serial code at first but after a very quick response from customer service they sent it to my email and it worked perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Black, Harry",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T14:03:20.000Z",
          "Titre": "Everything was fine the website just…",
          "Contenu": "Everything was fine the website just looked kind of shady and that gave me some heebie-jeebies but other than that real great job."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Fahad Alfahad",
          "Nb_Reviews": 2,
          "Date": "2019-03-14T03:53:06.000Z",
          "Titre": "Nice features",
          "Contenu": "I like how it tells me if the code is active my country since many sites don't do that and just say its an American, European......etc Version ."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Noyb",
          "Nb_Reviews": 1,
          "Date": "2019-05-08T08:31:31.000Z",
          "Titre": "Phone number needed to complete transaction - Great & Fast otherwise",
          "Contenu": "If you're OK with giving out your phone number for security reasons to complete the transaction it is a great and fast transaction experience."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Niktorius",
          "Nb_Reviews": 2,
          "Date": "2018-10-01T15:13:46.000Z",
          "Titre": "Fast, reliable, safe",
          "Contenu": "Everything went OK and smooth. There is a bit of complicated security process (for first-time users) that takes few steps, but it can by done fast."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Philipon",
          "Nb_Reviews": 1,
          "Date": "2018-08-17T17:14:47.000Z",
          "Titre": "Fast, if you have a cellphone nearby.",
          "Contenu": "The confirmation by SMS was a little annoying, especially since I didn't see it indicated before the payment. Otherwise no problem and fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 4,
          "Date": "2017-04-13T12:29:10.000Z",
          "Titre": "They take security almost too …",
          "Contenu": "They take security almost too seriously. Once you jump through all their hoops it's a good service though. Cheap, secure, maybe a little slow."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MC",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T22:43:16.000Z",
          "Titre": "A good service/shop overall",
          "Contenu": "A good service/shop overall.  Some language and grammar issues here and there, but everything worked and that's good enough for me."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Dirk",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T15:31:52.000Z",
          "Titre": "Download Manager OK",
          "Contenu": "Download Manager OK, nevertheless it did an incomplete process. One file was corrupt and caused several severe crashes until downloaded again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Evans",
          "Nb_Reviews": 4,
          "Date": "2017-08-03T08:02:09.000Z",
          "Titre": "Too much verification but it worked first time",
          "Contenu": "Bit of a hassle with all the verification codes etc but the delivery of the product was prompt and the steam code worked fine. All in all good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hu, Jason",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T11:12:07.000Z",
          "Titre": "Hey you guys are great",
          "Contenu": "Hey you guys are great, you've been around a long time and you give gamers great deals while providing great service. Please keep up the good work, but you really don't need that much feedback to know you're doing a good job do you?"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T23:15:05.000Z",
          "Titre": "Great price, everything received.",
          "Contenu": "Great price, everything worked as said, no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elvin Lee",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T15:14:58.000Z",
          "Titre": "Delivered as promised and stood by the transaction, years later!",
          "Contenu": "Bought a game in 2019 (activation code on Steam). Then suddenly got a message from Steam in 2022 saying the game had been removed from my inventory. When I contacted Steam support they said the activation key had been revoked by the publisher. Once I informed DLGamer support of the situation, they issued me a replacement key right away. Thanks for standing by your sale!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T04:06:35.000Z",
          "Titre": "Always an easy time purchasing from you…",
          "Contenu": "Always an easy time purchasing from you guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 4,
          "Date": "2021-10-02T02:02:26.000Z",
          "Titre": "Very good experience buying here",
          "Contenu": "Very good experience buying here. Quick delivery and everything. I have had a couple issues which have been sorted out quickly and even better than I expected and wouldn't think twice before coming back or recommending to someone else. Couldn't ask for much better service when needed which is very important for if you run into a problem!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Three Hundred Fifty Pound Man",
          "Nb_Reviews": 4,
          "Date": "2022-10-24T14:44:24.000Z",
          "Titre": "This was a very secure transaction",
          "Contenu": "This was a very secure transaction. Probably a bit excessive imo, but definitely nice to see. Key was received instantly upon purchase which is most important. Thanks DLGAMER, you guys earned a new customer!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Petro Tiurin",
          "Nb_Reviews": 5,
          "Date": "2022-06-11T18:10:24.000Z",
          "Titre": "Generally smooth experience",
          "Contenu": "Managed to buy a game with no issues, all went well generally smoothly. Not sure why they need so many verifications, had to receive a code on both email and phone for the transaction to go ahead.Instructions on how to redeem the code were helpful and code worked, as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weirich, Michal",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T12:53:33.000Z",
          "Titre": "I never heard of this company before I…",
          "Contenu": "I never heard of this company before I bought this game. I’m familiar with sites that sell keys for games so I wasn’t scared to try it. I’m happy I did, the key has been working perfectly for a while and I imagine won’t have any issues going forward with any more purchases! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2021-10-03T06:25:18.000Z",
          "Titre": "Bought one item at the time it was the lowest price and I'm satisfied.",
          "Contenu": "I ordered one game and it was at the lowest price at the time of purchase.  Even though the delivery was not instant and the wait took a while I was still able to get the game and successfully activate it on Steam with no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Elko",
          "Nb_Reviews": 6,
          "Date": "2023-07-03T01:05:47.000Z",
          "Titre": "easy and secure",
          "Contenu": "The purchase was easy and secure. The game codes worked immediately, and I haven't had any problems with running the game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucas Ferri",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T15:08:10.000Z",
          "Titre": "WORTH IT!",
          "Contenu": "I have to admit I was pretty skeptical at first. After I saw I could use PayPal I thought it would be OK to take the risk. The process was very quick and only required a few security steps. I got Elden Ring for Steam and the code worked perfectly. I will definitely use you guys in the future!TIP: Type the code exactly as it appears. I typed it in wrong at first but it worked in the end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiden",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T03:30:13.000Z",
          "Titre": "Quick delivery for a good price",
          "Contenu": "Quick delivery for a good price. Definitely not a scam. Nothing much else to say, good experience"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Manon Awkward",
          "Nb_Reviews": 3,
          "Date": "2022-10-05T22:56:35.000Z",
          "Titre": "The best!!",
          "Contenu": "My first purchase on this service, so far I like everything, great people in the support service, helped me figure everything out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E.K.",
          "Nb_Reviews": 4,
          "Date": "2021-10-13T02:17:14.000Z",
          "Titre": "They have an easy to navigate website…",
          "Contenu": "They have an easy to navigate website and secure payment process. Also, I needed to reach out to customer service regarding my purchase (nothing negative) and they were quick in replying and very courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Micchon Shikimori",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T06:26:48.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "First time buying. Got Persona 5 Royal. Created an account, bought the game and received the code in less than 5 minutes. Good service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Avid gamer",
          "Nb_Reviews": 2,
          "Date": "2022-03-08T06:01:14.000Z",
          "Titre": "Ya baby",
          "Contenu": "Not a hassle to purchase be it the store or the checkout, and after payment got my key within seconds on multiple occasions."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "brando",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T22:24:05.000Z",
          "Titre": "REVIEW",
          "Contenu": "I had searched up the game title I wanted to get for cheap (\"GAME\" FOR CHEAP) on google, and came across DLGAMER. I thought it was a fake site and was not to be trusted but I took a risk and it worked out in the end. After 50 seconds of payment and all the info that I had put in, I received my key for my game, and it worked."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Cliente",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T13:14:08.000Z",
          "Titre": "My first experience",
          "Contenu": "I found this website on isthereanydeal.com and decided to give it a chance and loved my first experience, was fast in all stages of the purchase. Would and will shop here again."
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Martin Dekan",
          "Nb_Reviews": 4,
          "Date": "2021-12-23T13:24:32.000Z",
          "Titre": "The verify process is long",
          "Contenu": "The verify process is long and quite exhaustong, but you will get your key in like 1-3hrs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lakem",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T23:36:19.000Z",
          "Titre": "Hell yeah",
          "Contenu": "10/10 a little complicated but everything worked! cheaper price than MSRP. Steam compatible"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Christenson",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T13:39:26.000Z",
          "Titre": "Great Site",
          "Contenu": "Great site, competitive prices and sales and fast order turnaround, would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Cordoba",
          "Nb_Reviews": 2,
          "Date": "2022-03-06T18:10:15.000Z",
          "Titre": "It's good",
          "Contenu": "No complaints, got my code as advertised. Was skeptical at first, will use again."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Cirith, Ungol",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T02:53:42.000Z",
          "Titre": "Everything worked as advertised.",
          "Contenu": "Everything worked as advertised.Received the steam code for the game right away at the best price.Satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DWG",
          "Nb_Reviews": 3,
          "Date": "2022-07-22T17:06:31.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service Couldn’t fault them really helpful and quick response"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sven Steinbach",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T12:16:07.000Z",
          "Titre": "Quick delivery and easy process",
          "Contenu": "My order was processed quickly. Everything worked fine and got the key directly after the process was finished."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Hrl",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T06:48:12.000Z",
          "Titre": "I buy elden rings with these company…",
          "Contenu": "I buy elden rings with these company and it was low price in preorder and i dont have any problem."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paulo Bicho",
          "Nb_Reviews": 2,
          "Date": "2021-12-26T22:09:44.000Z",
          "Titre": "First time that I've used DLgamer",
          "Contenu": "First time that I've used DLgamer, was a simple and easy to follow process until I got the game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T23:24:12.000Z",
          "Titre": "Impeccable customer service",
          "Contenu": "While I didn't receive my game code immediately, customer service informed me about the problems with getting the code, gave me frequent updates and resolved it in a very timely manner."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Callum, Murray",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T11:10:20.000Z",
          "Titre": "Good Site",
          "Contenu": "Got the steam key right away, for cheaoer than elsewhere, worked easily"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T19:28:27.000Z",
          "Titre": "Fast and great service!",
          "Contenu": "The process of buying games was insanely quick and the prices are amazing"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Giovanni",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T14:54:51.000Z",
          "Titre": "Great service at all times",
          "Contenu": "I enjoy all the sales DL Gamer has and payments / purchases are done easy"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T16:58:44.000Z",
          "Titre": "DLGAMER had the lowest listed price",
          "Contenu": "DLGAMER had the lowest listed price, and the activation code worked flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diddly Squat",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:25:22.000Z",
          "Titre": "Game came quickly and it worked out…",
          "Contenu": "Game came quickly and it worked out great. will be shopping here more in the future."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Lucie",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T11:09:25.000Z",
          "Titre": "Service rapide",
          "Contenu": "Service rapide, process simple  donc efficace !  bravo !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Drew",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T00:39:14.000Z",
          "Titre": "Good selection at a good price",
          "Contenu": "Good selection at a good price. Steam key was easy to activate."
        },
        {
          "Note": 5,
          "Lieu": "KH",
          "Pseudo": "Oggv Oggv",
          "Nb_Reviews": 2,
          "Date": "2021-11-18T08:05:03.000Z",
          "Titre": "9999",
          "Contenu": "Use the edit icon to pin, add or delete clips.Touch and hold a clip to pin it. Unpinned clips will be deleted after 1 hour."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saci, Samy",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T21:27:07.000Z",
          "Titre": "Great customer service",
          "Contenu": "I made a wrong purchase and wrote to DLGAMER and within hours my money was back in my account. Kudos!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Too Poor",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T22:06:00.000Z",
          "Titre": "It works",
          "Contenu": "Fast and straightforward process. Nothing else to say."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T15:14:26.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Easy to find what I was looking for.Good price for the item.Easy checkout and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddy G",
          "Nb_Reviews": 11,
          "Date": "2021-12-03T10:37:40.000Z",
          "Titre": "Great deal, no issues.",
          "Contenu": "Got a great deal on a game and I had no issues with my first time using the sight. No complaints here."
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Estrada, Nilson",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T12:21:07.000Z",
          "Titre": "Recommended",
          "Contenu": "Excellent service. The purchase process was very fast and secure."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T06:54:32.000Z",
          "Titre": "DLGamer gets the job done!",
          "Contenu": "Cheap price for a legitimate product.Made it pretty easy to get my steam code and get the game I ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abraham, Boaz",
          "Nb_Reviews": 3,
          "Date": "2022-11-22T06:29:13.000Z",
          "Titre": "Quick and easy.",
          "Contenu": "Quick and easy. Got what I wanted without any issues whatsoever. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Geoff, M",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T07:32:40.000Z",
          "Titre": "Security seemed too notch."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee",
          "Nb_Reviews": 26,
          "Date": "2023-06-03T08:03:28.000Z",
          "Titre": "Good seller",
          "Contenu": "Good seller. Quick purchase. No messing around."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Viktor Todorov",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T15:17:45.000Z",
          "Titre": "Works perfectly",
          "Contenu": "I bought a game and I almost instantly received the key."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 6,
          "Date": "2022-03-06T22:13:41.000Z",
          "Titre": "Awesome",
          "Contenu": "Good price, quick delivery, well designed website. A great experience overall."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anton Howarth",
          "Nb_Reviews": 8,
          "Date": "2022-05-05T18:40:24.000Z",
          "Titre": "Quick delivery with no hassle",
          "Contenu": "Quick delivery with no hassle, would use them again."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "CWT",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T10:27:27.000Z",
          "Titre": "Game key came quickly",
          "Contenu": "Game key came quickly, simple purchase process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T19:58:39.000Z",
          "Titre": "Good service",
          "Contenu": "Quick delivery and it was easy to buy and enter the code to steam."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T15:00:21.000Z",
          "Titre": "No issues",
          "Contenu": "No issues..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liorge, Dominguez",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T02:35:20.000Z",
          "Titre": "Quick and fast transaction",
          "Contenu": "Quick and fast transaction. 😀"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "liooil",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T16:40:14.000Z",
          "Titre": "Delivered in under 5 min",
          "Contenu": "Delivered in under 5 min, key worked"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Nikolakakos, Dimitris",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T10:02:29.000Z",
          "Titre": "Easy and fast payment and delivery"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "David Catalano",
          "Nb_Reviews": 5,
          "Date": "2021-11-08T23:26:10.000Z",
          "Titre": "simple & easy",
          "Contenu": "simple & easy, fast and cheap transaction! Thanks"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Customemer",
          "Nb_Reviews": 6,
          "Date": "2021-12-10T18:28:43.000Z",
          "Titre": "Flawless purchase",
          "Contenu": "Flawless purchase, good price."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chutmarani",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T04:06:56.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery. Key worked fine in Steam. Good price. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Kathryn Yc",
          "Nb_Reviews": 3,
          "Date": "2022-02-17T01:42:50.000Z",
          "Titre": "good price & fast delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley, Brett",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T06:12:52.000Z",
          "Titre": "One of the best sites to get games",
          "Contenu": "Love the site, have used it several times to buy games at cheap prices. All keys are legit, as they actually have the right to sell the games so you never have to worry about anything. Never had an issue or had to wait longer than 3 minutes during the whole process. The transaction was over faster than I could navigate myself to get my key haha."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J David Porter",
          "Nb_Reviews": 4,
          "Date": "2021-08-11T20:16:13.000Z",
          "Titre": "Steam Keys",
          "Contenu": "Bought a few steam keys that were significantly cheaper than on steam.  Keys were delivered promptly and worked without issue. There were some security hoops to jump through for the first order, but I assume that this is to avoid chargebacks and allows them to limit fraud and keep their prices low."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "belialsworld 666 belialsworld 666",
          "Nb_Reviews": 3,
          "Date": "2021-09-24T23:48:42.000Z",
          "Titre": "Fast delivery and 100% legit folks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mackey",
          "Nb_Reviews": 2,
          "Date": "2021-06-14T22:27:02.000Z",
          "Titre": "Easy Purchase",
          "Contenu": "Smooth transaction, proper, valid game key delivered as promised.  There was a nominal transaction fee from their bank for using my Visa card, of which I was unaware.  Otherwise, no other problems & I still got my game on sale, well below retail.  I like saving money.   So, thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gunnlaugson, Pascal",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T04:31:56.000Z",
          "Titre": "First time using your service",
          "Contenu": "First time using your service, recommended via a friend. Got a game for my birthday and was very pleased with how quick and easy it was, as well as the layers of security you have on your purchases. Felt safe and comfortable with providing my information knowing that. Will use you again. Regards"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shoop, Michael",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T20:09:44.000Z",
          "Titre": "Super easy purchase process",
          "Contenu": "Super easy purchase process, codes delivered in timely manner, overall positive experience."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "HDinis09",
          "Nb_Reviews": 6,
          "Date": "2021-04-15T07:37:58.000Z",
          "Titre": "Great first experience!!",
          "Contenu": "Had my first experience with this website and it was great. Was the only website that had a cheaper deal. The process was very easy. All required codes to confirm the purchase were given within a few seconds. As for the customer support or refunds, i have no input, given that it was not required."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Fromholtz, Sindre",
          "Nb_Reviews": 1,
          "Date": "2021-06-14T23:06:32.000Z",
          "Titre": "Dl gamer review",
          "Contenu": "It was a very straoght forward page which did seem quite legitThe order came really quick and it was easy to connect my origin account for getting my codeYou also follow tour customers up with emails with info and receipts and i will recommend you to fellow gamers😄"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Pepper",
          "Nb_Reviews": 1,
          "Date": "2022-01-30T05:39:21.000Z",
          "Titre": "Quick and easy customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Mitchell",
          "Nb_Reviews": 3,
          "Date": "2021-05-08T22:57:17.000Z",
          "Titre": "Been using dlgamer for almost 6 years…",
          "Contenu": "Been using dlgamer for almost 6 years exactly now and have never had any issues. Keys are delivered promptly and the prices are very reasonable. Just as as readily buy from dlgamer as I would from other similar trusted sites like greenmangaming or humble bundle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy Beans",
          "Nb_Reviews": 1,
          "Date": "2021-06-27T00:50:07.000Z",
          "Titre": "The customer service was fast and…",
          "Contenu": "The customer service was fast and friendly! I had some trouble finishing an order so I contacted their customer service department. Not only was my query answered, the order itself was back on track in mere minutes.Kudos to you, DLGAMER Crew!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nguyen, Bill",
          "Nb_Reviews": 1,
          "Date": "2021-05-30T23:23:58.000Z",
          "Titre": "Good store, buy with confidence!",
          "Contenu": "I've used DLGamer to buy a few racing sims and dlc, and it definitely works and is a legit site! I was kinda worried because the site looks a bit sketchy, but no worries, the service works no problem! Got my keys immediately with no issues!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Luke",
          "Nb_Reviews": 3,
          "Date": "2021-04-20T01:42:07.000Z",
          "Titre": "I've bought here before, I'll buy here again!",
          "Contenu": "DLGamer us a reliable, trustworthy site. Stock info and turnaround times have always been accurate, and deliver is usually instantaneous. All this at prices often the best on the market. Yep, I'm gushing. They're one of my favourites."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Shiells, Murray",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T18:38:00.000Z",
          "Titre": "Always a good experience",
          "Contenu": "Always a good experience. Good prices."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hobib Ali",
          "Nb_Reviews": 25,
          "Date": "2021-05-11T01:52:56.000Z",
          "Titre": "Received the game key in a few minutes so well done DLGAMER",
          "Contenu": "Received the game key in a few minutes, Activated just fine on Steam, 1st time i used DLGAMER, was the cheapest on the net by a wide of £20 which is huge so well done to them.I will use DLGAMER againBought RE8 on release day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 4,
          "Date": "2021-05-15T05:10:33.000Z",
          "Titre": "Great service, had an issue with quick and great resolution to it",
          "Contenu": "I had an issue with my purchase that said it was a duplicated key but was refunded very quickly and the issue was resolved quickly and in a great way so even though it was not what I expected to happen the resolution was perfect."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "GenericMoron",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T16:17:44.000Z",
          "Titre": "Good service",
          "Contenu": "I was initially skeptical, but the service was very good. I got my key within a few minutes of payment and it unlocked my game on the selected installer. I was able to save money on the game and therefore I am very happy."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Explogan",
          "Nb_Reviews": 4,
          "Date": "2021-06-01T11:28:37.000Z",
          "Titre": "Great customer Service",
          "Contenu": "Had region issues with my code twice but the customer service reps resolved the issue both times within 12 hours and then credited my account to apologise for the inconvenience. Very very impressed"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Bryant",
          "Nb_Reviews": 3,
          "Date": "2021-09-17T20:24:26.000Z",
          "Titre": "A great place to great steam key for a…",
          "Contenu": "A great place to great steam key for a big discount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Chen",
          "Nb_Reviews": 2,
          "Date": "2021-04-29T23:00:55.000Z",
          "Titre": "bought \"For the King\" from DLGAMER for…",
          "Contenu": "bought \"For the King\" from DLGAMER for $8. Easy purchase. Unfortunately paypal wasn't available but I was able to use my credit card. They just give you a steam code to redeem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kim",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T23:07:03.000Z",
          "Titre": "good customer service",
          "Contenu": "had an issue with my purchase where a pre-ordered game did not give me a code. spoke with customer service and they helped me clear up the issue within the hour. very happy with dl gamer"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Otto",
          "Nb_Reviews": 4,
          "Date": "2021-10-04T20:24:27.000Z",
          "Titre": "Great deals",
          "Contenu": "Great deal, steam key and no issues so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nunya",
          "Nb_Reviews": 11,
          "Date": "2021-06-05T20:04:35.000Z",
          "Titre": "DLGamer is not some grey market sketch…",
          "Contenu": "DLGamer is not some grey market sketch fest. They provide legitimate products at awesome discounts, and immediate delivery. Thank you DLGamer. I will be recommending you to my friends."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Boulanger, Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T17:18:53.000Z",
          "Titre": "I was septic at first but...",
          "Contenu": "I was septic at first but I once I received my steam game code ans then was working, all my down was wrong. Don’t hesitate. Buying from Quebec Canada and always happy to save 😁"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mark",
          "Nb_Reviews": 6,
          "Date": "2022-02-25T01:02:54.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, easy and my game is available in Canada"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Zaganul",
          "Nb_Reviews": 3,
          "Date": "2021-05-16T17:42:10.000Z",
          "Titre": "Their customer support is top notch",
          "Contenu": "Their customer support is top notch. I didn't get the deal I wanted because of some tehnical issues but they were really fast to reply and return my money. Completely trustworthy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChaosDuty",
          "Nb_Reviews": 4,
          "Date": "2021-09-13T22:51:23.000Z",
          "Titre": "Paid for a game and received the key…",
          "Contenu": "Paid for a game and received the key right away"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T03:57:43.000Z",
          "Titre": "spoungebob",
          "Contenu": "Bought game.  Key worked.  Cheaper than steam."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sebastian Fors",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T22:59:12.000Z",
          "Titre": "No Problems",
          "Contenu": "No Problems, EZPZ"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Manuel Horácio Ferreira",
          "Nb_Reviews": 3,
          "Date": "2021-12-01T18:16:46.000Z",
          "Titre": "Everything worked perfectly"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "LeDron",
          "Nb_Reviews": 5,
          "Date": "2021-06-19T17:21:02.000Z",
          "Titre": "Great service, great prices",
          "Contenu": "I accidentally purchased a game I already owned and they refunded me without any further questions or delay, and even let me keep the game key for free as a bonus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stellar Force",
          "Nb_Reviews": 6,
          "Date": "2022-10-18T18:15:25.000Z",
          "Titre": "Steam game code worked",
          "Contenu": "I bought a Steam game code, and it worked and was cheap."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Damian K.",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T21:07:26.000Z",
          "Titre": "Perfect.",
          "Contenu": "Didn't know what to expect from relatively unknown store, but everything went perfectly fine. I got my key instantly, everything works. Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "baba boi",
          "Nb_Reviews": 2,
          "Date": "2021-11-26T07:19:10.000Z",
          "Titre": "Good support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert M.",
          "Nb_Reviews": 2,
          "Date": "2022-11-23T10:25:59.000Z",
          "Titre": "Fast delivery of key",
          "Contenu": "Fast delivery of key! Easy shopping experience"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Niels Duus Nielsen",
          "Nb_Reviews": 15,
          "Date": "2023-08-11T12:07:39.000Z",
          "Titre": "No hustles",
          "Contenu": "No hustles, as it should be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty Burningham",
          "Nb_Reviews": 6,
          "Date": "2021-08-17T15:40:47.000Z",
          "Titre": "Five stars",
          "Contenu": "Got my game key quick, it was the key I wanted, and there weren’t any hidden delivery charges or anything. Great site for saving some money on games."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "nathqan min",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T06:58:08.000Z",
          "Titre": "very god site",
          "Contenu": "very good site. hope that the process goes quickly"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "GE",
          "Nb_Reviews": 3,
          "Date": "2023-04-21T20:39:06.000Z",
          "Titre": "All is right",
          "Contenu": "Great and simple experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Hunter",
          "Nb_Reviews": 3,
          "Date": "2021-03-12T16:48:36.000Z",
          "Titre": "Easy and simple; just a normal transaction",
          "Contenu": "Easy to use but outdated looking website. Nothing wrong, nothing shady, just a simple transaction that worked the way it should have. No problems here."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Stainley Lebron",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T18:01:52.000Z",
          "Titre": "Total War: Warhammer III",
          "Contenu": "Extremely fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "yaboismitty",
          "Nb_Reviews": 5,
          "Date": "2021-09-07T08:03:11.000Z",
          "Titre": "All OK",
          "Contenu": "Ordered key, waited ~1m, received it. All OK"
        }
      ]
    }
  ]
}