{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.adv-sound.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T20:17:37.000Z",
          "Titre": "Couldn’t get seal on ear piece",
          "Contenu": "Couldn’t get seal on ear piece.  Case doesn’t quite fit.  There is noticeable gap, when closed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blaine Mathieu",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T16:51:57.000Z",
          "Titre": "Don't stay in any better than the rest",
          "Contenu": "Similar to the other memory foam earpieces, these squeeze and then expand into your ear canals and feel good at first. But gradually this pressure squeezes them out of your ears. This is the 5th after-market vendor I have tried and I am now officially giving up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Petty",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T17:44:10.000Z",
          "Titre": "Don't work as well as the ones that come with the Airpod Pro 2",
          "Contenu": "I ordered the medium ones, which is what I use for other products. The product claims to improve noise cancellation by making a superior seal with your eye. In my tests, they made less of a seal than what comes with the air pod pro 2. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "feverfive",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T23:35:16.000Z",
          "Titre": "I dislike having to rate so low",
          "Contenu": "I dislike having to rate so low, but I must given utter lack of seal I get from these (size L).  The choice to not publish measurements is questionable.  I utterly wasted $$ for 3 pairs of tips that give me zero seal.  Quality of materials seems fine, but does me no good.  I now have oval-shaped ear tips that will sit in a drawer, unused )hopefully I can trade them at some point in the future."
        },
        {
          "Note": 1,
          "Lieu": "KZ",
          "Pseudo": "Yevgeniy Vatutin",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T05:40:56.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, I bought the first M5-TWS “Jet Black” headphones in September 2022, they worked for me for about 1 month, then the left earphone stopped holding a charge, that is, after a full charge, it started working for 5-10 minutes and was completely discharged.  I wrote to support about this, they kindly sent me a new pair of headphones, M5-TWS “Accent Red” I was happy, but they worked well for exactly 1.5 months, and then the same problem appeared with the right earbud, about 3 minutes of work  and complete discharging.  I wrote to the support service about this, and they sent me a new pair of M5-TWS “Accent Red” earbuds again, I received them the day before yesterday, yesterday I opened them, and no matter how I tried, the right earbud does not hold a charge at all, not a single minute.  now I have 3 pairs of non-working headphones, 3 pairs cost about $450 but play for $0+ support stopped responding to me ("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael H. Villela",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T18:37:24.000Z",
          "Titre": "Problem with the Module Y Earbuds",
          "Contenu": "Bought the Module Y Earbuds earlier this year.  Opened the box and proceeded to charge up battery's. After the charging process I followed the instruction's and tried out the earbuds. Linked to the Bluetooth device on my laptop and proceeded to listen to some music.  The pairing of the earbuds was quick except for the following.  The Right earbud performed as expected it did Very Well.  The Left earbud was non-responsive.  No sound other than a couple of tones (beeps).  I checked the power connections which appeared okay.  Went to the ADV-sound Support page and followed the directions for resetting the earbuds.  No difference in the functioning of the Left earbud. My initial analysis is that either the base unit and/or the Left earbud are not receiving any power. The Right earbud is receiving power.I have contacted the ADV support group and have established an email correspondence."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Ángel Luis Martínez Manzano",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T14:18:27.000Z",
          "Titre": "Very very disappointed.",
          "Contenu": "Hello there,Love your products and the problem is more on the side of the logistic. You charge me 25$ for a sending that could be 1-2 weeks and that's expensive AND the problem is that the parcel have not arrive in all this time. It takes almost two weeks to arrive to New York, not to mention to Europe.If I know this could happen I would not even buy it. I doubt even do it again, even on the kickstarter side when I support on adv X and suggest to put a USB-C... I'm really disappointed in you, for several reasons and now this experience on shopping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gokmen T.",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T22:34:02.000Z",
          "Titre": "Haven’t received order.",
          "Contenu": "Haven’t received order.. can’t even find the confirmation email anymore. Hopefully I’ll be surprised soon. We’ll see."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 3,
          "Date": "2020-10-01T20:02:46.000Z",
          "Titre": "I had the buds for one week and already…",
          "Contenu": "I had the buds for one week and already had to throw one away because it broke from plastic housing and gets waterlogged with sweat causing a screeching sound. No bueno."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "KIYOMI YAMADA",
          "Nb_Reviews": 2,
          "Date": "2021-06-09T14:14:45.000Z",
          "Titre": "I have problem for ordering at your…",
          "Contenu": "I have problem for ordering at your e-shop. I sent a mail to ask counter measure but no reply from your side.ORDER #ADVSP18912 CANCELATION"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Henson",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:19:34.000Z",
          "Titre": "DO NOT BUY!",
          "Contenu": "DO NOT BUY!! Cheap quality and horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ivan Alfredo Martinez",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T17:50:50.000Z",
          "Titre": "I was sent the wrong product and sent…",
          "Contenu": "I was sent the wrong product and sent an email seeking a replacement and I have had no reply."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mateus",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T00:50:56.000Z",
          "Titre": "False advertisement",
          "Contenu": "The custom ear piece is not as advertised, do not buy CIEMs from here"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Sherman",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T23:31:44.000Z",
          "Titre": "I never got my head phones I got 6 ear…",
          "Contenu": "I never got my head phones I got 6 ear plugs I want my refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy Schulman",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:54:12.000Z",
          "Titre": "They do not work",
          "Contenu": "They do not work. Complete waste of money. Does not even fit. Wish for a refund."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shareen Narayan",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T17:25:51.000Z",
          "Titre": "Totally disappointed",
          "Contenu": "Totally disappointed! The product was clearly used and damaged.. such a waste of my money. the fitting was so damaged that it did not even fit in the airpod. After struggling to make it work, threw it in the garbage as it was no use to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty Shapiro",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T19:48:58.000Z",
          "Titre": "where is my order",
          "Contenu": "where is my order. I haven't recieved it yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 3,
          "Date": "2021-02-01T22:02:44.000Z",
          "Titre": "Product didn’t fit",
          "Contenu": "Product didn’t fit. Didn’t improve the sound quality"
        },
        {
          "Note": 1,
          "Lieu": "BM",
          "Pseudo": "Tom Coelho",
          "Nb_Reviews": 4,
          "Date": "2020-01-20T18:12:30.000Z",
          "Titre": "I still have not received the product I…",
          "Contenu": "I still have not received the product I ordered!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Rosenboom",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:46:11.000Z",
          "Titre": "These tips make my ears itch and don’t…",
          "Contenu": "These tips make my ears itch and don’t stay in as well as the Comply memory foam tips. Maybe it’s just me. Love the color options, though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark ANthony",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T16:19:32.000Z",
          "Titre": "Good but not revolutionary",
          "Contenu": "I like that they are attached to their own pieces, however i had to use the original earpieces over these and fit them inside to make them actually seal. I have the comply ones and the foam in these don't rebound as fast (good thing, the fast rebound tends to hurt the ear). However, if you remove this from your ear and put it back, the foam is a little slow moving so it wont seal and may not even sense the headphone is in your ear. So you are left leaving it in your ear. The perfect fit was this, i had to remove the foam from the attachment (snaps off), and physically remove the rubber inner ring, and then take the original apple earpiece, and put this foam inside that. This is the only comfy way to get a good seal every time."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Lui Chi Hung",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T16:37:07.000Z",
          "Titre": "I understand the cause of the covid 19…But feeling no good",
          "Contenu": "I understand the cause of the covid 19 cases. Will be delays, but You didn't take the initiative to update the information.Until I asked... You only have updated information... You don’t have that model. I’ll send my model make one , This model you use online shop for others. but the cost is me ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William G.",
          "Nb_Reviews": 2,
          "Date": "2020-09-14T15:12:06.000Z",
          "Titre": "Largest size still too small",
          "Contenu": "I ordered the largest size available, looking for a replacement for the existing foam Air Pods Pro tips that I had that felt just a bit too small. These were even smaller than the ones I had, and I didn’t even use them for 1 day before switching back to my old ones. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Guy Martin",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T17:59:11.000Z",
          "Titre": "Custom TWS Bluetooth headphones",
          "Contenu": "I ordered the custom bluetooth IEM style, and while I expected a lengthy wait, it was almost 5 months.  That is not what is the most upsetting though - the communication on status of my order was lost several times, and I had to keep pestering them to figure out where my order was."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T16:50:59.000Z",
          "Titre": "The modelx headphones are the older…",
          "Contenu": "The modelx headphones are the older model, that I wish I didn't buy. The case is pretty cheap. with the lid not opening very easily and if you leave it on the charger it is always charging. It isn't magnetic to pull the ear buds in, so you have to constantly make sure the case is closed right. Also, they aren't usb-c and don't have wireless charging. The buds are good enough for the $40 I paid. I do like the fit and the foam plugs that it comes with are a great addition. The sound quality is great. Great wide sound, for any buds, with bass and highs solid. However, they are very quite. Seems like you can't get them loud enough especially if you're walking around a busy area with them. Wouldn't recommend buying them unless they were cheaper."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Tremonte",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:48:40.000Z",
          "Titre": "Negative Experience, Model 3 Custom",
          "Contenu": "Customer support has long lead times before providing repetitive canned responses, ultimately leading to no resolution for poorly fitting custom IEM tips, as well as intermittent earbud sound cut. They have not taken responsibility over product quality issue in the 3 weeks since initial contact. I’ve withheld my review long enough to assure that it is in fact an issue being ignored, and other consumers should be informed of this experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Seth Kostek",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T16:04:03.000Z",
          "Titre": "Fail",
          "Contenu": "They fit just fine; however, they DO NOT block any sound. The little plastic inserts do nothing to stop sound at all. Sorry this is a fail. I ended up filling them with hot glue and now they actually do some sound reduction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon Carter",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T21:34:54.000Z",
          "Titre": "These are not as comfortable as the…",
          "Contenu": "These are not as comfortable as the apple ones. kept falling out of my ears. Tried all tip sizes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Larkin",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T18:03:20.000Z",
          "Titre": "The ear monitor tips did not fit the in…",
          "Contenu": "The ear monitor tips did not fit the in the ear molds properly."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ershad Vahid",
          "Nb_Reviews": 4,
          "Date": "2020-12-14T03:58:39.000Z",
          "Titre": "So close yet so far away",
          "Contenu": "I really wanted to like the advanced type x plus but going through two brand new pairs i noticed a very pronounced driver flexing in both buds any time I touched any of the buds for any readjustments or trying to properly insert them into my ear always hearing the dreaded click noise which is frustrating for the TWS of this caliber. The ear tips are included either don’t provide a proper seal or the ones that do aside from being uncomfortable they accentuate the driver flex every time you touch the buds by pop and click sound  you are pretty much stuck to use what is supplied and literally any other tips from any other manufacture although are more comfortable fit and better seal than the default tips will not allow the case to close properly.As for the sound the Type X + version puts a lot of emphasis on bass so much so that the mids are butchered and highs are severely recessed like listening to an AM radio.It’s disappointing to see the plus version that is suppose to be an upgrade has been a disappointment when compared to its predecessor the Type X which although a bit older has significantly better clarity and a respectable bass with out butchering the mids and highs to provide a far better listening experience than the type X Plus version.Having said that I am patiently waiting for the Type Y and can only hope for it to have a better sound quality than the type X Plus which at least for me was an utter disappointment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony L",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T22:01:11.000Z",
          "Titre": "I purchased the memory foam ear bud tips",
          "Contenu": "I purchased the memory foam ear bud tips for my Apple AirPods Pro because they kept falling out of my ears. The ad stated the ADV foam tips would stop them from falling out. While they are a bit more secure, they still fall out. I tried all 3 sizes and none work well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Noel Jennings",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:11:00.000Z",
          "Titre": "Didn’t meet expectations",
          "Contenu": "Not the size I was hoping for. I ordered what I believe is their biggest size and it still doesn’t seal like I hoped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NORMAN ERWIN",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T23:32:57.000Z",
          "Titre": "I bought the ADV Xtra Large Ear Bud Tips",
          "Contenu": "I bought the ADV Xtra Large Ear Bud Tips for my Apple Ear Buds.  The tip on the left ear works great.  The tip on the right ear does not seal out outside sounds nearly as well as the one in the left ear.  Perhaps my right ear opening is different than anyone else?  I had the same problem with the ear bud tips that came standard with my Apple Ear Buds with all sized provided."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benjamin Carroll",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T16:48:25.000Z",
          "Titre": "Fine product, faulty logistics.",
          "Contenu": "The product is good and works as advertised, but I ordered two three-packs and only got one. I've sent a request to address this to the support team, and I'll be happy to update this review when they make it right.Edit 1: 2 stars has become three stars. Support has reached out to me to say that they'll fix the problem right away.Edit 2: The missing product is on its way. Still three stars for now, will hit four when the product has arrived safely!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nik Vandiver",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T06:34:04.000Z",
          "Titre": "One of the tips didn’t last as long as…",
          "Contenu": "One of the tips didn’t last as long as the other so I had to buy a replacement. I had to buy one for $75. A discount would have been nice! I love my ADV Eartune Fidelity tips but the customer service has been mediocre."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evan R. Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T18:45:43.000Z",
          "Titre": "Maybe wrong size, maybe just meh ¯\\_(ツ)_/¯",
          "Contenu": "I might've enjoyed them more if I'd chosen a larger size so they'd fit a bit tighter, but my review of the mediums (and I wear the mediums that came with my AirPods Pro) is that they're fine, not really more or less comfortable than the included tips and I didn't notice much if any improvement to sound quality or isolation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Flores",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T17:15:14.000Z",
          "Titre": "A product improvement would be to have…",
          "Contenu": "A product improvement would be to have silicon covers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Klopfer",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T00:38:51.000Z",
          "Titre": "Sound a bit muffeled and..",
          "Contenu": "Sounds a bit compressed/muffeled and the unit is a bit larger than I hoped"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Misha Gattengo",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T20:24:54.000Z",
          "Titre": "Product fits well",
          "Contenu": "Product fits well, but it took over 3 months to receive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sadie Kientz",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:21:09.000Z",
          "Titre": "Foam Earbud Tips",
          "Contenu": "These foam tips made use of my airpods pro much more enjoyable. My headphones haven't stayed in, and stayed sealed this well since I got them. Just would've hoped to not pay as much as I did for shipping, though I did appreciate that I received them in 2 days!"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Melvin Ong",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T18:01:15.000Z",
          "Titre": "Ordered Eartune Fidelity U for my IER…",
          "Contenu": "Ordered Eartune Fidelity U for my IER Z1R. Best tips with this IEM after trying lots of eartips. Solved the recessed mids problems with some songs, especially male vocals.  Hearing more elusive details too. The only thing making me hesitate to give a 5 stars rating is shipping is so so and expensive."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Mwaniki Munene",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T13:22:23.000Z",
          "Titre": "Almost there...😉",
          "Contenu": "The purchase & shipping experience is hustle free. ✔️ The audio delivery is exquisite. The vocals come out crisp - including overtones on individual artists. The treble could do with a slight touch up. The bass is just right for the required balance and all the instrumentation is also showcased decently. Inclusion of foam tips would further enhance the experience. A steal for the package. I recommend them to anyone who'd like to enjoy a total sound experience for a decent prize."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Schack Lindemann",
          "Nb_Reviews": 2,
          "Date": "2021-01-03T09:35:31.000Z",
          "Titre": "Fine service - super product",
          "Contenu": "Fine service, but would prefer more shipping options. I bought the Model Y and they are nothing short of excellent. Solid build quality, phenomenal sound and stable connectivity. Everything you could ask for even at twice the price. 👍🏼🤩"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Louis Martin",
          "Nb_Reviews": 2,
          "Date": "2021-11-06T02:22:18.000Z",
          "Titre": "Love the earpeices",
          "Contenu": "Love the earpeices, they sound great. The fit is perfect and even when using them for a long time.Only thing is the left peice seems to detach from the headphone easily when removing them. Overval not a showstopper & obviously does not affect anything during use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Winogrand",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T02:22:32.000Z",
          "Titre": "The Eartune Fidelity UF-A I ordered…",
          "Contenu": "The Eartune Fidelity UF-A I ordered didn't fit (who knows, could be my ear canals!) But the customer service at ADV was excellent. Very quick and responsive to try anything to make it right. I would order from them again for sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard S",
          "Nb_Reviews": 3,
          "Date": "2022-03-10T16:36:34.000Z",
          "Titre": "The ear tips fit great and are very…",
          "Contenu": "The ear tips fit great and are very comfortable.  They form an excellent seal on my ears.  They fit the same as other custom fit IEMs I own - the difference being these are softer vs harder plastic for the others. The stretch for me is to have been more accurate forecasting how long it would take to build them.  I was expecting 3-4 weeks and it was 6+."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T Bruggeman",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T16:19:10.000Z",
          "Titre": "Nice replacement",
          "Contenu": "Nice replacement, but wish the memory foam was a tad thicker to make it more comfortable. Overall a major upgrade from the out of the box Apple ear tips."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie Archer",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T23:27:59.000Z",
          "Titre": "The ear cushions do seal better making…",
          "Contenu": "The ear cushions do seal better making for a quieter environment. Does improve sound quality some."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "DJ  Saldana",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T15:03:52.000Z",
          "Titre": "Really like them",
          "Contenu": "Really like them,  sounds great, connect very easy to my old iPhone 7,  only gripe is that they are so sensitive that sometimes while i am putting in my ear I disconnect the call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam Harris",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T21:16:57.000Z",
          "Titre": "Good quality and they do their job",
          "Contenu": "Good quality and they do their job. Bought the XL and was hoping they’d be a little larger (darn my big ears!). They seem in line with other products LG size wise but comfortable foam and fun to have color options. Would recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Byram Robert",
          "Nb_Reviews": 3,
          "Date": "2021-08-20T14:50:45.000Z",
          "Titre": "Excellent personal service",
          "Contenu": "Excellent personal service. The only issue was the AirPods Pro adapters were missing and I had to go back the next day for those in order to use the tips."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Septien Patterson",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T03:11:01.000Z",
          "Titre": "Great value, and sound quality",
          "Contenu": "I’m impressed with the balanced sound, and dot style design. Fits snugly in the ear without discomfort; comfortable to sleep in. Full touch controls and good Bluetooth range are great as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Lee",
          "Nb_Reviews": 2,
          "Date": "2020-02-06T03:16:05.000Z",
          "Titre": "Staff of Advsound I met at NAMM 2020…",
          "Contenu": "Staff of Advsound I met at NAMM 2020 were very friendly and informative!The were eager to provide information about their products and let me try them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 11,
          "Date": "2023-06-09T03:38:51.000Z",
          "Titre": "Twice now the buds have not charged in…",
          "Contenu": "Twice now the buds have not charged in the case. I make sure the case is charged as I think I'm only getting one charge out of it. Otherwise these are good,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyron Willians",
          "Nb_Reviews": 3,
          "Date": "2020-08-06T12:16:12.000Z",
          "Titre": "Has a great sound and build",
          "Contenu": "Has a great sound and build. Would like more of a flat response or enhanced bass if enhanced treble."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 3,
          "Date": "2022-01-17T16:26:33.000Z",
          "Titre": "I liked your service",
          "Contenu": "I liked your service but I got the wrong size ear tips so they won't work for me"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T08:46:39.000Z",
          "Titre": "Very good the my IEM",
          "Contenu": "Very good the my IEM and soft and my ear feel good. If have more model can choice. I will make more."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "P Tan",
          "Nb_Reviews": 6,
          "Date": "2021-10-13T01:57:58.000Z",
          "Titre": "Tin P1 custom tips",
          "Contenu": "Great fit and good sound isolation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Schneider",
          "Nb_Reviews": 3,
          "Date": "2020-02-06T19:55:21.000Z",
          "Titre": "Final product is awesome",
          "Contenu": "Final product is awesome. Communication during the process sucks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon H",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T04:57:44.000Z",
          "Titre": "The goods I ordered were packed tightly…",
          "Contenu": "The goods I ordered were packed tightly for mailing.  Not one thing was out of place, broken, taken out, the things I ordered arrived still packed very well.  Great service, pleasant people, and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Singer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T22:25:06.000Z",
          "Titre": "Great improvement to my AirPods",
          "Contenu": "Great improvement to my AirPods. Went from them falling out of my ears to good fitment and better sounding music."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherman Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T03:37:52.000Z",
          "Titre": "Great Company! ADV simply has great service and a…",
          "Contenu": "ADV simply has great service and a great product. One without the other hurts a company. ADV is strong in both. I ordered the same size tips (Large) that I had with my Air Pod Pros. The fit wasn’t exactly right. I heard sound with the new tips in the noise canceling mode. I sent one email to customer service. The reply came in less that 2 hours. They explained what they felt the issue c was in terms I could understand. They sent the new size out immediately and that solved my problem! And didn’t charge me for them! I would definitely recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warren Stinson",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T03:30:07.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Works better than the Apple ear tips. These keep them in your ears way better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Moy",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:20:55.000Z",
          "Titre": "Great product/Fast shipping",
          "Contenu": "Shipping of my purchase was fast.  I got exactly what I ordered and am very happy with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wpnX",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:53:02.000Z",
          "Titre": "Crazy fast shipping. Top quality product.",
          "Contenu": "I ordered these and they were on my doorstep within days. This is my 2nd time ordering from ADV. Their foam airpod pro eartips are far and away the highest quality I’ve purchased and used. They fit flawlessly in the case, drastically improve the noise cancellation, and are easier to install than the silicone eartips provided by apple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Robin",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T18:58:29.000Z",
          "Titre": "If you decided to buy AirPods",
          "Contenu": "If you decided to buy AirPods, these are a must for the best sound. The best upgrade for the money you can get."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adolfo Valdez",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:28:18.000Z",
          "Titre": "Just wow!!",
          "Contenu": "Just wow!!! As a musician this type of comfort is a new level, been playing drums and using finally my AirPods and oh man!!! They feel secure, sound cancellation has become high end better than your regular ear tips. They never fall off due to sweat or shaking your head. 100 out 10 highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T14:41:05.000Z",
          "Titre": "They work well.",
          "Contenu": "They work well, they just seem a little bit for a medium. They hurt one of my ears, and I may end up ordering a small. I used the medium for iPod ear tips, so I thought this would be the same size, but apparently I was inaccurate. ** EDIT**The company responded and sent me a smaller size for my left ear, which fit perfectly. I just wear a different size for each ear. This company is great, their customer service is great, and I highly recommend the product to everyone! I love this product and wear them constantly.. I will be buying them for everyone in my family that has the AirPods."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Loor",
          "Nb_Reviews": 5,
          "Date": "2023-04-12T06:53:19.000Z",
          "Titre": "The ear impressions are really comfortable",
          "Contenu": "The ear impressions are really comfortable and I can wear them for a long time. They really enhance the sound by blocking noise. I would like to have received more detailed instructions to insert the custom buds into my ears. I had to use trial and error to figure out the optimal way to insert them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L C",
          "Nb_Reviews": 1,
          "Date": "2021-01-09T06:32:58.000Z",
          "Titre": "Great Seller of Audio Products and Accessories",
          "Contenu": "Great seller of audio products and accessories! Had an issue with an order and they were prompt, courteous, and kind with replacing an incorrect shipment. I've purchased a few things from both Adv and their sister site, Eartune, without issue. Heard about the site from an audio reviewer website that had reviewed the Model 3 Wireless headphones (which were the first thing I bought from ADV). Since then I've purchased a wireless bluetooth receiver, a USB C to 3.5mm headphone adapter, as well as some eartip replacements! Overall a great site to buy some underrated products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Welsh",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T18:05:56.000Z",
          "Titre": "Wish I’d seen them sooner.",
          "Contenu": "I couldn’t believe the difference these tips made in the sound quality of my Second Gen AirPod Pros.  The the sound quality, volume, bass and noise reduction all very noticeably better. Plus the improved seal makes them much more secure. They stay tight and secure when running and biking. And for the first time i can wear they kayaking.  I always feared one would fall out right into the water, but not anymore. If you’re unsure of the size, I’d go with the large. The memory foam like material can be squeezed, then expands in your ear to give that improved seal. The price is a huge bargain for the increased quality of sound you get."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WILTON PALERMO",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T17:42:49.000Z",
          "Titre": "Great sound when you find the proper fit",
          "Contenu": "Great sound when you find the proper fit, which wasn't on the tips included in the box, but rather from the Model X tips that I saved when my X's case got destroyed. I'm my case those were the dome shaped tips.Great battery life and great band for the buck $$. I've hammering this puppies for over a week now that I can tell that there's s huge difference between them and the Model X. I fell in love with Adv-sound products several years and and I always recommend their products, very competitive in price, great construction and great sound quality.So far I have Model 3 Bluetooth(2017), Lightning(2018) and USB-C(2021) DAC Amps, Model X, Model Y and the Gaming Earbuds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Hurlebaus",
          "Nb_Reviews": 2,
          "Date": "2020-02-11T19:22:32.000Z",
          "Titre": "Sleepers are great",
          "Contenu": "The Sleepers ear buds have worked great for me. I listen to my classical radio station from Boston with a portable HD pocket radio while I sleep. The fidelity and dynamics are quite sufficient even at low levels.  They are comfortable and offer great isolation. An added plus,  the wires get better reception than my other IEM's."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Demonetized",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T17:20:12.000Z",
          "Titre": "Nismo Gaming Jr. (They are better than their 30$ price tag , worth the money)",
          "Contenu": "I've received their amazing headphones a month ago. The left ear piece fell out due to error, but they didn't hesitate to provide me with a replacement in hope that it was a faulty pair. The sound is extremely good for the price. I would suggest these to content creators who need great sound quality, including that it works very well with VR Headsets that include a 3.5mm Headphone Jack."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace N",
          "Nb_Reviews": 3,
          "Date": "2021-07-16T23:39:21.000Z",
          "Titre": "Missing Package Made Right",
          "Contenu": "I had an issue where my package was marked delivered by USPS but it wasn’t in my mailbox. I emailed support and was contacted right away that a second package would be sent to me and confirmed my address. I got the new package a few days later (along with the original one as well— thanks USPS). I was so impressed by how prompt and helpful they were in making things right even though it was obvious the mistake wasn’t on their end!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha Nolan",
          "Nb_Reviews": 4,
          "Date": "2023-05-01T19:42:45.000Z",
          "Titre": "A+++!!!",
          "Contenu": "Love the pink color and the memory foam material. These feel much more comfortable and stay in your ears longer than the silicone ones that come with the airpods."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "radambe",
          "Nb_Reviews": 4,
          "Date": "2021-06-17T17:13:25.000Z",
          "Titre": "Custom tips for Z1R",
          "Contenu": "Fantastic experience doing business with ADV. I ordered a set of custom tips for Sony IER-Z1R. ADV delivered a perfectly fitting set of tips in far less time than originally estimated, and was also able to deliver 3D scan files of my ear impressions for further use."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul M",
          "Nb_Reviews": 2,
          "Date": "2019-12-27T16:13:01.000Z",
          "Titre": "Stunning Sound Quality With  Accessport 2",
          "Contenu": "I just received my new Accessport 2 a few days ago.I play FLAC music files (CD quality) through my iPhone XR  using some Shure in-ear buds.Sound quality with the Accessport 2 amp/DAC is astonishing.Superb clarity, detail and musicality"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ashish Kaushik",
          "Nb_Reviews": 2,
          "Date": "2021-04-15T14:10:59.000Z",
          "Titre": "Superb Products and customer service.A++",
          "Contenu": "I have been a regular customer of Adv products right from model 3 time (which is still a great.earphone btw) and when they were called advanced sound.I am truly a fan of their customer service.Although I am based in Australia but they have always responded with utmost sincerity - understanding every aspect and responding in a truely supporting way.I had an issue with a Model 3 last to last year and a Model X+ few days back and they have always taken care of me Love your products and the customer service. A++Cheers,Ashish"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blair Johns",
          "Nb_Reviews": 1,
          "Date": "2020-11-29T16:24:23.000Z",
          "Titre": "Model 3 Mobile",
          "Contenu": "As always, an excellent and high-quality product. The Model 3 mobile earbuds are  something I’ve been wanting for quite some time and they have not disappointed. Excellent sound quality. Advanced is a gem shining in the mountain of other products out there. I look forward to many years of enjoyment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neal Smith",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T16:53:27.000Z",
          "Titre": "Very happy about the discount fix, Good People",
          "Contenu": "Well besides an e mail to get a discount on my first order didnt reach me till after i made my first order, everything was good. Gt3s are a bit bulky for my ears, but sound pretty good when powered. Free shipping didnt take long so overall im happy. ( a couple weeks later i was pleased to receive a message that i got a discount, good people, im very happy now)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Keller",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T21:15:45.000Z",
          "Titre": "Freaking Fantastic",
          "Contenu": "Best sound company out there.  Custom ear tips are the bomb and they have serious audiophile product to fit any budget.   I snap up everything I can afford the moment it hits market.  Give them all your money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaquanda Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T17:03:59.000Z",
          "Titre": "These are the best war bud covers ever",
          "Contenu": "These are the best ear bud covers ever! They stay secure in my ear and allow all the features of my airpod pros to work correctly. They are super comfortable and my favorite color was an option! Will recommend and re purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Pelletier",
          "Nb_Reviews": 4,
          "Date": "2021-02-01T23:55:33.000Z",
          "Titre": "Shipping was awesome and the quality is…",
          "Contenu": "Shipping was awesome and the quality is great. I got a medium yellow set and the yellow color is awesome. The foam feels a lot like a traditional earplug. When I get them set just right they fit and hold way better than the stock silicone ones. Sometimes I find them uncomfortable and I prefer the small silicone apple ones. My friend wears the smalls as well and said these foam mediums somewhat hurt his ears. I gave the 3rd set to another friend who is going to try them out. I will try to get one of them to buy a small set. ADV is a super quality company."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "S Menon",
          "Nb_Reviews": 1,
          "Date": "2021-02-07T18:36:20.000Z",
          "Titre": "A customer for Life!",
          "Contenu": "In a time where good products are often let down by bad service, I have nothing but the highest respect for the standards ADV seems to have set itself for Customer Support. They have always gone above and beyond the call of duty to keep their customers happy. I am a customer for life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Carpenter",
          "Nb_Reviews": 3,
          "Date": "2020-08-06T15:43:39.000Z",
          "Titre": "Phenomenal for the price!",
          "Contenu": "At the retail price, I would probably give these 4 stars, as I would have liked to see AptX supported and a case that would hold the buds with my aftermarket tips.The supplied tips fit in the case, but are too shallow to reach into my canals.But, for 50% discount, you can't beat these for balance of frequencies, clarity and range! Plus, these rest relatively flush in the ear, if you are a side sleeper.and choose to use them in bed. I have tinnitus and they assist with that as well.Phenomenal for the price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T13:56:16.000Z",
          "Titre": "I've always gotten good service from…",
          "Contenu": "I've always gotten good service from Adv Sound.  Orders arrive quickly and in great shape, and in the many orders I've placed, I only had one problem with a product which was handled easily and quickly.  Their customer service, from my point of view, is exemplary and a model for other companies to follow.  Every thing about them has always been top notch.  I've been purchasing from them since their first Kickstarter campaign, and have yet to have even a slight hiccup.  I don't know of many other companies that can claim that after several years in business.  It is my hope that they continue producing this level of quality products for several more years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Gruber",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T22:52:21.000Z",
          "Titre": "Eartune Fidelity Tips for my JH Audio Layla AION",
          "Contenu": "I bought an expensive pair of Universal Layla Aion IEMs and was anxious to get Eartune Fidelity Tips (custom ear tips). Although the ADV team only communicates via e-mail (not phone), they are the consummate professionals. They told me that they would have to get their hands on my Laylas since they had not made Eartunes for that IEM before. I took the leap of faith and sent my precious new earphones to a company with which I never dealt before. ADV was fast and efficient, walking me through every step of the process to reassure me that my Laylas were in good hands. The product is terrific, making it a joy to listen to my music. I have already ordered two more pair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Schnelle",
          "Nb_Reviews": 4,
          "Date": "2021-08-03T01:47:18.000Z",
          "Titre": "M5-TWS",
          "Contenu": "Appropriate timely delivery. Took a couple of days trying different tips.Shells are really good looking, but very slippery, somewhat hard to pick up cleanly or change tips; minor quibble though.Still quite early in listening. I just use these with iPad and iPhone. Still trying tips. Tried some aftermarket New Bee foam tips, but they are too long to fit in charging case.Will update later. So far, good 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darman  Reyes",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T18:11:09.000Z",
          "Titre": "happy with product",
          "Contenu": "customer service responded quickly to any questions i had and even went one better giving me 3d images of my physical ear molds. an added bonus to this purchase. the earbuds feel comfortable and ok right off the bat."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Daniel G",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T00:32:46.000Z",
          "Titre": "Consistent quality.",
          "Contenu": "Been buying iem's from ADV for a couple years now and I have had nothing but positive experiences with the few products I own. For the price it will be incredibly difficult/impossible to find iem's or headphones that match the build and sound quality that they offer, and I am honestly excited to see what new stuff they come out with in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Price",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T04:22:48.000Z",
          "Titre": "Deprived Ears",
          "Contenu": "I bought these after seeing the pair that works with the android phone on Touch of Modern. I came directly to the site to check the specs then I saw ADV-M5 and bought them instead. I already have a pair of Samsung IconX for everyday phone use. However, ADV-M5 exceeded my expectations and have become my music and movie sound device, saying earbuds makes them sound cheap. As a musician and movie buff, I love the bass and sound quality. Prior to writing this review, I went to Spotify and listened to a Vocal playlist with the Gear IconX then the ADV-M5. I was blown away by the crisp sound and hear the distinct notes and reverbs with the ADV-M5 which I could not with the Gear IconX. I never knew what I was missing until I listened. A job well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ent2000",
          "Nb_Reviews": 5,
          "Date": "2021-08-19T18:00:00.000Z",
          "Titre": "I needed to get replacement custom…",
          "Contenu": "I needed to get replacement custom sleeves for one of my IEMs and get new sleeves for a different set of IEMs. I had used a different company prior, and while I never had issue with them, they did sleeves for a small number of brands. I discovered ADV and learned they could make custom sleeves to meet my needs, but also supported a wider variety of brands. I got my impressions and sent them. As soon as I did, they asked for the tracking number so they could both ensure receipt and notify me when they received them.Turn around was very fast. Faster than I expected. The sleeves fit perfectly. I'm very happy with the service and look forward to using ADV again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richland Mboa",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T13:03:41.000Z",
          "Titre": "Great Product",
          "Contenu": "This is the second product i purchased from ADV. Great sound and isolation.Manufacturing and shipping times were on point taking into consideration that everything is backed up right now.Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diego Pineda",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T21:21:51.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product! The m5-tws has excellent sound quality for a Bluetooth item. Also it works great as a headset. The ordering process was also straightforward. I look forward to being an advsound customer in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "prannoi none so vile",
          "Nb_Reviews": 1,
          "Date": "2020-01-01T02:58:10.000Z",
          "Titre": "excellent piece of art and sound ..",
          "Contenu": "excellent piece of art and sound ... 20 to 40,000Hz yes sir it proved, recommend audiophile to give it a try , Mids - 4.5 /5Highs - 5/5Lows- 3.5/5built quality - 5/5 , design , ultra light weight .. best wire mic - may not be compatible with all smart phones , low voice capturing . sound mono on calls"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2020-06-24T14:21:24.000Z",
          "Titre": "Great tool for work & play",
          "Contenu": "Saw an ad for ADV's higher-end monitors and was intrigued, then very surprised when I saw they had a $30 in-ear with a boom mic. Snatched a pair for conference calls at work as well as some gaming. What I read indicated that these would be a big step-up from my old Sk***c***y's. Honestly I was surprised by how little bass there was in the mix vs my old set, and at how clear everything else was. First Impression: Impressive clarity and 3d sound.-Fit is decent, my ears are hard to fit and I appreciated them including multiple size tips. Definitely wearable for multiple hours even with the mic.-Boom mic is awesome and improves clarity for gaming, inline mic is totally adequate for phone calls and the remote's mute feature is welcome.-Build quality is light & plastic, but totally on par with the low price.I have recommended these to all of my friends. A must-have for the price, in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Charles",
          "Nb_Reviews": 3,
          "Date": "2020-03-19T15:42:27.000Z",
          "Titre": "I purchased",
          "Contenu": "I purchased. I was not happy with my purchase. (My problem - not yours.) Your customer service with a superb attitude are beyond great! I experienced no problem returning the product and you credited my credit card quickly. Wow....just WOW!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Liam Martin",
          "Nb_Reviews": 3,
          "Date": "2021-07-20T18:18:36.000Z",
          "Titre": "The wireless earphones are exactly as…",
          "Contenu": "The wireless earphones are exactly as advertised. Great sound and very comfortable to wear while sitting listening to music or exercising at moderate to high levels. Would recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Serhii",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T07:40:50.000Z",
          "Titre": "Great earphones with lightning connector",
          "Contenu": "Delivery to Europe is expensive but fast. The first purchase discount arrived into the mailbox AFTER submitting the first order...The earphones I got (for iPhone) are great for their price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T16:56:53.000Z",
          "Titre": "very fast shipment",
          "Contenu": "very fast shipment. The XL foam for AirPods worked for me, whereas other brands were falling out while hiking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Bozzonetti",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T18:16:33.000Z",
          "Titre": "ADV were receptive to all my inquiries…",
          "Contenu": "ADV were receptive to all my inquiries and timely in all their responses. I particularly appreciate that they made sure I was aware of any potential compatibility difficulties my IEM, Moondrop Blessing 2, may have with their Eartune Fidelity eartips. They could have said nothing, but instead confirmed the risks with me knowing I could then decide not to proceed with purchase. This gesture resonated with me and is not something I feel most companies would do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Floyd Trice",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T22:28:04.000Z",
          "Titre": "Great sound for great price",
          "Contenu": "I have been buying earbuds from these guys for a long time. Started when they were under a different name.Always fast shipping and the products are the best. Got rid of my Bose and polks a long time ago. I think I have about 5 pair of different models. Listening to hi quality music is my escape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Hill",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T17:04:50.000Z",
          "Titre": "AWESOME CUSTOM EAR TIPS !!",
          "Contenu": "I ordered the Eartune Fidelity Custom Ear Tips for my KZ ZS10 Pro Ear Buds. I sent the ear impressions in that I had made at my audiologist. ADV made them perfectly to fit MY ears and I am completely blown away at the quality. The combination of these ear tips with my ear buds blows the $1200 custom IEM's I had tried before right out of the water !! Thank You ADV !! :))"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vishnu Shriram",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T01:40:31.000Z",
          "Titre": "Hands down the best customer service",
          "Contenu": "This is the second time I am buying Advanced products, and the quality of the products and the attention to detail - in the product as well as the customer service is second to none. Truly a pleasure doing business with Advanced, stay the same as you grow bigger and better guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2021-02-03T21:06:33.000Z",
          "Titre": "I purchased these after a lot of…",
          "Contenu": "I purchased these after a lot of research as a gift for someone who doesn't necessarily care about sound quality. I hear they’re fantastic, and I have plans to buy the m5 myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diego Flores",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T13:46:08.000Z",
          "Titre": "I was a little skeptical at first but..",
          "Contenu": "I was a little skeptical at first but Great upgrade from my regular ones that come with the AirPod pros! Much more comfortable and my earphones don’t slip out like they used to when I workout, great buy."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Felix Lenk",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T17:39:03.000Z",
          "Titre": "Very happy with my M5 1D.",
          "Contenu": "Very happy with my M5 1D.They resolve very clearly, with smooth mids and a punchy and quick base. The stage has a medium size (compared to a pair of AKGxMassdrop K7xx) with fantasticly dedicated instruments.But besides their resolution, the biggest advantage I see in them is the speed! They go from 100 to 0 in no time. Beryllium does its job here! Well worth it!The housing is indeed a bit large and could be a bit nicer, compared to the awesomely designed housing of the TWS. But the size ofcourse acts as a ressonance body. Also I find it kind of aesthetic. The cable is nice aswell, while I dislike the carrying case. Bought a Peli 1010 instead, after I saw someone shot it with a pumpgun on yt.All in all I'd say, they're worth the price. For me, this is definitely the way I want to consume music.Nice job ADV!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Cohn",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T17:13:02.000Z",
          "Titre": "Review for M5-TWS Custom",
          "Contenu": "On the Adv sounds website, all instructions to get a good ear mold and the time it will take from them receiving the ear molds to finish earbuds shipped to the customer is very accurate, there customer service is very prompt in answering all questions and very accurate. When I received the earbuds and followed the instructions they were paired with in 2 minutes when I put the earbuds in my ears I have never had a better fit. After 1-2 weeks wearing them ever day they fit perfectly sealed all outside sounds out and the music quality is great. From my dealings with Adv sound I would highly recommend this company, look no further these are perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "aychsee",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T22:48:51.000Z",
          "Titre": "It is an audio business.",
          "Contenu": "Made an audio product, advertised it via email that I subscribed to, sold it to me, and delivered a quality package that delivers what it says it does."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shreyas",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T05:52:38.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product and an even awesome customer service. The sound is much better now and there’s no sound leak. Doesn’t slip out of my ear so easily as with the stock ones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "essaa_arlene",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T18:57:06.000Z",
          "Titre": "Miracle savors",
          "Contenu": "I’m so very pleased to rate these tips. I was allergic to the ones that came with the AirPods Pro and these tips where a miracle savor for me. Just about to give the pros away, tried  buying other tips that’s didn’t help ADV thank you 5 stars for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aubrey Beardsley",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T22:55:27.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, good packaging. No issues with ADV or ordering from their site. Would probably order from them again if I need more audio stuff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rubere",
          "Nb_Reviews": 2,
          "Date": "2020-02-17T21:35:48.000Z",
          "Titre": "you couldn't ask for a better company",
          "Contenu": "I recently bought my third product from these guys and they have been excellent. Any issues were immediately addressed, the products are amazing and they have made me a fan for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T02:23:43.000Z",
          "Titre": "Responsive customer service and fast, practical shipping option",
          "Contenu": "Haven't tried the product yet...but customer service was quick to respond to my question before buying, and I appreciated ADV shipped via USPS instead of forcing an unnecessary premium shipping option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel H",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T18:46:31.000Z",
          "Titre": "Amazing Quality",
          "Contenu": "This duel headphone stand is ultra high quality. Built like a tank (and heavy), you can tell they cared about the quality control. Definitely worth the premium price tag."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Miles",
          "Nb_Reviews": 2,
          "Date": "2023-02-04T17:37:45.000Z",
          "Titre": "I love them so much really comfortable",
          "Contenu": "I really love wearing the ear tips way better then the Apple Original I’m definitely going to buy some more in the future I can wear them all day long and they don’t fall out my Apple ones fall out all of the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Stein",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T18:02:38.000Z",
          "Titre": "Good fit and seal.",
          "Contenu": "I bought the custom fit ear plugs at NAMM where they made the molds the same day.  They were delivered promptly a few days after the show.  The fit is very good for me and the seal is tight without being uncomfortable.  They fit very deeply into my ears and are very comfortable and secure. I recommend them and are a good value for the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BW",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T23:09:33.000Z",
          "Titre": "Fast responses, real answers",
          "Contenu": "Very fast responses with real answers. You get someone who knows what they're doing, not a script from an underpaid call-center."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Hernandez",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T22:18:37.000Z",
          "Titre": "ADV Fan! Love your products!",
          "Contenu": "I currently own the Model 3, Model X, and the Nismo Jr. I am extremely satisfied with the quality sound, as well as the quality service I received when I had questions. Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Hillam",
          "Nb_Reviews": 4,
          "Date": "2020-04-06T14:01:32.000Z",
          "Titre": "ADV's Low Profile earbuds are terrific!",
          "Contenu": "Sometimes, you just need some good noise attenuating buds that are comfortable and easy to launch. Look no further. These are well made and sound great, for such a low cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew H",
          "Nb_Reviews": 3,
          "Date": "2020-11-12T23:26:08.000Z",
          "Titre": "Very prompt processing of order and…",
          "Contenu": "Very prompt processing of order and delivery of product. I’ve never had a bad experience with ADV. Products are well designed and offer great value for the money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Fronczak",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T21:32:47.000Z",
          "Titre": "Customer service was amazing",
          "Contenu": "Customer service was amazing. The support team was fantastic at working with me to receive my IEMs and get my custom molds created. Will definitely be purchasing again in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phong Pham",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T19:40:50.000Z",
          "Titre": "ADV has great customer support",
          "Contenu": "ADV has great customer support! They’re also very understanding when I wasn’t satisfied with a couple of products. I’ll still buy from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sad customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-15T14:04:48.000Z",
          "Titre": "Hi-Fi in your hand!",
          "Contenu": "ADV m5 tws don't hurt my ears like galaxy live, galaxy buds, Airpods 2nd gen, and Jabra EA 75t. Sound quality is really good, it's just annoying to pair and the case is quite fat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ Painter",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T18:04:40.000Z",
          "Titre": "product came and I'm using them",
          "Contenu": "product came and I'm using them. I still wish you had the option for a variety pack instead of 3 pairs in the same colors, people wanna mix it up sometimes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T15:34:42.000Z",
          "Titre": "They work exactly as advertised",
          "Contenu": "They work exactly as advertised. The memory foam fits snugly in my ears and the sound quality is unaffected. Would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Pope",
          "Nb_Reviews": 3,
          "Date": "2021-03-17T04:19:44.000Z",
          "Titre": "Amazing Customer Service",
          "Contenu": "During a recent winter storm my package was lost and never delivered. When I messaged the customer service team they immediately sent another and were completely understanding. I am thankful for this experience and love the product that I received!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MZ A.",
          "Nb_Reviews": 2,
          "Date": "2019-12-20T16:10:56.000Z",
          "Titre": "Sent me exactly what I asked for",
          "Contenu": "Sent me exactly what I asked for, with the exact information written on their site. They also helped me gain points for a year old order!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Skinner",
          "Nb_Reviews": 2,
          "Date": "2021-06-21T14:39:14.000Z",
          "Titre": "I'm seriously impressed by this company…",
          "Contenu": "I'm seriously impressed by this company customer service. They got my earbuds out to me very quickly and at a great value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 6,
          "Date": "2021-03-02T01:13:41.000Z",
          "Titre": "Love these",
          "Contenu": "Love these - had a pair from another vendor and they didn't allow the top to close properly.  These fit great and allow my case to properly close.  Just ordered a second pair for my daughter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Brennan",
          "Nb_Reviews": 2,
          "Date": "2020-07-14T22:44:26.000Z",
          "Titre": "Daughter loves them!",
          "Contenu": "Daughter loves them much more comfortable then others she used. Sleeps with them every night now for week and no longer wakes up with soreness."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Luis torres",
          "Nb_Reviews": 4,
          "Date": "2020-08-13T21:25:59.000Z",
          "Titre": "Amazing equipment",
          "Contenu": "Amazing equipment, delivery very fast to my home and when you star listen your music the sound is aaaaaamazing thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T19:10:44.000Z",
          "Titre": "Fast shipping and amazing sound…",
          "Contenu": "Fast shipping and amazing sound quality! Will definitely purchase again when I need more headphones! ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Behrens",
          "Nb_Reviews": 2,
          "Date": "2020-07-01T14:26:12.000Z",
          "Titre": "Always great sound from this company",
          "Contenu": "Always great sound from this company. Nothing super fancy, but just nice fitting, well tuned ear buds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Duarte",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T18:21:10.000Z",
          "Titre": "Great measurable improvement in comfort and sound cancelation",
          "Contenu": "Great company/product.   My Airpods Pro 2 are so much better and more comfortable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Caplan",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T17:00:24.000Z",
          "Titre": "Adv is an awesome company they truly …",
          "Contenu": "Adv is an awesome company they truly  stand behind their products and do a wonderful job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nathan",
          "Nb_Reviews": 2,
          "Date": "2020-03-17T04:52:06.000Z",
          "Titre": "Love my in-ears!",
          "Contenu": "good product - company was very communicative through the process and i felt like they cared about getting it right"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T17:31:20.000Z",
          "Titre": "Quick service for a great product",
          "Contenu": "The earphones shipped and arrived pretty quickly. I've ordered a couple of their older products a couple years ago and, shipping was good, it was fine theb, now it's better. Nice to see Advance show their growth over the years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pasha Sarraf",
          "Nb_Reviews": 2,
          "Date": "2020-05-20T17:18:41.000Z",
          "Titre": "Absolutely love it",
          "Contenu": "Absolutely love it.   Hugely helpful for zoom calls.   Total sound control.  Great quality.   Amazing.   Love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Mathieus",
          "Nb_Reviews": 2,
          "Date": "2020-01-16T19:51:43.000Z",
          "Titre": "excellent place with excellent customer…",
          "Contenu": "excellent place with excellent customer service.  Its really hard to beat the quality they give for the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT POOLE",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T21:23:26.000Z",
          "Titre": "Excellent fit",
          "Contenu": "Excellent fit. Glad I ordered them, as normal inserts were always falling out."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Diane G",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T20:45:31.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Best customer service ever. Every time I got a problem with a pair of headphones, it was quickly fixed or replaced. I trusted ADV on Indiegogo and so glad I did. I love every purchase I made. Love the sound of every pair of earphones. They are all worth well above their price. I only have good things to say about ADV."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T20:53:43.000Z",
          "Titre": "Great customer service",
          "Contenu": "I reached out to customer service with a question, and I was surprised by how quickly they responded."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffery Mazur",
          "Nb_Reviews": 3,
          "Date": "2019-12-24T16:51:52.000Z",
          "Titre": "I love this company and there customer…",
          "Contenu": "I love this company and there customer service. They are fast to respond and always courteous.I love my ModX ear buds. I have a set for work and a set for home. Great job Advance Sound!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Aman Thethy",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T17:58:11.000Z",
          "Titre": "No issues with service",
          "Contenu": "No issues with service. In the past customer support requests for answered and solved very quickly."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Oleh Kovalenko",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T19:10:27.000Z",
          "Titre": "Nice supporting while processing order",
          "Contenu": "Nice supporting while processing order. In the end tips were more than I expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowan Womble",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T14:53:01.000Z",
          "Titre": "I haven't had an issue",
          "Contenu": "I haven't had an issue, so I haven't had much service, but shipping was fast and it seemed well-packed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vsj",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T18:16:45.000Z",
          "Titre": "These are my favorite earphones now",
          "Contenu": "These are my favorite earphones I own. They got here very fast. Bluetooth connection is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Harmon",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T22:36:52.000Z",
          "Titre": "The buds work as advertised",
          "Contenu": "The buds work as advertised. Fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elias Yeri",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T17:28:20.000Z",
          "Titre": "Custom eartips",
          "Contenu": "They sound awesome omg 😲 and also they fix perfectly on my ears, I don't have to be worry about my ears tips falling out anymore. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Hatfield",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T02:55:06.000Z",
          "Titre": "The fitment and quality of the product…",
          "Contenu": "The fitment and quality of the product is excellent and standing up to the test"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kemamo Ho",
          "Nb_Reviews": 2,
          "Date": "2020-12-02T18:09:36.000Z",
          "Titre": "Products for the 21st Century",
          "Contenu": "I own a Air & a Fly. Both great products.My latest purchase is a Nismo 3D.  Great sound and I like having a boom mike for both calls and gaming.  I will order again directly when a new product catches my eye."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Mathieus",
          "Nb_Reviews": 2,
          "Date": "2020-01-09T16:09:56.000Z",
          "Titre": "Love the site and the products",
          "Contenu": "Love the site and the products, I have bought way too many to be honest, not disappointed at all"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Patrick.W",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T05:22:33.000Z",
          "Titre": "The best site for inear headphones",
          "Contenu": "The best site for inear headphones. Cheap and the quality is impressive. Good support. I love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Evans",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T11:40:12.000Z",
          "Titre": "Works perfectly with my AirPod Pros",
          "Contenu": "Great product!! Couldn't be happier with the custom tips for my AirPod Pros!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Brown",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T23:13:23.000Z",
          "Titre": "Great customer service and in ears fit…",
          "Contenu": "Great customer service and in ears fit perfect!!! Will do business again !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel O",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T16:31:02.000Z",
          "Titre": "quality all around",
          "Contenu": "customer service is very prompt, product is high quality and site is easy to navigate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Charles",
          "Nb_Reviews": 3,
          "Date": "2020-11-23T17:41:55.000Z",
          "Titre": "M30 in ears! — outstanding!",
          "Contenu": "I’ve purchased three pair of M30 in ears!!Great service and a great product for drummers! Very good, natural sound!"
        }
      ]
    }
  ]
}