{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.usbmemorydirect.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nia",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T21:09:50.000Z",
          "Titre": "Definitely not worth the price paid.",
          "Contenu": "The flash drives are cheap, flimsy, and overall a huge disappointment. The picture is completely shifted, stretched, and out of focus, despite asking them to fix it but they never did. They sent me a picture for approval before shipment. I noticed the image was not centered so I asked them to fix it, and they literally just took a different picture of the same drives the next day without reprinting. They already had printed the entire order before even sending me the picture for approval, so I don't know what the point was of me approving anything. Definitely not worth the price paid. Overcharged for thin, flimsy plastic with a skewed image. The drives were shipped directly from China, so I doubt the company really even sees the final product in person. I highly doubt I will be ordering from this company again, and I do not recommend if they are your first choice. Do some research for other companies first before deciding on this one!*Update: since UMD wants to be defensive, I actually did not receive a sample of the drive I ultimately ordered. If I did, I most definitely would not have gone with that choice. Second, the drive is literally 2\" in diameter, and the image provided is much larger especially in dpi. I don't understand how you can shrink an image and it still comes out blurry. Lastly, I have not been reached out to and my order has not been fully refunded, so please reviewers do not believe everything that they respond with! Most of it is them trying to cover themselves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JJ Chen",
          "Nb_Reviews": 3,
          "Date": "2020-01-25T00:38:52.000Z",
          "Titre": "Worst quality ever",
          "Contenu": "Worst quality ever! I order quite lot of 8g and 16g usb drive from them, there are almost 70% of them are not working at all. After copy the images to those usb drive, the image will appear to have across line in the middle! As a business owner, it is big damage for my business!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harvey Heller",
          "Nb_Reviews": 1,
          "Date": "2018-11-07T18:45:10.000Z",
          "Titre": "Terrible Experience",
          "Contenu": "Terrible. They sent me a proof that I accepted and produced a different color that was unreadable. I had to keep them at a discount and buy new from them to meet a deadline! Never again.  I have done business with them before but this never has happened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich Nelson",
          "Nb_Reviews": 1,
          "Date": "2018-11-14T21:19:37.000Z",
          "Titre": "Total lack of Customer service",
          "Contenu": "Total lack of Customer service. Ordered from them last year, they messed up a couple of things, minor, but none the less, messed up. I had no reason that I would receive a replacement before my deadline, so I used what I had. NOT a good presentation. They contacted me this year. I told them my problem and they swore that I'd be happy and gave me a discount. Like a fool, I bought their line and ordered again. A worse problem this time. When I called them, they told me I could reload the drives with new material. They were not interested it my returning the drives for new ones, offering me any compensation, NOTHING! When I asked if I understood correctly, that they would do nothing, my question was met with silence. They truly DO suck..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2021-08-06T21:02:25.000Z",
          "Titre": "Customer Service Helped Me, With my error.",
          "Contenu": "My first order. I have ordered 32 gig and 64 gig memory USBs.  Many weeks later when they arrived from China. I was shipped all 32 gig USBs. Just reached out to Sales person to see response.I will update..After speaking with my Salesperson, We discovered that I in fact did order the 32 gig. So it way my error. My only concern, was that the drives were shipped from China and I was not told that. This took extra time. Also some of the drives did not write as the same speeds. Some are fast and some write slower. The final product is out the door and the customer will give me final feedback.With all that said. I will do business with them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Hurt",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T00:19:55.000Z",
          "Titre": "The wording is TOO light that it can…",
          "Contenu": "The wording is TOO light that it can nearly be read!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T21:59:15.000Z",
          "Titre": "Communication was poor and the day my…",
          "Contenu": "Communication was poor and the day my drives were supposed to arrive I come to find out they weren't even shipped. And not only did they not ship, it took an additional month due to them having to change my order because of a mistake on their behalf. I received my order AFTER my deadline of needing them so this affected my clients because they couldn't receive their full order on time. Salesman was nice and respectful, but was also poor with communication. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Hanna",
          "Nb_Reviews": 1,
          "Date": "2020-04-14T13:12:40.000Z",
          "Titre": "The elastic straps are breaking off at…",
          "Contenu": "The elastic straps are breaking off at the attachment point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martin A Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:58:08.000Z",
          "Titre": "The delivery date was not met…",
          "Contenu": "The delivery date was not met and I was not contacted that it would not be met until I reached out then I found out the individual was out of the office and the temp replacement never contacted me until I started the ball rolling"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monica B",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T22:47:00.000Z",
          "Titre": "Love the design and style of my usb…",
          "Contenu": "Love the design and style of my usb thumb drives. However I’ve been through about half of them and two of them do not work so far. Not sure how many from my batch total will not work. It’s disappointing since I did pay for the bulk and need all of them to work, since they are given to clients. Haven’t decided if I’ll be reordering from this company or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Bautista",
          "Nb_Reviews": 1,
          "Date": "2018-10-31T20:50:18.000Z",
          "Titre": "My experience",
          "Contenu": "the process was easy and great but the printing on the tins for  usb's did not come out as I expected   I had ordered them in the past they are silver and looked fine with the logo printed on them  This order the silver on the tin was a different type of metal or color silver that reflected light making it harder to see the logo"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Carlson",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T20:24:45.000Z",
          "Titre": "Engraving was a bit smaller than…",
          "Contenu": "Engraving was a bit smaller than expected and not clean but still very much meets my needs   You delivered what I ordered in a timely manner"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca Ferguson",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T19:34:14.000Z",
          "Titre": "I would like to purchase items that do…",
          "Contenu": "I would like to purchase items that do not come from China. Can you supply made in America products?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Satpal Singh",
          "Nb_Reviews": 1,
          "Date": "2018-11-07T19:10:34.000Z",
          "Titre": "I didn't receive any reply regarding my…",
          "Contenu": "I didn't receive any reply regarding my current order of custom USB.  Some usb were not working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. J. Raven",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T18:35:16.000Z",
          "Titre": "Great with a small caveat",
          "Contenu": "Everything was great and the product was delivered as promised on time and form. The only thing I didn't like was that the \"rush\" charge (separate from the UPS delivery charge) was conveyed to me when I didn't have any other choice but to pay it because of the timing. This charge should have been discussed with me on day 1."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AlexLawrence",
          "Nb_Reviews": 6,
          "Date": "2021-06-25T08:53:41.000Z",
          "Titre": "Excellent service, customized usb flash drives",
          "Contenu": "Excellent service. I really liked the premium quality of custom printed usb drives. They also developing customized usb flash drives which is great thing about them. Affordable prices and also offers Discounts."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Steven Miles",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T09:15:05.000Z",
          "Titre": "I was assisted well on my hardware…",
          "Contenu": "I was assisted well on my hardware needs for my PC. Excellent service!"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Mia Patel",
          "Nb_Reviews": 8,
          "Date": "2021-11-26T11:09:46.000Z",
          "Titre": "I use their device for my college study…",
          "Contenu": "I use their device for my college study . Here I bought the Memory card and save all my works there.  I would actually buy more ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 6,
          "Date": "2020-12-21T21:28:30.000Z",
          "Titre": "Great service from Marina but not from UPS.",
          "Contenu": "Great service from Marina, as usual! But the shipping from UPS was not good. Several days delay and they finally delivered it at 8:30 pm on a Friday. Then I received two more emails from UPS, one telling me that the order would be delivered on Saturday, and the other said Monday. Meanwhile, it had already been delivered, albeit late."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Irene Byers",
          "Nb_Reviews": 1,
          "Date": "2019-12-19T20:01:03.000Z",
          "Titre": "Customer service GREAT!",
          "Contenu": "We as well as our client who ordered the USB items are disappointed in the darkness of the background color so much that the wording is difficult to read. This is not as per the artwork provided.In spite of original difficulties with this order, we were treated with the greatest courtesy by Lana Gorelik and know without a doubt that she bent over backwards to help our client needs. Thank you Lana!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krystal Campbell",
          "Nb_Reviews": 1,
          "Date": "2016-12-28T22:31:55.000Z",
          "Titre": "Easy to work with, flexible representative, small hiccups were easily corrected.",
          "Contenu": "Our representative was very easy to work with.  We had a couple very small hiccups that were very quickly and easily corrected. Our rep was very flexible and assisted with pricing to meet our needs.  We confirmed final order apprxo 12/13 - 12/15 and received on 12/27... in my opinion, that is a very quick turnaround time, especially during the holidays!!  Would definitely recommend USB Memory Direct."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Briana",
          "Nb_Reviews": 1,
          "Date": "2016-08-25T19:57:29.716Z",
          "Titre": "Larger sized USBs",
          "Contenu": "I was looking for larger sized USBs for branding of a government project. The USBs arrived on time. They work well. My only complaints are that some of the tops look a little bent and the printing wasn't mirrored correctly: When you flip it over to side B the logo appears upside down, but it can be flipped on the side to appear correctly.Good job overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hansa S",
          "Nb_Reviews": 1,
          "Date": "2015-01-06T16:22:56.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "David Krymowski was my accounts manager and he provided us with exemplary service. We received our online proof within half an hour and David was available to answer any questions regarding the design and product specifications. He went out of his way to ensure that the finished USB drives looked exactly the way we wanted them to. Kudos to David and the rest of his team for providing quality service in such a timely fashion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Hretz",
          "Nb_Reviews": 1,
          "Date": "2018-05-17T16:42:46.000Z",
          "Titre": "This was our first order with USB…",
          "Contenu": "This was our first order with USB Memory Direct and we didn't really know exactly what we wanted.  Cindy G was so patient with us while we sent her our logo files and color changes several times until we got just what we wanted.  We asked for samples and got them right away so we could make educated decisions of what we wanted to order.  Our order processed quickly and we have our first order to begin distributing already.  Pricing is very competitive and quality is great!  We will definitely be using USB Memory Direct in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Pellegrini",
          "Nb_Reviews": 4,
          "Date": "2020-02-24T20:22:02.000Z",
          "Titre": "Happy over all",
          "Contenu": "The drives look great, but the color is a little less vivid than I would have liked. Next time I will look a little closer to the proofs. The company is easy to deal with, the price was good and the delivery had no issues. I would do business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Preparedness Consulting Group",
          "Nb_Reviews": 1,
          "Date": "2015-01-02T15:12:39.000Z",
          "Titre": "Preparedness Consulting Group USB Project",
          "Contenu": "David Krymowski is our account manager and provided excellent customer service and communication.  The art department captured our company needs on the USB drive that we give to each of our clients.  We are extremely pleased with he final product and will order from David and USB Memory Direct again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caitlin O'Reilly",
          "Nb_Reviews": 2,
          "Date": "2019-03-26T18:18:31.000Z",
          "Titre": "Working with Enrique was a great…",
          "Contenu": "Working with Enrique was a great experience. He was responsive to the emails and gave me detailed information I needed over the phone. Shipping did take a while but other than that, great experience!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2017-01-03T17:23:58.179Z",
          "Titre": "Great once we had a confirmed rep",
          "Contenu": "Once we had a confirmed rep handling our account/order everything transpired great, very helpful in putting the job together and the product received looks wonderful! Thanks Nicholas!"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Emma Cairo",
          "Nb_Reviews": 3,
          "Date": "2017-04-25T11:32:20.000Z",
          "Titre": "I loved the product they provided and …",
          "Contenu": "I loved the product they provided and Amanda was super helpful and accommodating with the quotes - BUT the product didn't arrive in time for the event I bought it for. USB Memory Direct had confirmed the date ( a Friday ) and they paid for overnight shipping, but due to a storm in China, the package came on Monday. I asked a few days prior if the package was shipped, and Amanda checked, but they didn't ship it till one day before the delivery date. Not her fault - but in my opinion, the company should ship it an extra day in advance to make sure they meet the client's delivery request. After I explained to them that I only ordered the product for this specific event, they ended up refunding me, which I think is a great and fair service on their part for this specific incidence."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenfab Cleaning Solutions",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T19:57:47.000Z",
          "Titre": "A Solid Business Partner",
          "Contenu": "Great customer service. Very responsive to our needs and very prompt. Product quality was also very good and the price competitive. We will be ordering again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Gerow",
          "Nb_Reviews": 1,
          "Date": "2015-03-26T14:52:42.000Z",
          "Titre": "Great Experience",
          "Contenu": "The USB drives I ordered were a great value, the imprinting was of high quality, as were the drives. The colors were vibrant, and they arrived quickly after ordering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Verdung",
          "Nb_Reviews": 2,
          "Date": "2019-05-14T13:10:42.000Z",
          "Titre": "Great response time and turnaround",
          "Contenu": "Great response time and turnaround.  The finished product looked fantastic with our logo!  Thank you USB Memory Direct!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin Jones",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T21:19:19.000Z",
          "Titre": "Good",
          "Contenu": "Good. Very timely. Lasering a little duller than image given for sample. Still happy though"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Pellegrini",
          "Nb_Reviews": 4,
          "Date": "2018-10-17T15:55:09.000Z",
          "Titre": "Excellent customer service!",
          "Contenu": "Excellent customer service (thanks Cindy!). Product was as expected. Easy process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loren Colburn",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T18:01:09.000Z",
          "Titre": "Very unique item",
          "Contenu": "Very unique item, somewhat fragile. Super service and friendly staff."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Evan Larkin",
          "Nb_Reviews": 1,
          "Date": "2017-07-24T20:59:36.000Z",
          "Titre": "Good product and service",
          "Contenu": "Good product and service, delivered reasonably quickly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Martinez",
          "Nb_Reviews": 1,
          "Date": "2019-10-10T22:36:45.000Z",
          "Titre": "Linoove the usb but shipping took too…",
          "Contenu": "Linoove the usb but shipping took too many days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renea Somerville",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T22:30:35.000Z",
          "Titre": "The thumb drives look very nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse Woolridge",
          "Nb_Reviews": 1,
          "Date": "2018-11-13T17:44:52.000Z",
          "Titre": "Final product is beautiful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Phillippe",
          "Nb_Reviews": 1,
          "Date": "2019-05-14T20:36:48.000Z",
          "Titre": "Union Thumb Drives",
          "Contenu": "JUST A LITTLE CONFUSING."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah C. Cornish",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T10:05:04.000Z",
          "Titre": "great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P. J. Raven",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:46:39.000Z",
          "Titre": "They are very efficient and the product is great…",
          "Contenu": "They are very efficient and the product is great. However, I was notified of a \"rush\" charge at a moment where I couldn't say no because of my timing. This was not quoted to me the day before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PowerScreen Crushing & Screeni",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T18:01:33.000Z",
          "Titre": "Exactly as ordered & fast shipping!",
          "Contenu": "The product came exactly as ordered & quick delivery!See picture attached of one of our machines made into a USB/flash drive (for customer manuals). I put them on our company Christmas tree for additional ornaments!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yaphet J Comer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:52:13.000Z",
          "Titre": "Was the first time doing dealings with…",
          "Contenu": "Was the first time doing dealings with this business and the last time i had to look for a custom USB dealer! Very professional! Very firm and efficient in making sure you get what you are looking for! I will be ordering all of my USBs from them from here on out! Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LUZ ALVARO",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:36:39.000Z",
          "Titre": "Great dealing with this business",
          "Contenu": "Great dealing with this business, they follow through with your order from start to finish. I'll do business again with them in the future as tge need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Babwe",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T09:02:00.000Z",
          "Titre": "Six Stars",
          "Contenu": "Fast. Accurate. Thorough. Professional. Cordial. Cost effective. Gina Marcos, company rep, was stellar. Anyone looking for excellent service and excellent products would be wise to choose USB Memory Direct.  Does this sound like a fake review from a plant? It's not. Call Gina at the company. She has my permission to provide my contact info to anyone who wants to communicate with me about my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary C",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:25:57.000Z",
          "Titre": "The product is great",
          "Contenu": "The product is great, and the salesperson was very patient and helpful. Terrific delivery time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billie Jo White",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:17:46.000Z",
          "Titre": "Joseph is always pleasant to work with",
          "Contenu": "Joseph is always pleasant to work with. He makes re-ordering simple & smooth. USB's look nice & never have an issue with them not working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:01:01.000Z",
          "Titre": "Prompt delivery",
          "Contenu": "Prompt delivery, Items are high quality. company logo imprint is very good and text is nice, sharp and extremely legible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen Chambers",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:31:39.000Z",
          "Titre": "The flash drives exceeded my…",
          "Contenu": "The flash drives exceeded my expectations.  The built-in Busy light is also a good feature.  I much appreciate the polite and friendly interactions with the Senior Account Executive Lana Gorelik."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Chambers",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:24:57.000Z",
          "Titre": "I had such a great experience working…",
          "Contenu": "I had such a great experience working with Daniel at USB Memory Direct. He was super responsive and handled my project with great care. Will definitely use him again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:37:18.000Z",
          "Titre": "Gina made my ordering process a breeze",
          "Contenu": "Gina made my ordering process a breeze.  I gave her a list of my needs and she broke down all my options with me.  She was quick and responsive with all of my questions.  This is my second time ordering through USBMemoryDirect and I will use them again in the future.  Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob w Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:33:41.000Z",
          "Titre": "From start to finish this is one of the…",
          "Contenu": "From start to finish this is one of the easiest projects I ever did. The work was all done before they even asked for any money. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allegra Hickory",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:03:09.000Z",
          "Titre": "that WAS my title ;)",
          "Contenu": "Everything went great! Our customer was pleased with the re-order and the timeline."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli Berkowitz",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:37:30.000Z",
          "Titre": "USB Direct is the go to source for…",
          "Contenu": "USB Direct is the go to source for usb's. I have been using them for a few years for custom usb's.. The process is seamless. They are super-quick, efficient, and cost-effective. My sales agent, Lana is professional, intuitive, helpful, and able to come up with solutions. I recommend USB Direct to anyone looking for USB's."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Zimmermann",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:48:40.000Z",
          "Titre": "USB Direct has been my go to source for…",
          "Contenu": "USB Direct has been my go to source for custom USB drives for years and years now and they've always offered great prices, quick shipping and support when needed.  No need to look anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Traza Bills",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:33:02.000Z",
          "Titre": "Great service and products",
          "Contenu": "Had a great experience and was helped by Joey C. He was diligent, knowledgeable about the products available and gave excellent customer service. His communication was great and he was able to exactly what I needed even when my needs changed last minute. Highly recommend USB Memory Direct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MikeBone",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:15:25.000Z",
          "Titre": "usb wrist bands to sell as band merch",
          "Contenu": "The usb wrist bands we order was a hit, & as a musician this gave us the opportunity to have physical digital music."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Lilicrap",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:07:00.000Z",
          "Titre": "President/owner",
          "Contenu": "1st used your service the lady who helped me was excellent and did a great job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PM",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T21:51:14.000Z",
          "Titre": "The sales person at USB Memory Direct…Gina Marcos",
          "Contenu": "The sales person at USB Memory Direct was very knowledgeable and friendly. She was also very patient while I kept changing my mind. Turnaround time to get the drives was very quick. They drives look good, are solid and work perfectly. Would 100% use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tomkat Books",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:16:13.000Z",
          "Titre": "Enrique is the best!",
          "Contenu": "After dealing with many other representatives from other companies who cared little about what they sold or to whom they sold it to it was a pleasure to work with Enrique Diaz.  Enrique described his company's products clearly and which would best suit my needs.  He followed through on his promises quickly and thoroughly, despite dealing with a rather complicated transaction.I highly recommend Enrique and USB Memory Direct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:32:49.000Z",
          "Titre": "Amazing experience",
          "Contenu": "Amazing experience! Gina Marcos walked us through process, for a pre loaded drive, a Town giveaway, quick response and helpful at each step! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn McLane",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T21:03:53.000Z",
          "Titre": "Great Product and Service",
          "Contenu": "Enrique Diaz was extremely helpful in getting us the product we wanted. His responsiveness and professionalism throughout the design process was excellent. The turn-around time was fast, and our logo looks amazing on the product. I highly recommend working with Enrique and USB Memory Direct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Christensen",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T18:42:18.000Z",
          "Titre": "Great service and experience!",
          "Contenu": "I needed to order some new USBs with my company logo on them. I was having a hard time searching for the right one, until I came across USB Memory Direct. I reached out to the company to explain my needs and Daniel Feldman helped me order everything I needed with a great price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Mayer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:25:26.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Very pleasant experience and we will now only use them. Very happy!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madi Carlson",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:21:33.000Z",
          "Titre": "Daniel was easy to work with and made…",
          "Contenu": "Daniel was easy to work with and made getting my USBs a breeze! He was able to pull a previous project and worked fast to get production going."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donovan Ross",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:59:32.000Z",
          "Titre": "Great company",
          "Contenu": "Great company, great recommendations, great prices, great delivery & Joseph Calvani was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "liz scott",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:55:58.000Z",
          "Titre": "Great work",
          "Contenu": "I've worked with Lana Gorelik on a few orders and it's always been a pleasant experience. she's always super responsive and helpful. For my last order we ordered 600 USB cards for a conference in Africa, and they were a hit, they were gone in 2 days. Everyone commented on how innovated our USBs were. We will definitely order more soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Lundborg",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T15:55:02.000Z",
          "Titre": "Great Product and a Great price!",
          "Contenu": "Great Product and a Great price!We are a small agriculture business and having flash drives was a necessity for our business. Lana was very helpful in getting us exactly what we needed for our business. We were thrilled when receiving our first order. Service is one of the most important things we consider when purchasing from a company and USB Memory Direct definitely has some of the best service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy R",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:54:06.000Z",
          "Titre": "Great product, service and price!",
          "Contenu": "They offer quality usb drives with quick shipping at a price that beat our previous vendor by about 35%. Customer service is fantastic, especially Enrique who stayed in communication through every step of the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R Burns",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T19:19:27.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, great product! Joseph made sure I got what I needed and the quality was beyond impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristy",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T00:01:48.000Z",
          "Titre": "Joseph was super easy to work with",
          "Contenu": "Joseph was super easy to work with. He always had a quick response time to my all my questions. Joseph even kept me informed when there was a shipping issue. We will use this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:18:07.000Z",
          "Titre": "Excellent Company and Service",
          "Contenu": "Anikaris Ortiz assisted me with ordering USBs for my company. I reached out to 2 other companies for this project, and they all paled in comparison to price, quality, and preferred design. Anikaris was professional, answered all my questions, and was extremely easy to work and communicate with. I have added her and USB Memory Direct to our company's preferred vendor list for future projects. I highly recommend this company and Anikaris for your USB needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB Consulting Group LLC",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T01:06:17.000Z",
          "Titre": "Excellent service / Great product",
          "Contenu": "After shopping around and getting a few quotes I chose USB Memory Direct.   Great price and and customer service.   Account Executive Joseph Calvani worked with me to ensure I chose the right product and that my company logo was applied perfectly.   Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T21:33:40.000Z",
          "Titre": "I reached through their website to…",
          "Contenu": "I reached through their website to inquire on the customized logo USB drives. I received a response back very fast and the pricing was better than the company that we were ordering from. The turn-around time on production was pretty fast too and our logo looks amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvelle Shriver",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T16:10:06.000Z",
          "Titre": "Best USBs for my photography clients",
          "Contenu": "USB direct is the best and most cost friendly way to provide USBs for my photography clients.  They have excellent customer service, and they're always so communicative and helpful through the entire effortless process.  I have used them for many years, and I have yet to find another company that can give me a quality product at this low of a cost.  I continue to be a happy customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "iTEN tv",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:50:22.000Z",
          "Titre": "USB drives",
          "Contenu": "My situation, was a little different than most. However working with Gina was a bliss. I got all USB situation all matched to my needs. I was happy and will be using them for all my future projects from now on. Price was good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES",
          "Nb_Reviews": 4,
          "Date": "2023-04-10T11:32:11.000Z",
          "Titre": "I've ordered from this company several…",
          "Contenu": "I've ordered from this company several times.  They've always produced a quality product and done so in a timely manner.  I especially appreciate Daniel Feldman's help on this last order.  I slipped up and almost ran out of our USB's before I placed an order.  Mr. Feldman went out of his way to make sure the order was expedited without any additional charge and I received my order before the date I was told I would receive them and never ran out of product.  Thank you USB Direct and Mr. Feldman!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Michaels",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T23:04:02.000Z",
          "Titre": "Fast, good customer service",
          "Contenu": "Less than a week before my conference I was filling out online forms and sending email inquiries to see if I could possibly get some memory sticks with our content pre-loaded. I was skeptical that it could actually happen with such short notice. But Dan called me right away, even though it was after hours, and helped me get the order in. I really appreciated hearing from an actual human and having someone walk me through the process. The memory sticks arrived at our conference hotel the night before and looked great. Would definitely work with them again if the need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T22:48:23.000Z",
          "Titre": "Quick service, production, excellent result",
          "Contenu": "Lana reached out almost immediately after my web contact. She helped guide me to exactly what we needed, suggesting a better value USB than I thought I needed, and completed the graphic exactly as requested. Our order processed and shipped much more quickly than we ever expected. Excellent service and delivered product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dj Juno",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T22:43:37.000Z",
          "Titre": "Awesome!",
          "Contenu": "Wow, when I received my package and opened it up. I was blown away by the way my memory sticks looked.They came exactly as promised. I will definitely place another order, hopefully soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T22:08:56.000Z",
          "Titre": "Seamless Ordering Process",
          "Contenu": "I've ordered USBs for our company multiples times and the process has been seamless. I've worked with a few reps and all of them have been helpful, but Daniel F. has been instrumental in getting my last few orders set-up, placed, and delivered with no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zante",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T22:17:25.000Z",
          "Titre": "Good quality product and service, at a great price!",
          "Contenu": "I placed a small order for \"swivel\" USB 3.0 32GB drives with custom printing.Sales rep (Lana) was incredibly responsive and very patient as I kept considering various options.Final product looks great and has a nice quality \"feel\" to it. Bonus for how quickly the whole process took, including speed of shipping even during the holiday rush during a pandemic.Highly recommend; will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Fitzsimmons",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T21:46:15.000Z",
          "Titre": "Great service and product",
          "Contenu": "We are a nonprofit who needed branded USBs for a premium gift and had a great experience with USB Memory Direct. Lana was very patient while we got quotes from several companies, responsive when it came to tweaking our design, and sent mock-ups and updates every step of the way to make sure we were happy with what we were getting. Production and shipping were fast despite the busy time of year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Hammerman",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T17:57:12.000Z",
          "Titre": "Great experience working with USB…",
          "Contenu": "Great experience working with USB memory direct. They were very responsive to my many questions, and were patient with me when we went back and forth several times on finding the right design/materials etc. They were honest and accurate about the delivery times and everything else, package arrived on time and everything looked great. Also, very reasonably priced for what they offer, they were the best deal I found. I recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T02:32:10.000Z",
          "Titre": "I can see why there are so many 5 star…",
          "Contenu": "I can see why there are so many 5 star reviews. Anikaris and the team were unusually great to work with. I had a very tight timeline for an important presentation that needed to be beautiful. The product, price, and fast shipping was excellent and the customer service was exceptional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary  Platner",
          "Nb_Reviews": 4,
          "Date": "2022-04-26T00:15:02.390Z",
          "Titre": "Amanda Caraballo was a joy to work with…",
          "Contenu": "Amanda Caraballo, usbmemory, was a joy to work with our rather rush order of USBs for the American Iris Society's National Convention.  It was only a handful of days from placing the order to its arrival.  Folks appreciated the imprint so they would know what was on the USBs.  Life was even easier with the USBs being preloaded with the documents.  Way to go, Amanda!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tallin Curran",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T14:57:33.000Z",
          "Titre": "Great service and prices over the years",
          "Contenu": "We have ordered two different models of flash drives across three separate orders from USB Memory Direct over several years.  Every time the price has been better than competitors and we have had working flash drives with a clean and centered version of our logo on each and every drive.  This last time it had been a few years since the previous order and I went price shopping.  I believe we checked four or five different online flash drive sellers and ended up going back to USB Memory Direct.  Our sales rep, Lana, was extremely helpful throughout the process and made sure I was happy with the mockups before anything went to print.  The next time we need flash drives we will be ordering from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SL Wallis",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T18:04:01.000Z",
          "Titre": "Custom LEGO shaped thumb…",
          "Contenu": "I was looking for LEGO shaped thumb drives and the company I normally work with was zero help. Reached out to Lana at USB Memory Direct and she went above and beyond to get me what I needed for our event. She just made things happen! Received quotes, art and complete layout within a couple of days and everything arrive well before I needed them. Will absolutely recommend them to others and use them again!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chanel Kayy",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T16:18:55.000Z",
          "Titre": "Fast service, great product",
          "Contenu": "If you ever need customized products, USB Memory Direct Direct is the place to go! The company I work for was in urgent need of about 50 USBs for an event that was coming up in a few short days. Our team didn't think that we'd be able to get them in time, but with the help of Daniel Feldman, we received them in just 3 days. May I add that they were also customized with our clients logo!Daniel was very responsive and on top of his work, which offered us a great experience. If we are ever in need of USBs again in the future, I would definitely recommend USB Memory Direct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Tuft",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:04:07.000Z",
          "Titre": "Good service",
          "Contenu": "Good service - prompt"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paola",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T21:17:38.000Z",
          "Titre": "Great custom usb drives",
          "Contenu": "This was the first time ordering from this company for custom usb drives and I'll definitely be ordering from them again. The logo on the sticks look great and very professional, perfect for handing out to clients. Daniel was my representative for the order and he provided great service - provided q quote very quickly and answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Design Team",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:13:45.000Z",
          "Titre": "Extremely helpful!",
          "Contenu": "Nothing but helpful, I had some questions and some design changes throughout the process. They were so kind and worked with me on how to edit and fix my project, will definitely buy more products in the future!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chet Price",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:42:55.000Z",
          "Titre": "I have ordered from USB Memory Direct several times",
          "Contenu": "I have ordered from USB Memory Direct several times and each time, this company has been responsive, and quick.  Daniel has been my point of contact for the last several purchases and is prompt and courteous.  Thank you Dan and thank you USB Memory Direct!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isabelle Payne",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T23:51:04.000Z",
          "Titre": "I appreciated the responsiveness",
          "Contenu": "I appreciated the responsiveness. Prices were lowest I've seen with no lack in quality! Genuine care was shown with sending samples. Product we purchased was a hit. Will use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barb Nowack",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:48:19.000Z",
          "Titre": "Good Product with Outstanding Customer Service",
          "Contenu": "Daniel Feldman went above and beyond to ensure that my order was exactly what I wanted and that it arrive on time for my conference.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Charlie",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:03:39.000Z",
          "Titre": "Great  price and fast service!!",
          "Contenu": "Great  price and fast service!! Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Rushay",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T18:20:20.000Z",
          "Titre": "Lana Gorelik did an awesome job…",
          "Contenu": "Lana Gorelik did an awesome job fulfilling our order for flash drives. She was prompt and clear in her communications. I appreciate how quickly she was able to print our new logo on the flash drives and to answer a technical question I had about NDAA compliance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracie",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T19:31:37.000Z",
          "Titre": "Wow!",
          "Contenu": "Wow - this company is great! They were super fast, responsive, and excellent quality! We had a specific design in mind and they nailed it. Very satisfied and would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth  Sims",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T21:29:54.000Z",
          "Titre": "I recently placed an order for flash…",
          "Contenu": "I recently placed an order for flash drives with Memory Direct and am very pleased with the whole process. The artwork looked great, the price was fantastic and the sales representative was very helpful. Thank you and I look forward to being a continued customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Toone",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T16:44:19.000Z",
          "Titre": "Great Looking Drives",
          "Contenu": "The communication was very quick and helpful, even as things were changing throughout our project. Our USB drives also turned out great, looking exactly as advertised. Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerardo",
          "Nb_Reviews": 2,
          "Date": "2022-09-19T17:55:05.000Z",
          "Titre": "Excellent all the way around!!",
          "Contenu": "Excellent all the way around!!From timely delivery, to customer service and quality of the product, they beat our expectations!! They USB memory sticks came out much better than what we anticipated!!! Definitively recommend them and will be using them over and over again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Rodman",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T14:23:51.000Z",
          "Titre": "Quality products, terrific customer service",
          "Contenu": "I 've been purchasing thumb drives from USB Memory Direct for my digital products for a couple of years, and highly recommend them. My drives were exactly what I wanted, my logo looks great on them and my own customers love them. Amanda Caraballo was the rep who handled my last order and she left no stone unturned to make sure I got what I  needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Howard",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T00:50:02.000Z",
          "Titre": "Awesome product that is well supported!",
          "Contenu": "Great product with first-class customer service!  Lana, was quick to produce the submittal for our USB. The product shipped way ahead of the estimated ship date, which is always a good. I will not hesitate to order from them again and look forward to a long relationship!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirsten W",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T22:51:54.000Z",
          "Titre": "Great Company!!!",
          "Contenu": "It's been a long while since I've dealt with a company as responsive, helpful and willing to go the extra mile as USB Memory Direct.  Armando Alberto is an excellent rep of this company, and I would love to do business with them again because of his competence and professionalism!  And they sell a great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris Dargenio",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T14:33:50.000Z",
          "Titre": "Easy to order - Great customer service",
          "Contenu": "Easy to order, great price, product was just as expected, very impressed. Dan Feldman, Acct. Exec. was very professional, attentive, and quick to answer my emails, keeping me up-to-date throughout the order/delivery process. Will definitely order from this company again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lew",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:29:22.000Z",
          "Titre": "Super fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip Saunders",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:10:16.000Z",
          "Titre": "Great to deal with",
          "Contenu": "Great to deal with. Thumb drives were what we needed and cost effective, delivery was on time as quoted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 3,
          "Date": "2022-08-30T00:36:16.000Z",
          "Titre": "I was so glad to find USB Memory…",
          "Contenu": "I was so glad to find USB Memory Direct.  I had purchased from another company and was pleased but when I saw what they had to offer, I had to give them a try.  I contacted the company to inquire about purchasing USB drives and was shocked at the amazing response I received.  They were attentive to my needs and thorough in answering my questions and I received my order in a timely manner.  The product is quality and the logo is spectacular.  Thank you USB Memory Direct.  You'll be hearing from me again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa Jergensen",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T16:38:49.000Z",
          "Titre": "USB Memory Direct has helpful staff &…",
          "Contenu": "USB Memory Direct has helpful staff & creates a quality product for a good price. My beautiful wooden USB drives came with a laser engraved logo and look so professional and elegant. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gabi",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T16:21:52.000Z",
          "Titre": "Strongly recommended",
          "Contenu": "We've been very happy with the service from Daniel & the whole team at USB Direct. The communication has been unparalleled, as well as providing a fantastic product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T17:26:43.000Z",
          "Titre": "Lana is great Very happy with my purchase",
          "Contenu": "I recently purchased 2500 USB Drives from USB Memory Direct.  Lana was very helpful and quick to respond to my needs.  I also received my order in 13 days.  Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina F",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T16:04:27.000Z",
          "Titre": "Our company is a small medical practice…",
          "Contenu": "Our company is a small medical practice looking to put out going records on flash drives. USB Memory Direct was very helpful and was able to address our needs in a timely manner. We will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey McClarty",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T14:02:06.000Z",
          "Titre": "They do what they promise, and do it well.",
          "Contenu": "They deliver exactly what they say they will. My company has now bought about 500 USB drives in total across three separate orders. They turn out great, work as expected, and deliver quickly. Their team always checks in on me after we receive the order to make sure it turned out well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelvin Demps",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T15:24:23.000Z",
          "Titre": "The USB Memory drives we received were…",
          "Contenu": "The USB Memory drives we received were competitively priced, delivered quickly, and looked fantastic. Lana's customer service skills are amazing. I look forward to working with her in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Sexton",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T18:01:29.000Z",
          "Titre": "Quick accurate interactions in design",
          "Contenu": "The company worked with me revising the design I wanted for our order. Quick response with new images of product draft. I felt I knew exactly what the product would look like when I ordered and it arrived quickly, and looked just like I expected. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chey Harden",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T17:51:25.000Z",
          "Titre": "I have purchased several times frGreat Experience with USB Memory Directom USB…",
          "Contenu": "I have purchased several times from USB Memory Direct. Daniel Feldman made things easy and the product came in on time and in perfect condition.Very happy with using USB Memory Direct and I will be calling Dan as soon as I need more USB sticks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas K. Baldwin",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T22:47:04.000Z",
          "Titre": "USB Memory Direct ROCKS!",
          "Contenu": "Anakaris made the entire design and ordering process very easy.  She followed through with everything on a timely basis.  Once I got the flash drives, they looked great and worked flawlessly.  It will be a great and useful marketing tool for my firm.   I couldn't be happier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:41:29.000Z",
          "Titre": "Daniel Feldman provided excellent…",
          "Contenu": "Daniel Feldman provided excellent service every step of the way.  He helped us determine our needs, design our drives and receive our order in a timely manner.  Highly reccomend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Math Sciences",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T14:43:22.000Z",
          "Titre": "USB Direct Never Disappoints",
          "Contenu": "USB Direct never disappoints. I mistakenly approved the incorrect print, but Lana moved quickly to help me fix my error. My thumb drives arrived as I had envisioned them and in quick time. I was so pleased with my order, I ordered more for another department. Thanks, Lana!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aqueos Corporation",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T18:37:21.000Z",
          "Titre": "FIRST CLASS experience!",
          "Contenu": "Great experience and absolutely first class product! Our customer service rep, Daniel, was always quick to respond and made the creation and production process of our custom USB very easy. We will not hesitate to order from them again and look forward to a long term relationship!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Ball",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T18:33:16.000Z",
          "Titre": "Fast service and great ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Modus Inc",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T18:37:33.000Z",
          "Titre": "A very pleasant experience overall",
          "Contenu": "A very pleasant experience overall. Rep Amanda was great with fast communication. We received a great product- they design looks good. It was delivered quickly. No complaints here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard S",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T23:25:38.000Z",
          "Titre": "The best!",
          "Contenu": "As always - great service, great product and reasonable pricing.Our contact Lana has worked with us for years on all our product needs and is attentive and never lets us down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T17:49:01.000Z",
          "Titre": "Great experience!",
          "Contenu": "Immediate response with a quote and assistance in choosing our USB designs.  Printed and loaded the USBs in short order and we received the finished product in a timely manner.  It was a pleasure dealing with this organization."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Tuft",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T01:33:23.000Z",
          "Titre": "Understood my needs",
          "Contenu": "Understood my needs.  Good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Peltier",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T19:45:51.000Z",
          "Titre": "Great company!",
          "Contenu": "Great company to work with. The proofing process is quick and painless. Quality products every time! Our salesman, Daniel Feldman, was prompt to respond and took care of everything we needed in an expedient manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti Smiles",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T19:30:32.000Z",
          "Titre": "Prime Customer Service",
          "Contenu": "I called a lot of companies. USB Memory Direct was straightforward and helpful. This company is all about excellence. I wrote to Daniel Feldman who helped me:Dear Dan,  I wanted to tell you what I appreciated. Working with you was really fun. You are very professional and friendly.  You gave me a lot of trust in the process of creating this project as a first timer! You followed up constantly and that was what I needed to accomplish this task. I have friends that own their own businesses. I will forward your personal information to them. Thank You Again!!Patti"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Ross",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:10:46.000Z",
          "Titre": "Very good customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Ramsey",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T14:42:43.000Z",
          "Titre": "First time ordering flash drives",
          "Contenu": "We attempted to contact a few other online dealers of flash drives to no avail. We found USB Memory Direct via an online seach. We had no previous dealing with them. We left a request to be contacted about ordering some credit card type flash drives. Amanda contacted us very quickly (as I recall within an hour) and was extremely helpful. Amanda was able to answer all our questions and promptly sent us our requested quote. Once we sent the camera ready art, per their specifications, she worked to speed up our delivery date. We were pleased with the delivery date she gave us, but I believe our flash drives actually arrived one day earlier than the promised date, so we were thrilled to be able to get them to our customer sooner. When we received them, they were perfect! Should the need arise, we will certainly use USB Memory Direct again! And we would like to thank Amanda directly for ensuring our experience was smooth and trouble free. Amanda made us feel like we were her only customer and old friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Boullion",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T01:15:45.000Z",
          "Titre": "Great Service, Excellent Product!",
          "Contenu": "In the process of my first adventure into producing an A/V album on a memory stick for a customer, we searched several companies, but chose USB Memory Direct due to the responsiveness of our contact, Daniel.  He provided multiple quotes based on our replies to our use, format, data size, and style.As we made progress toward reaching final playlist and visual presentation selections, Daniel checked in occasionally without prompt from us - we were impressed with his interest in how the project was going, his patience, and willingness to help!As we were assembling the final playlist and visual presentation, Daniel provided guidance on formatting the Google slide show, and troubleshooting a few settings for export.  Sharing the production files was efficient, and turn-around on the digital proofs of product was fast.  We actually went with a different USB stick than we originally planned due to the different styles of proofs Daniel provided!  Once we approved our format/style, a very good turn around time on product and delivery.Thank you Daniel and USB Memory Direct!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Sparkman",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:39:59.000Z",
          "Titre": "They have excellent customer service…",
          "Contenu": "They have excellent customer service and Dan was very helpful in facilitating the process of making the custom drives for my client's company! My client loves their drives with their logo on them and they have a very fast turn around as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T15:48:48.000Z",
          "Titre": "Great quality and great service!",
          "Contenu": "I was very pleased with the product and service I received from USB Memory Direct.  Amanda, the sales rep I worked with made the whole process super smooth.  The price that I received was of the lowest quotes I could find, but that wasn't reflected in poor quality or service.  These were both top notch.  Hopefully the USB Drives we ordered will go quickly so we can be back for more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T19:33:32.000Z",
          "Titre": "Excellent Sales Team",
          "Contenu": "Daniel was a pleasure to work with. He was extremely helpful in meeting our needs. Very often, he would go above and beyond what was needed. The usb drives themselves seem to be working well. We use the drives as promotions, and they look great and function well for that purpose."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yuri Bejarano",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T23:07:35.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I have ordered from USB Memory Direct for years and Lana Gorelik has been the best senior account executive I have the pleasure in working with!  The USB's were absolutely perfection and I can't wait to use them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Reagan",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:37:25.000Z",
          "Titre": "Great experience and product",
          "Contenu": "The USB Memory drives we received were competitively priced, delivered quickly, and looked fantastic. Anikaris Oritz was easy to communicate with and was responsive to emails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T02:54:30.000Z",
          "Titre": "Easy to work with, Fast, and a Quality Product",
          "Contenu": "Dan was very helpful in setting up the project with me, outlining details and costs. They worked quickly to implement a logo change, which came out looking great. Easy to work with, fast, and a quality product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T19:28:00.000Z",
          "Titre": "Great Experience!!",
          "Contenu": "I recently purchased a company that was established and already using USB Memory Direct. I placed my first order with Senior Account Executive Lana Gorelik. Lana was great to work with, assisted me in changing existing logo and contact information on the USB. The interaction very pleasant and will bring me back to USB Memory Direct for my future business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaitlyn",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T21:55:58.000Z",
          "Titre": "I was able to get my order in extremely…",
          "Contenu": "I was able to get my order in extremely fast and whenever I had a question, I was answered almost immediately. Will definitely be doing business here again!:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T22:25:24.000Z",
          "Titre": "Amazing service and products!",
          "Contenu": "Lana was a tremendous help in coordinating our order of the SWM USBs. She was able to help us get our correct Pantone matches so that the USBs perfectly matched our brand standards!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mkwdt",
          "Nb_Reviews": 4,
          "Date": "2022-04-13T16:01:18.000Z",
          "Titre": "Lana and her team are wonderful!!!",
          "Contenu": "Lana and her team are wonderful to work with and provide excellent, friendly, knowledgeable and professional help from the initial contact through the design, proofing, ordering and shipping processes!  She kept us well informed at each juncture in the process with delightful communications!  I am grateful to work with Lana and USB Memory Direct!"
        }
      ]
    }
  ]
}